[
  {
    "title": "Operations Engineer Job at Nestoil Plc",
    "link": "https://www.jobgurus.com.ng/jobs/view/operations-engineer-job-at-nestoil-plc",
    "pubDate": "Thu, 05 Jun 2025 10:45:47 GMT",
    "source": "JobGurus",
    "keyword": "nestoil plc",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Nestoil Plc was incorporated in Nigeria in 1991 for the provision of Engineering, Procurement and Construction (EPC) services to the energy and oil & gas industry. Since then, Nestoil has grown to become the leading indigenous EPC provider for major IOCs (International Oil Companies) in Sub-Saharan Africa like National Petroleum Company (NNPC) Shell, Exxon Mobil, Chevron, Total, etc.\n\nWe are recruiting to fill the position below:\n\nJob Position: Operations Engineer\n\nJob Location: Warri, Delta\nJob Type: Full-time \n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are on an evolutionary journey where we’re changing our story. We are looking to hire an experienced Operations Engineer to join our diverse team in our Company.\n\tThis role you will be responsible for providing successful management of business operations, while driving the implementation of policies and standards that align with the Business Unit’s vision and business philosophy. \n\n\nResponsibilities\nAs an Operations Engineer, you will be responsible for:\n\n\n\tWorking with the MD to develop and align company business objectives with the vision and long-term strategies of the Group. \n\tCommunicating the Group’s vision and business strategy (short, medium and long terms) and ensure that the company operates in line with the Group’s governance policies, standards and values \n\tWorking with the MD to develop and implement the company’s business strategies, growth plans an budget in support of the Group’s long term business direction \n\tSupporting the MD to put adequate operational systems and controls in place to ensure proper monitoring of the company’s performance against plans and budgets.\n\tEnsuring proper adherence to the Group’s Quality, Health and Safety policies across all functional units \n\tSupporting the MD to facilitate resolution of high priority issues between departments and acts as one of the organization’s ambassadors and spokespersons in matters involving external stakeholders \n\tSupporting the MD to ensure that company operations and performance culture comply with approved financial, business and risk management objectives as well as applicable legal and regulatory requirements \n\tSupporting the MD in monitoring members of the Business Unit leadership team to effectively deliver on respective functional programmes, achieve set targets and improve overall performance \n\tWorking with the MD to prepare relevant reports to the Board of Directors on the company’s performance target achievements (i.e financial results, market performance, organizational development plans and overall business performance)  \n\n\nRequirements\nWhat are we looking for?\n\n\n\tAny good First Degree especially in Engineering, Business Administration, Finance, Social and Behavioural Sciences \n\tPost-graduate business degree (including MBA) will be an advantage.\n\tIWCF (Well Control Certificate)\n\tMinimum of 8 years post qualification work experience, 3 of which must have been at a management level in an Engineering, Procurement, Construction and maintenance business environment.\n\tPrevious Experience as Operations Engineer with a drilling contractor.\n\tHighly ethical, self-motivated, diligent and enthusiastic with a winning mentality\n\tStrong ability to cope well with pressure, solve complex operational problems and deliver within tight timeframes\n\tExcellent analytical, business development and strategic planning skills \n\tStrong negotiation and management skills \n\tExcellent networking and people/relationship management ability, as well as interpersonal, project and change management skills \n\tStrong communication and presentation skills  \n\tHighly innovative and adaptable \n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Assistant Manager Job at FlexFilms Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/assistant-manager-job-at-flexfilms-limited",
    "pubDate": "Thu, 05 Jun 2025 10:45:47 GMT",
    "source": "JobGurus",
    "keyword": "flexfilms limited",
    "duplicate": false,
    "classifications": [],
    "content": "FlexFilms Limited is the global film manufacturing arm of India’s largest multinational flexible packaging solutions company, Uflex Limited. With State-of-the-Art film manufacturing facilities in all the 5 major continents Asia, Europe, North America, CIS and Africa our cumulative production capacity stands in excess of 4,52,600 MT Per Annum.\n\nWe are recruiting to fill the position below:\n\nJob Position: Assistant Manager, Electrical Power Plant\n\nJob Location: Ogun\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tResponsibility for daily shift operation of substation, field electrical & Watsila engine E&I troubleshooting.\n\tTransformer VCB & ACB Operation & Maintenance.\n\tBasic Electrical Knowledge.\n\tDOL, Star Delta starter & VFD.\n\tPCC & MCC.\n\tDaily power report.\n\n\nSalary Range\nN400,000 - N500,000 / month.\n\nMethod of Application\nInterested and qualified candidates should forward their CV to: careeratflexfilms@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Accountant (Financial Reporting) Job at Petrogap Oil and Gas Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/accountant-financial-reporting-job-at-petrogap-oil-and-gas-limited-1",
    "pubDate": "Thu, 05 Jun 2025 10:45:47 GMT",
    "source": "JobGurus",
    "keyword": "petrogap oil and gas limited",
    "duplicate": false,
    "classifications": [],
    "content": "Petrogap Oil and Gas Limited was incorporated as a response to the emerging trends in the dynamic Oil & Gas industry. We are a wholly indigenous company and registered player in the Upstream, Midstream and Downstream sectors of the Oil & Gas industry.\n\nWe are recruiting to fill the position below:\n\nJob Position: Accountant (Financial Reporting)\n\nJob Location: Victoria Island, Lagos\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tPreparing High-level financial reports and analysis\n\tDeveloping financial strategy and forecasting\n\tPerforms statistical, cost and financial analysis of financial reports and data, and prepares subsequent narrative analysis for management.\n\tPreparing income statements, balance sheet, profit and loss statement, and other reports,monthly closings and preparation of monthly financial statements.\n\tCompiles and analyses financial information to prepare entries to account books, such asgeneral ledger accounts and prepare journal entries.\n\tCompute and remit taxes, tax returns and other tax related reports.\n\tConsolidateand Manage the Organizations budget\n\tCash flow management and Debt management\n\tWorking closely with Management or Executive teams to share reports and analysis findings\n\tReview expense vouchers, invoices, purchase requisitions or other transactions.\n\tHandle financial audit with external auditors\n\tPayroll administration and preparation of monthly sales reports for analysis.\n\tAnd other financial reporting functions.\n\n\nRequiements\n\n\n\t2:1 grade B.Sc. (Minimum qualification) in a relevant discipline and Professional Certification (ICAN etc) is a major requirement\n\t3 - 5 years of professional experience in financial Reporting.\n\tAge: 27 - 34 years.\n\tSex: Female (for gender balance).\n\n\nMethod of Application\nInterested and qualified candidates should send their CVs to: careers.pgog@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]