[
  {
    "title": "Job Vacancies at Lafarge Africa Plc",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancies-at-lafarge-africa-plc-2",
    "pubDate": "Mon, 23 Jun 2025 09:43:27 GMT",
    "source": "JobGurus",
    "keyword": "lafarge africa plc",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Lafarge Africa Plc is a member of the LafargeHolcim Group – the biggest building and concrete solutions company in the world. It is a publicly quoted company on the Nigerian Stock Exchange (NSE) and serves Nigeria with a wide range of building and construction solutions designed to meet housing and construction needs from small projects like individual home buildings to major construction and infrastructure projects.\n\nWe are recruiting to fill the following positions below:\n\n1.) Mechanical Manager\n\nRequisition ID: 14041\nJob Location: Ewekoro, Ogun\nJob type: Full-time\n\nAbout the Job\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tEnsure completion of mechanical maintenance jobs with the highest level of quality, safety and effectiveness at minimum cost to maximise equipment availability. \n\tApply preventive and predictive maintenance practices, and contribute to their improvement.\n\n\nWhat you'll be doing \n\n\n\tCommunicate clearly on information relating to potentially dangerous situations and get confirmation that they are correctly understood.\n\tMake sure that key equipment is working properly.\n\tEnsure the use of Personal Protective Equipment.\n\tIs responsible for the execution and the quality of maintenance work to be carried out on mechanical equipment according to planned work orders.\n\tResponsible for knowledge transfer and develop team members for improve performance.\n\tEnsure proper day-to-day scheduling of works and necessary resources. Assign and review work to perform with the craftsmen.\n\tEnsure, upon completion of repairs, that equipment is in good operating condition, ready to meet operational requirements, fully inspected, tested, clean and safe.\n\tEnsure and control quality of maintenance jobs done by subcontractors.\n\tProvide reporting on repair jobs including consumption of materials, specific tools, man-hours and skills, and fills equipment history files.\n\tEnsure completion of major operations within schedule (yearly overhaul).\n\tContribute in his field, to the development of working methods and definition of procedures and ensure their implementation.\n\tKeep him/herself informed of general plant practices so as to ensure “on-call” duty.\n\tContribute to Root Cause Analysis.\n\tParticipate in the Plant Improvement Plan (PIP).\n\tCheck for safety and cleanness in the workplace\n\n\nWho you'll be working with:\n\n\n\tDirect Reports\n\t\n\t\tMechanical Engineers\n\t\tWorkshop Team\n\t\tMechanical Supervisors.\n\t\tCraftsmen.\n\t\n\t\n\n\nWhat we are looking for\n\n\n\tMinimum 5 years of postgraduate experience in execution (Mechanical)\n\tProficiency in the use of maintenance tools like SAP etc.\n\tGood knowledge of cement manufacturing processes.\n\tGood knowledge of safety laws and regulations.\n\tGood written and verbal communications skills\n\tGood knowledge of Reliability based maintenance practices.\n\tGood problem solving skills through the root cause failure analysis.\n\n\nClick here to apply online\n\n \n\n2.) Process Engineer\n\nRequisition ID: 12834\nJob Location: Mfamosing, Cross River\nJob type: Full-time\n\nDescription \n\n\n\tThe Process Engineer leads plant discussions and investigations to improve throughput, efficiency, quality, and environmental performance.\n\tThrough data analysis, field measurements, and conversations with employees are able to diagnose issues and develop solutions to move the plant towards greater performance.\n\n\nResponsibilities\nWhat you'll be Doing:\n\n\n\tMakes positive contributions to the plant safety activities and initiatives.\n\tProvides technical support to the plant’s production, quality, and environmental functions. Understands strategies, priorities, and optimization techniques that assist the plant in attainment of plant and company objectives.\n\tConduct inspections, measurements and operational assessment for shop assigned to you.\n\tFollow-up actions / recommendations from findings with the responsible\n\tDaily evaluates operations, processes, and trends through the use of audits and systematic approach, for example RCAs, Incidence assessment & reporting etc.\n\tProvides technical support on implementation of new equipment and/or new procedures including training of plant personnel as required. Serves as mentor to CCR Operators in production and other departments.\n\tThis position has a requirement of elevating the technical knowledge and practices of all facets of the operation.\n\tEnsure compliance with internal control procedures - communicating problems in operations, unwarranted deviations from established standards, and violations of policy or law.\n\tPrimary to the Process Engineer position is the coordination and participation in improvement of the Plant’s technical capabilities.\n\tThe Process Engineer’s objectives are to initiate process optimization in collaboration with Quality, Production and Maintenance to ensure maximum and efficient utilization of the plant’s equipment.\n\tInitiate actions for de-bottlenecking equipment and Processes and engage with stakeholders to close the actions.\n\tDesign and contribute development of new systems, equipment and procedures and propose modifications of existing ones for continuous process improvement. Include economic and operational feasibility studies. Support commissioning and de-bottleneck new installations\n\tPromote the increased use of AFR (if applicable): provide comprehensive technical expertise to evaluate AFR with respect to its impact on the process; develop and implement solutions to eliminate / reduce impact of AFR on the process operation\n\tEnsure involvement in the implementation and maintenance of an Integrated management system (IMS) in the plant.\n\n\nWho You'll Be Working With\nInternal:\n\n\n\tKiln coach, control room supervisors, production supervisor, coordinators, shift chemist and managers, corporate engineers.\n\tQuality, Production, Maintenance, Environment Departments\n\n\nExternal:\nList of Direct Reports:\n\n\n\tProcess technicians, Industrial trainees/interns\n\n\nRequirements\nWhat we are Looking for:\n\n\n\tCandidates should possess a Degree in Chemical / Process Engineering \n\t5 years of working experience with at least 3 years in cement Industry.\n\tGood knowledge of cement manufacturing Process\n\tPerform the measurements of a basic process: gas flow measurement, false air mapping etc.\n\tOrganize and perform an audit to any one area of a plant: Equipment/gas / thermal/ material balance of a kiln or a mill based on a pre-established model.\n\tAudit reporting \n\tTune a control loop.\n\tUnderstand the strategy of an expert system. (HLC)\n\tGood knowledge of statistical process control methods.\n\tGood knowledge of project management methods.\n\tStrong computer expertise in but not limited to: Excel,\n\tGood knowledge of SAP, TIS, and PACT.\n\n\nOH&S Competencies:\n\n\n\tImplements OH&S Mission: Ensures alignment of OH&S activities arising from the country OH&S mission.\n\tEnsures adequate OH&S organization: Ensures relevant actions are taken so that OH&S requirements are met\n\tIdentifies Hazards & Control Risks: Actively manages risks by ensuring that all related control activities are implemented thoroughly\n\n\nBehavioral competence:\n\n\n\tAbility to work effectively under time pressure, in a demanding environment, while maintaining the highest professional standards. Ability to self-organize, prioritize tasks, take initiatives, and make recommendations while engaging with Senior Leaders.\n\tIntellectual curiosity and strategic thinking; eagerness to learn, excellent analytical skills, Objective focus, Courage and integrity Intellectual humility, Honesty, Respect.\n\n\nLeadership and managerial abilities:\n\n\n\tCommunication skills (verbally /on paper), teaching ability, listening skills, team spirit,\n\tAdapting to change and creativity.\n\n\nMobility requirements:\n\n\n\tAbility to work in multi-national environment, Readiness to travel, Flexibility.\n\n\nClick here to apply online\n\n \n\n \n\n3.) Security Operative\n\nRequisition ID: 10385\nJob Location: Mfamosing, Cross River\nJob type: Full-time\n\nJob Summary\n\n\n\tThe Security Operative (SO) is responsible for keeping Lafarge Africa and suppliers’ staff, visitors, and similar safe & secure.\n\tBased on shift work rotation the SO will be in the plant between eight and twelve hours, also on weekends, and supervise all security related activities while in parallel supervise and support all company transport activities.\n\n\nWhat you'll be doing\n\n\n\tResponsible for the protection of the company’s PEARL (People, Environment, Assets, Reputation & Legal Exposure) in the South-East Region under the direction of the Security Manager South-East.\n\tSupport the supervision of the Private Security Provider, ensuring they fulfil their contractual obligations. Conduct supervisory checks on the 3rd party security provider and the services provided such as random checks at guard locations in Mfamosing Plant (MFA) and Calabar, joining vehicular patrols and ensuring all standards agreed are being fulfilled. To be conducted utilising various online tools that are available.\n\tEnsure Lafarge Health & Safety standards are adhered to.\n\tSupervise and direct the armed security incident response force.\n\tSupervise and direct security assets during crises periods and/or in case of direct assaults on company staff and/or assets.\n\tProvide reliable and concise incident data and write accurate reports via the various company online tools.\n\tInteract with the local PSF (Public Security Forces) in cases of (armed) attacks, intrusions, trespassing, fraud and theft.\n\tSafeguard that all Security & Resilience Policies of the company are adhered to.\n\tAct as a communicator between the Plant Management and Security Department when the Senior Security Operatives is not present.\n\tWork in shifts ensuring there is a 24/7 security supervision function on duty.\n\tSupport with investigations and detailed report writing. Validate reporting independent of the Private Security Provider’s report.\n\t Conduct independent assessments and identify gaps in baseline physical security and notify/ advise both the Security Manager and Senior Security Operative.\n\tGather local intelligence on all aspects and issues to support and protect the business.\n\tCreate and maintain intelligence networks.\n\tReporting of incidents on the Group Security SINT platform.\n\tMonitoring and supervision of CCTV operators, video evidence assessment and ongoing projects.\n\n\nWhat we are looking for\n\n\n\tOND minimum requirement \n\tA minimum of 4 years of experience in a security supervisory position\n\tSecurity incident supervisory experience (incl. following up on complex incidents such as shootings, armed attacks, theft, and similar)\n\tExperience of supervising teams and resources\n\tCapability to drive Lafarge security standards in all business activities.\n\tBe Microsoft Office proficient\n\tAbility to produce different kind of vetted and accurate incident reports.\n\n\nWho you'll be working with:\n\n\n\tSenior Security Operative\n\tContractors \n\tAll levels of staff.\n\n\nClick here to apply online    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Openings at Human Capital Partners",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-human-capital-partners-1",
    "pubDate": "Mon, 23 Jun 2025 09:43:27 GMT",
    "source": "JobGurus",
    "keyword": "human capital partners",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Human Capital Partners is a professional services firm that specializes in the provision of management consulting services covering the entire human resource management value chain.\n\nWe are recruiting to fill the following positions below:\n\n1.) IT Graduate Trainee (ICT Officer)\n\nJob Locations: Delta and Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tA leading oil and gas company is seeking a highly motivated and skilled IT Graduate Trainee (ICT Officer) to join its ICT team.\n\tThis role plays a critical part in supporting and maintaining the company’s ICT infrastructure and will serve as the first line of support for networks, servers, and other essential IT services.\n\n\nResponsibilities\n\n\n\tSupport the procurement, installation, maintenance, and upgrades of network and telecom hardware, software, and systems.\n\tAssist in configuring and testing new ICT equipment and applications.\n\tCoordinate with vendors on software implementation and license management.\n\tManage network user profiles, printer servers, and related infrastructure.\n\tProvide first-line support for network and telecom issues.\n\tSupport system backups, security updates, and hardware/software inventory tracking.\n\tAssist end users with ICT issues, including installations, troubleshooting, and relocations.\n\tContribute to user awareness initiatives and maintain the ICT ServiceDesk logs and documentation.\n\n\nRequirements\n\n\n\tBachelor’s Degree in IT-related field such as Computer Engineering, Computer Science, Information Technology, MIS, etc., OR 1-3 years of IT working experience with a bachelor’s degree in any other field.\n\tMinimum of 1 year of experience with IT systems and tools.\n\tRelevant IT Certifications such as ITIL, COBIT, MCSE, Cisco Certifications, A+, CISA are a plus.\n\tKnowledge of network/system security and VOIP technologies.\n\tAttention to detail andcommitment to accuracy\n\tExperienced in incident and problem management.\n\tStrong analytical and problem-solving capabilities.\n\tExcellent communication, presentation, and customer service skills.\n\tTime management, prioritization, and analytical thinking.\n\tSelf-motivated, able to multitask effectively and perform under pressure.\n\n\nApplication Closing Date: 28th June, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: ibrahim.ogunleye@hcp-ng.com using the Job Position as the subject of the mail.\n\n \n\n \n\n2.) Chief Operating Officer\n\nJob Location: Abuja (FCT)\n\nJob Summary\n\n\n\tAs part of on-going initiatives to strengthen its operations and enhance its capacity to achieve its goals, our client seeks to recruit a dynamic, exceptional and results-oriented professional to fill the position of Chief Operating Officer.\n\tReporting to the Managing Director and Chief Executive Officer, the successful candidate will be responsible for directing and coordinating the internal operational activities of the Organisation that ensure achievement of its lending and profitability goals. \n\tThe overarching objective of the role is client relationship management and operational efficiency encompassing business development, client acquisition, credit appraisal and structuring.\n\n\nResponsibilities\nOther responsibilities will include the following:\n\n\n\tProvide leadership for the business development, product development and credit operations teams in the execution of the Organisation's activities.\n\tOversee the articulation and development of a strategic business development and relationship management framework.\n\tDevelop and maintain strategic relationships with various stakeholders, including key institutions and strategic business alliances.\n\tChampion a customer management framework to build and maintain strong relationships with clients for business growth and retention.\n\tCoordinate the development and review of strategies for product management and customer acquisition for the short, medium and long term.\n\tDevelop strategic partnerships to enhance end-user needs assessment and position the Organisation before its target audience.\n\tDrive the credit assessment process and ensure all credit requests meet the eligibility criteria as set out in the credit policy.\n\tMonitor and report on the performance of all products, schemes and investments managed by the Organisation.\n\n\nQualifications, Experience and Attributes\n\n\n\tA Bachelor's Degree in any discipline, combined with a master's degree in a business-related discipline.\n\tRelevant business-related professional certification(s).\n\tA minimum of eighteen (18) years' cognate experience, with at least thirteen (13) years in the Banking industry and at least five (5) years in a top management role in MSME and commercial business.\n\tProven experience in several areas of banking operations including business development, portfolio management and customer service management.\n\tDemonstrable knowledge of risk management, proficiency in credit analysis and appraisal, and loan administration.\n\tProven leadership, negotiating and influencing skills.\n\tStrong understanding of banking operations as well as applicable industry regulations.\n\tGood working knowledge of financial procedures and applications.\n\tStrong business and financial acumen.\n\tExcellent strategic networking, interpersonal and relationship management skills.\n\tMaturity and tact, including the ability to relate with different internal and external stakeholders.\n\tWell-honed skills to persuade, influence, as well as manage and sustain effective relationships.\n\tHigh ethical standards and integrity.\n\n\nApplication Closing Date: 3rd June, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their current Curriculum Vitae (prepared as a Microsoft Word document, and saved with their full names) to: recruitment@hcp-ng.com using the Job Position as the subject of the email.\n\nNote\n\n\n\tAll applications and information provided will be held in strict confidence.\n\tOnly short-listed candidates will be contacted.\n\n\n \n\n \n\n3.) Production Officer\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe are recruiting Production Officers to support daily water treatment and production operations at various locations across Lagos.\n\tThe role involves working in a technical and process-driven environment to ensure the efficient production and delivery of potable water.\n\tIdeal candidates are detail-oriented, safety-conscious, and eager to grow within a critical public service sector.\n\n\nKey Responsibilities\n\n\n\tOperate and monitor water treatment systems and equipment (pumps, valves, filters, etc.)\n\tRecord and report operational parameters such as flow rate, pressure, water levels, and chemical dosing\n\tMaintain clean and organized workspaces within the production plant\n\tParticipate in scheduled maintenance and collaborate with engineering teams when required\n\tCarry out routine checks and inspections on plant facilities and assist in basic troubleshooting\n\tEnsure compliance with operational procedures, safety protocols, and environmental regulations\n\tSupport shift operations, including weekends and public holidays, as part of a rotation schedule\n\tEscalate faults or abnormalities promptly to supervisors or technical teams.\n\n\nRequirements\n\n\n\tMinimum of OND in Civil Engineering, Mechanical Engineering, Electrical Engineering, or related Engineering field\n\tGood understanding of basic mechanical or electrical operations\n\tWillingness to work in a physically demanding and shift-based environment\n\tStrong observational and reporting skills\n\tAbility to follow instructions, adhere to protocols, and maintain safety standards\n\tPrior industrial training or internship in utility, manufacturing, or process industry is an added advantage.\n\n\nApplication Closing Date: 24th July, 2025.\n\nClick here to apply online\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Customer Service & Social Media Representative Job at Solutions Consultancy",
    "link": "https://www.jobgurus.com.ng/jobs/view/customer-service-social-media-representative-job-at-solutions-consultancy",
    "pubDate": "Mon, 23 Jun 2025 09:43:27 GMT",
    "source": "JobGurus",
    "keyword": "solutions consultancy",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance"
    ],
    "content": "The Solutions Consultancy - Our client, a growing lifestyle retail brand, is recruiting to fill the position below:\n\nJob Position: Customer Service & Social Media Representative\n\nJob Location: Kado, Abuja\nEmployment Type: Full-time\nWorking Days: Monday – Saturday\nTime: 9:00 AM – 7:00 PM\n\nAbout the Role\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tOur client is seeking to hire a Customer Service & Social Media Representative. This is a full-time, in-store role for smart and dedicated individuals who are passionate about retail, customer experience, and social media.\n\tWe are looking for fresh graduates (BSc, HND, OND) who are eager to gain hands-on experience in a fast-growingretail environment.\n\n\nKey Responsibilities\n\n\n\tAttend to walk-in customers and online inquiries via WhatsApp, phone, and email\n\tManage daily customer service needs across all channels\n\tSchedule and publish basic content on social media platforms\n\tEngage with customers online and respond to comments or messages\n\tCoordinate with vendors to confirm stock availability, deliveries, and restocking\n\tAssist with basic eCommerce operations, including processing and tracking orders\n\n\nRequirements\n\n\n\tA minimum of OND, HND, or BSc in any field\n\tMust reside in or around Kado, Abuja (applicants living far from the location will not be considered)\n\tStrong communication and interpersonal skills\n\tFamiliarity with Instagram, WhatsApp Business, and basic social media tools\n\tBasic knowledge of eCommerce and online retail customer behavior\n\tDetail-oriented, organized, and customer-focused\n\tWillingness to work in a fast-paced retail setting.\n\n\nSalary\nN50,000 - N70,000 per month (includes transport and data stipend). \n\n \n\nNote: Only serious applicants who meet the location and qualification criteria will be contacted.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Vacancies at Insight Tours and Travels Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancies-at-insight-tours-and-travels-limited",
    "pubDate": "Mon, 23 Jun 2025 09:43:27 GMT",
    "source": "JobGurus",
    "keyword": "insight tours and travels limited",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "Insight Tours and Travels Limited is recruiting suitable candidates to fill the position below:\n\n1.) Travel Consultant (Reservations & Ticketing)\n\nJob Location: Ikeja, Lagos\nEmployment Type: Full Time\n\nJob Description\n\n\n\tThe ideal candidate will be an experienced travel consultant who has great passion for travel and tourism.\n\tThe person must be apt at booking travel arrangements which includes flight, hotel accommodation, tours, excursions/activities and visa applications for clients (individuals, families, groups, or corporates).\n\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tCreate flight reservations, ticketing, cancellations, refund and after sales services\n\tOrganize end-end trips services.\n\tResearch various destinations and means of travel and advise customers regarding visa processing requirements, flight fares, customs, weather conditions, check-in formalities, etc.\n\tResolve challenges relating to customers’ trips, complaints, or refund, etc.\n\tAttend travel seminars to remain updated with travel and tourism trends.\n\tDiagnose clients’ travel needs and suggest suitable travel packages or services.\n\tHandle unforeseen problems, complaints and determine the right course of action.\n\tCreate and update electronic records of clients, securely.\n\tMaintain a good relationship with customers.\n\tNegotiate any customizations or modifications requested by clients and accommodate them to the very best possible degree.\n\n\nRequirements\n\n\n\t BSc or HND in any discipline with a minimum of Second class Lower (2:2).\n\tExperience: 1-year of  proven work experience as a Travel and Tours Consultant\n\tGDS experience – Galileo is compulsory. Amadeus, and Sabre will be an added advantage.\n\tPossess good contact base with travel agencies and tour companies (Local and International).\n\tSales skills and customer-oriented approach.\n\tExperienced in various areas of travel (domestic/international, business/holidays, group/individual, etc.)\n\tProficiency in MS Office and knowledge of operating standard office equipment.\n\tExcellent verbal communication, presentation, negotiation, command of English and management skills.\n\tGood writing skills for drafting cover letters and emails\n\tExcellent Research & Feedback skills.\n\tExcellent use of initiative and proactive approach in delivering tasks.\n\tProblem-solving attitude.\n\tA customer-oriented attitude.\n\tAbility to work well with a team.\n\tEffective coordination skills.\n\tPassion to Learn and Grow.\n\n\nApplication Closing Date: 30th June, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their applications to: insighttourshr@gmail.com using the Job Position as the subject of the mail.\n\n \n\n\n2.) Visa and International School Admission Processing Officer\n\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time, On-site\n\nJob Summary\n\n\n\tWe are in need of a visa, overseas school admission processing, and immigration consultant to manage the end-to-end of visa and interactions with prospective and existing clients.\n\tTo also support management with daily operational tasks, in alignment with executing overall strategy for the business operations unit.\n\n\nRequirements\n\n\n\tPrior and Good knowledge of Tourist, Business, Student, Medical Visa processing and Overseas schools Admission processing to Canada, USA, UK, South Africa, Dubai, Australia, New Zealand, Schengen & European countries, African Countries and other destinations.\n\tEducation/Certifications: BSc in Business Administration, International Relations, Social Sciences or any related discipline with a minimum of Second class Lower (2:2).\n\tExperience: 2 years’ work experience in related field.\n\tPossess good contact base with other visa assistance professionals, travel agencies and tour companies (Local and International).\n\tProficiency in MS Office and knowledge of operating standard office equipment.\n\tExcellent verbal communication, presentation, negotiation, command of English and management skills.\n\tExcellent Research & Feedback skills.\n\tExcellent use of initiative and proactive approach in delivering tasks.\n\tProblem-solving attitude.\n\tA customer-oriented attitude.\n\tAbility to work well with a team.\n\tEffective coordination skills.\n\tPassion to Learn and Grow\n\n\nResponsibilities\n\n\n\tManage the end-to-end process of visa application. Successfully fill & process Tourist, Business, Student, Medical visa applications and insurance.\n\tHandle Admission processing into Colleges/Universities Abroad. Advise potential students on education opportunities overseas, explain about colleges/universities, courses and their options.\n\tEnsure clients submit all the required documents and information needed for processing their admissions and applications. Follow Up for additional documents required.\n\tBuilding and maintaining relationships with clients and key stakeholders within the Organization.\n\tOversee coaching, mock interviews and advisory services to clients in preparation for application appointments.\n\tEnsure timely submission and collection of client visa applications.\n\tProactively update/ advise registered clients on evolving Immigration laws and processes.\n\tEnsure that all organization's policies are followed in both written and verbal relations with Clients.\n\tContinually research and be abreast of different Countries’ Visa Application process and requirements.\n\tAssist Sales, Product Development, Research and Social Media Unit with information and professional advice when required.\n\tDirect potential leads to the sales team and follow up on progress.\n\tContinually Inform Clients about other services the Organization offers.\n\tEstablish working relationship with different embassies in order to have updated information and special treatment of visa applications.\n\n\nSalary\nN150,000 Monthly (Negotiable).\n\nApplication Closing Date: 24th July, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV and a cover letter to: insighttourshr@gmail.com using the Job Position as the subject of the mail.\n\n \n\n3.) Sales & Business Development Officer\n\nJob Location: Ikeja, Lagos\nEmployment Type: Full time, On-site\nCompany: Insight Tours and Travels Limited\n\nSummary\n\n\n\tThe ideal candidate will be a high performing, self-driven, and result-oriented sales professional who understands the sales process for new customer acquisition and revenue growth and is responsible for the success of the company’s sales department.\n\tThe ideal candidate will be responsible for maximizing our sales team potential, crafting sales plans and justifying those plans to the management and must have strong communication skills and have a proven/positive track record of exceeding outlined goals.\n\n\nResponsibilities\n\n\n\tGenerate new business opportunities and develop sales outlets to drive revenue growth and profit margins.\n\tProspect, sign up new corporate accounts and ensurethey are functional and productive.\n\tManage current & new accounts to ensure each grows by revenue and profit margin.\n\tMeet and exceed weekly and monthly revenue and profit margin targets\n\tIdentify advantages and compare Insight Tours and Travels’ products/services with competitors.\n\tDevelop, plan and monitor sales strategy plan formaximizing company's Return on Investment at all times.\n\tEnsure prompt payment for our products & services and recover debts from clientele when necessary.\n\tRecruit and manage affiliates, freelancers and subagent portfolios to increase in sales generation, revenue and profit margin.\n\tEnsure client's retention with Insight Tours and TravelsLimited through customer relationship management, customer care, service and support delivery.\n\tDevelop clear and effective written proposals for current and prospective customers.\n\tDevelop and submit weekly reports to the management on sales, revenue team activities, customer needs, problems, interests, competitive activities, and potential for new products and services.\n\tAnalyze the market's potential and determine the value of existing and prospective customer's value to the organization.\n\tParticipate in sales presentation to describe account management process and assist in bid process for preferred vendor when requested.\n\tManage sales budgets\n\tAttend sales meetings, events and conferences for networking and to keep abreast of the latest developments.\n\tKeep abreast of best practices and promotional trends.\n\n\nRequirements\n\n\n\tDegree in Management, Business Studies, or related field\n\tTwo (2) years of proven work experience as a Sales Representative, Travel Consultant and Agency Management.\n\tHighly motivated, vibrant, productive, result oriented and target driven with a proven track record in sales and agency management\n\tPrioritizing, time management and organizational skills\n\tAbility to create and deliver presentations tailored to the audience needs\n\tRelationship management, leadership and organizational skills and openness to feedback.\n\tThorough understanding of diverse business processes and strategy development\n\tExcellent knowledge of MS Office, databases, and information systems.\n\n\nSalary\nN150,000 monthly.\n\nApplication Closing Date: 30th June, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their application to: insighttourshr@gmail.com using the Job Position as the subject of the mail.\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]