[
  {
    "title": "Direct Sales Agent (DSA) Job at Elizabeth Maddeux Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/direct-sales-agent-dsa-job-at-elizabeth-maddeux-limited",
    "pubDate": "Sat, 07 Jun 2025 13:03:02 GMT",
    "source": "JobGurus",
    "keyword": "elizabeth maddeux limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Elizabeth Maddeux Limited - Our client, a Financial company, is recruiting suitable candidates to fill the position below:\n\nJob Position: Direct Sales Agent (DSA)\n\nJob Locations: Abuja and Port Harcourt, Rivers\nEmployment Type: Full-time\nIndustry/Sector: Financial\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Direct Sales Agent (DSA) is responsible for generating new business by identifying prospective clients and promoting the company’s financial products, especially within low-income and underbanked communities.\n\tThe role requires active field engagement, customer acquisition, and loan origination in alignment with the Finance Company's mission to enhance financial inclusion.\n\n\nKey Responsibilities\n\n\n\tIdentify and approach prospective clients in target markets to promote the company’s financial products.\n\tBuild and maintain a robust client base through proactive customer relationship management.\n\tProvide after-sales support and maintain long-term relationships with clients.\n\tMarket savings, loans, and other microfinance products to individuals, micro-entrepreneurs, and SMEs.\n\tConduct sales presentations and product demonstrations to showcase the company's offerings.\n\tCollect and verify required customer documentation and ensure accurate account or loan application processing.\n\tEnsure compliance with internal policies, procedures, and regulatory guidelines.\n\tAchieve assigned sales and customer acquisition targets on a daily, weekly, and monthly basis.\n\tCross-sell the company's products to new and existing customers.\n\tConduct client needs assessments and provide recommendations on suitable financial solutions.\n\tEducate clients on product features, repayment structures, and responsible borrowing.\n\tMaintain accurate records of all sales activities.\n\tSubmit timely sales activity reports and participate in performance review meetings.\n\tStay updated on market trends, competitor activities, and customer preferences.\n\tProvide feedback for product/service development based on customer surveys and environmental analysis.\n\tParticipate in the recovery action on non-performing loans, including watch-listed accounts.\n\tEnsure proper Know Your Customer (KYC) procedures to mitigate risks.\n\n\nRequirements\n\n\n\tCandidates should possess an HND / B.Sc. in any discipline.\n\tMust have 1–2 years of direct sales experience in the microfinance sector is mandatory.\n\tProven knowledge of micro-lending practices and financial products.\n\tStrong interpersonal and communication skills with a customer-centric mindset.\n\tAbility to work under pressure and meet sales targets.\n\tFamiliarity with local markets and fluency in the predominant local language is an added advantage.\n\tHigh level of integrity, discipline, and self-motivation.\n\tProficiency in Microsoft Office applications.\n\n\nCompensation Breakdown\n\n\n\tCompetitive Salary (N150,000 - N180,000 / Month)\n\tHealth Insurance\n\tAnnual performance bonus\n\tProgressive workplace with career development opportunities.\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Civil Engineer Job at Starich Recycling Technology Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/civil-engineer-job-at-starich-recycling-technology-limited",
    "pubDate": "Sat, 07 Jun 2025 13:03:02 GMT",
    "source": "JobGurus",
    "keyword": "starich recycling technology limited",
    "duplicate": false,
    "classifications": [],
    "content": "Starich Recycling Technology Company Limited, established in 2018 and located in Abia State, Nigeria, is a subsidiary of RSIN Group which entered Africa in 2008. By advanced plastic recycling technology, production equipment and excellent personnel team, Starich has become a leading manufacturer of plastic products, chemical fiber and textile products in Nigeria. Our main products include: chemical fibers, PET bottles, strapping bands, woven bags, mattresses, crawling mats, 4-piece bedding sets (excluding duvets), and more.\n\nWe are recruiting to fill the position below:\n\nJob Position: Civil Engineer\n\nJob Locations: Aba - Abia, Ogun and Kaduna\nEmployment Type: Full-time\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Description\n\n\n\tDesign and Planning: Developing plans, blueprints, and specifications for infrastructure projects, including buildings, roads, bridges, and water systems.\n\tConstruction Supervision: Overseeing the construction process, ensuring it aligns with design plans and regulatory standards.\n\tMaterial and Equipment Selection: Selecting appropriate materials and equipment for construction projects, considering factors like cost, durability, and sustainability.\n\tProject Management: Managing project budgets, timelines, and resources, ensuring projects are completed on time and within budget.\n\tProblem-Solving: Identifying and resolving technical challenges that arise during the design or construction phase.\n\n\nQualifications\n\n\n\tInterested candidates should possess an HND / Bachelor's Degree with 3-5 years of experience.\n\n\nMethod of Application\nInterested and qualified candidates should send their Applications to: Stellarinternationaljobs@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]