[
  {
    "title": "Job Vacancies at Nile University of Nigeria",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancies-at-nile-university-of-nigeria",
    "pubDate": "Fri, 14 Nov 2025 16:20:42 GMT",
    "source": "JobGurus",
    "keyword": "nile university of nigeria",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Nile University, Founded in 2009, is a private multidisciplinary university based in Abuja, and a proud member of Honoris United Universities since 2020. Nile University currently has over 40 undergraduate programmes and more than 50 postgraduate programmes spread across eight best- in-class faculties, in the College of Health Sciences, Law, Science, Computing Studies, Engineering, Environmental Sciences, Management Sciences, and Arts & Social Sciences.\n\nWe are recruiting to fill the following positions below:\n\n1.) Officer, Guidance & Counselling\n\nJob Location: Abuja (FCT) \nEmployment Type: Full-time\n\nSummary\n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are currently looking to engage a highly competent and result-oriented Officer, Guidance & Counselling, with strong personal & professional integrity to join our dynamic team.\n\n\nResponsibilities\n\n\n\tThe Officer, Guidance & Counsellor will be responsible for providing students with career, personal, social, and educational counselling, whilst assisting students in evaluating their abilities, interests, talents, and personalities.\n\n\nHe/she is expected to:\n\n\n\tProactively identify and address the unique socio-emotional challenges faced by individual students, employing a compassionate and understanding approach.\n\tCollaborate with teaching staff to strategically determine the most effective approaches for meeting the unique needs of individual students whilst actively contributing to interdisciplinary teams for comprehensive student support.\n\tWork closely with school faculty and staff to develop holistic plans for maintaining the well-being of both individual students and the student population as a whole.\n\tComplete thorough and comprehensive reports for services provided, including detailed session notes and incident reports.\n\tProvide tailored group or individual counseling to address a spectrum of social, behavioral, or academic challenges faced by students.\n\tActively engage in open and transparent consultation with families and staff, highlighting students’ needs and collaboratively devising strategies for improvement.\n\tSupport the development and implementation of counseling programs that are effective in meeting the diverse needs of students, adapting strategies to evolving educational landscapes.\n\tSubmit referrals to external agencies when necessary, ensuring that students receive specialized attention and support tailored to their specific needs.\n\tEvaluate students’ academic and career plans, assisting them in setting realistic and achievable goals for personal and academic growth.\n\tMonitor and observe students to identify personal, emotional, or social issues that may impact their overall well-being.\n\tRefer students to health psychologists and other mental health professionals when specialised attention is required.\n\n\nQualifications & Experience\n\n\n\tBachelor's degree in Guidance Counselling or any related field, such as psychology, social work, human services, or a similar discipline.\n\tA minimum of 2 years of proven experience in counselling or related fields is required.\n\tProfessional Certification or Licensure in Guidance Counselling.\n\tAbility to use data management systems or student information systems to maintain accurate and confidential records.\n\n\nMethod of Application \nInterested and qualified candidates should send their CV to: jobs@nileuniversity.edu.ng using the Job Position as the subject of the email.\n\nNote: Only short-listed candidates will be contacted.\n\nDisclaimer\n\n\n\tNile University is an equal opportunity employer and will never demand payment from candidates for employment.\n\tWe caution all applicants to be vigilant against fraudulent solicitations.\n\tLegitimate job openings are exclusively advertised through official channels and reputable job boards.\n\tIf you encounter any suspicious activity, please report it to: humanr@nileuniversity.edu.ng immediately.\n\n\n \n\n2.) Officer, Alumni\n\nJob Location: Abuja (FCT)\nEmployment Type: Full-time\n\nDescription\n\n\n\tWe are currently looking to engage a highly competent and result-oriented Officer, Alumni with strong personal & professional integrity to join our dynamic team.\n\n\nResponsibilities\n\n\n\tThe Officer, Alumni is entrusted with the pivotal responsibility of cultivating vibrant engagement between student societies, alumni, and the University by overseeing mentorship programs, maintaining alumni communication, and managing event participation.\n\n\nHe / She is expected to:\n\n\n\tFoster collaboration with student societies and alumni associations to enhance student-alumni interaction within the University community.\n\tAddress inquiries and requests from university alumni, providing detailed information about the services and activities offered by the Alumni Engagement Centre.\n\tOversee and manage alumni mentorship programs, facilitating meaningful connections between alumni and current students for professional development.\n\tKeep alumni informed about university updates, changes, and career-related information, contributing to the creation of quarterly e-newsletters and reports on career and industry trends.\n\tProvide comprehensive support for all University initiatives aimed at enhancing and enriching the overall alumni experience.\n\tGather feedback from alumni on their interactions with employers during career-related events, contributing to continuous improvement initiatives.\n\tAssist the Career Insights Advisor in maintaining an updated alumni database, including personal contact details and employment information, in compliance with relevant data retention laws.\n\tManage and refresh content on the alumni section of the University website, including news, events, and alumni profiles.\n\tCompile, document, and monitor attendance at alumni events, and follow up on action items and referrals from alumni to ensure a seamless and impactful experience.\n\tSupervise and review on-campus recruitment processes, interview procedures, resume referrals, and job listing services tailored for alumni.\n\tGenerate comprehensive reports for stakeholders on the performance of implemented alumni engagement initiatives, contributing to strategic decision-making.\n\n\nQualification & Experience\n\n\n\tBachelor’s Degree in Business Administration, Marketing, Public Relations, or any other related field.\n\tMinimum of 2 years of experience in public/corporate relations or related roles.\n\tMSc / MBA in a related field will be an advantage.\n\tExperience in people and project management.\n\tIncumbent must be well organized with the ability to plan, prioritize and manage high volumes of alumni queries and requests.\n\tExperience in coordinating and updating website content, preferably using content management systems.\n\tDemonstrated ability to systematically evaluate outcomes of alumni initiatives, providing insights for improvement.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: jobs@nileuniversity.edu.ng using the Job Position as the subject of the email.\n\nNote: Only short-listed candidates will be contacted.\n\nDisclaimer\n\n\n\tNile University is an equal opportunity employer and will never demand payment from candidates for employment.\n\tWe caution all applicants to be vigilant against fraudulent solicitations.\n\tLegitimate job openings are exclusively advertised through official channels and reputable job boards.\n\tIf you encounter any suspicious activity, please report it to: humanr@nileuniversity.edu.ng immediately.\n\n\n \n\n \n\n3.) Officer, Club Engagement\n\nJob Location: Abuja (FCT)\nEmployment Type: Full-time\n\nAbout the Role\n\n\n\tWe are currently looking to engage a highly competent and result-oriented Officer, Club Engagement, with strong personal & professional integrity to join our dynamic team.\n\n\nResponsibilities\n\n\n\tThe Officer, Club Engagement will be responsible for the administration, development, and support of student-led clubs and societies within the University.\n\n\nHe/she is expected to;\n\n\n\tIdentify students’ interests and encourage formation of clubs aligned with their aspirations.\n\tProvide ongoing support and guidance to club committees, promoting collaboration and dynamic engagement.\n\tDevelop and implement communication strategies to keep stakeholders informed about club activities.\n\tMaintain accurate records of all club activities and outcomes.\n\tSecure necessary approvals for financial and facility-related matters concerning club events.\n\tEnsure transparent financial record-keeping and compliance with guidelines.\n\tParticipate in decision-making and policy discussions with club committees.\n\tOrganize events to recognize and celebrate active club members and committees.\n\tFacilitate regular meetings with club members, committees, and the Director of Student Services.\n\tAddress conflicts within clubs, promoting discipline and smooth operations.\n\tEnforce guidelines for club operations and member conduct.\n\tCollaborate with counsellors and psychologists to monitor student progress and recommend interventions.\n\tPrepare timely reports and seek approvals for proposed events.\n\tFoster collaboration among clubs for joint activities and events.\n\tCoordinate at least one major club-specific event per academic session.\n\n\nQualification & Experience\n\n\n\tBachelor’s Degree in Education, Recreation, Event Management, or Human Services.\n\tMinimum of 2 years of experience in youth/social club coordination, volunteer management, and partnership development.\n\tExperience delivering projects/workshops for young people.\n\tBudgetary and supervisory experience.\n\tKnowledge of youth development, out-of-school programs, and mentoring practices.\n\n\nMethod of Application \nInterested and qualified candidates should send their Applications to: jobs@nileuniversity.edu.ng using the Job Position as the subject of the email.\n\nNote\n\n\n\tOnly short-listed candidates will be contacted.\n\tDisclaimer: Nile University is an equal opportunity employer and will never demand payment from candidates for employment. We caution all applicants to be vigilant against fraudulent solicitations. Legitimate job openings are exclusively advertised through official channels and reputable job boards. If you encounter any suspicious activity, please report it to humanr@nileuniversity.edu.ng immediately.\n    \n\n    \n\n        Click here to Apply",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]