[
  {
    "title": "Marketing Officer Job at Trinity Financial",
    "link": "https://www.jobgurus.com.ng/jobs/view/marketing-officer-job-at-trinity-financial",
    "pubDate": "Mon, 02 Jun 2025 21:39:42 GMT",
    "source": "JobGurus",
    "keyword": "trinity financial",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Trinity Financial is a limited liability company duly incorporated in Nigeria under the 2002 Companies and Allied Matters Act. licensed and supervised by the Central Bank of Nigeria as a full-fledged Financial Service Firm.\n\nWe are recruiting to fill the position below:\n\nJob Position: Marketing Officer\n\nJob Location: Victoria Island, Lagos\nEmployment Type: Full-time\n\nRequirements\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are urgently in need of a vibrant and intelligent Female Fresh Graduates to occupy the role of a Marketer.\n\tWith minimum of Zero experience as there would also be an intense training regarding this role for qualifiedvand interested applicants\n\tB.Sc in Accounting or related fields\n\tMust reside within Lekki, Ajah or Surulere.\n\n\nSalary\nN100,000 - N150,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: consultomr@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Sales Account Manager Job at ipNX Nigeria Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/sales-account-manager-job-at-ipnx-nigeria-limited",
    "pubDate": "Mon, 02 Jun 2025 21:39:42 GMT",
    "source": "JobGurus",
    "keyword": "ipnx nigeria limited",
    "duplicate": [
      {
        "site": "Example Site",
        "id": "7404dab744617c4e005220b8b2608298",
        "timestamp": 1748869291184
      },
      {
        "site": "JobGurus",
        "id": "7404dab744617c4e005220b8b2608298",
        "timestamp": 1748900381675
      }
    ],
    "classifications": [
      "Marketing"
    ],
    "content": "ipNX is one of Nigeria’s fastest growing Information and Communications Technology companies, serving a multitude of needs across enterprises, small businesses and residents with innovative, world-class services. Our ability to identify, satisfy and exceed today’s market needs is a testament to over a decade of experience, our commitment, drive and passion realized through highly skilled and well seasoned professionals.\n\nWe are recruiting to fill the position below:\n\nJob Position: Sales Account Manager\n\nJob Location: Abuja (FCT)\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a sales account manager to join our team. The Account Manager will maintain and grow the business and client base on an ongoing and project basis, will create and maintain relationships with existing and potential clients, develop strategic solutions and plans that best fit the business needs within the Lagos Island.\n\tBuild and maintain productive business relationships with key decision makers to understand the Customers’ strategic direction and identify opportunities.\n\tFocus on growing and developing existing clients, by exploring and driving Business opportunities that will give ipNX a larger share of the Customers’ wallets. Please apply via https://bit.ly/ipNXrecruitment\n\n\nResponsibilities\n\n\n\tDevelop and maintain strategic long-term trusting relationships with high volume clients to accomplish organic growth and long-term company objectives.\n\tDevelop and implement marketing strategies and ensure that coherent and consistent strategies are employed in all serving and/or maintenance transactions and relationships.\n\tInteract with key decision makers, Initiate and bring forward strategic engagement plans to retain and grow business within key accounts.\n\tProvide annual plan on how to increase share of wallet and win new business within each allocated accounts.\n\tDevelop a deep understanding of the client’s priorities, strategies and ensure ipNX add value across the broader organization.\n\tDevelop and implement effective account strategies including relationship mapping, management of opportunity pipeline and generation of service offerings.\n\tMaintain knowledge and awareness of competing products/services, discount and pricing structures, and overall strengths and weaknesses in order to determine how best to service and motivate key accounts to stay with the business.\n\tMaintain data and information relevant to key accounts for the purpose of conducting analyses that influence account-specific decision making.\n\tMaintain, deliver and present forecasting models, metrics, reports, analyses, and dashboards to drive key business decisions within the Account.\n\tMaintain good public relations with current and prospective customers within the Accounts.\n\tEnsure that profitable sales volume and strategic objective targets are met for the assigned key accounts.\n\tCo-ordinate with relevant technical and service delivery teams to ensure excellent service delivery to the customer\n\tEffective Project Management, Business Profitability and Thorough Understanding of Customers’ needs\n\n\nQualifications and Requirement\n\n\n\tA Bachelor’s Degree in Sales, Business Management, Communications, Marketing, Customer Relationship Management, Business Administration or any other related field (2.1/Upper Credit)\n\tAt least 5 years of Key Account Management experience\n\t5 - 7 Years of experience in managing strategic Accounts\n\tProven experience of driving opportunities through to revenue\n\tStrong commercial acumen both in terms of managing pipeline and challenging/coaching teams through the sales process\n\tA strong knowledge of Pursuit or another relationship/ sales methodology\n\tExhibits sound business judgment, a proven ability to influence others, strong analytical skills, and a proven track record of taking ownership, leading data-driven analyses, and influencing results\n\tAbility to penetrate accounts and meet with stakeholders within accounts/sectors\n\tCapability to be a structured thinker with a strong analytical approach.\n\tExcellent research, problem solving, and analytical skills, including excellent PowerPoint and Excel capabilities, with impeccable analytical and business judgment.\n\n\nNote\n\n\n\tPlease note that only shortlisted candidates will be contacted.\n\tDouble Application is not accepted. \n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Internal Auditor Job at Excel and Grace Consulting",
    "link": "https://www.jobgurus.com.ng/jobs/view/internal-auditor-job-at-excel-and-grace-consulting",
    "pubDate": "Mon, 02 Jun 2025 21:39:42 GMT",
    "source": "JobGurus",
    "keyword": "excel and grace consulting",
    "duplicate": [
      {
        "site": "Example Site",
        "id": "f1167244121b741022b43c1a62c1b5b7",
        "timestamp": 1748869291184
      },
      {
        "site": "JobGurus",
        "id": "f1167244121b741022b43c1a62c1b5b7",
        "timestamp": 1748900381675
      }
    ],
    "classifications": [
      "Finance"
    ],
    "content": "Excel and Grace Consulting is a fast-paced business consulting organization with a track record of delivering exceptional business solutions to small and medium-scale enterprises in Nigeria, Ghana, Germany, Switzerland, Canada, etc. We are certified management consultants with the International Council of Management Consulting Institutes (CMC-Global) with over 18 years of experience. Our team of experts and consultants have authored over 20 books on business management, business structure, business operations, human resources, organizational structure, employee development, money management, and so on.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Internal Auditor\nJob Location: Iyana-Ipaja, Lagos\nEmployment Type: Full-time\nIndustry: Hospitality / FMCG\n\nJob Overview\n\n\n\tWe are seeking a highly skilled and detail-oriented Internal Auditor to join our team.\n\tThe ideal candidate will be responsible for evaluating and improving the effectiveness of internal controls, risk management, and governance processes across our hospitality and FMCG operations.\n\tYou will ensure compliance with regulatory standards, detect irregularities, and make recommendations for process improvements.\n\n\nKey Responsibilities\n\n\n\tConduct periodic audits of operational, financial, and compliance processes across the organization.\n\tReview internal controls and processes to identify areas of risk, inefficiency, or non-compliance.\n\tVerify accuracy of financial records, inventory, procurement, and expense reports.\n\tEvaluate the effectiveness of risk management practices and controls in place.\n\tLiaise with external auditors, regulators, and stakeholders as required.\n\tMonitor adherence to policies and procedures across departments (e.g. kitchen operations, inventory management, procurement, HR, and sales).\n\tInvestigate discrepancies, fraud, or financial misstatements and report findings to management.\n\tRecommend improvements in operational efficiency, internal controls, and business practices.\n\tPrepare comprehensive audit reports and present findings with actionable insights to management.\n\tConduct follow-up audits to ensure that recommended corrective actions have been implemented.\n\n\nRequirements\n\n\n\tBachelor's degree in Accounting, Finance, or a related field (ICAN/ACCA certification is an added advantage).\n\tMinimum of 3 years of experience as an internal auditor, preferably within the hospitality or FMCG sector.\n\tStrong knowledge of accounting standards, internal controls, and audit procedures.\n\tProficiency in accounting software (e.g. QuickBooks, Sage, or ERP systems) and Microsoft Office (especially Excel).\n\tExcellent analytical, investigative, and reporting skills.\n\tHigh attention to detail, integrity, and the ability to maintain confidentiality.\n\tStrong communication and interpersonal skills.\n\tMust be resident in or willing to relocate to Iyana-Ipaja or nearby areas.\n\n\nSalary\nN300,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV and a brief cover letter to: eandg.tprecruiters@gmail.com using \"Internal Auditor – Iyana-Ipaja\" as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Linux System Administrator Job at AMECRON Nigeria Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/linux-system-administrator-job-at-amecron-nigeria-limited",
    "pubDate": "Mon, 02 Jun 2025 21:39:42 GMT",
    "source": "JobGurus",
    "keyword": "amecron nigeria limited",
    "duplicate": [
      {
        "site": "Example Site",
        "id": "54f9211cf528b0b0c75d8628cb192dd2",
        "timestamp": 1748869291184
      },
      {
        "site": "Example Site",
        "id": "215afdcaaf6cbc45fbfeb4bc9b30a6f5",
        "timestamp": 1748870501361
      },
      {
        "site": "JobGurus",
        "id": "54f9211cf528b0b0c75d8628cb192dd2",
        "timestamp": 1748900381675
      }
    ],
    "classifications": [],
    "content": "AMECRON Nigeria Limited is an indigenous firm established and incorporated on the 26th of June, 1980, under the companies and allied matters decree of Nigeria, 1968. Primarily set up, as a consulting Civil Engineering firm, the company served both the private and public sectors for a decade, before entering into the Oil and Gas industry in the turn of the decade (1990).\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nAmercron's services encompass consultancy - various Engineering and project design services through to supply and Installation with ongoing technical support, manpower supply, construction/Project Management and multidisplinary design, and procurement services. these are catergorized into four groups: Engineering and Construction/Fabrication, Project Management, Procurement Services, and Human Resource Management.\n\nWe are recruiting to fill the position below:\n\nJob Position: Linux System Administrator\n\nJob Location:  Nigeria\n\nJob Description\n\n\n\tThe Linux Systems Administrator is responsible for effective provisioning, installation/configuration, operation, and maintenance of systems hardware and software and related infrastructure.\n\tThis position assists project teams with technical issues in the initiation, planning and implementation phases with multiple departments, clients, and vendors. \n\tThe Linux Systems Administrator will be involved in the continued implementation, rollout, maintenance, and support of all corporate software and servers and related infrastructure. \n\tThis individual participates in technical research and development to enable continuing innovation within the infrastructure. \n\tThis individual ensures that system hardware, operating systems, software systems, and related procedures adhere to organizational values and enabling staff. \n\tThe ideal candidate is a strong technology professional with experience in a variety of environments for server and application administration for all development, testing, and production systems.\n\n\nResponsibilities\nThe key responsibilities include:\n\n\n\tEnsure HSE goal zero is achieved in all aspect operations service delivery.\n\tEnsure that servers’ availability is within agreed SLA.\n\tIncident/Problem resolution on escalation from 1st and 2nd Line Support\n\tEnsure backup operations are up and running.\n\tEnsure adherence to established processes.\n\tEvents and capacity management\n\tOperations support for Hosting and Storage projects\n\tHosting and Storage infrastructure security monitoring and remediation\n\tApply OS patches and upgrades on a regular basis and upgrade administrative tools and utilities. Configure / add new services as necessary.\n\tDevelop, maintain installation and configuration procedures through the change management process.\n\tParticipates in internal and client project planning for business systems and is relied upon to research and develop solutions/suggestions.\n\tInterface with hardware/software vendors to provide guidance on design and usability.\n\tResearch and recommend innovative, and where possible automated approaches for system administration tasks.\n\n\nJob Purpose\n\n\n\tProvide technical expertise for RedHat Linux\n\tProvide technical expertise for Suse Linux\n\tProvide infrastructure support for Linux based applications.\n\tProvide infrastructure benchmarks and ensure projects are delivered to operations specification.\n\tIT security and compliance management\n\n\nKey Interfaces\n\n\n\tDBA & Middleware Team\n\tHosting and Storage Project Team\n\tIT Security and compliance Team\n\tSubsurface and Wells Team\n\tExploration, Geophysics and Reservoir Engineering Application Support Team\n\n\nJob Dimension\n\n\n\tWorks as part of a team that provides support for about:\n\t\n\t\tSuse Linux servers and 2 support systems\n\t\tPhysical & Virtual Linux servers\n\t\tLinux clusters with cluster nodes\n\t\tVWS Linux and Windows Workstations\n\t\n\t\n\n\nSpecial Challenges:\n\n\n\tUnderstanding of Operations Delivery process\n\tUnderstanding of Enterprise Services, Delivery Verticals, Business Interface and IDSO\n\tUnderstanding the nature of cross function reporting and communication\n\tUnderstanding of virtualization technologies with focus on VMware vSphere\n\n\nRequirements\nEducational Qualification & Experience:\n\n\n\tCandidates should possess a Degree in Computer Science, Information Systems, physical sciences, or Engineering.\n\tAbility to speak read and write in the English language.\n\tAt least 5 years’ experience in Systems Administration within the Unix or Linux environment\n\tFormal Professional Training and Certification in RHCE and ITILF will be added advantage.\n\tFormal Professional Training on Linux System Administration & Troubleshooting and IT Service Management skills.\n\tAbility to lead and manage third party personnel.\n\tAbility to manage relations with peers and senior EP business managers effectively in various organisations.\n\tStrong interpersonal skills, which are critical and required to develop the professional respect essential for successful performance.\n\tExperience in working with or a good awareness of NetApp Storage Infrastructure.\n\tHas excellent project management skills to build and execute project plans for system upgrades, patches, rollouts, etc.\n\tGood understanding of the EP business\n\tGood understanding of the trends in the IT industry\n\tNatural flair for documentation and knowledge sharing\n\tAbility to communicate with and understand the needs of clients.\n\n\nMethod of Application\nInterested and qualified candidates should send their Applications to: cv@amecronng.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Warehouse Manager Job at DAG Industries Nigeria Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/warehouse-manager-job-at-dag-industries-nigeria-limited-2",
    "pubDate": "Mon, 02 Jun 2025 21:39:42 GMT",
    "source": "JobGurus",
    "keyword": "dag industries nigeria limited",
    "duplicate": [
      {
        "site": "Example Site",
        "id": "b9a47fc979a105fa178c0a6ff600196f",
        "timestamp": 1748869291184
      },
      {
        "site": "Example Site",
        "id": "c65f9e18aef5d89c2e2e023fca7d8852",
        "timestamp": 1748869291184
      },
      {
        "site": "JobGurus",
        "id": "b9a47fc979a105fa178c0a6ff600196f",
        "timestamp": 1748900381675
      }
    ],
    "classifications": [
      "Finance"
    ],
    "content": "DAG Industries Nigeria Limited, We provide the most popular range of Bajaj motorcycles, Bajaj tricycles, Bajaj genuine spares, MRF tyres, DAG lubricants and unfaltering after sales service. Backed by its untiring team of professional and trained technicians, authorized service stations and its own service center, DAG has been instrumental in developing Nigeria through building infrastructure and creating jobs thereby providing a livelihood for the common people in Nigeria. We at DAG are committed to provide genuine spare parts, accessories, and a never failing support to its customers and business associates.\n\nWe are recruiting to fill the position below:\n\nJob Position: Warehouse Manager\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tThe Warehouse Manager is responsible for overseeing the efficient receipt, storage, and dispatch of a wide range of goods. \n\tThis role ensures productivity targets are met and that all warehouse processes are running smoothly, safely, and in compliance with company and legal standards. \n\tThe manager leads and motivates the warehouse team to optimize workflow and ensure high customer satisfaction.\n\n\nResponsibilities\nWarehouse Operations:\n\n\n\tOversee daily warehouse activities including receiving, storing, inventory control, order fulfillment, and shipping.\n\tEnsure accurate and timely order processing and delivery.\n\n\nInventory Management:\n\n\n\tMonitor stock levels and conduct regular inventory checks.\n\tImplement and manage warehouse management systems (WMS) or ERP for stock accuracy and traceability.\n\n\nTeam Leadership:\n\n\n\tRecruit, train, and supervise warehouse staff.\n\tSet performance goals and conduct regular performance reviews.\n\tFoster a positive and productive work environment.\n\n\nCompliance & Safety:\n\n\n\tEnsure compliance with health, safety, and environmental regulations.\n\tEnforce proper handling, storage, and security procedures.\n\tConduct regular safety audits and training sessions.\n\n\nProcess Improvement:\n\n\n\tAnalyze workflows and implement improvements to increase efficiency and reduce costs.\n\tOptimize warehouse layout and processes for better space utilization and faster operations.\n\n\nCross-functional Coordination:\n\n\n\tCollaborate with procurement, logistics, sales, and customer service teams to meet business needs.\n\tResolve delivery and inventory-related issues in a timely manner.\n\n\nReporting & Documentation:\n\n\n\tMaintain accurate records of inventory, shipments, staff schedules, and expenses.\n\tPrepare regular reports for senior management on warehouse performance and KPIs.\n\n\nRequirements\n\n\n\tBachelor’s Degree in Logistics, Supply Chain Management, Business Administration, or a related field.\n\t5+ years of experience in warehouse management or logistics operations.\n\tStrong leadership and team management skills.\n\tProficiency in WMS/ERP systems and MS Office tools.\n\tExcellent organizational and problem-solving abilities.\n\tKnowledge of safety and compliance regulations.\n\tForklift certification (optional or required depending on the role).\n\n\nWorking Hours:\n\n\n\tMonday till Saturday (8am-6pm).\n\n\nSalary\nN350,000 - N500,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: Kingsley.o@bajajnigeria.com using the Job Position and Prefered location as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]