[
  {
    "title": "Mechanical Engineer Job at Equinix",
    "link": "https://www.jobgurus.com.ng/jobs/view/mechanical-engineer-job-at-equinix",
    "pubDate": "Sat, 14 Jun 2025 16:43:36 GMT",
    "source": "JobGurus",
    "keyword": "equinix",
    "duplicate": false,
    "classifications": [],
    "content": "Equinix is the world’s digital infrastructure company®, operating over 260 data centers across the globe. Digital leaders harness Equinix's trusted platform to bring together and interconnect foundational infrastructure at software speed. Equinix enables organizations to access all the right places, partners and possibilities to scale with agility, speed the launch of digital services, deliver world-class experiences and multiply their value, while supporting their sustainability goals.\n\nWe are recruiting to fill the position below:\n\nJob Position: Mechanical Engineer\n\nJob ID: JR-152051\nJob Location: Lagos\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tComplete knowledge and full understanding of area of specialization, principles and practices within a professional discipline.\n\tAssesses unusual circumstances and uses sophisticated analytical and problem solving techniques to identify cause.\n\tResolves and assesses a wide range of issues in creative ways and suggests variations in approach.\n\tThis job is the fully qualified, experienced professional, journey-level position.\n\n\nResponsibilities\nTechnical Support:\n\n\n\tResponsible for technical specialized repairs on mission- critical datacenter systems requiring sophisticated analytical problem solving techniques to identify cause.\n\n\nReporting:\n\n\n\tReviews specialized contractual reports and activities.\n\n\nSite Maintenance:\n\n\n\tOversees the site maintenance and up keep of Data Center infrastructures according to Equinix global standards.\n\n\nAssess Adherence to Policy:\n\n\n\tEnsures all repairs performed on all Data Center infrastructure are according to the manufacturer’s guidelines and best practices.\n\n\nComplexity & Problem Solving:\n\n\n\tAids in root cause analysis and in repair of specialized failed critical components\n\tDevises solutions based on limited information and precedent and adapts existing approaches to resolve issues\n\tUses evaluation, judgment, and interpretation to select right course of action. Work is done independently and is reviewed at critical points.\n\n\nCollaboration & Interaction:\n\n\n\tLiaises with design stakeholders on design changes\n\tEnhances relationships and networks with senior internal/external partners who are not familiar with the subject matter often requiring persuasion\n\tAdapts style to differing audiences and often advises others on difficult matters.\n\n\nDesign:\n\n\n\tValidates design criteria for new principal power installations (e.g. single power source).\n\n\nQualifications\n\n\n\tTypically requires proven years of related experience with a Bachelor’s degree; or proven years and a Master’s degree; or a PhD without experience; or equivalent work experience.\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Network Service Delivery Job at Equinix",
    "link": "https://www.jobgurus.com.ng/jobs/view/network-service-delivery-job-at-equinix-1",
    "pubDate": "Sat, 14 Jun 2025 16:43:36 GMT",
    "source": "JobGurus",
    "keyword": "equinix",
    "duplicate": false,
    "classifications": [],
    "content": "Equinix is the world’s digital infrastructure company®, operating over 260 data centers across the globe. Digital leaders harness Equinix's trusted platform to bring together and interconnect foundational infrastructure at software speed. Equinix enables organizations to access all the right places, partners and possibilities to scale with agility, speed the launch of digital services, deliver world-class experiences and multiply their value, while supporting their sustainability goals.\n\nWe are recruiting to fill the position below:\n\nJob Position: Network Service Delivery\n\nJob ID: JR-151389\nJob Location: Lekki, Lagos\nEmployment Type: Full-time, Hybrid\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Summary\n\n\n\tThe Network Service Delivery Engineer will be responsible for the first- and second-line network monitoring, change management, incident management and escalations, management of managed service vendors, and providing support on the network serving nodes using various network management tools and trouble-ticketing systems.\n\tThis includes diagnosing and locating faults, performing repairs, maintenance, and reporting to ensure optimal customer satisfaction.\n\n\nResponsibilities\n\n\n\tTo provide daily support (8 am -5 pm), 5 working days/week as a Network service delivery engineer, if needed, you may be required to work beyond stipulated working hours and over weekends\n\tEnsure proactive monitoring of Primetime customer services on MainOne’s network using the available NMS (Network Monitoring System), providing specific updates, status, and performance of all the services\n\tEnsure there is a ticket / open a trouble ticket (TT) for every Primetime-related fault and that it is tracked, updated, and managed throughout the incident's life cycle up to the point of closure within OLAs\n\tEnsure that any equipment faults affecting Primetime Customers are rectified promptly and efficiently\n\tResponsible for providing remote support and troubleshooting for all identified faults on the network, interfacing with the assigned MainOne Vendor and third party, and escalating to Level 3 (TX Implementation and IP Operations) where it cannot be resolved at Level 2\n\tMaintain and ensure full compliance with all MainOne’s NOC Operations processes and procedures\n\tMonitor Primetime customers' performance on MainOne's global network, flag anomalies, and collaborate with stakeholders to resolve any challenges to customer satisfaction\n\tEnsure accurate Ticket logging, timely updates, and communication by Primetime Service NOC to other engineers during the life cycle of an IPLC, IP, or VOIP-related incident\n\tEnsure that all escalated IP, IPLC, or VOIP tickets are resolved within agreed-upon timelines and handled professionally\n\tManage appropriate communication to achieve an excellent service experience during the incident handling\n\tAnswer all Primetime customer support-related telephone calls and interface with internal and external stakeholders on operational issues and related network events, using Main One’s standard operating procedures to address all issues\n\tEnsure that change management processes for Primetime customers are adhered to ensure customer satisfaction\n\tEnsure network KPIs are met (Network Availability 99.99%, and MTTR 4 hours NHW, 6 hours HW)\n\tProvide technical support to managed service vendors 24/7 to meet and exceed customers’ expectations\n\tEnsure that circuit handover or acceptance of new services is carried out in accordance with MainOne’s standards, capturing all necessary information and saving it in DMS, in compliance with our corporate policy\n\tHandle escalated trouble ticket calls, working closely with other NOC engineers, and last-mile providers, and managed service vendors to resolve issues promptly\n\tEnsure quarterly training is conducted for the vendor support engineers, covering technical aspects and operational expectations\n\tUndertake any other ad hoc assignment that may be assigned by the Ghana Transmission and CLS Manager\n\n\nQualifications\n\n\n\tA Bachelor’s Degree in Telecom Engineering, Computer Science, or Equivalent in Information and Communications Technology\n\n\nRelevant Professional / Technical Certifications:\n\n\n\t1-2 years of work experience in configuration, operations, and maintenance of fiber optical nodes, Carrier Ethernet nodes, MW radio (PTP, PTMP), IP network troubleshooting skills, (Cisco-Ciena, FortiGate routers & switches), fiber optics cable handling and OTDR traces, and basic knowledge in power rectification systems\n\tNetwork certification, such as Cisco Certified Network Associate (CCNA) or equivalent, is desired. Strong understanding of GPON, FTTx architectures, and related technologies\n\n\nCompetencies Required:\n\n\n\tMust have fair knowledge of optical networks such as DWDM/OTN/SDH/SONET/GPON, FTTx, and working knowledge of Ciena OME 6500 series, Ciena switches, Cisco routers and switches\n\tAbility to read, review, interpret and understand technical documents (e.g., schematics, drawings, blueprints, layouts) and implement them into the network in an efficient manner if required\n\tMicrowave radio advanced configuration skills and troubleshooting\n\tBasic knowledge in configuring and troubleshooting L1 and L2 issues for Cisco and Ciena equipment\n\tFair understanding of OSPF, TCP/IP, Enterprise Wireless, and L2 technologies\n\tTCP/IP, Network Security, VoIP and OSPF networking experience required\n\tAbility to drive managed vendors to prioritize and resolve problems and identify future needs\n\tAble to use initiative to tackle a broad range of problems, while still following procedures and processes\n\tExtensive knowledge of Spanning Tree, VLAN’s, VTP, and Trucking protocols\n\tGood knowledge of the Microsoft Office suite, including Word, Excel, PowerPoint and MS SharePoint\n\tAble to work well within a busy team and handle a wide range of issues. Capable of multi-tasking, good time management and prioritization of workload\n\tAbility to maintain composure and customer-service focus in stressful and ambiguous situations\n\tFamiliar with the use of various test equipment, i.e. OSA, OTDR, Ethernet Analyser, Transmission Analysers, Optical power meters, etc.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Personal Assistant Job at Lauvee Beauty Salon",
    "link": "https://www.jobgurus.com.ng/jobs/view/personal-assistant-job-at-lauvee-beauty-salon-3",
    "pubDate": "Sat, 14 Jun 2025 16:43:36 GMT",
    "source": "JobGurus",
    "keyword": "lauvee beauty salon",
    "duplicate": false,
    "classifications": [],
    "content": "Lauvee Beauty Salon is a luxury salon situated at Wuse 2, the heart of Abuja. It is privately owned and strives to positively enrich our clients with beauty, luxury and lifestyle. We render excellent services ranging from the sales of raw human hairs, manicure and pedicure, lash extensions, microblading and above all, our excellent customer care services are experiences you wouldn't want to miss.Our salon is literally a home away from home as we have a very spacious and serene environment, making sure we give you comfort at its peak.\n\nWe are recruiting to fill the position below:\n\nJob Position: Personal Assistant\nJob Location: Free Town, Abuja (FCT) \nEmployment Type: Full-time\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nRequirements\n\n\n\tInterested candidates should possess a Bachelor's Degree with 2 - 3 years of experience. \n\tApplicant must be brilliant, Hardworking and be able to multitask.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: lauveebeauty@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Internal Auditor Job at Wandel International",
    "link": "https://www.jobgurus.com.ng/jobs/view/internal-auditor-job-at-wandel-international-1",
    "pubDate": "Sat, 14 Jun 2025 16:43:36 GMT",
    "source": "JobGurus",
    "keyword": "wandel international",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "Wandel International is the flagship company of the Simba Group, operating in Nigeria since 1988. The company is home to some of Nigeria’s best loved brands, and leaders in their respective industries. We are a diversified business entity with interest in distribution, marketing and services in transportation, alternate energy, internet connectivity and call center solutions.\n\nWe are recruiting to fill the position below:\n\nJob Position: Internal Auditor\n\nJob Location: Surulere, Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Internal Audit role is responsible for the execution and overseeing compliance audits across all Wandel international.\n\tThis role leads the full lifecycle of audit engagements—from risk assessment and planning to execution, reporting, and follow-up—ensuring audits are delivered to a high standard and in alignment with the Group Internal Audit Methodology and the International Standards for the Professional Practice of Internal Auditing (IIA Standards).\n\tThe incumbent plays a key role in providing assurance over the effectiveness of compliance frameworks, policy adherence, and regulatory obligations across Wandel Group.\n\tThis includes assessing internal policies and control systems, identifying systemic weaknesses, and recommending actionable improvements to strengthen governance and enhance risk management.\n\n\nOther Responsibilities:\n\n\n\tSupportin audit planning and conduct risks-based audit process.\n\tLead and perform fieldwork activities, including process walkthroughs, control testing, policy evaluation, and gathering sufficient audit evidence.\n\tAssess compliance with internal policies, applicable laws/procedures and contractual obligations.\n\tLeverage data analytics to enhance audit coverage and identify anomalies or red flags.\n\tAssist with the development and defining the scope of review, propose tailored audit work program and audit time schedules.\n\tPerform walkthrough interviews with key stakeholders and testing of complex / non-routine audit areas including the development and completion of work programs.\n\tEvaluate internal controls' design and operating effectiveness over financial reporting, including identifying control gaps and recommending improvements.\n\tCollaborate with cross-functional teams to identify control gaps and facilitate the implementation of corrective actions.\n\tStay abreast of industry regulations and standards to ensure compliance and best practices are integrated into our audit processes.\n\tPrepare high-quality audit reports with well-documented findings, root cause analysis, risk implications, and actionable recommendations\n\tTrack implementation of audit recommendations, validate remedial actions and escalate overdue or ineffective responses\n\tCarry out other responsibility as require by management.\n\n\nQualifications\n\n\n\tBachelor’s degree in Accounting, Finance, Business, or a related disciplinewith a minimum of Second Class upper/Upper credit.\n\tAt least 6 years of working experience in internal audit, risk or advisory.\n\tACA, ACCA, CIA, CISA or equivalent certification (or actively pursuing) is an advantage.\n\tHave a minimum of five credits in WASSCE Ordinary Level/NECO subjects or acceptable equivalent examination, including Mathematics and English Language in one sitting only.\n\tConsiderable knowledge of accounting principles, practices, procedures, and generally accepted auditing standards.\n\tResults-oriented with strong analytical, problem-solving, and decision-making skills.\n\tExcellent communication, interpersonal and reporting skills, with the ability to communicate complex technical information to non-technical stakeholders.\n\n\nBenefits\n\n\n\tCompetitive salary\n\tOpportunities for Professional Growth and Career Advancement\n\tCollaborative and supportive work environment.\n\n\nMethod of Application\nInterested and qualified candidates should send their Resume to: careers@simba.com.ng using the Job Position as subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Marketing Manager Job at Simba Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/marketing-manager-job-at-simba-group",
    "pubDate": "Sat, 14 Jun 2025 16:43:36 GMT",
    "source": "JobGurus",
    "keyword": "simba group",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "The Simba Group which started operations in 1988, is a conglomerate having a Pan-Nigeria presence and business interests in some other most dynamic sectors in the economy. The Group is a dominant player in the transportation, power products, and IT-enabled service sectors which are critical to the sustained growth of the Nigerian Economy. The corporate vision of the Group is to provide innovative and quality products along with excellent aftersales service to our customers. The activities of the Group are guided by strong value systems built around Integrity, Innovation, Openness, and Consistency.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Marketing Manager\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tThe Head of Marketing will be responsible for developing and executing the marketing strategy for MTD with a primary focus on increasing brand awareness, driving customer acquisition and enhancing market share in MTD.\n\tThis leadership role requires a strategic thinker with a deep understanding of the industry, exceptional communication skills and a track record of successful marketing campaigns.\n\n\nResponsibilities\n\n\n\tDevelop and implement a comprehensive marketing strategy aligned with SIMBA MTDs overall business objectives.\n\tContinuously assess market trends, customer needs and competitor activities to refine the strategy.\n\tStrengthen and manage the division’s brand image, ensuring brand consistency across all marketing channels and materials.\n\tCollaborate with marketing agencies and vendors to execute marketing initiatives ensuring the highest quality of work within budget constraints.\n\tDrive product launches and promotional campaigns to maximize product visibility and sales. Collaborate with cross-functional teams to ensure successful product introductions.\n\tConduct market research to identify customer preferences, needs and emerging trends. Utilize research findings to develop data-driven marketing initiatives.\n\tOversee the development and execution of digital marketing campaigns, including SEO, SEM, social media, email marketing and online advertising.\n\tLead content creation efforts, including the production of marketing collateral, product literature, blog posts and multimedia content.\n\tManage the marketing budget effectively, ensuring cost-efficient strategies and campaigns that deliver measurable results.\n\tBuild and lead a high-performing marketing team, providing guidance, mentorship and professional development opportunities.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and Cover Letter to: dtaiwo@simba.com.ng using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]