[
  {
    "title": "Store Admin Officer Job at St. Dominic Catholic Hospital",
    "link": "https://www.jobgurus.com.ng/jobs/view/store-admin-officer-job-at-st-dominic-catholic-hospital",
    "pubDate": "Sat, 07 Jun 2025 15:14:15 GMT",
    "source": "JobGurus",
    "keyword": "st. dominic catholic hospital",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "St. Dominic Catholic Hospital is a 64-bed hospital located in Ogungbade off New Ife road in Ibadan. St. Dominic Catholic Hospital is the vision of the Dominican Sisters of St. Catherine of Siena (Italy). We offer various medical services such as: General medicine, internal medicine, O & G, Laboratory, and Radiology, to mention just a few. The hospital is run in collaboration with foreign partners. We are registered and licensed by the Corporate Affairs Commission and the Ministry of Health. Also, we are accredited by the NHIS as both primary and secondary health care providers.\n\nWe are recruiting to fill the position below:\n\nJob Position: Store Admin Officer\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Location: Ibadan, Oyo\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tThe Store Admin Officer is responsible for managing the day-to-day activities of the store, ensuring efficient receipt, storage, and distribution of goods and supplies.\n\n\nKey Responsibilities\nInventory Management:\n\n\n\tReceive, inspect, and store goods and supplies.\n\tMaintain accurate inventory records and ensure stock levels are up-to-date.\n\n\nOrder Management:\n\n\n\tProcess purchase orders and ensure timely delivery of goods.\n\tVerify orders againstinvoices.\n\n\nStock Control:\n\n\n\tMonitor stock levels and report on low stock or overstock situations.\n\tEnsure proper storage and handling of goods.\n\n\nSupply Chain Management:\n\n\n\tCoordinate with procurement team to ensure timely delivery of goods.\n\tDevelop and maintain relationships with suppliers.\n\n\nAdministrative Tasks:\n\n\n\tMaintain accurate records and reports.\n\tPerform data entry and ensure accurate inventory records.\n\n\nHealth and Safety:\n\n\n\tEnsure compliance with health and safety regulations.\n\tReport any safety concerns or incidents.\n\n\nRequirements\n\n\n\tHigh school diploma or equivalent required.\n\t1-5 years of experience in inventory management or logistics.\n\tBasic computer skills and knowledge of inventory management software.\n\tExcellent organizational and communication skills.\n\tAbility to work in a fast-paced environment and prioritize multiple tasks.\n\n\nSalary\nN50,000 - N70,000 / Month.\n\nMethod of Application\nInterested and qualified candidates should send their Application Letters and CV to: adm.sdchib2019@yahoo.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Sales Manager Job at LifeBank",
    "link": "https://www.jobgurus.com.ng/jobs/view/sales-manager-job-at-lifebank",
    "pubDate": "Sat, 07 Jun 2025 15:14:15 GMT",
    "source": "JobGurus",
    "keyword": "lifebank",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "LifeBank is a technology company that powers hospitals and care centers to deliver quality healthcare to patients in emerging markets. The company’s technology, infrastructure, agile production, and distribution networks enable hospitals in emerging markets to catch up with their global peers. The company has distributed 45,000+ medical products to 1000+ healthcare facilities, saving 18,000+ lives across Nigeria, Ethiopia and Kenya. At LifeBank, we are the technology-led healthcare system for the future.\n\nWe are recruiting to fill the position below:\n\nJob Position: Sales Manager\nJob Location: Benin, Edo\nReports To: Director of Customer Health\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Sales Manager will be responsible for driving the growth of LifeBank's products and services by engaging with potential clients in hospitals, healthcare institutions, and relevant sectors.\n\tThe Sales Agent’s primary responsibility is to identify, acquire, and build long-term relationships with customers, while also meeting individual and team sales targets.\n\tThe ideal candidate will be a self-motivated, target-driven individual with a passion for healthcare and a strong ability to communicate LifeBank's services effectively to potential clients.\n\n\nResponsibilities\nCustomer Acquisition & Account Management:\n\n\n\tMeet with potential clients to understand their needs and offer tailored LifeBank solutions that address their specific challenges in blood, oxygen, Equipment and Consumables Supply.\n\tClose sales by negotiating terms and conditions, ensuring mutual agreement on service delivery and pricing.\n\tDevelop and maintain relationships with key decision-makers, ensuring customer satisfaction and retention.\n\n\nSales Targets & Performance Tracking:\n\n\n\tAchieve individual sales targets and contribute to team sales goals by driving revenue growth.\n\tMonitor and report on sales activities, including lead conversion, meetings held, and deals closed, in alignment with sales objectives.\n\tUtilize the CRM system to track prospects, opportunities, and sales pipeline, ensuring accurate reporting and forecasting.\n\n\nCustomer Health Management & Retention:\n\n\n\tEnsure smooth communication between clients and LifeBank’s operations team, addressing any issues or concerns regarding service delivery.\n\tFoster long-term relationships with clients, ensuring they receive continuous support and satisfaction with LifeBank’s services.\n\tCoordinate with the operations team to resolve any client issues, ensuring a high level of customer satisfaction and retention.\n\n\nRequirements\n\n\n\tEducation and Qualification: Bachelor's Degree in Business, Sales, Marketing, Healthcare Management, or a related field.\n\t2 - 3 years of sales experience, preferably in healthcare, pharmaceuticals, or B2B sales (experience in selling services to hospitals or healthcare providers is a plus).\n\tProven track record of achieving sales targets and building customer relationships.\n\n\nSkills and Competence:\n\n\n\tAbility to present and sell LifeBank's products clearly and persuasively to potential clients.\n\tComfortable negotiating terms and closing deals in a competitive market.\n\tStrong focus on meeting customer needs and providing exceptional service.\n\tStrong organizational skills with the ability to prioritize tasks and manage multiple accounts simultaneously.\n\tComfortable using CRM software (e.g., Salesforce, Zoho), Microsoft Office Suite, and other sales tools.\n\tAbility to collaborate effectively with other team members and departments to achieve sales and organizational goals.\n\n\nPersonal Attributes:\n\n\n\tHigh levels of drive and determination, capable of working independently with minimal supervision.\n\tA results-oriented individual who thrives in a performance-based environment.\n\tAbility to adapt to changing sales environments and customer needs.\n\tHonest, transparent, and ethical in dealing with customers and colleagues.\n\tAble to handle rejection and remain motivated to achieve sales goals.\n\n\nSalary\nN250,000 / Month.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: team@lifebank.ng using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Senior Software Engineer (Full-Stack) Job at Reliance Health",
    "link": "https://www.jobgurus.com.ng/jobs/view/senior-software-engineer-full-stack-job-at-reliance-health",
    "pubDate": "Sat, 07 Jun 2025 15:14:15 GMT",
    "source": "JobGurus",
    "keyword": "reliance health",
    "duplicate": false,
    "classifications": [
      "Software Engineering"
    ],
    "content": "Reliance Health uses Technology to Make Healthcare Accessible and Affordable. Through an integrated approach that includes affordable health insurance, telemedicine, and a combination of partner and proprietary healthcare facilities, Reliance Health offers innovative healthcare solutions that meet the needs of emerging markets.\n\nWe are recruiting to fill the position below:\n\nJob Position: Senior Software Engineer (Full-Stack)\nJob Location: Lagos\nEmployment Type: Full-time (Remote)\n\nDescription\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAs a Senior Software Engineer at Reliance Health, you will play a pivotal role in developing, maintaining and optimizing the software used by our customers, our staff and our healthcare partners.\n\tYou will collaborate closely with cross-functional teams, including product managers, engineers, and stakeholders, to identify opportunities for automation and to streamline our user experiences and processes.\n\tThrough your expertise in software engineering, you will contribute to the evolution of the Reliance Health platform, creating delightful and efficient interactions that empower our customers whilst maintaining rigorous standards of quality and security.  \n\n\nResponsibilities\nBackend Development Responsibilities:\n\n\n\tBackend Development: Design, develop, test, and maintain backend services and APIs using one of the following technologies: PHP (Laravel), Node.js, or Java (Spring Boot). Experience in full-stack development is an advantage.  \n\tDatabase Management: Work with various database systems (primarily MySQL and PostgreSQL) to optimize data storage and retrieval.  \n\tAPI Integration: Collaborate with frontend and mobile app developers to ensure seamless integration with frontend systems and third-party APIs with REST.  \n\tPerformance Optimization: Identify and address performance bottlenecks and optimize code for appropriate scalability and efficiency.  \n\tSecurity: Implement security best practices to protect data and systems from potential threats and vulnerabilities.  \n\tCode Quality: Write clean, maintainable, and well-documented code, and participate in code reviews to ensure code quality and adherence to coding standards.  \n\tTesting: Develop and maintain unit tests, integration tests, and automated testing processes to ensure software reliability.  \n\tCollaboration: Collaborate closely with product managers, designers, and other engineers to understand requirements and deliver solutions that align with business goals.  \n\tPair programming is the norm \n\tAgile Development: Contribute to an agile development environment, participate in sprint planning, and help drive the development process.  \n\tLearning and Growth: Stay updated on industry trends and emerging technologies to continuously improve your skills and contribute to the team's technical excellence.  \n\n\nFrontend Development Responsibilities:\n\n\n\tReact Development: Design, develop, and maintain web applications using React.js, ensuring a responsive and intuitive user interface.  \n\tState Management: Implement state management solutions (e.g., Redux, Mobx) to manage complex application states efficiently.  \n\tComponent Development: Create reusable UI components that can be easily integrated into different parts of the application.  \n\tRESTful API Integration: Collaborate with backend developers to consume RESTful APIs and ensure seamless data flow between the frontend and backend systems.  \n\tPerformance Optimization: Identify and address performance bottlenecks and optimize frontend code for speed and efficiency.  \n\tUser Experience (UX): Work closely with product designers to translate design mockups and wireframes into pixel-perfect, user-friendly interfaces.  \n\tCross-Browser Compatibility: Ensure that web applications are compatible with various browsers and devices.  \n\n\nRequirements\nBackend Heavy:\n\n\n\t6+ years of experience in Software Engineering working with either PHP (Laravel), Node.js, or Java (Spring Boot).  \n\tStrong understanding of software engineering principles and design patterns.  \n\tExperience with database systems, API development, and cloud services (e.g., AWS, Azure, GCP).  \n\tProficiency in version control systems (e.g., Git) and collaborative development tools.  \n\tExcellent problem-solving and debugging skills.  \n\tStrong communication and teamwork abilities.  \n\tAgile development experience is a plus.  \n\n\nFrontend Heavy:\n\n\n\t7+ years of experience in frontend development with a strong focus on React.  \n\tKnowledge of and experience in the creation of WordPress themes. \n\tProficiency in JavaScript (ES6+), HTML5, and CSS3.  \n\tExperience with state management libraries such as Redux or Mobx.  \n\tFamiliarity with RESTful APIs and asynchronous programming.  \n\tStrong understanding of responsive web design and cross-browser compatibility.  \n\tProficiency in version control systems (e.g., Git) and collaborative development tools.  \n\tExcellent problem-solving and debugging skills.  \n\tStrong communication and teamwork abilities.  \n\tAgile development experience is a plus. \n\n\nBenefits\nAt Reliance Health, we prioritize our people and their well-being. Our benefits package is designed to support your success, growth, and happiness. Here’s what you’ll enjoy:\n\n\n\t Remote-First Environment\n\t\n\t\tWork from anywhere while staying connected to a vibrant, collaborative team.\n\t\n\t\n\t Competitive Salary and Benefits\n\t\n\t\tWe offer a salary that’s benchmarked against the best in the industry, ensuring your expertise and impact are fully rewarded.\n\t\n\t\n\t Premium Health Insurance\n\t\n\t\tComprehensive health coverage for you and your family, because your well-being comes first.\n\t\n\t\n\t Unlimited Leave\n\t\n\t\tTake the time you need when you need it—no limits, no questions.\n\t\n\t\n\t Meaningful Impact\n\t\n\t\tPlay a key role in transforming customer experiences and shaping healthcare innovation.\n\t\n\t\n\t Collaborative Work Culture\n\t\n\t\tJoin a supportive, inclusive, and team-focused environment that celebrates diversity.\n\t\n\t\n\t Growth Opportunities\n\t\n\t\tAccess tools, mentorship, and resources to elevate your skills and career.\n\t\n\t\n\t Learning & Development Allowance\n\t\n\t\tWe provide an allowance to support your ongoing professional growth and skill enhancement. \n\t\n\t\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Executive Assistant Job at Unified Payment Services Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/executive-assistant-job-at-unified-payment-services-limited-1",
    "pubDate": "Sat, 07 Jun 2025 15:14:15 GMT",
    "source": "JobGurus",
    "keyword": "unified payment services limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Unified Payment Services Limited is Nigeria’s premier Payments & Financial Technology company that operates as a shared infrastructure for the banking community in Nigeria and Payments Service Provider within and outside Nigeria, with a vision to be the most preferred e-payment service provider in Africa.\n\nWe are recruiting to fill the position below:\n\nJob Position: Executive Assistant\nJob Location: Victoria Island, Lagos\nEmployment Type: Contract\n\nJob objective(s)\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tTo provide administrative and executive assistance/support to the office of the Director Corporate Services.\n\n\nDuties & Responsibilities\n\n\n\tTo provide comprehensive secretarial support and assistance to the Director Corporate Services in the discharge of her duties\n\tSchedules appointments on behalf of the Director Corporate Services and ensuring that her meetings are held and records kept accordingly and agreed decisions circulated\n\tReceives and responds to correspondences\n\tManages the calendar of the Director Corporate Services\n\tPrepare memos, letters, and miscellaneous correspondence on behalf of the Director Corporate Services.\n\tLogs and distributes incoming messages to the Director Corporate Services promptly\n\tMaintains and updates files, takes down minutes of meetings when necessary.\n\tCo-ordinates conference and travel arrangements, prepares itineraries and expense reports.\n\n\nJob Requirements\nEducation:\n\n\n\tHND / Bachelor's Degree in Social Science or any other related field.\n\n\nExperience:\n\n\n\t3 years of experience in similar job role.\n\n\nKnowledge:\n\n\n\tGood knowledge of the payment industry.\n\tBusiness Management.\n\tMicrosoft Office Suite.\n\n\nSkill / Competencies:\n\n\n\tExcellent Communication and Interpersonal Skills.\n\tGood Computer Skills and Tech Savvy.\n\tHigh drive, Initiative and Motivation.\n\tAnalytical Reasoning Abilities.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: recruitment@up-ng.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]