[
  {
    "title": "Social Media Manager / Content Creator Job at Vantegral Consulting",
    "link": "https://www.jobgurus.com.ng/jobs/view/social-media-manager-content-creator-job-at-vantegral-consulting",
    "pubDate": "Wed, 04 Jun 2025 10:44:48 GMT",
    "source": "JobGurus",
    "keyword": "vantegral consulting",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Vantegral Consulting - We are a dynamic recruitment and consulting firm committed to connecting top talent with the right opportunities. Our mission is to help businesses streamline their hiring processes while supporting job seekers in achieving their career goals. \n\nWe are recruiting to fill the position below:\n\nJob Position: Social Media Manager / Content Creator\n\nJob Location: Lekki Phase 1, Lagos\nEmployment Type: Full-time (Hybrid)\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are currently seeking a creative and strategic Social Media Manager with strong content creation skills to join our team.\n\tThe ideal candidate will help enhance our digital presence, engage our audience, and position our brand as a leading voice in the HR and recruitment industry.\n\n\nKey Responsibilities\n\n\n\tDevelop and execute a comprehensive social media strategy aligned with business objectives.\n\tManage and grow the company’s presence across platforms, including LinkedIn, Instagram, Twitter (X), Facebook, and TikTok.\n\tCreate, curate, and schedule high-quality, engaging content (text, images, videos, reels, infographics) tailored to each platform.\n\tUse analytics tools to track and report performance, adjusting strategies for optimal results.\n\tManage paid social advertising campaigns on platforms such as LinkedIn, Facebook, and Instagram.\n\tMonitor social and industry trends; implement innovative campaigns to increase brand awareness, engagement, and lead generation.\n\tCollaborate with the recruitment team to promote job openings, employer branding content, and career development tips.\n\tEngage actively with followers, respond to comments and inquiries, and build a strong online community.\n\tStay updated on platform algorithm changes, digital trends, and best practices to maintain a competitive edge.\n\n\nKey Requirements\n\n\n\tBachelor’s Degree in Marketing, Communications, Business, or a related field.\n\t2 – 3 years of proven experience as a Social Media Manager or in a similar role, preferably in recruitment, HR, or consulting.\n\tStrong content creation skills including experience with graphic design, short-form video editing, and storytelling.\n\tProficiency in tools such as Canva, Adobe Creative Suite, or similar content creation platforms.\n\tSolid understanding of SEO, paid social advertising, and analytics (e.g., Google Analytics, Meta Business Suite, LinkedIn Analytics).\n\tExcellent copywriting and verbal communication skills.\n\tStrong attention to detail, creativity, and ability to manage multiple projects in a fast-paced environment.\n\n\nWhy Join Us?\n\n\n\tSalary: N150,000 - N200,000 Monthly (Other benefits excluded)\n\tWork in a fast-growing recruitment and consulting firm with strong industry impact.\n\tShape the digital voice and employer brand of a reputable HR consultancy.\n\tCollaborative team environment with room for growth and learning.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Executive Assistant to the MD / CEO Job at Private Sector Health Alliance of Nigeria",
    "link": "https://www.jobgurus.com.ng/jobs/view/executive-assistant-to-the-md-ceo-job-at-private-sector-health-alliance-of-nigeria",
    "pubDate": "Wed, 04 Jun 2025 10:44:48 GMT",
    "source": "JobGurus",
    "keyword": "private sector health alliance of nigeria",
    "duplicate": false,
    "classifications": [],
    "content": "At Private Sector Health Alliance of Nigeria (PSHAN), we create a compelling opportunity to pool private sector capabilities to improve Healthcare systems in Nigeria.\n\nWe are recruiting to fill the position below:\n\nJob Position: Executive Assistant to the MD / CEO\nJob Location: Victoria Island, Lagos\nEmployment Type: Full-time\n\nAbout the Role\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a highly organized and proactive Executive Assistant (EA) to support our MD/CEO in the NGO sector.\n\tAs a crucial member of the team, you will play an essential role in ensuring the seamless functioning of the executive office while contributing to organizational success.\n\n\nResponsibilities\n\n\n\tManage the executive’s calendar, scheduling meetings, appointments, and travel arrangements.\n\tAnticipate and prioritize the needs of the MD/CEO, acting as a proactive and trusted assistant.\n\tPrepare, collate and manage reports, minutes of meetings, etc\n\tHandle email and phone inquiries, efficiently screening calls and messages.\n\tOrganize and maintain both physical and digital executive filing systems.\n\tCoordinate logistics for meetings, conferences, and events.\n\tPerform other ad-hoc tasks as assigned.\n\n\nQualifications\n\n\n\tMinimum of 3 years of experience in an Executive Assistant or similar administrative role.\n\tStrong organisational skills, with the ability to prioritize and manage multiple tasks effectively.\n\tHigh degree of discretion, professionalism, and integrity.\n\tAbility to work independently, take initiative, and maintain confidentiality.\n\tExcellent communication and interpersonal skills, with the ability to liaise with executives and staff at all levels.\n\tProficiency in Microsoft Office Suite (Word, Excel, PowerPoint, Outlook) and other relevant tools.\n\tKeen attention to detail and a commitment to accuracy.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hrsupport@pshan.org using \"Executive Assistant\" as the subject of the mail.\n\nNote: Only Lagos state-based candidates will be contacted.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Procurement Officer Job at JIJEDAPT Human Resources Consult Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/procurement-officer-job-at-jijedapt-human-resources-consult-limited",
    "pubDate": "Wed, 04 Jun 2025 10:44:48 GMT",
    "source": "JobGurus",
    "keyword": "jijedapt human resources consult limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "JIJEDAPT Human Resources Consult Limited is involved in the Consultancy Of Human Resources Management And Services, Project Management, Training And Certifications, Business Plans, Business Optimization, Expatriate Management, Information Management Sysyem and GeneralAdvisory Services.\n\nWe are recruiting to fill the position below:\n\nJob Position: Procurement Officer\n\nJob Location: Agadagba-Obon, Ese-Odo LGA, Ondo \nEmployment Type: Full-time\nReports to: Procurement Manager/General Manager\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking an experienced Procurement Officer to source, negotiate, and purchase goods and services that meet our organization's needs.\n\tThe successful candidate will be responsible for developing procurement strategies, managing supplier relationships, and ensuring compliance with company policies and regulatory requirements.\n\n\nKey Responsibilities\nSourcing and Procurement:\n\n\n\tIdentify reliable suppliers and negotiate pricing, terms, and contracts\n\tConduct market research to identify potential suppliers and analyze their capabilities\n\tEvaluate and approve purchase requests, ensuring adherence to company policies and budgetary constraints.\n\n\nSupplier Relationship Management:\n\n\n\tBuild and maintain strong relationships with suppliers\n\tNegotiate contracts and ensure compliance with contractual terms\n\tMonitor supplier performance and resolve any issues or disputes.\n\n\nInventory and Stock Management:\n\n\n\tManage inventory levels and ensure timely delivery of goods and services\n\tMonitor and track purchase orders to ensure accuracy and completeness.\n\n\nCompliance and Documentation:\n\n\n\tEnsure procurement activities adhere to company policies and regulatory requirements\n\tMaintain accurate records of purchases, contracts, and supplier evaluations\n\tConduct audits to ensure transparency and compliance.\n\n\nRequirements and Qualifications\nEducation:\n\n\n\tBachelor's Degree in Procurement, Supply Chain Management, Business Administration, or a related field.\n\n\nExperience:\n\n\n\t2-5 years of experience in procurement or a related field.\n\n\nSkills:\n\n\n\tExcellent negotiation, communication, and analytical skills\n\tProficiency in procurement software and tools\n\tStrong attention to detail and ability to multitask\n\tAbility to work effectively with suppliers, stakeholders, and team members.\n\n\nCertifications:\n\n\n\tProfessional certifications like CIPS or CPSM are an added advantage.\n\n\nWhat We Offer\n\n\n\tSalary: N150,000 - N250,000 / month. \n\tCompetitive salary and benefits package\n\tOpportunity to work with a dynamic and growing organization\n\tCollaborative and supportive work environment.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: jijedapthrconsulting@gmail.com using \"Procurement Officer\" as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Openings at Lisse Africa",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-lisse-africa",
    "pubDate": "Wed, 04 Jun 2025 10:44:48 GMT",
    "source": "JobGurus",
    "keyword": "lisse africa",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Lisse Africa is a dynamic human resource consulting firm with key interest in recruitment with the aim of providing employees that are professional, verified and with a good cultural fit. At Lisse Africa, our aim is to build the world's most valued Recruitment Solution Company to Clients, Candidates, Colleagues and the communities where we work and live with regards to staff recruitment, background verification and other HR solutions.\n\nWe solely focus on the enhancement of client organizations by providing quality services on various aspects of their human resources and by letting the organization focus on its core issues.\n\nWe are recruiting to fill the following positions below:\n\n1.) Content Creator\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Location: Osapa, Lekki - Lagos\nEmployment Type: Full-time\nWork Mode: Hybrid ( 3 days in the office and 2 days work from home)\n\nRole Description\n\n\n\tThe Content Creator will be responsible for generating engaging and relevant content for the brand, including product descriptions, blog posts, social media posts, and marketing materials.\n\n\nQualifications\n\n\n\tCandidates should possess a Bachelor's Degree in Marketing, Communications, Journalism, or related field with at least 2 years of work experience.\n\tContent Creation, Copywriting, and Blogging skills\n\tSocial Media Management and Marketing skills\n\tKnowledge of SEO and digital marketing strategies\n\tExcellent communication and storytelling abilities\n\tExperience with eCommerce platforms is a plus.\n\n\nSalary\nN100,000 monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: tegarecruits@gmail.com using \"Content Creator\"as the subject of the mail .\n\n \n\n2.) Male Housekeeper\n\nJob Location: Lekki, Lagos\nEmployment Type: Full-time\nAccommodation: Yes\n\nJob Summary\n\n\n\tWe are seeking a dedicated cleaner/housekeeper to maintain cleanliness and organisation in a residential setting.\n\tResponsibilities include performing routine cleaning tasks, such as dusting, vacuuming, mopping floors, and sanitising bathrooms and kitchen areas.\n\tThe ideal candidate should demonstrate attention to detail, reliability, and the ability to work independently.\n\tPrevious experience in cleaning or housekeeping roles is preferred.\n\tThis position offers an opportunity to contribute to creating a comfortable and hygienic environment for residents.\n\n\nRequirements\n\n\n\tCandidates should possess an SSCE qualification\n\tMinimum of 2 years of professional housekeeping experience.\n\tPhysical ability to stand for extended periods, bend, lift, push, and move objects.\n\n\nSalary\nN80,000 - N100,000 / Month.\n\nMethod of Application\nInterested and qualified candidates should send their CV and Cover Letter to: tegarecruits@gmail.com using \"Male House Keeper\" as the subject of the mail.\n\n \n\n3.) Cleaner\n\nJob Location: Lekki, Lagos\nEmployment Type: Part-time\nWork Mode: 3 times a week\n\nKey Responsibilities\n\n\n\tClean and maintain rooms, floors, and surfaces.\n\tEmpty trash and recyclables.\n\tRestock supplies and materials.\n\tPerform other cleaning tasks as needed.\n\n\nRequirements\n\n\n\tCandidates should possess SSCE with 1 - 3 years of experience.\n\tAbility to lift and move heavy objects.\n\tAttention to detail and ability to follow instructions.\n\tReliable and punctual.\n\tAvailability to attend work 2 times per week.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: tegarecruits@gmail.com using \"Cleaner\" as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Warehouse Supervisor Job at GUO Transport Company",
    "link": "https://www.jobgurus.com.ng/jobs/view/warehouse-supervisor-job-at-guo-transport-company",
    "pubDate": "Wed, 04 Jun 2025 10:44:48 GMT",
    "source": "JobGurus",
    "keyword": "guo transport company",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "GUO Transport Company is a division of G. U. Okeke & Sons Limited, a household name in the transportation industry and one of the largest providers of intercity and interstate transportation, serving more than 200 destinations across Nigeria and West Africa with a modern and environmentally friendly fleet.\n\nWe are recruiting to fill the position below:\n\nJob Position: Warehouse Supervisor\nJob Location: Orile Coker, Lagos\nEmployment Type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tSupervise warehouse staff and manage day-to-day warehouse operations.\n\tEnsure accurate inventory control and timely stock reconciliation.\n\tOptimize warehouse layout and workflow for efficiency\n\tMonitor the receipt, storage, and dispatch of goods.\n\tImplement and maintain safety and dispatch of goods.\n\tGenerate regular inventory and activity reports for management.\n\tEnsure compliance with company policies and regulatory requirements.\n\n\nTechnical & Professional Requirements\n\n\n\tBachelor’s degree or HND in logistics, supply chain management, business administration, or a related field.\n\tMinimum of 3 years of experience in warehouse operations or a similar supervisory role.\n\tStrong leadership, organizational, and communication skills.\n\tProficiency in inventory management systems and Microsoft Excel.\n\tAbility to work under pressure and meet deadlines.\n\tKnowledge of safety and regulatory standards related to warehousing.\n\n\nPerks & Benefits\n\n\n\tSalary: N150,000 - N250,000 Monthly. \n\tStaff Bus to commute to work daily\n\tFree Travel ticket across Nigeria and West Africa\n\tHMO\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]