[
  {
    "title": "Head of Operations Job at Glovo Nigeria",
    "link": "https://www.jobgurus.com.ng/jobs/view/head-of-operations-job-at-glovo-nigeria-3",
    "pubDate": "Tue, 17 Jun 2025 14:16:08 GMT",
    "source": "JobGurus",
    "keyword": "glovo nigeria",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Glovo - We’re a Barcelona-based startup and the fastest-growing delivery player in Europe, Hispanic America and Africa. With food at the core of the business, Glovo delivers any product within your city at any time of day. Our vision and ambition are not only to make everything immediately available in your city but it is also to offer our employees the job of their lives. A job where you'll be challenged and have the most fun working in through tech-enabled experiences.\n\nWe are recruiting to fill the position below:\n\nJob Position: Head of Operations\n\nJob Location: Lagos\nDepartment: Operations\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThis role is for a senior leader (Head of Operations) of Glovo’s operations team, which focuses on working with the Glovo team to support our couriers and partners to improve their operations and user experience around delivery. \n\tAs a Head of Operations in Nigeria, you will have the unique opportunity to help us:\n\t\n\t\tCouriers (Supply Ops): Improve delivery times, quality of service and overall satisfaction of couriers\n\t\tPartners (Partner Ops): Improve on key metrics such as preparation time, waiting time, and menu quality.\n\t\n\t\n\t\n\tWe're looking for someone who has a mix of the:\n\n\t\n\t\tOperational excellence to get great work done\n\t\tNegotiation and collaboration skills are needed to bring out the best from our partners (Couriers or Retailers)\n\t\tStrategic, innovative and creative thinking is required to develop outside the box solutions\n\t\tManagement skills and emotional intelligence are required to lead and inspire a team.\n\t\n\t\n\n\nThe Journey\n\n\n\tLead a team of Ops Specialists, guiding them and helping them both to achieve their goals and to develop their skills\n\tLead by example by being incredibly truth-seeking, making data-driven decisions, and setting high standards for the team\n\tEstablish the monthly/quarterly goals of your cities and be responsible for their operational metrics, continuously monitoring their achievement\n\tBe able to perform any required analysis and provide actionable ideas to improve indicators and solve any possible problems in the cities of your region\n\tSupport the Commercial team on operational issues, identifying areas for improvement and possible actions, always with a didactic and positive attitude\n\tPut yourself in the Glover’s shoes - understand who they are in order to execute the best possible outcome and choose properly the solution we are launching or testing\n\tUnderstand, deep-dive, and have a complete understanding of the local supply situation at all times\n\tIdentify channels to source new leads and potential Glovers through both online and offline media\n\tAnalyze daily, weekly, and monthly operation metrics with a macro view of the long-term success of the city/region\n\tReassure that we provide the best-class experience for our couriers, fleet partners, and we are the platform number #1 of their choice\n\tHave a blank page for you to create! We don’t stick to a single playbook, and we expect you to build your own as the business and market evolve.\n\n\nWhat You Will Bring To The Ride\n\n\n\tAt least 7 years of experience \n\tMinimum 3 years of management experience in a fast-paced, demanding role (big tech, investment banking, private equity or consulting)\n\tSQL proficiency is preferred\n\tSTEM degree is preferred\n\tCombine day-to-day and tactical management with a strategic and long-term view\n\tYou should be able to motivate and develop teams\n\tYou should be able to get your hands dirty, be on the frontlines, rather than delegate tasks routinely\n\tResults-oriented, autonomous and efficient. Decisions taken should be driven by available data\n\tStrong analytical and problem-solving skills are required\n\tStrong project management skills are a must\n\tStrong organisational skills and delegation, ability to prioritize and multitask, work well under pressure, handle multiple issues simultaneously in a dynamic environment\n\tDemonstrate sound written and verbal communication skills.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Procurement Sourcing Specialist Job at Mikano International",
    "link": "https://www.jobgurus.com.ng/jobs/view/procurement-sourcing-specialist-job-at-mikano-international",
    "pubDate": "Tue, 17 Jun 2025 14:16:08 GMT",
    "source": "JobGurus",
    "keyword": "mikano international",
    "duplicate": false,
    "classifications": [],
    "content": "Mikano International is Nigerian company in the power generation, automobile, steel fabrication sectors. This company offers sales, maintenance, assembly and distribution of power generation products.\n\nWe are recruiting to fill the position below:\n\nJob Position: Procurement Sourcing Specialist\n\nJob Location: Ogba, Ikeja, Lagos \nEmployment Type: Full-time\n\nResponsisbilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tContribute to the establishment of the Bidders List in accordance with the Approved Vendors Lists.\n\tContribute to the selection, management and performance monitoring of Vendors.\n\tPrepare request for quotations/invitation to tenders for goods and services in line with, allocating budgets, quality and delivery targets.\n\tDevelop and implementing strategies for procuring goods and services for the oil and gas industry.\n\tPrepare proposals, request quotes and negotiating purchase terms and conditions.\n\tPrepare and issue purchase orders and agreements.\n\tInspect and evaluate the quality of purchased items and resolving shortcomings.\n\tMonitor industry trends to ensure cost-effective sourcing and procurement.\n\tNegotiate contracts with suppliers to ensure the best value for the organization.\n\tMonitor supplier performance to evaluate satisfaction and quality of services.\n\tTake responsibility for purchases in support of customer-related business processes or for internal use.\n\tDiscuss defects and delivery problems with suppliers and negotiating refunds.\n\tCoordinating with operations, maintenance, warehouse and engineering to ensure proper scheduling and movement of goods and supplies.\n\tAnalyze costs, negotiating contract details, and offering strategies and solutions to help manage costs on supplies and vendor services.\n\tManage, direct, negotiate, and award complex high-value and unique acquisitions for goods and services.\n\n\nQualifications\n\n\n\tB.Sc in Supply Chain Management or Logistics\n\tMinimum of 5 years of experience in the same or similar role\n\tWe experienced in procurement strategic sourcing\n\n\nMethod of Application\nInterested and qualified candidates should send their CV  to: careers@mikano-intl.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Business Development Executive Job at VURIN Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/business-development-executive-job-at-vurin-group",
    "pubDate": "Tue, 17 Jun 2025 14:16:08 GMT",
    "source": "JobGurus",
    "keyword": "vurin group",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "The VURIN Group is a diversified portfolio of businesses across various sectors of the oil and gas and infrastructure industries, in Nigeria and beyond, with the primary mission to establish, grow, and manage the most successful group of energy operations and support businesses, in terms of superior shareholder returns, business leadership, and contribution to society.\n\nWe are recruiting to fill the position below:\n\nJob Position: Business Development Executive\n\nJob Location: Lagos\nJob type: Full-Time\nIndustry: Oil & Gas\n\nThe Role\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a dynamic Business Development Executive to drive growth in the upstream and midstream oil and gas sectors.\n\tIn this role, you’ll identify new business opportunities, compile bids, gather project data, and leverage your understanding of regulations and client operations to capitalize on early-stage opportunities.\n\tIf you’re a strategic leader passionate about driving growth and building strong industry connections, join us!\n\n\nWhat you’ll do\n\n\n\tIdentify, qualify, and secure business opportunities, coordinating business generation activities.\n\tAssist in the development and implementation of Business Development and sales strategies.\n\tAssist in the development of budgets and sales plans.\n\tUnderstand clients’ needs and offer solutions and support, responding to clients (existing and prospective) enquiries and requests for proposals (RFPs. RFQs, etc.).\n\tCollaborate with sales and leadership to secure, retain, and grow key high graded accounts.\n\tCreate informative presentations, presenting and delivering information to potential clients at client meetings, industry exhibitions, trade shows, and conferences.\n\tManage external relations and correspondences with industry stakeholders (governmental & non-governmental) such as NAPIMS, NIPEX, DPR, NCDMB, PETAN etc. \n\tTranslate innovative client insights into value-creating business plans. \n\tPrepare high-impact presentations and proposals to clients promoting companies’ brand and protecting position. \n\tMonitor the status of live contracts and purchase orders to advise clients correctly when required. \n\n\nWhat we are looking for\nEducation:\n\n\n\tBachelor’s degree in business administration, marketing, or any related discipline.\n\n\nExperience:\n\n\n\tAt least five (5) years of experience in similar role, with a strong network within the industry.\n\tKnowledge and Proficiency in:\n\tOil & Gas Industry, Standards, Projects, and Regulations\n\tIndustry services marketing\n\tLead generation and prospect management\n\tIndustry local content regulations\n\tBids and Tender preparations\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]