[
  {
    "title": "Backend Engineer (Python) Job at Afripoint Group Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/backend-engineer-python-job-at-afripoint-group-limited",
    "pubDate": "Fri, 13 Jun 2025 14:15:33 GMT",
    "source": "JobGurus",
    "keyword": "afripoint group limited",
    "duplicate": false,
    "classifications": [
      "Software Engineering"
    ],
    "content": "Afripoint Group Limited is a dynamic and innovation-driven organization delivering cutting-edge technology and enterprise solutions across industries. We're on a mission to redefine systems and experiences, and we’re looking for exceptional talent to grow with us.\n\nWe are recruiting to fill the position below:\n\nJob Position: Backend Engineer (Python)\n\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time (Onsite)\nCompany: Afripoint Group Limited\n\nRole Overview\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe’re looking for a skilled Backend Engineer (Python) to join our engineering team onsite.\n\tYou will be responsible for developing, testing, and maintaining high-quality backend systems and APIs that power our products.\n\tThis role is ideal for someone who is passionate about backend architecture, clean code, and building reliable, scalable systems in Python.\n\n\nWhat You’ll Do\n\n\n\tBuild and maintain robust RESTful APIs and backend services in Python.\n\tArchitect and optimize scalable server-side applications.\n\tCollaborate with cross-functional teams including frontend engineers and product managers.\n\tWork closely with DevOps for deployment, monitoring, and automation tasks.\n\tManage databases and ensure data integrity, performance, and security.\n\tDebug, test, and troubleshoot software and server infrastructure.\n\tParticipate in code reviews and contribute to best practices.\n\tStay updated with new backend trends and bring fresh ideas to the table.\n\n\nWhat We’re Looking For\n\n\n\tInterested candidates should possess a Bachelor's Degree\n\t3+ years of backend development experience\n\tStrong Python skills (Django, Flask, or FastAPI)\n\tProficient in working with PostgreSQL, MySQL, or other relational databases\n\tExperience with Docker, Git, Redis, Celery\n\tFamiliarity with backend security practices\n\tExcellent debugging and testing skills\n\tStrong communication and problem-solving skills\n\tWillingness and availability to work onsite.\n\n\nNice to Have:\n\n\n\tExperience with cloud platforms like AWS or Azure\n\tFamiliarity with microservices architecture\n\tKnowledge of GraphQL or WebSockets\n\tCI/CD and DevOps experience.\n\n\nWhy Join Afripoint Group?\n\n\n\tOpportunity to work on innovative projects\n\tA collaborative and fast-paced environment\n\tProfessional growth and mentorship\n\tCompetitive salary and benefits\n\tBe part of something impactful!\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and Cover Letter to: hr@afripointgroup.com using \"Backend Engineer (Python) - Onsite\" as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Digital Marketer Job at the Plug Entertainment Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/digital-marketer-job-at-the-plug-entertainment-limited",
    "pubDate": "Fri, 13 Jun 2025 14:15:33 GMT",
    "source": "JobGurus",
    "keyword": "the plug entertainment limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "The Plug Entertainment Limited - We are a success-drawn talent management company. With great stories and accomplishments across multiple sectors.\n\nWe are recruiting to fill the position below:\n\nJob Position: Digital Marketer\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tProficient in social media management\n\tGood knowledge of paid Ad Campaigns (IG, Snap, X/Twitter and Fb)\n\tEmail marketing strategy and Automation\n\tContent Creation and Scheduling\n\tAnalytics & Performance Reports\n\tBrand Positioning and Digital Strategy.\n\n\nRequirements\n\n\n\tProven experience in digital marketing (portfolio required)\n\tStrong understanding of Meta Ads Manager, Snap Ads, Twitter Ads\n\tProficiency in email marketing tools.\n\tBasic graphic design skills\n\tExcellent communication and time management skills.\n\n\nMethod of Application\nInterested and qualified candidates should send their Applications to: hr@plugng.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Social Media Manager Job at Wahala No Dey Finish",
    "link": "https://www.jobgurus.com.ng/jobs/view/social-media-manager-job-at-wahala-no-dey-finish",
    "pubDate": "Fri, 13 Jun 2025 14:15:33 GMT",
    "source": "JobGurus",
    "keyword": "wahala no dey finish",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Wahala No Dey Finish - Come Chop is a food content brand that focuses on creating engaging video content and high-quality visuals. They are active on platforms like YouTube and Facebook, showcasing food-related challenges and culinary showdowns, aiming to build an active and positive online community around their unique brand identity in the food content industry.\n\nWe are recruiting to fill the position below:\n\nJob Position: Social Media Manager\nJob Location: Lagos\n\nKey Responsibilities\nPlatform Management and Community Engagement:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDevelop, implement, and manage our social media strategy across key platforms, including Instagram, Facebook, and YouTube, ensuring brand consistency and optimal performance.\n\tOversee and manage all community interactions, responding promptly and professionally to comments, messages, and inquiries.\n\tActively foster an engaged and positive online community, encouraging discussions and user-generated content.\n\tMonitor social media channels for trends, feedback, and opportunities for engagement.\n\n\nContent Strategy and Calendar Planning:\n\n\n\tCollaborate with the Content Creator to develop a comprehensive content plan and calendar that aligns with our brand’s tone, values, and overall marketing objectives.\n\tSchedule and publish content across all social media platforms, ensuring timely and consistent posting.\n\tIdentify and leverage trending topics and relevant conversations to increase brand visibility and engagement.\n\n\nPerformance Analysis and Reporting:\n\n\n\tTrack, analyze, and report on key social media metrics, including engagement rates, follower growth, reach, and content performance.\n\tProvide monthly analytics reports with actionable insights and recommendations for optimizing social media performance.\n\tUtilize social media analytics tools to monitor campaign effectiveness and identify areas for improvement.\n\n\nStrategic Input and Collaboration:\n\n\n\tWork closely with the Content Creator and other team members to align social media efforts with broader marketing and business goals.\n\tParticipate actively in content brainstorming sessions, contributing creative ideas for social media campaigns and initiatives.\n\tStay up-to-date with the latest social media trends, platform updates, and best practices to ensure our strategy remains cutting-edge.\n\tIdentify and engage with relevant influencers and partners to expand our online reach.\n\n\nQualifications and Skills\n\n\n\tCandidates should possess relevant qualifications.\n\tProven experience as a Social Media Manager or similar role, with a strong track record of managing and growing social media platforms.\n\tDemonstrable expertise in social media management tools and analytics platforms.\n\tAbility to analyze data and translate insights into actionable strategies.\n\tExceptional written and verbal communication skills.\n\tExcellent community management skills, with a proven ability to foster engagement and build online communities.\n\tStrong understanding of social media algorithms, trends, and best practices across various platforms (Instagram, Facebook, etc).\n\tAbility to work independently and collaboratively in a fast-paced, dynamic environment.\n\tPassion for food content and a desire to contribute to a growing brand.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and Portfolio to: contactwahalanodeyfinish@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Social Media Manager Job at T.O.N Corporate Services",
    "link": "https://www.jobgurus.com.ng/jobs/view/social-media-manager-job-at-ton-corporate-services",
    "pubDate": "Fri, 13 Jun 2025 14:15:33 GMT",
    "source": "JobGurus",
    "keyword": "t.o.n corporate services",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "T.O.N Corporate Services  - Our client provides businesses with a professional phone system that enables teams to manage customer calls efficiently. Their goal is to help businesses improve the quality of their customer interactions while enhancing operational efficiency.\n\nWe are recruiting to fill the position below:\n\nJob Position: Social Media Manager\n\nJob Location: Lagos, Nigeria\nEmployment Type: Full-time\n\nRole Overview\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe’re looking for a Social Media Manager with strong creative instincts, a strategic mindset, and a deep understanding of internet culture.\n\tThis person will lead our client’s social media efforts, from curating content to managing campaigns, while making sure everything aligns with the brand.\n\tIf you’re someone who loves jumping on trends, turning insights into strategy, and using content to drive real business growth, this role is for you.\n\n\nKey Responsibilities\n\n\n\tOwn and manage all social media platforms (Instagram, Twitter/X, LinkedIn, TikTok)\n\tMonitor trends, viral content, conversations and tie them back to our client’s mission in a meaningful and timely way\n\tPlan, curate, and publish creative content across all platforms to increase engagement and visibility\n\tTrack performance metrics and optimise based on data and user insights\n\tCollaborate cross-functionally with Product, Design, Growth, and Customer Success teams to support marketing campaigns\n\tStrategically manage organic and paid social campaigns from start to finish\n\tUse tools like Hootsuite to schedule, monitor, and analyse content performance\n\tDevelop a consistent tone of voice that builds brand recognition and strengthens community trust\n\n\nKey Success Metrics\n\n\n\tGrowth in engagement rate and follower count across platforms\n\tIncrease in link clicks and social-driven web traffic\n\tImproved brand visibility and consistency online\n\tCampaign success rates based on defined objectives (reach, engagement, conversions)\n\tTimely and relevant engagement with social trends\n\tQuality of content and alignment with brand essence\n\n\nRequirements\n\n\n\t3+ years of experience managing social media for a brand, preferably in a fast-paced environment\n\tStrong understanding of social media algorithms, culture, and real-time marketing\n\tA creative thinker with the ability to execute ideas fast\n\tProficiency in social media scheduling and analytics tools (e.g. Hootsuite, Buffer, Later, etc.)\n\tExcellent written communication skills and an eye for compelling visuals\n\tFamiliarity with tools like Canva, CapCut, or Adobe Suite is a plus\n\tAnalytical and data-driven, comfortable using insights to guide strategy\n\n\nBenefits\n\n\n\tBe part of a company solving a deep and urgent problem for African businesses\n\tCollaborate with a smart, driven, and kind team\n\tFreedom to take ownership and innovate\n\tOpportunity to shape the voice of one of Africa’s most promising startups\n\tWork remotely with flexible hours\n\tCompetitive salary and performance-based growth opportunities\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Recruitment Officer Job at Eko Maintenance Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/recruitment-officer-job-at-eko-maintenance-limited-8",
    "pubDate": "Fri, 13 Jun 2025 14:15:33 GMT",
    "source": "JobGurus",
    "keyword": "eko maintenance limited",
    "duplicate": false,
    "classifications": [],
    "content": "Eko Maintenance Limited is a Facilty Maintenance company thet deal in highrise buildings and consruction.\n\nWe are recruiting to fill the position below:\n\nJob Position: Recruitment Officer\nJob Location: Victoria Island, Lagos\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tIn-charge of drafting all recruitment plans for the company both Local & Expatriates\n\tLaise with site managers/supervisors to determine staffing requirements\n\tIn-charge of filling all current and future vacancies within the company\n\tHandles the on-boarding process, induction and orientation for new employees\n\tHandles all job postings and sourcing of resumes for interviews\n\tConducts interviews alongside all line managers\n\tContacts all successful candidates for employment\n\tIn-charge of providing all new employees with all items they require to perform their duties\n\tAny other related job.\n\n\nRequirements\n\n\n\tCandidates should possess a Bachelor’s Degree in Human Resource Management, Business Administration or related discipline.\n\t2 – 3 years of experience in Recruitment (Technical) or Talent Acquisition\n\tAbility to make informed decisions about candidates’ suitability and hiring recommendation.\n\tProficient with the use of Recruitment tools.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: recruitment@ekomaintenance.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]