[
  {
    "title": "Secretary Job at C&I Leasing Group of Companies",
    "link": "https://www.jobgurus.com.ng/jobs/view/secretary-job-at-ci-leasing-group-of-companies",
    "pubDate": "Thu, 03 Jul 2025 14:16:13 GMT",
    "source": "JobGurus",
    "keyword": "c&i leasing group of companies",
    "duplicate": false,
    "classifications": [],
    "content": "The C&I Leasing Group of Companies serves its clients through four business lines; Fleet Management, Outsourcing,Telematics (Citracks)and Marine Services with two subsidiaries in Ghana (Leasafric) and the United Arab Emirates (EPIC International FZE).\n\nWe are recruiting to fill the position below:\n\nJob Position: Secretary\n\nJob Location: Lekki, Lagos\nEmployment Type: Full-time\nGender: Female\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tGreet clients as they enter the company.\n\tSchedule appointments and manage the company's calendar.\n\tAnswer phone calls and respond to client inquiries.\n\tMaintain the cleanliness and organization.\n\tProcess payments and manage cash register.\n\n\nRequirements\n\n\n\tND / HND holder.\n\tPrevious experience in a customer service role.\n\tExcellent communication and interpersonal skills.\n\tAbility to multitask and work in a fast-paced environment.\n\tProficient in basic computer skills.\n\n\nMethod of Application\nInterested and qualified candidates should send their Curriculum Vitae (CV) to: rotimi.omoera@c-ileasing.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Receptionist Job at Management FIRST",
    "link": "https://www.jobgurus.com.ng/jobs/view/receptionist-job-at-management-first-7",
    "pubDate": "Thu, 03 Jul 2025 14:16:13 GMT",
    "source": "JobGurus",
    "keyword": "management first",
    "duplicate": false,
    "classifications": [],
    "content": "Management FIRST - Our client, a top beauty clinic and spa in Abuja, is seeking to hire a well experienced and detailed individual for immediate employment to fill the position below:\n\nJob Position: Receptionist\n\nJob Location: Abuja (FCT) \nEmployment Type: Full-time\n\nJob Description\n\n\n\tThe Receptionist undertakes all receptionist and clerical duties at the desk of the main entrance. You will be the “face” of the company for all visitors and will be responsible for the first impression that will be made.\n\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tKeep front desk tidy and presentable with all necessary material (pens, forms, paper etc.)\n\tGreet and welcome guests\n\tAnswer questions and address complaints\n\tAnswer all incoming calls and redirect them or keep messages\n\tReceive letters, packages etc. and distribute them\n\tPrepare outgoing mail by drafting correspondence, securing parcels etc.\n\tCheck, sort and forward emails\n\tMonitor office supplies and place orders when necessary\n\tKeep updated records and files\n\tMonitor office expenses and costs\n\tTake up other duties as assigned (travel arrangements, schedules etc.)\n\n\nRequirements\n\n\n\tProven experience as front desk representative, agent or relevant position\n\tFamiliarity with office machines (e.g. fax, printer etc.)\n\tKnowledge of office management and basic bookkeeping\n\tProficient in English (oral and written)\n\tExcellent knowledge of MS Office (especially Excel and Word)\n\tStrong communication and people skills\n\tGood organizational and multi-tasking abilities\n\tProblem-solving skills\n\tCustomer service orientation.\n\n\nSalary\nN100,000 - N120,000 / month.\n\nMethod of Application\nInterested and qualified candidates should send their Resume to: recruitmentwithmanagementfirst@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Customer Service Coordinator Job at FoliXx Hospitality",
    "link": "https://www.jobgurus.com.ng/jobs/view/customer-service-coordinator-job-at-folixx-hospitality",
    "pubDate": "Thu, 03 Jul 2025 14:16:13 GMT",
    "source": "JobGurus",
    "keyword": "folixx hospitality",
    "duplicate": false,
    "classifications": [],
    "content": "FoliXx Hospitality, established in 2018, provides a sophisticated and contemporary entertainment experience. From renowned themed nightlife events and live performances to exceptional restaurants and special occasions. We are a fast-growing and dynamic hospitality group with business units that include a Quick Service Restaurant (QSR), a Fine Dining Lounge, and a vibrant Nightclub.\n\nWe are recruiting to fill the position below:\n\nJob Position: Customer Service Coordinator\n\nJob Location: Ikate, Lekki - Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Customer Care Supervisor is responsible for leading a team of front-line customer care agents/maids/hostesses to ensure that every customer interaction is handled with care, speed, empathy, and professionalism.\n\tYou’ll serve as the first escalation point for customer concerns, and work closely with management to track feedback trends, suggest improvements, and enforce a high standard of customer satisfaction across all units.\n\n\nKey Responsibilities\n\n\n\tSupervise day-to-day activities of the customer care/frontline team.\n\tEnsure timely and professional resolution of all customer complaints, inquiries, and requests (in-person, via phone, or online).\n\tTrack, log, and escalate recurring issues to management and operations for review.\n\tMonitor staff-customer interactions to ensure warmth, courtesy, product knowledge, and engagement.\n\tMentor and coach junior customer service staff to ensure consistency in brand voice, etiquette, grooming, and tone.\n\tPerform regular checks on service delivery flow across customer touchpoints (entrance, seating, service, payment, etc.).\n\tOversee and enforce company dress code, grooming, and hospitality culture among hostesses, maidens, and other customer-facing roles.\n\tConduct briefings before shifts and debrief after shifts to share feedback and align expectations.\n\tCoordinate with Floor Supervisors, Kitchen, Bar, and Security teams to ensure smooth guest experience.\n\tHandle customer escalations and VIP/client concerns directly, ensuring swift and satisfactory resolution.\n\tEnsure effective management of reservation systems, appointment bookings, and guest list.\n\tGenerate and submit customer feedback reports, reviews summaries, and incident logs weekly.\n\n\nRequirements\n\n\n\tMinimum of HND / Bachelor’s Degree in Hospitality, Business Administration, or related fields\n\t2–4 years of proven experience in customer service, preferably within the hospitality, food service, or retail sector\n\tMinimum of 1 year in a supervisory or team lead role\n\tFlexible availability including nights, weekends, and public holidays\n\tKnowledge of customer service metrics and reporting is a plus\n\tAbility to speak confidently in English (additional local languages are a plus).\n\n\nRequired Skills & Competencies:\n\n\n\tStrong leadership and supervisory skills\n\tExcellent communication and interpersonal abilities\n\tProblem-solving mindset with emotional intelligence\n\tHigh attention to detail and strong follow-through\n\tAbility to multitask in high-pressure environments\n\tTech-savvy with experience in POS systems, reservation tools, or CRM platforms\n\tProfessional appearance and demeanor.\n\n\nSalary\nN200,000 - N300,000 Monthly. \n\nMethod of Application\nInterested and qualified candidates should send their CV and a short cover letter to: hr@folixxhospitality.com using \"Customer Care Supervisor\" as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Human Resources Information System (HRIS) Officer Job at Dangote Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/human-resources-information-system-hris-officer-job-at-dangote-group-2",
    "pubDate": "Thu, 03 Jul 2025 14:16:13 GMT",
    "source": "JobGurus",
    "keyword": "dangote group",
    "duplicate": false,
    "classifications": [],
    "content": "Dangote Group is one of Nigeria’s most diversified business conglomerates with a hard – earned reputation for excellent business practices and products’ quality with its operational headquarters in the bustling metropolis of Lagos, Nigeria in West Africa.\n\nWe are recruiting to fill the position below:\n\nJob Position: Human Resources Information System (HRIS) Officer\n\nJob Location: Apapa, Lagos\nJob type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Human Resources Information System (HRIS) Officer will be responsible for managing and optimizing the HRIS database to ensure the accurate collection, management, and reporting of employee data.\n\tThis role will involve working closely with HR teams to automate processes and enhance data accessibility, thus supporting strategic HR decision-making.\n\n\nKey Responsibilities\n\n\n\tManage the HRIS to ensure system integrity and accuracy of data.\n\tSupport HR initiatives by maintaining employee data and ensuring compliance with data privacy regulations.\n\tDevelop and generate reports and analytics to inform HR strategies and improve operational efficiencies.\n\tAssist in the design and implementation of new HRIS modules and features.\n\tProvide training and support to HR personnel and end-users on HRIS functionalities.\n\tCollaborate with IT for system upgrades, troubleshooting issues, and maintaining system security.\n\tConduct regular audits of employee data to ensure accuracy and compliance.\n\tStay updated on HRIS best practices and emerging technologies. \n\tParticipate in change management initiatives relating to HRIS updates.\n\n\nRequirement & Competencies\n\n\n\tBachelor’s degree in Human Resources, Information Technology, Business Administration or a related field.\n\tProven experience working as an HRIS Officer or similar role.\n\tStrong understanding of HR processes and data management.\n\tProficiency in HRIS software (e.g., SAP, Oracle, Workday) and advanced Excel skills.\n\tKnowledge of database management and data security standards.\n\tExcellent analytical skills with the ability to interpret complex data.\n\tStrong attention to detail and commitment to data accuracy.\n\tEffective communication and interpersonal skills.\n\tAbility to manage multiple tasks and projects simultaneously.\n\n\nBenefits\n\n\n\tPrivate Health Insurance\n\tOpportunities for Professional Growth and Career Advancement\n\tPaid Time Off\n\tTraining & Development\n\tCompetitive salary\n\tCollaborative and supportive work environment.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Executive Assistant to the Managing Director Job at Bluradish",
    "link": "https://www.jobgurus.com.ng/jobs/view/executive-assistant-to-the-managing-director-job-at-bluradish",
    "pubDate": "Thu, 03 Jul 2025 14:16:13 GMT",
    "source": "JobGurus",
    "keyword": "bluradish",
    "duplicate": false,
    "classifications": [],
    "content": "Bluradish is a modern, customer-centric luxury pawnshop brand committed to providing fast, reliable, and discreet financial solutions. We specialize in short-term loans secured against high-value luxury items such as watches, designer fashion, jewelry, and electronics. Our approach blends professionalism, confidentiality, and a high-end retail experience that sets us apart in the industry.\n\nWe are recruiting to fill the position below:\n\nJob Position: Executive Assistant to the Managing Director\n\nJob Location: Lagos\n\nRole Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are looking for a highly organized, polished, and proactive Executive Assistant to support the Managing Director in driving the strategic and operational goals of the business.\n\tThe ideal candidate will have 3–5 years of experience supporting C-level executives, preferably within a luxury business environment (e.g., fashion, retail, hospitality, or lifestyle brands).\n\tThe Executive Assistant will serve as a trusted gatekeeper and project coordinator, ensuring smooth day-to-day operations and helping the MD stay focused on leadership and business development.\n\n\nKey Responsibilities\n\n\n\tProvide high-level administrative support to the Managing Director, including calendar management, travel arrangements, meeting scheduling, and email correspondence.\n\tServe as the first point of contact and liaison between the MD and internal/external stakeholders, clients, and partners.\n\tPrepare, review, and organize documents, reports, presentations, and meeting agendas.\n\tCoordinate business meetings, events, and confidential matters with discretion and professionalism.\n\tTrack and follow up on action items, deadlines, and project milestones on behalf of the MD.\n\tHandle confidential information with integrity and professionalism.\n\tAssist with personal executive tasks as needed to support the overall performance of the MD.\n\tStay attuned to the luxury brand voice and assist in communications, brand-related tasks, and special projects when required.\n\n\nRequirements\n\n\n\tBachelor’s Degree in Business Administration, Communications, or related field\n\t3 - 5 years of proven experience as an Executive Assistant supporting senior executives, ideally in a luxury-focused business or corporate environment\n\tStrong organizational and multitasking skills with a proactive, detail-oriented approach\n\tImpeccable verbal and written communication skills\n\tHigh emotional intelligence, discretion, and professionalism\n\tProficient in Microsoft Office Suite, Google Workspace, and virtual communication tools (e.g., Zoom, Teams)\n\tA strong appreciation and understanding of luxury aesthetics, customer service, and brand tone\n\tMust be based in Lagos\n\n\nPreferred Qualities:\n\n\n\tExperience in luxury retail, hospitality, or fashion industries\n\tFamiliarity with executive calendar tools, project management platforms (e.g., Asana, Trello), and CRM systems\n\tAbility to thrive in a fast-paced, high-stakes environment\n\n\nWhy Join Bluradish?\n\n\n\tOpportunity to work closely with a visionary founder in a dynamic, upscale business\n\tExposure to the luxury retail and financial services industries\n\tHigh-impact role with opportunities for professional growth\n\tElegant and collaborative workplace culture\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and Cover letter to: career@pawnshopbyblu.com using “Application – Executive Assistant” as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]