[
  {
    "title": "Supply Chain Lead Job at Oriki Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/supply-chain-lead-job-at-oriki-group",
    "pubDate": "Sat, 21 Jun 2025 12:28:39 GMT",
    "source": "JobGurus",
    "keyword": "oriki group",
    "duplicate": false,
    "classifications": [],
    "content": "ORÍKÌ is an Agri-beauty farm to skin brand, the first and only personal care manufacturer in Nigeria to operate a fast-growing premium wellness & spa brand in conjunction. We work relentlessly towards our vision of putting Africa on the map in the global skincare & wellness industry, poised to significantly contribute to the personal grooming & wellness market share.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nORÍKÌ exists to display that African ingredients and their potent benefits will not just remain local; We stand for international best standards and quality. ORÍKÌ Group is comprised of a wellness day spa with multiple locations, farm to skin retail products, a wholesale & amenity product line for spa's, hotels, and airlines, a training institute, the ORIKI franchise and the UNWIND by ORÍKÌ tech app.\n\nWe are recruiting to fill the position below:\n\nJob Position: Supply Chain Lead\n\nJob Location: Victoria Island, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tThe Supply Chain Lead will oversee the end-to-end supply chain operations of ORÍKÌ Group, including procurement, inventory management, supplier relations, logistics, and compliance.\n\tThis role is critical in ensuring timely availability of products, optimizing cost efficiency, and maintaining supply chain resilience that supports the Group’s operational and strategic goals.\n\n\nResponsibilities\nStrategic Supply Chain Planning:\n\n\n\tDevelop and implement long-term supply chain strategies that align with business goals and product expansion.\n\tDesign and manage an integrated supply chain model covering local and international sourcing.\n\tEstablish SLAs across the chain to monitor efficiency and performance.\n\n\nDemand & Production Planning:\n\n\n\tCollaborate with sales, spa, and retail teams to forecast demand accurately across product lines.\n\tAlign production scheduling with inventory targets and market requirements.\n\tManage procurement timelines to ensure raw materials availability for production cycles.\n\n\nProcurement Oversight:\n\n\n\tOversee purchase requisition and order placement for raw materials, finished goods, and non-trade items.\n\tOptimize procurement lead times and ensure adherence to approved budgets.\n\tBuild cost-saving initiatives into the procurement lifecycle.\n\n\nLogistics, Warehousing & Distribution Management:\n\n\n\tLead the implementation of warehousing best practices, layout design, FIFO/LIFO systems, and inventory categorization.\n\tManage receiving, storage, and dispatch processes with documentation compliance.\n\tOversee distribution and order fulfillment logistics across all spa and retail locations.\n\n\nCompliance and Risk Management:\n\n\n\tEnsure compliance with internal procurement policies and regulatory standards.\n\tMitigate supply chain risks through contract management, dual sourcing, and contingency planning.\n\tMaintain a central documentation system for all procurement and logistics activities.\n\n\nTeam Management & Development:\n\n\n\tLead, coach, and grow the supply chain team across all touchpoints.\n\tConduct periodic reviews, set team KPIs, and ensure role clarity and performance alignment.\n\n\nMethod of Application\nInterested and qualified candidates should send their Resume to: jointheteam@orikigroup.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Assistant Manager, Finance Job at Husk Power Energy Systems Nigeria Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/assistant-manager-finance-job-at-husk-power-energy-systems-nigeria-limited-1",
    "pubDate": "Sat, 21 Jun 2025 12:28:39 GMT",
    "source": "JobGurus",
    "keyword": "husk power energy systems nigeria limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Husk is one of the world’s leading rural energy providers. We provide low-cost and reliable power to rural households and businesses, entirely from renewable energy sources. Powering economic possibilities in every village is at the heart of everything we do.\n\nWe design, build and operate the lowest cost hybrid (solar and biomass) power plant and distribution network in India and Africa. To date, Husk has provided electricity to over 15,000 homes and business, reducing 95,000 tonnes of CO2. Our aim is to provide 30MW of power to 225,000 customers by 2025, and save 350,000 tonnes of CO2 each year.\n\nWe are recruiting to fill the position below:\n\nJob Position: Assistant Manager, Finance\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Location: Abuja\nReports to: GM Finance with a dotted line to CFO\n\nRole Summary\n\n\n\tHusk seeks an Assistant Finance Manager who will be responsible for developing and maintaining a strategic financial plan and annual operating, capital budgets, financial analysis, acquisitions and business development, revenue management, and preparation of the financial statements, in accordance with financial techniques appropriate to the energy sector, decision support and cost accounting of the organization.\n\tThis role involves direct interface with external consultants, external auditors, banks, and regulators such as NERC etc. This reports to the GM Finance with a dotted line to the Chief Financial Officer (CFO).\n\n\nKey Responsibilities\nAccounting, Reporting & Auditing:\n\n\n\tCoordinate all monthly and annual financial processes for the local entity.\n\tLiaise with external financial consultants, ensuring adherence to all agreed timelines on deliverables (monthly accounting calendar), checking reconciliations, accurate recording in ledger and comprehensive and clear filing of all records and supporting documents.\n\tIdentify new metrics to drive business performance relative to strategic priorities while minimizing risk.\n\tDevelop strategies to increase cash flow forecast with the Country Director to ensure availability of cash annually. \n\tServe as lead liaison with banks, negotiating minimum costs on transactions and FX.\n\tEnsures that all balance sheet accounts are reconciled monthly, and a system of internal controls is in place and followed to facilitate a clean audit opinion with no audit adjustments or internal control deficiencies noted. I.e., of internal controls, verifying the month end cash counts, reviewing monthly account reconciliations for balance sheet accounts, verifying the reconciliation between physical Inventory and ERP inventory values, and ensuring the Fixed asset register is accurate.\n\tProduce monthly financial reports and interpret financial information to managerial staff while recommending further courses of action.\n\tEnsure supporting documents to grantors/financiers and other strategic partners are maintained and available as requested.\n\tResponsible for overseeing the end of year annual external audit and ensuring findings from the audit management letter are addressed.\n\tProvide support to business heads in implementing financial plans and productivity benchmarks, and to monitor progress toward financial goals i.e., financing projects for and by third parties. \n\tOversee operations of the local finance function \n\tPlan, assign, and review work of staff to ensure that group objectives are met. Hire, train, develop, and manage staff to ensure that a qualified staff exists to meet group objectives.\n\n\nTax & Regulatory Compliance:\n\n\n\tEnsure proper corporate governance practices including compliance with applicable Corporate Governance Code(s), statutory and other regulatory requirements.\n\tVerify that tax filings - VAT, PAYE, Withholding Taxes, NASSIT calculations, corporate income taxes are accurate and are filed before the statutory due dates.\n\tEnsure regulatory and tax compliance with the relevant regulators to ensure optimal planning. Register and renew dues & payments to statutory agencies. \n\tEnsure adequate budgeting systems for both operating and capital budgets.\n\tManage memberships and registration to industry-specific, statutory organizations & subscriptions.\n\tServe as lead liaison with NERC, especially on tariff and regulatory matters in conjunction with the Country Director.\n\tPrepare, publish and update a compliance tracker capturing compliance requirements for project, contract, industry, investor, regulatory, specific.\n\tOther related tasks and projects as requested.\n\n\nQualifications\n\n\n\tA graduate of Accounting, Economics, Finance or similar course of study, an MBA is a plus.\n\t4-7 years of financial management, accounting, or audit experience\n\tACA, ACCA, or CIMA qualifications is preferred\n\tHands-on on IFRS\n\tExperience in Financial modeling, financial planning, and analysis.\n\tSolid proficiency in Microsoft Office, especially Excel, SAP, and/or other financial and enterprise planning and management software.\n\tExcellent financial planning and modelling skills with strong knowledge of financial operations procedures.\n\tAnalytical thinker with strong conceptual and problem-solving skills.\n\tProven proactive approach to financial management and regulatory compliance.\n\tAbility to process large amounts of data and convert to useful business information and recommendations.\n\tThe ability to evaluate and convey complex information to others in an effective manner through persuasive communication, negotiating skills and clear presentation skills in both verbal and written contexts.\n\tKnowledge of ERP (Tally).\n\n\nBenefits\n\n\n\tSalary: Negotiable based on experience.\n\tHusk offers flexible working conditions with employee benefits that are in line with global best practices.\n\tThese include: clear career growth planning, transparent annual review processes that are gender inclusive, maternity, and paternity leave, gender-inclusive workplace conditions, family health insurance, and frequent training to assist the employees to grow in and to the next roles.\n\tHusk does not believe in micromanagement and encourages its employees to have a healthy work-life balance, hence giving them the freedom to manage their workload to be compatible with their life.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Manager - Relationship, ACB Job at Stanbic IBTC Bank",
    "link": "https://www.jobgurus.com.ng/jobs/view/manager-relationship-acb-job-at-stanbic-ibtc-bank",
    "pubDate": "Sat, 21 Jun 2025 12:28:39 GMT",
    "source": "JobGurus",
    "keyword": "stanbic ibtc bank",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Stanbic IBTC Bank is a leading African banking group focused on emerging markets globally. It has been a mainstay of South Africa's financial system for 150 years, and now spans 16 countries across the African continent.\n\nStandard Bank is a firm believer in technical innovation, to help us guarantee exceptional client service and leading edge financial solutions. Our growing global success reflects our commitment to the latest solutions, the best people, and a uniquely flexible and vibrant working culture. To help us drive our success into the future, we are looking for resourceful individuals to join our dedicated team at our offices.\n\nWe are recruiting to fill the position below:\n\nJob Position: Manager - Relationship, ACB\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Location: Nigeria\n\nJob Description\n\n\n\tTo effectively resolve customer complaints and complex queries.\n\tEnsuring a consistent and positive brand experience for Africa China Banking clients. This involves adhering to complaint management and dispute resolution processes to minimize reputational risk and customer attrition.\n\n\nQualifications\n\n\n\tCandidates should possess a B.Sc Degree in Social Science or related field.\n\tMasters and Professional certifications can be an added advantage.\n\n\nExperience:\n\n\n\t1-3 years of experience in Operations, Channel, Call Centre, Helpdesk -Service, Support, Project Implementation and management.\n\tUnderstanding of Stanbic IBTC’s products and services.\n\tMandarin speaking.\n\n\nBehavioural Competencies:\n\n\n\tAdopting Practical Approaches\n\tArticulating Information\n\tChallenging Ideas\n\tConvincing People\n\tExploring Possibilities.\n\n\nTechnical Competencies:\n\n\n\tBanking Process & Procedures\n\tCustomer Understanding (Consumer Banking)\n\tProduct Knowledge (Consumer Banking)\n\tActive Listening\n\tQuery Resolution.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]