[
  {
    "title": "Chief Engineer Job at Hilton Worldwide",
    "link": "https://www.jobgurus.com.ng/jobs/view/chief-engineer-job-at-hilton-worldwide",
    "pubDate": "Thu, 03 Jul 2025 15:16:58 GMT",
    "source": "JobGurus",
    "keyword": "hilton worldwide",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Hilton is the leading global hospitality company, spanning the lodging sector from luxurious full-service hotels and resorts to extended-stay suites and mid-priced hotels. For nearly a century, Hilton has offered business and leisure travelers the finest in accommodations, service, amenities and value. Hilton is dedicated to continuing its tradition of providing exceptional guest experiences across its global brands. Our vision to fill the earth with the light and warmth of hospitality unites us as a team to create remarkable hospitality experiences around the world every day. And our amazing Team Members are at the heart of it all.\n\nWe are recruiting to fill the position below:\n\nJob Position: Chief Engineer\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nRequisition ID: HOT0BQ8V\nJob Location: Abuja\n\nJob Description\n\n\n\tAs a Chief Engineer, you will manage all engineering operations including building, plants, heating and cooling system (HVAC), plumbing, water treatment, boilers systems, etc.\n\tManage effective performance of Engineering team in line with the department objectives and key performance indicators.\n\n\nResponsibilities\n\n\n\tAs Chief Engineer, you are responsible for the effective management of all engineering and maintenance operations within the hotel, including energy conservation.\n\tYou are also responsible for the development of the Engineering Team and staying abreast of compliance regulations and procedures in the field of Engineering, as required for hotel standards.\n\n\nSpecifically, a Chief Engineer will perform the following tasks to the highest standards:\n\n\n\tLead the Engineering Team in the day-to-day engineering and maintenance operations of the hotel, including service standards, equipment schedules, and work schedules\n\tCommunicate with Housekeeping to coordinate and prioritize maintenance activities for Guest rooms and public areas\n\tDevelop systems and procedures to ensure the health and safety of Guests and Team Members, as well as the proper conditions for plants, machinery, and property\n\tCommunicate with Government agencies to ensure full compliance with statutory regulations\n\tPrepare Capital and Repairs and Maintenance budgets for Engineering\n\tDevelop and implement preventive maintenance plan.\n\tSupervise, develops and maintains an ongoing maintenance operation for hotel, including refrigeration, heating, plumbing, water treatment, preventive maintenance, hotel rooms, air/heating units, ice machines, swimming pools, lighting, kitchen equipment, emergency generators, water softeners, switch rooms, roof exhausts, electrical substations, etc.\n\tConduct lift emergency release procedures as required\n\tDevelop, implement and manage energy conservation programs for the property to minimize expenses\n\tCoordinate renovation bidding, define the cost and scope of the project, and oversee the general contractor and subcontractors to ensure quality work is performed cost effectively\n\tPerform special projects and other responsibilities as assigned\n\tEnsure good relationships are built with internal and external customers.\n\tMaintenance of all hotel fixtures and fittings to ensure they are in safe condition and take action when any unsafe situations arise\n\tDevelop, implement, and direct all emergency programs\n\tIdentify and introduce environmentally-friendly systems and equipment\n\tMonitor Key Performance Indicators for the Engineering Department and take corrective action, as required, to improve equipment inventory, quality audit, productivity, and other objectives\n\tManage all Team Member related activities, including recruitment, performance management, training, career planning, disciplinary matters, and team motivation.\n\tMaintain the physical appearance and operational efficiency of the hotel including physical, mechanical, electrical, plumbing etc.\n\n\nRequirements\nA Chief Engineer serving Hilton brands is always working on behalf of our Guests and working with other Team Members. To successfully fill this role, you should maintain the attitude, behaviours, skills, and values that follow:\n\n\n\tAdvanced knowledge of building management/engineering\n\tA Master's Degree in Engineering or similar\n\tExposure to budgeting and basic accounting\n\tPositive attitude\n\tGood communication skills\n\tCommitted to delivering a high level of customer service\n\tStrong leadership skills and previous experience of managing a team\n\tExcellent grooming standards\n\tFlexibility to respond to a range of different work situations\n\tAbility to work under pressure\n\tAbility to work on their own\n\tPrevious experience of facilities management\n\tProficient, at an advanced level, with computers and relevant computer programs\n\n\nIt would be advantageous in this position for you to demonstrate the following capabilities and distinctions:\n\n\n\tDiploma CFPA Europe Fire Safety\n\tCertified Engineering Operation Executive (CEOE)\n\tMaster Certificate in Applied Project Management\n\tCertificate in Advance Strategic Project Management Practices.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "CNG Station Assistant Job at Dangote Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/cng-station-assistant-job-at-dangote-group",
    "pubDate": "Thu, 03 Jul 2025 15:16:58 GMT",
    "source": "JobGurus",
    "keyword": "dangote group",
    "duplicate": false,
    "classifications": [],
    "content": "Dangote Group is one of Nigeria’s most diversified business conglomerates with a hard – earned reputation for excellent business practices and products’ quality with its operational headquarters in the bustling metropolis of Lagos, Nigeria in West Africa.\n\nWe are recruiting to fill the position below:\n\nJob Position: CNG Station Assistant\n\nJob Location: Ibese, Ogun\nJob Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe CNG Station Assistant plays a critical role in ensuring the accurate, safe, and efficient refueling of Dantrans company trucks at third-party CNG (Compressed Natural Gas) stations.\n\tThis position involves actively monitoring the fuel dispensing process, maintaining accurate records, and assisting drivers during refueling operations.\n\n\nJob Description\n\n\n\tEnsure timely, accurate CNG fueling of all company trucks (Dantrans), preventing overfilling, underfilling, and fuel waste.\n\tManage truck movement and queuing to minimize wait times, reduce downtime, and support operational efficiency.\n\tSupervise and verify the CNG filling process, cross-check meter readings, and ensure correct gas quantities are dispensed.\n\tMaintain detailed and accurate records of fuel dispensed, meter readings, and collect supporting documentation.\n\tAddress fueling-related issues promptly, assist drivers during refueling, and report any anomalies discrepancies.\n\tEnforce safety protocols during the fueling process, report hazards/incidents, and ensure compliance with environmental and regulatory standards.\n\tMonitor fuel usage for discrepancies or inefficiencies and help detect potential fraud that may impact operational costs.\n\tLiaise with CNG station staff and coordinate with the operations team for scheduling and smooth fueling operations.\n\tProvide real-time data for operational analysis and support informed decision-making through accurate reporting.\n\n\nRequirements\nEducation and Work Experience:\n\n\n\tOrdinary National Diploma (OND) or equivalent.\n\tMinimum of 2 years of work experience.\n\tBasic understanding of CNG systems and safety protocols.\n\tPrior experience in a logistics or fueling environment is an advantage.\n\n\nSkills and Behaviours:\n\n\n\tAttention to detail and accuracy.\n\tGood communication and interpersonal skills.\n\tBasic record-keeping and reporting skills.\n\tAbility to work independently and responsibly.\n\tAwareness of safety and emergency procedures.\n\n\nBenefits\n\n\n\tPrivate Health Insurance\n\tPension Plan\n\tPaid Time Off\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Accounting Officer Job at Karisa Consults Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/accounting-officer-job-at-karisa-consults-limited",
    "pubDate": "Thu, 03 Jul 2025 15:16:58 GMT",
    "source": "JobGurus",
    "keyword": "karisa consults limited",
    "duplicate": false,
    "classifications": [],
    "content": "Karisa Consults Limited is an emerging management consulting firm that specialize in Agribusiness, Farms Management , Recruitment, Professional background Check Services, Research, Management training as well as Agricultural Training. We provide Management Consulting services to clients in the private and public sector within and outside Nigeria\n\nOur clients include start-ups, small and medium enterprises as well as multinationals and industry leaders in key sectors of the Nigeria and Africa regional economies.\n\nWe are recruiting to fill the position below:\n\nJob Position: Accounting Officer\n\nJob Location: Kano\n\nJob Responsibilties\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tReconciling the company’s bank statements and bookkeeping ledgers\n\tCompleting analysis of the employee expenditures\n\tManaging income and expenditure accounts\n\tGenerating the company’s financial reports using income and expenditure data\n\tKeeping a check on the company’s finances based on financial status\n\tFiling and remitting taxes and other financial obligations\n\tInitiating and managing financial and accounting software used by the company.\n\n\nRequirements\n\n\n\tA Degree or HND in accounting or similar.\n\t2 to 5 years working experiences\n\tPrevious working experience as an Accounting Officer.\n\tKnowledge and competency in accounting principles.\n\tProficiency in management systems.\n\tAdministration skills.\n\tSound interpersonal skills.\n\tProficiency in MS Excel and other accounting software.\n\tAbility to create and follow schedules\n\tLeadership and interpersonal skills\n\tProblem solving skills\n\tCommunication skills\n\tLanguage Skills\n\tReporting Skills\n\tTeam working skills\n\tConfidence.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: jobkarisaconsults@gmail.com using the Job Position and the Location as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]