[
  {
    "title": "Loan Processing Lead Job at TeamAce Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/loan-processing-lead-job-at-teamace-limited",
    "pubDate": "Thu, 05 Jun 2025 16:46:49 GMT",
    "source": "JobGurus",
    "keyword": "teamace limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "At TeamAce, we help businesses across different industries thrive. We work with businesses to create their desired change by getting the right people, designing bespoke business processes, leveraging data, applying insights and technology. We combine our expertise and take different bespoke approaches to solve different business challenges because we believe there is no one size fits all approach. This way, you keep your eyes on the price and thrive.\n\nWe are recruiting to fill the position below:\n\nJob Position: Loan Processing Lead\n\nJob Location: Victoria Island, Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking an experienced and detail-oriented Loan Processing Lead to oversee and manage end-to-end loan processing operations.\n\tThis role is responsible for leading a team of loan processors, ensuring timely and accurate loan documentation, compliance with lending policies, and delivering a seamless experience for customers.\n\tThe ideal candidate will have a strong background in loan operations, credit analysis, and team leadership.\n\n\nKey Responsibilities\n\n\n\tSupervise and coordinate daily loan processing activities from application to disbursement.\n\tReview loan files to ensure completeness, accuracy, and compliance with company policies and regulatory standards.\n\tCollaborate with credit analysts, underwriters, legal teams, and relationship managers to resolve discrepancies and streamline processing workflows.\n\tMonitor and report key performance indicators (KPIs) related to loan processing efficiency and accuracy.\n\tServe as the point of escalation for complex or high-risk loan files.\n\tEnsure adherence to service-level agreements (SLAs) for loan turnaround times.\n\tProvide leadership, training, and performance management for loan processing staff.\n\tIdentify process improvement opportunities and contribute to the enhancement of loan systems and operational procedures.\n\tMaintain strong documentation and audit trails for internal and external reviews.\n\tStay informed of industry trends, regulatory changes, and best practices in loan operations.\n\n\nQualifications\n\n\n\tHND / BSc in Finance, Business Administration, Banking, or a related field.\n\t3 - 4 years of experience in loan operations or processing, with at least 1 - 2 years in a leadership or supervisory role.\n\tCertification in credit/lending or financial services operations is a plus.\n\tStrong understanding of lending processes, credit evaluation, and loan documentation.\n\tKnowledge of applicable regulatory guidelines and compliance standards.\n\tExcellent organizational, analytical, and decision-making skills.\n\tStrong interpersonal and communication abilities.\n\tProficiency in loan management systems and Google workspace/microsoft office tools.\n\n\nWhat We Offer\n\n\n\tCompetitive salary (Negotiable) and benefit packages.\n\tOpportunities for professional growth and development.\n\tA collaborative and inclusive work environment.\n\tHealth insurance and pension, etc.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Office Assistant Job at Gbenga Badejo and Co.",
    "link": "https://www.jobgurus.com.ng/jobs/view/office-assistant-job-at-gbenga-badejo-and-co",
    "pubDate": "Thu, 05 Jun 2025 16:46:49 GMT",
    "source": "JobGurus",
    "keyword": "gbenga badejo and co.",
    "duplicate": false,
    "classifications": [],
    "content": "Gbenga Badejo and Co. - Our client, a Professional Services Firm based in Ikeja, Lagos State, is recruiting to fill the position below:\n\nJob Position: Office Assistant\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\n\nEssential Duties and Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tFiling documents, organising records and maintaining filing systems.\n\tHandling phone calls, directing calls to the appropriate personnel.\n\tEnsuring shared office spaces are tidy and organized.\n\tHandling incoming and outgoing emails.\n\tScheduling appointments and maintaining visitor logs.\n\tMonitoring and ordering office supplies and keeping stocks organized.\n\tAssist with general office operations, including running errands to support administrative and clerical functions.\n\n\nEducation and Requirements\n\n\n\tNational Diploma, AAT or equivalent is preferred.\n\tMinimum of one to two years of experience working in the same capacity.\n\tProficiency in Microsoft Office Suite.\n\n\nKey Competencies:\n\n\n\tExcellent verbal and written communication skills.\n\tAbility to maintain accurate data entry and document preparation\n\tAbility to manage files, schedule tasks and maintain records efficiently.\n\tAbility to work well with other staff and departments.\n\n\nSalary\nN50,000 - N100,000 Monthly.\n\nNote\n\n\n\tOnly shortlisted candidates will be contacted within 1 week hereof.\n\tMale Candidates will be preferred for gender balance.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Sales Executive Job at Dragnet Solutions",
    "link": "https://www.jobgurus.com.ng/jobs/view/sales-executive-job-at-dragnet-solutions",
    "pubDate": "Thu, 05 Jun 2025 16:46:49 GMT",
    "source": "JobGurus",
    "keyword": "dragnet solutions",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "Dragnet Solutions is a firm that specializes in the design, development and implementation of people screening solutions that can be deployed in a variety of uses covering both the workplace and the educational arena.\n\nWe are recruiting to fill the position below:\n\nJob Position: Sales Executive\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Purpose\n\n\n\tTo manage customer accounts, follow up, and meet with assigned customers in the coverage area.\n\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tImplement Accounts sales plan and planning agreements, in order to ensure annual sales objectives are achieved.\n\tFocus on annual / quarterly cost triggers related to customer prices and implement or negotiate where necessary.\n\tInvestigate new opportunities to increase our market share, in order to expand current business relationships and increase the value of customer accounts.\n\tFocus on stock levels, ensuring slow moving stock is attended to quickly.\n\tMaintain frequent communication and make planned visits to customers to evaluate and resolve complaints and continuously reinforce relations to increase customer satisfaction.\n\tReview Customer Accounts results on a monthly basis, explain the reasons for any deviations and take corrective actions, in order to be aligned with the agreed budget and planning agreement.\n\tGain in-depth knowledge of customers’ cyclical demand to improve service and recognize opportunities. Use this information to gather forecasts and share with the planner to facilitate the demand plans\n\tProvide ongoing (dynamic) analysis of market conditions and competitor activity to the company management and sales force to keep them informed about the market trends.\n\tNegotiate and implement the annual business budget and planning agreements, in line with sales turnover, profitability and other KPIs, to achieve agreed profits.\n\n\nQualifications & Experience\n\n\n\tBachelor's Degree or Higher National Diploma (HND) in Marketing or other sales related fields\n\t4-6 years of experience\n\tKnowledge of Microsoft Dynamics Navision or any other Enterprise resource planning (ERP) software\n\tKnowledge of Microsoft Excel, PowerPoint Presentation\n\tExperience in the commercial / sales area from a B2B company\n\tExperience in logistics / manufacturing sector is preferable.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]