[
  {
    "title": "Front Office Manager Job at Alan & Grant",
    "link": "https://www.jobgurus.com.ng/jobs/view/front-office-manager-job-at-alan-grant",
    "pubDate": "Wed, 04 Jun 2025 10:17:31 GMT",
    "source": "JobGurus",
    "keyword": "alan & grant",
    "duplicate": false,
    "classifications": [],
    "content": "Alan & Grant - Our client is a premier hospitality destination, renowned for its exceptional service, elegant accommodation and vibrant atmosphere.\n\nThey are recruiting to fill the position below:\n\nJob Position: Front Office Manager\n\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a professional and service-driven Front Office Manager to lead the front desk operations and guest experience function.\n\tThe ideal candidate will be responsible for managing the front office team, ensuring smooth check-in and check-out processes, maintaining high standards of guest service, and supporting overall hotel operations. \n\tThis individual will play a critical role in upholding the hotel’s reputation for luxury and comfort, ensuring every guest interaction reflects elegance and efficiency.\n\n\nKey Responsibilities\nGuest Services & Operations:\n\n\n\tOversee daily front office operations including guest check-ins, check-outs, and concierge services.\n\tEnsure a consistent, high-quality guest experience aligned with the property’s luxury standards.\n\tAddress guest concerns or complaints promptly and professionally, turning challenges into opportunities for service recovery.\n\tPromote in-house services and amenities including spa treatments, dining experiences, and wellness offerings.\n\n\nTeam Management:\n\n\n\tSupervise, train, and support front desk staff to maintain a professional and courteous atmosphere.\n\tDevelop and implement SOPs for the front office team to ensure operational consistency.\n\tFoster a culture of accountability, teamwork, and service excellence.\n\n\nReservation Coordination:\n\n\n\tWork closely with the reservations team to ensure accurate bookings, availability tracking, and coordination of guest requests.\n\tOptimize room allocation and liaise with housekeeping to ensure readiness and guest satisfaction.\n\tUpdate booking sheets and relevant front office systems daily.\n\n\nSystem & Reporting:\n\n\n\tManage and ensure full utilization of front office and property management systems (e.g., Opera, Amadeus, or similar).\n\tGenerate daily, weekly, and monthly reports on occupancy, guest feedback, and operational performance.\n\tMonitor guest trends to support continuous improvement efforts and enhance service delivery.\n\n\n Revenue Support & Collaboration:\n\n\n\tSupport revenue generation by upselling premium rooms and promoting special packages.\n\tCollaborate with Sales, Housekeeping, and F&B teams to ensure smooth guest transitions and operations.\n\tMaintain awareness of local competitors and market dynamics to inform service enhancements.\n\n\nRequirements\n\n\n\tBachelor’s Degree in Hospitality Management, Business Administration, or a related field.\n\t2 - 4 years of experience in a similar front office or guest services management role, preferably within a luxury or boutique hotel.\n\tProficiency in hotel management systems such as Opera, Amadeus, or equivalent.\n\tStrong leadership and communication skills.\n\tExceptional attention to detail and a guest-centric mindset.\n\tAbility to multitask and adapt in a dynamic, fast-paced environment.\n\tDemonstrated ability to lead a team with poise, professionalism, and a passion for hospitality.\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Compliance Manager Job at Alan & Grant",
    "link": "https://www.jobgurus.com.ng/jobs/view/compliance-manager-job-at-alan-grant-2",
    "pubDate": "Wed, 04 Jun 2025 10:17:31 GMT",
    "source": "JobGurus",
    "keyword": "alan & grant",
    "duplicate": false,
    "classifications": [],
    "content": "Alan & Grant - Our client is a Real Estate development brand, focused on advancing lives. They create contemporary structures, aspiration lifestyle and thriving communities.\n\nThey are recruiting to fill the position below:\n\nJob Position: Compliance Manager\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tThe Compliance Manager will be providing specialist compliance and risk, advice, ongoing maintenance and development of the organizations' risk and compliance frameworks, in accordance with regulatory, industry, legal and business standards and requirements.\n\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tManage the implementation and administration of Compliance Policies, Procedures and Initiatives.\n\tEnsure consistent monitoring, implementation and compliance with global practice and legislation laws\n\tDevelop and implement techniques for compiling, preparing and presenting risk data.\n\tDevelop and implement risk metrics that enable informed decisions\n\tDevelop and implement company policies and regulations\n\tOversee all business operations relating to compliance, including policies, investments, and procedures\n\tReview and evaluate company procedures and reports to identify hidden risks or common issues\n\tOversee all business operations relating to compliance, including policies, investments, and procedures\n\tCreate and oversee the implementation of effective compliance management strategies\n\tDesign and monitor control systems to deal with violations of legal rules and internal policies.\n\tMonitor the applicable laws, stay on top of the dynamic laws and regulations and make changes to the system as and when required\n\tGather, analyze, and interpret technical data, and translate it correctly into official regulatory submissions\n\tLiaise with SEC and other regulatory bodies\n\tProvide specialist advice on core matters concerning regulatory compliance, aiming to keep the company’s products and services within the quality control circle.\n\n\nRequirements\n\n\n\tFirst Degree in Law or related field and post-graduate education with a focus on compliance and risk management\n\tAt least 10 years of working experience as a senior compliance manager\n\tProficiency in using MS Office (Word, Excel, PowerPoint, Outlook, etc.)\n\tProficiency in industry trends, laws, and regulations\n\tExcellent project management, leadership, organizational, communication and analytical skills\n\tAML/CTF qualifications are desirable\n\tSuperior knowledge of industry regulations and corporate procedures for maintaining compliance.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]