[
  {
    "title": "Credit Risk Officer Job at AAA Finance and Investment Company Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/credit-risk-officer-job-at-aaa-finance-and-investment-company-limited",
    "pubDate": "Mon, 02 Jun 2025 20:45:54 GMT",
    "source": "JobGurus",
    "keyword": "aaa finance and investment company limited",
    "duplicate": [
      {
        "site": "Example Site",
        "id": "a3471bd8a4afa1eff4b0e0db8addc9bf",
        "timestamp": 1748891054257
      },
      {
        "site": "JobGurus",
        "id": "a3471bd8a4afa1eff4b0e0db8addc9bf",
        "timestamp": 1748893788721
      },
      {
        "site": "JobGurus",
        "id": "65fb4b0588b366367499f72e0d6f5878",
        "timestamp": 1748897149712
      }
    ],
    "classifications": [
      "Finance"
    ],
    "content": "AAA Finance and Investment Company Limited is a fast growing Finance House company established in 2018 and promoted by reputable investors. AA Finance and Investment Company limited is registered and licensed by Central Bank of Nigeria as a Finance House  to provide financial services.\n\nWe are recruiting to fill the position below:\n\nJob Position: Credit Risk Officer\n\nJob Location: Victoria Island, Lagos\nEmployment Type: Full-time\n\nRequirements\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tA bachelor's degree or master's in Finance, Law or a related field and a certification in compliance is an added advantage\n\t3-5 years of  experience in credit risk, preferably in the financial services industry\n\tStrong knowledge of financial regulation, including AML/CTF, KYC and data protection laws\n\tProven experience in compliance programs development and implementation\n\tAbility to carry out continuous and extensive review and assessment of credit application processes to access compliance to internal and external policies and perform credit search.\n\n\nMethod of Application\nInterested and qualified candidates should send their Resume / CV to: hiring@aaafinancegroup.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Human Resources Business Partner Job at PG Consulting Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/human-resources-business-partner-job-at-pg-consulting-limited",
    "pubDate": "Mon, 02 Jun 2025 20:45:54 GMT",
    "source": "JobGurus",
    "keyword": "pg consulting limited",
    "duplicate": false,
    "classifications": [],
    "content": "PG Consulting Limited - Our client, in the Ceramics Manufacturing Industry is recruiting to fill the position below:\n\nJob Position: Human Resources Business Partner (HRBP)\n\nJob Location: Ajaokuta, Kogi state\nEmployment type: Full-time, Permanent\n\nAbout the Role\n\n\n\tWe are seeking a seasoned HR professional with a proven track record to fill the role of HRBP. \n\tThe ideal candidate must be a CIPM member with a strong understanding of HR best practices and a passion for driving organizational success through people management.\n\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tHR Quality Management System\n\tHR Policy development\n\tPerformance Management System\n\tStrong HR Project Management skills\n\tHR Payroll\n\tHR Risk Analysis and Metrics System\n\tStrong HR Generalist\n\tStrong Leadership skills\n\tExcellent verbal and written communication skills.\n\tStrong Analytical, problem-solving / MIS skills\n\n\nRequirements\n\n\n\tBachelor's Degree in Human Resources Management, Business Administration, or a related field.\n\tMinimum of 7 years of progressive HRBP experience in a manufacturing company\n\tCIPM membership is a plus.\n\tExperience in a manufacturing industry is a plus\n\tStrong knowledge of labour laws and HR best practices.\n\tExcellent communication, interpersonal, and leadership skills.\n\tAbility to build strong relationships with employees at all levels.\n\tAbility to commute/relocate\n\n\nExperience:\n\n\n\tManufacturing: 5 years (Required)\n\tPersonnel Manager: 5 years (Required).\n\n\nSalary\nN500,000 - N600,000 Monthly.\n\nMetod of Application\nInterested and qualified candidates should send their CV  and cover letter to: jobs@pgconsultingglobal.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Customer Care Services Job at Xora Technologies Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/customer-care-services-job-at-xora-technologies-limited",
    "pubDate": "Mon, 02 Jun 2025 20:45:54 GMT",
    "source": "JobGurus",
    "keyword": "xora technologies limited",
    "duplicate": false,
    "classifications": [],
    "content": "Xora Technologies limited is one of the leading indigenous information communications technology company involved in proffering effective solutions. We offer full and advanced solutions in ICT for homes, office es and government establishments. Our products and services offer flexible, scalable, upgradeable, expandable and efficient solutions for voice, video, data and internet communications spanning the small, medium or wide areas of needs within the country. Today, Xora Technolgies limited boasts of it's regional offices in port Harcourt, Abuja and Lagos. We are renowned for our professionalism in providing solutions to satisfy our customers. The company strives for more challenges on growing and expanding technologies systems to match markets requirements.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Customer Care Services\n\nJob Location: Lagos \nEmployment Type: Full-time\n\nJob Description\n\n\n\tWe are seeking a dedicated and enthusiastic Customer Service Representative to join our dynamic team.\n\tIn this role, you will be the first point of contact for our clients, providing exceptional support and assistance to ensure their needs are met effectively.\n\tAs a Customer Service Representative, you will be responsible for addressing customer inquiries, resolving issues, and providing information about our products and services.\n\tYour ability to empathize with customers and deliver outstanding service will be key to building and maintaining strong relationships.\n\tYou will have the opportunity to work in a supportive team atmosphere, where your efforts will directly impact customer satisfaction and loyalty.\n\tYou will work in a fast-paced environment where every day brings new challenges and opportunities to grow.\n\tIf you are a problem solver with excellent communication skills and a passion for helping others, we would love to have you on board.\n\tThis position offers a chance to develop your career in customer service while contributing to our organization's success.\n\tJoin us in our mission to provide top-notch customer experiences and become an integral part of our team.\n\n\nResponsibilities / Skills\n\n\n\tRespond promptly to customer inquiries via phone, email, or chat.\n\tProvide detailed information about products and services to customers.\n\tResolve customer complaints efficiently and effectively to ensure satisfaction.\n\tMaintain accurate records of customer interactions and transactions.\n\tFollow up with customers to ensure their issues are resolved.\n\tProven experience in a customer service role or similar position.\n\tExcellent verbal and written communication skills.\n\tStrong problem-solving abilities and a customer-focused mindset.\n\tAbility to work in a fast-paced environment and manage multiple tasks.\n\tProficient in using computers and customer service software.\n\tFlexibility to work various shifts, including evenings and weekends.\n\n\nRequirements\n\n\n\tInterested candidates should possess relevant qualifications with proven experience in a customer service role or similar position.\n\n\nSalary\nN150,000 - N200,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: Xoratechnologieshr@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Junior Mobile Developer with React-Native Job at Outcess Solutions Nigeria Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/junior-mobile-developer-with-react-native-job-at-outcess-solutions-nigeria-limited-1",
    "pubDate": "Mon, 02 Jun 2025 20:45:54 GMT",
    "source": "JobGurus",
    "keyword": "outcess solutions nigeria limited",
    "duplicate": false,
    "classifications": [
      "Software Engineering"
    ],
    "content": "Outcess Solutions Nigeria Limited  is an integrated customer engagement and business process outsourcing company. We deliver innovative digital solutions that empower and optimize the performance of people, teams, and organizations.\n\nWe are recruiting to fill the position below:\n\nJob Position: Junior Mobile Developer with React-Native\n\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\n\n\n\tDevelop new user-facing features using React Native.\n\tBuild reusable components and front-end libraries for future use.\n\tEnsure the technical feasibility of UI/UX designs.\n\tOptimize components for maximum performance across a wide range of mobile devices and operating systems.\n\tWork closely with designers to ensure the technical feasibility of UI/UX designs.\n\tStay up-to-date with the latest industry trends and technologies to ensure best practices are applied.\n\tWrite unit and integration tests to ensure robustness and reliability.\n\tAssist in the development and maintenance of automated testing frameworks.\n\tCollaborate with back-end developers to integrate front-end and back-end aspects of the mobile application.\n\tParticipate in team meetings, code reviews, and agile development processes.\n\tMaintain and improve existing codebase.\n\tTroubleshoot and debug issues as they arise.\n\tPerform regular testing and debugging of the application to ensure quality.\n\tCreate and maintain documentation for code, reusable components, and development processes.\n\tDocument new development processes and update existing ones as needed.\n\n\nJob Requirements\n\n\n\tBachelor's Degree in Computer Science, Software Engineering, Information Technology, or a related field (or equivalent experience).\n\tProficiency in JavaScript/Typescript and understanding of its core principles.\n\tExperience with React and React Native frameworks.\n\tFamiliarity with mobile app development for both iOS and Android platforms.\n\tUnderstanding of RESTful APIs and mobile app integration.\n\tKnowledge of modern front-end build pipelines and tools.\n\tUnderstanding of version control systems, particularly Git.\n\tBasic knowledge of mobile UI/UX design principles.\n\tStrong problem-solving skills and attention to detail.\n\tGood communication skills and the ability to work in a team environment.\n\tWillingness to learn new technologies and adapt to changing requirements.\n\tUnderstanding of mobile app deployment processes for App Store and Google Play.\n\tFamiliarity with native build tools, like Xcode, Gradle (Android Studio), etc.\n\tBasic understanding of state management libraries like Redux.\n\tSome experience with mobile development projects, whether through internships, school projects, or personal projects.\n\tUnderstanding of Agile development methodologies is a plus.\n\n\nMethod of Application\nInterested and qualified candidates should send their Applications to: happiness.akpan@outcess.com or recruitment@outcess.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "IT Servicing Manager Job at PG Consulting Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/it-servicing-manager-job-at-pg-consulting-limited",
    "pubDate": "Mon, 02 Jun 2025 20:45:54 GMT",
    "source": "JobGurus",
    "keyword": "pg consulting limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "PG Consulting Limited is a business optimization consulting practice specializing in Human Capital Development and the transformation of raw talent into invaluable human resources to fuel organizational growth and efficient operations. Our practice further extends to a plethora of Business Consulting Services all geared towards helping corporate organizations excel in a highly challenging business environment.\n\nWe are recruiting to fill the position below:\n\nJob Position: IT Servicing Manager\nJob Location: Ajaokuta, Kogi\n\nSummary of Job Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tManage the assigned Computer & Copier Service team members Lead, coach and train team members\n\tDevelop and implement strategic initiatives for team\n\tBe an escalation point of contact to handle issues and involve direct leadership as needed Monitor team coverage, oversee personnel time off approval, make sure back-ups are in place and redistribute work to cover when others are out\n\tMonitor staffing and equipment needs\n\tConduct performance reviews and make compensation decisions\n\tConfiguring the software independently or in coordination with the central team\n\tHandling vendor (software, hardware, network).\n\tMonitor direct reports call screens, work load and call activity to meet and exceed our client s expectations\n\tHandling Orion upgrade activities\n\tAddressing bug fixes\n\tUnderstanding and implementing new requirements\n\tNetwork/hardware troubleshooting with the help of Central IT team.\n\tCoordination with Functional users/Stakeholders.\n\tPerform other related duties as assigned by Management.\n\n\nQualifications and Skills\n\n\n\tMust have a Degree / HND in Computer Science / Engineering or a related field.\n\tMust have at least 7 years of networking experience with at least the last 2 years in a senior supervisory level role in a manufacturing company.\n\tMust have indept knowledge of general applications support and troubleshooting skills.\n\tORION.\n\tPrevious experience of telecom softwarewould be a bonus.\n\tMust be able to manage and mentor junior support analysts.\n\tMust be able to motivate and supervise efficiently.\n\tMust be able to communicate fluently both orally and written English.\n\tAble to deliver without any excuses.\n\tMust have people management skills.\n\n\nSalary\nN500,000 - N600,000 / Month.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: jobs@pgconsultinguk.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]