[
  {
    "title": "Accounting Officer Job at Milepost Equip Services Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/accounting-officer-job-at-milepost-equip-services-limited",
    "pubDate": "Fri, 27 Jun 2025 12:31:51 GMT",
    "source": "JobGurus",
    "keyword": "milepost equip services limited",
    "duplicate": false,
    "classifications": [],
    "content": "Milepost Equip Services Limited - Our Vision To rule the leasing industry based on creativity and innovation. Our Mission To provide a first class local-content leasing/assets management services to the Nigerian economy and beyond West Africa, with a focus and strong desire for customer satisfaction.\n\nWe are recruiting to fill the position below:\n\nJob Position: Accounting Officer\nJob Location: Port Harcourt, Rivers\nEmployment Type: Full-time\n\nRequirements\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tBSc / HND in Accounting / Economics / Business Management with 6 years experience in preferably a leasing / vehicle rental company or OND in accounting with 6 years of financial and management accounting and reporting\n\tVery proficient in computer and accounting packages.\n\tMust be a team player\n\tMust be experienced in obtaining statutory financial documents and also government certificates(TCC, DPR, NSITF etc)\n\tMustbe able to work with within deadlines.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV (Word or PDF) to: milepostequipservicesltd@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Engineering & Operations Lead Job at Sub-Sea 9 Gas Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/engineering-operations-lead-job-at-sub-sea-9-gas-limited",
    "pubDate": "Fri, 27 Jun 2025 12:31:51 GMT",
    "source": "JobGurus",
    "keyword": "sub-sea 9 gas limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "At Sub-Sea 9 Gas Limited, we're building a clean energy future through the development of Compressed Natural Gas (CNG) and Liquefied Petroleum Gas (LPG) plants across Nigeria. Our new plant in Calabar is designed to unlock gas accessibility through modern infrastructure and mobile distribution systems, enabling lower-emission alternatives for industries, transport services, and underserved regions.\n\nWe are recruiting to fill the position below:\n\nJob Position: Engineering & Operations Lead\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Location: Calabar, Cross River\nJob Type: Full Time\nCareer level: Mid-to-Senior Level\nRole Category: Engineering | Plant Operations | Maintenance | Business Development | Gas Distribution\n\nAbout the Role\n\n\n\tWe are seeking a hands-on, result-driven Engineering & Operations Lead to support the development and manage the technical and operational life cycle of our new CNG gas plant.\n\tThis is a key technical role bridging engineering execution and plant operations. It spans from early-stage engineering and construction support to full ownership of operational and technical performance, maintenance planning, and product distribution.\n\tThe ideal candidate combines strong engineering expertise, proven operational leadership, in-depth knowledge of plant maintenance, and the ability to support product sales and distribution planning.\n\n\nResponsibilities\nDevelopment Phase:\n\n\n\tSupport project planning, risk management, and cost control.\n\tProvide engineering support during the design, procurement, and construction of the plant.\n\tReview engineering drawings and documentation, equipment specifications, and vendor proposals to ensure alignment with operational goals.\n\tAssist in the evaluation and onboarding of key equipment vendors and technical service providers.\n\tDevelop SOPs and operation and maintenance manuals in coordination with contractors and project teams.\n\tPresent technical concepts and updates to executive leadership and partners.\n\tCollaborate with engineering, procurement, and construction contractors, vendors, and consultants.\n\tLiaise with regulatory agencies for approvals and licenses, and prepare all technical documentation for statutory permits.\n\tContribute to research and development initiatives as well as continuous innovation.\n\tEnsure all deliverables are completed on time, within budget, and in line with project goals.\n\tEnsure compliance with safety, environmental, and operational standards.\n\tLead the preparation of the commissioning schedule, test procedures, and validate key performance indicators.\n\n\nOperations & Maintenance:\n\n\n\tLead the day-to-day operational activities of the gas plant, ensuring safe, reliable, efficient operations and optimal system performance.\n\tLead daily staff operations, shift management, inventory tracking, loss control, and vendor coordination.\n\tDevelop a strong team with the highest safety & technical performance.\n\tSupervise plant personnel and ensure compliance with Health, Safety, and Environmental regulations.\n\tMonitor and troubleshoot system issues in real time to optimize plant efficiency and reliability.\n\tPlan preventive maintenance schedules, ensuring a swift response to all faults or issues at all times.\n\tPerform routine and preventive maintenance on compressors, PRS, pumps, valves, meters, rotating equipment, and various other machines and equipment.\n\tConduct regular inspections of CNG systems, electrical equipment, and components to identify issues, hazards, defects, and the need for adjustments or repairs.\n\tDiagnose and troubleshoot mechanical and electrical problems with CNG systems, engines, and other related components.\n\tMaintain accurate records of maintenance and repair work performed at all times.\n\tMaintain and update reports, operating procedures, manuals, and technical documentation.\n\tMaintain high standards of fuel quality, gas purity, cylinder integrity, and workplace safety.\n\tProvide training and support to plant staff on CNG instrumentation and controls.\n\tEnsure all regulatory permits and licenses are acquired, maintained, and updated as required by law.\n\tEnsure compliance with industry standards, health, safety, and environmental regulations in the plant.\n\tStay updated on advancements in CNG technology and maintenance techniques.\n\n\nCommercial & Product Support:\n\n\n\tIdentify and qualify new business leads to expand the market reach.\n\tProvide technical support for customers' onboarding and product delivery.\n\tMonitor market trends and client feedback to identify areas for operational or technical improvements.\n\tWork closely with marketing and sales teams to develop and support new business opportunities from a technical and supply standpoint.\n\tCollaborate with the commercial team to align production with sales forecasts, customer demands, and the distribution schedule.\n\tSupport product pricing strategies by providing technical input on distribution costs, operational efficiency, and supply reliability.\n\tOversee the integration of metering and billing systems to ensure accurate product measurement and invoicing.\n\tImplement and monitor telemetry or SCADA systems for tracking product movement, trailer performance, and delivery conditions.\n\tAssist in developing technical proposals for commercial clients, including capacity, delivery options, and performance parameters.\n\tReview and approve technical aspects of supply contracts, including delivery terms, specifications, and quality standards.\n\tEngage with major customers and distributors to address technical queries, resolve issues, and strengthen service delivery.\n\tEnsure the safe and efficient loading process of CNG via real-time pressure, temperature, and flow control systems.\n\tDesign and implement safety procedures and emergency response plans for gas distribution and mobile asset handling.\n\n\nRequirements\n\n\n\tBachelor’s or Master’s in Mechanical, Chemical, Petroleum, or Process Engineering, or related degree.\n\t8–10 years of experience in energy, gas processing, CNG infrastructure, and industrial plant operations.\n\tExperience in project execution and operational management.\n\tStrong knowledge of CNG/LPG systems, gas compression systems, process equipment, and plant utilities is highly preferred.\n\tExperience with SCADA, telemetry, and industrial control systems to support real-time monitoring, automation, and efficient plant operations.\n\tGreat attention to detail, problem-solving skills, and ability to follow safety protocols.\n\tExcellent interpersonal and communication skills across technical and non-technical teams.\n\tWorking knowledge of HSE standards and regulatory compliance in Nigeria’s energy sector.\n\tAbility to work independently in a dynamic, project-driven environment.\n\tProven track record in plant operations, maintenance, and safety standards.\n\tProficiency in troubleshooting and diagnostic procedures for mechanical, electrical , and process systems with accuracy and speed.\n\tUnderstanding and ability to design engineering drawings, P&IDs, and process flow diagrams.\n\tPrior experience managing or working in industrial gas production is highly desirable.\n\tProven experience in leading cross-functional teams with a strong emphasis on accountability, performance delivery, and operational discipline.\n\tExperience collaborating with sales, distribution, or logistics teams to support end-to-end product delivery is a strong advantage.\n\tUnderstanding of the Nigerian gas market, client needs, and product logistics is a plus.\n\tWilling to be based full-time in Calabar, assuming full operational and technical ownership of site activities.\n\n\nWhat We Offer\n\n\n\tCompetitive salary package commensurate with experience..\n\tPerformance-based bonuses or incentives.\n\tHealth insurance and wellness coverage.\n\tGrowth opportunities within a fast-growing energy company.\n\tAccess to industry training, certifications, and technical development programs.\n\tThe opportunity to shape the future of clean gas access in Nigeria.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and Cover Letter to: careers@sub-sea9gas.com using \"Engineering and Operations Lead\" as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Broker Associate Job at Elyon Technik Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/broker-associate-job-at-elyon-technik-limited",
    "pubDate": "Fri, 27 Jun 2025 12:31:51 GMT",
    "source": "JobGurus",
    "keyword": "elyon technik limited",
    "duplicate": false,
    "classifications": [],
    "content": "Elyon Technik Limited specializes in aircraft parts supply, maintenance solutions and defense consulting. Backed by decades of industry expertise, we deliver reliable support to clients across commercial, business and military aviation.\n\nWe are recruiting to fill the position below:\n\nJob Position: Broker Associate\nJob Location: Lagos\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a skilled Broker Associate to join our team.\n\tThe successful candidate will be responsible for sourcing and procuring technical parts, equipment, and services, ensuring compliance with industry standards and regulations.\n\n\nKey Responsibilities\n\n\n\tSource and procure technical parts, equipment, and services.\n\tCollaborate with cross-functional teams to ensure timely delivery of projects.\n\tConduct market research to identify potential suppliers.\n\tNegotiate prices and terms with suppliers.\n\tEnsure compliance with industry standards and regulations.\n\tMaintain accurate records of procurement activities.\n\n\nRequirements\n\n\n\tMinimum qualification: B.Sc in Physics,Mechanical Engineering &Electrical/Electronics Engineering\n\t1 year of experience in procurement or a related field, NYSC members are also encouraged to apply.\n\tStrong knowledge of technical parts and equipment.\n\tStrong analytical and problem-solving skills.\n\tExcellent communication and negotiation skills.\n\tAbility to work in a fast-paced environment.\n\tProficiency in Microsoft Suite (Word, Excel, PowerPoint, Outlook).\n\tThis role requires a strong technical background, excellent communication skills and the ability to work effectively in a fast-paced environment.\n\n\nMethod of Application\nInteretsed and qualified candidates should send their CV to: hr@elyonship.com using \"Broker Associate\" as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Store Manager Job at FoyinHR",
    "link": "https://www.jobgurus.com.ng/jobs/view/store-manager-job-at-foyinhr",
    "pubDate": "Fri, 27 Jun 2025 12:31:51 GMT",
    "source": "JobGurus",
    "keyword": "foyinhr",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "FoyinHR, a reliable, growning IT Company, is  recruiting to fill the position below:\n\nJob Position: Store Manager\n\nJob Location: Lekki Phase 1, Lagos\nEmployment Type: Full-time\nReports to: General Manager\n\nJob Description\n\n\n\tYour Job is to manage all aspects of day to day store operations to ensure that customers and business expectations are met and/or exceeded within the business strategy.\n\tYou are also responsible for creating brand visibility and managing same by creating a lasting impression on the Customer.\n\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tEnsure the outlet is opened for business operations as scheduled on a daily basis\n\tMaintain outlet ambience in line with best practices for cleanliness, arrangement,\n\tmusic and other requirements.\n\tInduction and training of new associates on policies, procedures, products and\n\tservices\n\tTrain and develop team member capabilities for effective service delivery in line with\n\tcustomer, company and brand expectations\n\tDaily banking operations in line with cash management policies and procedures\n\tDevelop local sales strategy in line with global strategy and techniques to enrich the\n\tcustomer’s experience\n\tRecommend sales strategy in line with local customer behavior and/or trends in order to ensure that all set sales targets are met\n\tMonitor delivered merchandise, ensure stock taken is accurate and maintain reorder\n\tlevels in line with trends and customer preferences\n\tRecording daily transactions, daily stock and financial bank reconciliation\n\tInventory & Promotions: Keep accurate records of store goods, sales figures, requests,\n\tdiscounts and markdowns\n\tPreparing daily, weekly and monthly reports. May have to submit other unscheduled reports\n\tBuild, manage and maintain customer database for CRM purposes\n\tKeep customers abreast of store products, discounts, promotions and services\n\tManage store expenses, avoid waste of company resources, be alert for securities breaches like customer theft\n\tEffectively manage own team to ensure store/outlet sales targets are met\n\tEnsure uniformity and consistency of brands in-store\n\tEnsure staff maintain a professional working environment at all times\n\tOther duties as assigned by management\n\n\nQualifications\n\n\n\tBSc in Business Administration or any related field\n\t3 years of experience required or experience in a managerial post is a plus\n\tRetail training will be an advantage.\n\n\nSalary\nN250,000 / month. \n\nMethod of Application\nInterested and qualified candidates should send their CV to: foyinoluwa@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Human Resources Manager Job at Yourfavouritehrguide",
    "link": "https://www.jobgurus.com.ng/jobs/view/human-resources-manager-job-at-yourfavouritehrguide",
    "pubDate": "Fri, 27 Jun 2025 12:31:51 GMT",
    "source": "JobGurus",
    "keyword": "yourfavouritehrguide",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Yourfavouritehrguide - Our client, an IT Company in Lagos, is recruiting to fill the position below:\n\nJob Postion: Human Resources Manager\n\nJob Location: Lekki Phase 1, Lagos\nEmployment Type: Full-time\n\nPosition Summary\n\n\n\tWe are seeking to employ a young and vibrant Human Resources Manager that will oversee all human resources practices and processes.\n\tThe position requires an individual to have a good business acumen. The Human Resources Manager should also be a good team player with excellent written and verbal communication skills.\n\n\nDuties & Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDevelop and implement HR strategies and initiatives aligned with the overall business strategy\n\tBridge management and employee relations by addressing demands, grievances or other issues\n\tManage the recruitment and selection process\n\tOversee and manage a performance appraisal system that drives high performance\n\tMaintain pay plan and benefits program\n\tSupport current and future business needs through the development, engagement, motivation and preservation of human capital\n\tDevelop and monitor overall HR strategies, systems, tactics and procedures across the organization\n\tNurture a positive working environment\n\tAssess training needs to apply and monitor training programs\n\tReport to management and provide decision support through HR metrics\n\tEnsure legal compliance throughouthuman resource management\n\n\nEducation & Qualifications\n\n\n\tCandudates should posess a Degree in Human Resources or related field\n\tProven working experience of 3 years and above as HR Manager or HR Executive\n\tPeople-oriented and results driven\n\tDemonstrable experience with Human Resources metrics\n\tKnowledge of HR systems and databases\n\tAbility to architect strategy along with leadership skills\n\tExcellent active listening, negotiation and presentation skills\n\tCompetence to build and effectively manage interpersonal relationships at all levels of the company\n\tIn-depth knowledge of labor law and HR best practices\n\n\nSalary\nN300,000 - N350,000 / Month\n\nMethod of Application\nInterested and qualified candidates should send their CV to: foyinoluwa@gmail.com using \"Human Resources Manager\" as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]