[
  {
    "title": "Job Vacancies at Stridewaves Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancies-at-stridewaves-limited",
    "pubDate": "Fri, 13 Jun 2025 10:44:26 GMT",
    "source": "JobGurus",
    "keyword": "stridewaves limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Stridewaves Limited - We are a sustainability company that helps businesses and individuals thrive through environmentally sustainable practices.\n\nWe are recruiting to fill the following positions below:\n\n1.) HSE Officer\n\nJob Location: Port Harcourt, Rivers\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe're seeking a highly motivated and experienced HSE Officer to join our team.\n\tThe successful candidate will be responsible for ensuring a safe and healthy work environment, complying with relevant laws and regulations, and promoting a culture of safety within the organization.\n\n\nKey Responsibilities\n\n\n\tDevelop and implement HSE policies, procedures, and standards\n\tConduct risk assessments, audits, and inspections\n\tIdentify and mitigate hazards\n\tProvide HSE training and awareness programs\n\tInvestigate incidents and near-misses\n\tEnsure compliance with relevant laws, regulations, and industry standards\n\tCollaborate with other departments to promote HSE best practices\n\n\nRequirements\n\n\n\tRelevant Degree or certification in HSE, Environmental Science, or related field\n\tProven experience as an HSE Officer or similar role\n\tStrong knowledge of HSE laws, regulations, and industry standards\n\tExcellent communication and training skills\n\tAbility to work independently and lead teams.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: chigorgomi@gmail.com using the Job Position as the subject of the mail.\n\nNote: For more enquires send messge via WhatsApp to: 08101150077.\n\n \n\n \n\n2.) Driver\n\nJob Location: Port Harcourt, Rivers\nEmployment Type: Part-time\n\nJob Summary\n\n\n\tWe're seeking a reliable and experienced part-time driver to support our team.\n\tThe successful candidate will be responsible for driving company vehicles, transporting goods or personnel, and performing basic vehicle maintenance tasks.\n\n\nKey Responsibilities\n\n\n\tSafely drive company vehicles to transport goods or personnel\n\tMaintain a clean and safe vehicle environment\n\tPerform basic vehicle maintenance tasks, such as checking oil and tire pressure\n\tAdhere to traffic rules and regulations\n\tEnsure timely pickups and deliveries\n\n\nRequirements\n\n\n\tValid driver's license\n\tProven experience as a driver\n\tGood knowledge of local roads and traffic regulations\n\tExcellent driving record\n\tAbility to work independently and follow instructions.\n\n\nSalary\nN20,000 - N30,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: info@stridewaves.com using the Job Position as the subject of the mail.\n\nNote: For more enquires send messge via WhatsApp to 08101150077.\n\n \n\n \n\n3.) Marketing Officer\n\n\nJob Location: Port Harcourt, Rivers\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe're seeking an experienced Marketer to develop and execute marketing strategies that drive sales, increase brand awareness, and build customer engagement.\n\tThe successful candidate will be responsible for identifying new business opportunities, building relationships with clients, and promoting our products/services.\n\n\nKey Responsibilities\n\n\n\tDevelop and implement effective marketing strategies to achieve business objectives\n\tIdentify new business opportunities and build relationships with clients\n\tConduct market research and analyze competitors to stay ahead of industry trends\n\tCreate and distribute marketing materials to promote our products/services\n\tCollaborate with cross-functional teams to achieve business goals\n\tMeet and exceed sales targets.\n\n\nRequirements\n\n\n\tInterested candidates should possess relevant qualification with 1 - 5 years of work experience. \n\n\nSalary\nN70,000 - N80,000 per month. \n\nMethod of Application\nInterested and qualified candidates should send their CV to: info@stridewaves.com using the Job Position as the subject of the mail.\n\nNote: For more enquires send messge via WhatsApp to 08101150077.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Openings at Hobark International Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-hobark-international-limited-2",
    "pubDate": "Fri, 13 Jun 2025 10:44:26 GMT",
    "source": "JobGurus",
    "keyword": "hobark international limited",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "Hobark International Limited (HIL) is the parent company of the Hobark group operating in the oil and gas industry. The company was incorporated in 1998, starting as a staffing agency based in Port Harcourt. Currently we have offices in 4 countries with our head office in Lagos.\n\nWe are recruiting to fill the following positions below:\n\n1.) Community Relations Officer\n\nJob Location: Port Harcourt, Rivers\nJob Type: Contract\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tStrategic relationship management with various community stakeholders to the company's operations; ensuring business continuity through strategic stakeholder engagement and issues management.\n\tConflict mitigation through effective grievance management techniques.\n\tSupporting the development and implementation of pipeline security strategies towards minimizing pipeline downtime due to community interference.\n\tMidwifing sustainable economic development through deployment of programmes engendering local community empowerment.\n\n\nRequirements\n\n\n\tA minimum of a Bachelor’s Degree (B. Sc.) Degree in any of the Social Science disciplines\n\tCandidate must have worked in a similar role for at least ten (10) years post NYSC experience\n\tDemonstrate experience in working with rural communities & community groups especially in troubled areas.\n\tStrong interpersonal skills, including excellent verbal and written skills\n\tFluency in English\n\tGood working knowledge of the Niger Delta area.\n\tGood knowledge of Microsoft Office programs.\n\n\nClick here to apply online\n\n \n\n \n\n2.) Sales Associate\n\nJob Location: Lagos\nJob Type: Permanent/Full-time\n\nJob Description\n\n\n\tMeet and exceed sales targets\n\tSuccessfully create a business from new and existing customer accounts\n\tManage complex negotiations with senior-level executives\n\tBuild rapport and establish long-term relationships with customers\n\tConduct market research to identify selling possibilities and evaluate customer needs\n\tActively seek out new sales opportunities through cold calling, networking, and social media\n\n\nRequirements\n\n\n\tBSc in Marketing, Business Admin, or any relevant field\n\t2-5 years of quota-carrying sales experience\n\tProven experience as a Sales Executive or relevant role in a Finance company, ICT, or Insurance, ETC\n\tExperience and working knowledge of CRM systems\n\tDemonstrable track record of over-achieving quota\n\tStrong written and verbal communication skills\n\tProficiency in English\n\tExcellent knowledge of MS Office\n\n\nClick here to apply online\n\n \n\n3.) Internal Auditor\n\nJob Location: Lagos\nJob Type: Full-time\n\nResponsibilities\n\n\n\tSupport risk-based audit planning: Works with the Internal Audit Leads and Managers in scoping audit assignments and developing the audit work programs, ensuring programs address testing of controls highlighted in the risk assessment.\n\tConducting audit test procedures identifying patterns and exceptions or discrepancies in supporting information and documenting audit exceptions in line with the Global IA Standards and department guidelines. Prepares the work papers, evaluates findings, and formulates recommendations for changes and/or improvements.\n\tFraud risk management: Assist in designing and carrying out audit procedures to identify cases of potential fraud and misappropriation within the Group, as part of the audit plan, or as a special review at management’s request.\n\tIn carrying out audit assignments, determine the extent of compliance with established policies, procedures, and regulations, identify control lapses in the execution of policies and processes by control owners and responsible parties, and identify risk mitigations.\n\n\nRequirements\n\n\n\tBachelor's Degree in Accounting or Finance\n\tMinimum of 5 years of cumulative working experience. Prior Big 4 accounting firm or other audit /relevant work experience is a huge plus.\n\tB.Eng. in Engineering Discipline or Business Administration\n\tRequires significant learning agility\n\tProfessional qualification – ACA/ACCA/CIA/CISA or equivalent.\n\n\nClick here to apply online    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]