[
  {
    "title": "Inventory Officer Job at Hec Recruit",
    "link": "https://www.jobgurus.com.ng/jobs/view/inventory-officer-job-at-hec-recruit",
    "pubDate": "Mon, 09 Jun 2025 12:32:26 GMT",
    "source": "JobGurus",
    "keyword": "hec recruit",
    "duplicate": false,
    "classifications": [],
    "content": "Hec Recruit is a full-service HR consulting firm with a unique approach. Since 2020, we have been helping our clients find a job best suited for their skills and interests, and helping local companies locate the best employees.\n\nWe are recruiting to fill the position below:\n\nJob Position: Inventory Officer\nJob Location: Surulere, Lagos\nEmployment Type: Full-time\n\nDuties\n\n\n\tEnsure compliance with regulatory requirements and company polices relating to inventory management\n\tRegular audit and inspection to identify discrepancies or non-compliance.\n\n\nQualifications\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDegree relevant to job logistics and supply chain management, etc\n\tCertifications are an added advantage, CIM, CSRP.\n\tAge is 25 to 30 years.\n\n\nSalary\nAttractive.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: toluedun9@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Logistics-Based Manager Job at Wendernek Consulting Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/logistics-based-manager-job-at-wendernek-consulting-limited",
    "pubDate": "Mon, 09 Jun 2025 12:32:26 GMT",
    "source": "JobGurus",
    "keyword": "wendernek consulting limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Wendernek Consulting Limited is a leading human resource outsourcing management solutions provider in Nigeria. Our purpose is to provide applied and bespoke solutions to our clients.\n\nWe are recruiting to fill the position below:\n\nJob Position: Logistics-Based Manager\n\nJob Location: Port Harcourt, Rivers\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Logistics Manager is responsible for planning, organizing, and executing the movement, tracking, and documentation of equipment, materials, and personnel in support of our operations in the upstream, mid, and downstream oil and gas.\n\tThe role ensures timely mobilization/demobilization of tools, compliance with regulatory requirements, and the coordination of land, sea, and air transport.\n\tThis position plays a crucial part in minimizing non-productive time (NPT) and ensuring smooth operational continuity by aligning supply chain and field service requirements with logistics execution.\n\n\nKey Responsibilities\nMaterial and Equipment movement:\n\n\n\tCoordinate inbound and outbound shipments of oilfield tools, spare parts, consumables, and heavy equipment.\n\tSchedule and monitor deliveries via road, sea freight, and air freight, ensuring alignment with project timelines.\n\tLiaise with freight forwarders, haulers, rig/base personnel, and service companies for logistics planning.\n\n\nLoadout and Backload Operations:\n\n\n\tPrepare loadout lists, packing lists, and cargo manifests for rig mobilization or job site support.\n\tSupervise backload returns, including inspection, documentation, and quarantine (if applicable).\n\tEnsure load compliance with lifting plans, weight limits, and HSE requirements.\n\n\nInventory and Material tracking:\n\n\n\tTrack real-time location and status of tools and equipment through ERP or logistics software.\n\tSupport inventory control teams with stock movements, bin transfers, and usage reporting.\n\tMaintain traceability of serialized equipment and rental assets.\n\n\nDocumentation and Customs Compliance:\n\n\n\tGenerate shipping documentation: delivery notes, waybills, material transfer notes, manifests, and commercial invoices.\n\tCoordinate with customs brokers for import/export clearance in line with local regulations.\n\tEnsure adherence to documentation standards for bonded, non-bonded, and client-owned materials.\n\n\nVendor and Transport Coordination:\n\n\n\tArrange trucking, vessel booking, and air cargo as per job urgency, tool availability, and route planning.\n\tVerify vendor compliance with HSE, transport, and documentation requirements.\n\tCoordinate return of rental tools and vendor-supplied equipment post-job.\n\n\nHSE and Regulatory Compliance:\n\n\n\tEnforce load securing, safe lifting, and hazardous goods handling procedures.\n\tEnsure that logistics processes meet local, international, and company HSE standards.\n\tParticipate in safety briefings, toolbox talks, and risk assessments related to transport or loading\n\n\nBase/Yard Support:\n\n\n\tCoordinate with base teams for cargo preparation, staging, and dispatch.\n\tEnsure physical inspection of goods before shipment to confirm readiness and condition.\n\tMonitor yard layout efficiency for ease of loading/unloading and HSE adherence.\n\n\nCommunication and Stakeholder Liasion:\n\n\n\tMaintain constant communication with field service teams, workshop supervisors, and clients.\n\tProvide regular updates to operations and project managers on shipment status and ETAs.\n\tAct as a single point of contact for urgent dispatches, job mobilizations, and material logistics support.\n\n\nEmergency and After-Hours Support:\n\n\n\tBe available for urgent call-outs, especially during operational downtime or high-priority jobs.\n\tArrange express dispatches and last-minute freight bookings under pressure.\n\n\nRequirements\n\n\n\tDiploma or Bachelor’s degree in Logistics, Supply Chain Management, Business Administration, or a related field.\n\t4–8 years of experience in logistics coordination, preferably in the oil and gas.\n\tIATA/IMDG Certification for Dangerous Goods Handling\n\tLogistics/Supply Chain Certification (e.g., CILT, APICS, CSCMP)\n\tForklift, Crane, or Lifting Certification (as applicable)\n\tHSE Certifications (e.g., OSHA, NEBOSH awareness)\n\tStrong understanding of oilfield tools, consumables, and supply chain cycles.\n\tExperience working with freight forwarders, customs agents, and bonded shipments.\n\n\nKey Competencies:\nTechnical:\n\n\n\tProficient in ERP/logistics software (e.g., SAP, Oracle, Tallyman, Maximo)\n\tKnowledge of Incoterms, freight booking, and trade documentation\n\tFamiliar with warehouse systems, asset tracking, and stock movement procedures\n\tAbility to interpret load charts, rig-up requirements, and lifting plans\n\n\nWorking Conditions:\n\n\n\tLogistics yard or base environment with field exposure.\n\tMay involve shift work, extended hours, or weekend availability.\n\tRequires PPE and compliance with safety regulations in warehouse/yard areas.\n\tMay include travel to port, customs office, or operational sites as needed.\n\n\nSalary\nN500,000 (Five Hundred Thousand Naira p/m)\n\nMethod of Application\nInterested and qualified candidates should their Resume / CV to: recruitment@wendernek.com using the Job Position as the subject of email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Customer Service Intern (NYSC) Job at Dews and Petals Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/customer-service-intern-nysc-job-at-dews-and-petals-limited",
    "pubDate": "Mon, 09 Jun 2025 12:32:26 GMT",
    "source": "JobGurus",
    "keyword": "dews and petals limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Dews and Petals is a premium pest control and cleaning company operating in Abuja, Nigeria. Renowned for delivering expert pest management services, Dews and Petals is committed to creating healthier, pest-free environments through education and tailored solutions. With a strong reputation for excellence, Dews and Petals provides reliable and effective pest control solutions for residential and commercial properties.\n\nWe are recruiting to fill the position below:\n\nJob Position: Customer Service Intern (NYSC)\n\nJob Location: Gwarimpa, Abuja (FCT) \nEmployment Type: Full-time\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tRespond to customer inquiries via phone, email, and social media promptly and professionally\n\tAssist in resolving client complaints and service issues courteously\n\tMaintain accurate records of customer interactions and follow-up actions\n\tSupport the customer service team with administrative and operational tasks\n\tHelp schedule appointments and service requests\n\tProvide general support to clients and ensure excellent service delivery\n\n\nRequirements\n\n\n\tMust be a current NYSC corps member serving in Abuja\n\tStrong communication and interpersonal skills\n\tProficiency in Microsoft Office tools (Word, Excel, etc.)\n\tAbility to multitask and stay organized in a fast-paced environment\n\tPositive attitude and willingness to learn\n\tInterest in customer relations and service-based industries.\n\n\nWhat We Offer\n\n\n\tSalary: N40,000 - N50,000 Monthly.\n\tA friendly, supportive work environment\n\tPractical experience and exposure to real business operations\n\tOpportunity to grow and develop customer service skills\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Human Resources and Admin Assistant Job at Dews and Petals Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/human-resources-and-admin-assistant-job-at-dews-and-petals-limited",
    "pubDate": "Mon, 09 Jun 2025 12:32:26 GMT",
    "source": "JobGurus",
    "keyword": "dews and petals limited",
    "duplicate": false,
    "classifications": [],
    "content": "Dews and Petals is a premium pest control and cleaning company operating in Abuja, Nigeria. Renowned for delivering expert pest management services, Dews and Petals is committed to creating healthier, pest-free environments through education and tailored solutions. With a strong reputation for excellence, Dews and Petals provides reliable and effective pest control solutions for residential and commercial properties.\n\nWe are recruiting to fill the position below:\n\nJob Position: Human Resources and Admin Assistant\n\nJob Location: Gwarimpa, Abuja (FCT) \nEmployment Type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAssist with recruitment activities, including posting job vacancies, screening resumes, scheduling interviews, and onboarding new employees\n\tPrepare employment letters, contracts, and other HR-related documentation\n\tMaintain accurate and up-to-date employee records and HR databases\n\tTrack attendance, leave, and performance appraisal schedules\n\tManage office supplies and ensure timely replenishment of materials and equipment\n\tMaintain filing systems for both HR and administrative documents (digital and physical)\n\tSchedule meetings, prepare agendas, and take minutes when required\n\tCoordinate logistics for office maintenance, facility services, and vendor management\n\tSupport the implementation and enforcement of HR policies and procedures\n\tOrganize and coordinate staff training, development programs, and wellness activities\n\tRespond to employee inquiries regarding HR policies, benefits, and procedures\n\tMaintain confidentiality and handle sensitive employee information with discretion\n\tAssist in planning and executing company events, staff engagements, and meetings\n\tMonitor renewal schedules for service contracts, subscriptions, and licenses\n\tProvide general administrative support to the HR Manager and other departments\n\tContribute to fostering a professional, efficient, and compliant work environment\n\tPerform other related duties as assigned by HR or management.\n\n\nRequirements\n\n\n\tBachelor’s Degree in Human Resources, Business Administration, or a related field\n\t1 - 2 years of experience in HR, administration, or office management (internship experience may be considered)\n\tStrong understanding of HR principles, labor laws, and office procedures\n\tProficient in Microsoft Office Suite (Word, Excel, PowerPoint, Outlook)\n\tExcellent organizational and multitasking skills\n\tStrong verbal and written communication abilities\n\tAbility to handle confidential information with integrity and professionalism\n\tHigh attention to detail and accuracy\n\tPositive attitude and a proactive, problem-solving mindset\n\tAbility to work independently and collaboratively in a team\n\tKnowledge of HR software or tools is an added advantage.\n\n\nBenefits\n\n\n\tCompetitive monthly salary (N100,000 - N150,000)\n\tOpportunities for professional growth and on-the-job learning\n\tExposure to both HR and administrative functions\n\tFriendly and supportive work environment\n\tStaff wellness and engagement programs\n\tHealth Insurance\n\tExperience working with a dynamic team in a growing organization.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Finance Manager Job at Rolad Properties",
    "link": "https://www.jobgurus.com.ng/jobs/view/finance-manager-job-at-rolad-properties",
    "pubDate": "Mon, 09 Jun 2025 12:32:26 GMT",
    "source": "JobGurus",
    "keyword": "rolad properties",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "At Rolad Properties, we are on a global mission to build premium homes and unlock dreams through land schemes, property acquisition, and co-funding opportunities. As the Finance Manager, you will play a vital role in shaping the financial future of our fast-growing real estate firm by identifying strategic investment opportunities, evaluating the financial viability of projects, and driving funding initiatives. Your expertise will guide the business in making informed investment decisions and securing the capital needed to bring high-impact developments to life.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Finance Manager\nJob Location: Gbagada, Lagos\nEmployment Type: Full-time\nDepartment: Finance Department\nReports To: Executive Director & Managing Director\nWork Mode: Hybrid (The first month of resumption is on-site)\n\nJob Overview\n\n\n\tThe Finance Manager will oversee the financial well-being and strategy of our real estate firm.\n\tThis ideal candidate is highly skilled and strategic and plays a crucial role in driving financial efficiency, ensuring sustainable growth, and supporting investment decisions within the organization.\n\tThe finance manager would be responsible for collaborating with key stakeholders to align financial management with the company’s long-term vision\n\n\nJob Description\nKey Responsibilities:\nFinancial Strategy & Leadership:\n\n\n\tCreate and implement financial strategies that align with the organization's business goals.\n\tIdentify and mitigate financial risk while ensuring compliance with regulatory requirements.\n\tChampion financial planning, forecasting, and budgeting process to ensure a comprehensive financial performance.\n\n\nInvestment Management:\n\n\n\tConduct financial due diligence for property acquisitions and developments.\n\tEvaluate potential real estate investments and projects to maximize returns.\n\tManage and sustain relationships with investors, banks, and other financial institutions to secure favorable funding terms.\n\n\nOperational Excellence & Efficiency:\n\n\n\tOversees the day-to-day operations of the department, including accounts, payroll, receivables/payables, and cash flow management.\n\tCollaborate with other departments to align financial objectives with operational strategies.\n\tDevelop key metrics and KPIs to track organizational performance\n\n\nCompliance & Governance:\n\n\n\tEnsure adherence to financial laws, tax regulations, and industry standards.\n\tIntroduce and implement corporate governance best practices to protect company assets and boost investor confidence\n\n\nTeam Leadership:\n\n\n\tProvide learning and development opportunities to ensure the team stays abreast with current trends.\n\tCreate a culture of innovation and collaboration within the department.\n\tSupervise and support the finance team, ensuring efficient operations and providing guidance to enhance their performance\n\n\nQualifications\n\n\n\tBachelor's Degree in Finance, Accounting, Economics, or a related field (Master's or advanced degree is an advantage).\n\t5+ years of progressive experience in financial management\n\tProfessional certifications, such as ACCA, is preferred\n\tStrong analytical skills and ability to leverage data for decision-making.\n\tExpertise in financial planning, investment management, and analysis.\n\tExceptional leadership, communication, collaboration, and stakeholder management skills.\n\tProficiency in advanced Microsoft Excel and financial software.\n\n\nSalary\nN800,000 - N1,000,000 Monthly.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]