[
  {
    "title": "Church Administrator Job at Open Access Consulting Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/church-administrator-job-at-open-access-consulting-limited",
    "pubDate": "Sat, 07 Jun 2025 14:13:05 GMT",
    "source": "JobGurus",
    "keyword": "open access consulting limited",
    "duplicate": false,
    "classifications": [],
    "content": "Open Access Consulting Limited - Our client is a vibrant Pentecostal church with thriving branches in Lagos, Nigeria and Texas, USA. They are committed to spreading the Gospel with excellence and power, building lives through the Word, worship, and service across continents.\n\nThey are seeking spirit-filled, qualified, and God-fearing individuals to join their growing ministry team in the capacity below:\n\nJob Position: Church Administrator\nJob Location: Lagos\n\nJob Role\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tTo oversee the day-to-day administrative operations of the church, ensuring smooth, efficient, and spirit-led service delivery.\n\n\nJob Description\n\n\n\tManage office operations, including scheduling meetings, maintaining records, and handling correspondence.\n\tCoordinate internal communications among departments.\n\tSupervise administrative support staff.\n\tMaintain church membership records, finances, and inventory logs.\n\n\nQualifications\n\n\n\tBachelor's degree in Business Administration, Office Management, or a related field.\n\tCertification in Administrative Management is an added advantage.\n\n\nOther Requirements:\n\n\n\tMature Christian with good knowledge of church operations.\n\tAbility to work discreetly and maintain confidentiality.\n\n\nRequired Skills:\n\n\n\tStrong administrative and organizational skills.\n\tProficiency in Microsoft Office Suite and database management.\n\tExcellent written and oral communication skills.\n\tProblem-solving and multitasking abilities.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: career@openaccessconsult.com using the Job Position as the subject of the mail.\n\nNote: If you have a passion for kingdom work, spiritual integrity, and professional competence, we invite you to apply for the role above.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Sales Representative Job at Starich Recycling Technology Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/sales-representative-job-at-starich-recycling-technology-limited",
    "pubDate": "Sat, 07 Jun 2025 14:13:05 GMT",
    "source": "JobGurus",
    "keyword": "starich recycling technology limited",
    "duplicate": false,
    "classifications": [],
    "content": "Starich Recycling Technology Company Limited, established in 2018 and located in Abia State, Nigeria, is a subsidiary of RSIN Group which entered Africa in 2008. By advanced plastic recycling technology, production equipment and excellent personnel team, Starich has become a leading manufacturer of plastic products, chemical fiber and textile products in Nigeria. Our main products include: chemical fibers, PET bottles, strapping bands, woven bags, mattresses, crawling mats, 4-piece bedding sets (excluding duvets), and more.\n\nWe are recruiting to fill the position below:\n\nJob Position: Sales Representative\n\nJob Location: Zaria, Kaduna\nEmployment Type: Full-time\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Description\n\n\n\tGenerating Leads and Prospecting: Identifying potential customers and qualifying leads.\n\tBuilding Relationships: Establishing and maintaining positive relationships with clients.\n\tPresenting and Demonstrating: Sharing product information and demonstrating how a product or service meets customer needs.\n\tNegotiating and Closing Deals: Negotiating contracts, prices, and terms of sale.\n\tAchieving Sales Targets: Meeting or exceeding individual and team sales goals.\n\tProviding Customer Support: Answering questions, addressing concerns, and providing ongoing support.\n\tTracking and Reporting: Monitoring sales activity and reporting on performance.\n\n\nQualifications\n\n\n\tInterested candidates should possess an HND / Bachelor's Degree with 3-5 years of experience.\n\n\nMethod of Application\nInterested and qualified candidates should send their Applications to: Stellarinternationaljobs@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Business Development & Sales Executive Job at Sttrutt Integrated Services Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/business-development-sales-executive-job-at-sttrutt-integrated-services-limited",
    "pubDate": "Sat, 07 Jun 2025 14:13:05 GMT",
    "source": "JobGurus",
    "keyword": "sttrutt integrated services limited",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance"
    ],
    "content": "Sttrutt Integrated Services Limited is a QHSES consulting firm providing expert advisory, training, auditing, and compliance solutions to businesses in Nigeria and beyond.\n\nWe are recruiting to fill the position below:\n\nJob Position: Business Development & Sales Executive\nJob Location: Lagos\nEmployment Type: Full-time\n\nKey Aims and Objectives\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tIdentify, research and evaluate customer needs and potential clients\n\tDevelop and maintain client relationships\n\tDevelop mutually beneficial proposals\n\tNegotiate contract terms with clients and communicate with stakeholders Monitor project teams to ensure contracts are executed as agreed\n\tDevelop and manage strategic partnerships to grow business\n\tTrack and report on the status of proposal components\n\tGather useful information from customer and competitor data\n\tMake and give presentations to prospective clients on services offered\n\tTrack, identify and add qualified prospects to sales pipeline\n\tConduct ongoing market research\n\tWork with the pricing department to create rate proposals\n\tDrive the end-to-end sales process\n\tPrepare and submit sales contracts\n\tActively seek out new sales opportunities through cold calling, networking, and social media\n\tCreate frequent reviews and reports with sales and financial data\n\tEnsure the availability of stock for sales and demonstrations\n\tParticipate on behalf of the company in exhibitions or conferences\n\tManage social media accounts of SISL to drive content and sales.\n\n\nRequirements and Skills\n\n\n\tProven experience as a Sales Executive or relevant role\n\tProficiency in English\n\tExcellent knowledge of MS Office\n\tThorough understanding of marketing and negotiating techniques\n\tFast learner and a passion for sales\n\tSelf-motivated with a results-driven approach\n\tAptitude in delivering attractive presentations\n\tDegree in Engineering Preferred.\n\n\nRemuneration\n\n\n\tStart up on N100,000.00 monthly gross\n\t3.5% commission on the profit of every closed deal\n\tTo be reviewed after six months, based on performance.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: maryjanekalu86@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]