[
  {
    "title": "Internal Control Officer Job at CasaLavoro Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/internal-control-officer-job-at-casalavoro-limited",
    "pubDate": "Sat, 05 Jul 2025 16:17:51 GMT",
    "source": "JobGurus",
    "keyword": "casalavoro limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "CasaLavoro Limited is a growth-oriented company dedicated to excellence, transparency, and sustainable business practices. We are currently seeking a diligent and detail-oriented Internal Control Officer to strengthen our internal processes and ensure regulatory and financial compliance across all departments.\n\nWe are recruiting to fill the position below:\n\nJob Position: Internal Control Officer\n\nJob Location: 11 Yalinga Street, Wuse 2, Abuja (FCT) \nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Internal Control Officer will be responsible for assessing, monitoring, and improving internal control systems.\n\tThe ideal candidate must have 2–3 years of relevant work experience and must have previously worked in an audit firm.\n\tThis role involves conducting risk assessments, identifying control gaps, and ensuring that operational procedures align with internal policies and regulatory standards.\n\n\nKey Responsibilities\n\n\n\tEvaluate and test internal control systems across departments.\n\tIdentify control gaps, recommend improvements, and monitor remediation.\n\tConduct regular audits and surprise checks to ensure compliance with policies.\n\tReview financial transactions and processes to prevent fraud and errors.\n\tDocument internal control findings and prepare audit reports.\n\tCollaborate with management to develop and update policies and procedures.\n\tMonitor adherence to regulatory standards and suggest necessary adjustments.\n\tConduct training on internal control measures and compliance awareness.\n\tInvestigate irregularities and escalate issues when necessary.\n\n\nRequirements\n\n\n\tBachelor’s Degree in Accounting, Finance, Business Administration, or a related field.\n\t2–3 years of proven work experience in internal control, internal audit, or risk management.\n\tMandatory: Previous experience working in an audit firm.\n\tStrong understanding of accounting principles, financial reporting, and internal control frameworks.\n\tExcellent analytical and problem-solving skills.\n\tHigh level of integrity and professional ethics.\n\tProficient in Microsoft Excel and accounting software (e.g., QuickBooks, Sage, etc.).\n\tGood communication and report-writing skills.\n\n\nWhat We Offer\n\n\n\tCompetitive salary package.\n\tProfessional development and growth opportunities.\n\tSupportive work culture with high ethical standards.\n\tExposure to cross-functional business processes.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and Cover letter to: hr@casalavoro.net using \"Internal Control Officer – Application\" as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Sales Representative Job at Tybitx Services International Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/sales-representative-job-at-tybitx-services-international-limited-1",
    "pubDate": "Sat, 05 Jul 2025 16:17:51 GMT",
    "source": "JobGurus",
    "keyword": "tybitx services international limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Tybitx Services International Limited - Our client, an integrated agro-allied processing company, is recruiting results-driven candidates to drive product sales, expand market share, and build strong relationships with distributors, retailers, and customers in the capacity below:\n\nJob Position: Sales Representative\nJob Location: Lekki, Lagos\nEmployment Type: Full-time\n\nSummary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe role involves ensuring product visibility and availability, identifying and recruiting distributors, monitoring sales performance and market trends, managing inventory and debtors, and resolving customer complaints promptly while meeting and exceeding sales targets.\n\n\nKey Responsibilities\n\n\n\tPromote and sell products to existing and prospective customers.\n\tIdentify, recruit, and maintain relationships with distributors and retailers.\n\tMonitor sales performance, competitor activities, and market trends.\n\tEnsure timely deliveries, stock rotation, and inventory accuracy.\n\tHandle collections and manage debtor accounts.\n\tPrepare and submit regular sales and inventory reports.\n\tResolve customer complaints and report feedback to management.\n\n\nRequirements\n\n\n\tMinimum of OND / HND / B.Sc in a relevant field.\n\tProven sales experience in FMCG or related industry.\n\tStrong negotiation, presentation, and communication skills.\n\tTarget-driven with strong relationship-building abilities.\n\tKnowledge of inventory and sales reporting.\n\tProactive with good market analysis skills.\n\n\nSalary\nN100,000 / Month.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "HVAC Project Manager Job at Tybitx Services International Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/hvac-project-manager-job-at-tybitx-services-international-limited",
    "pubDate": "Sat, 05 Jul 2025 16:17:51 GMT",
    "source": "JobGurus",
    "keyword": "tybitx services international limited",
    "duplicate": false,
    "classifications": [],
    "content": "Tybitx Services International Limited is Nigeria’s Leading HR and Management Consulting Firm. At Tybitx, we provide HR professional services rooted in Transition Management, empowering companies to achieve their goals through innovative strategies that bring incomparable results.\n\nWe are recruiting to fill the position below:\n\nJob Position: HVAC Project Manager\n\nJob Location: Obalende, Lagos\nEmployment Type: Full-time\n\nSummary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a results-driven and organized HVAC Project Manager for a reputable company. You will oversee end-to-end project execution, ensuring high standards of quality, safety, and client satisfaction while optimizing resources and controlling costs.\n\n\nKey Responsibilities\n\n\n\tPlan, coordinate, and supervise all aspects of assigned HVAC projects from initiation to delivery\n\tDevelop and manage project schedules, budgets, and resources\n\tOversee procurement of materials and subcontractor activities\n\tProvide leadership and direction to project teams and technicians\n\tPrepare and present regular project reports to senior management\n\tEnsure compliance with health and safety standards and regulatory requirements\n\tMaintain clear communication with clients, vendors, and internal teams to meet expectations\n\tMonitor project progress, identify and mitigate risks, and resolve issues promptly\n\tSupport continuous improvement initiatives and uphold company values and quality standards\n\n\nRequirements\n\n\n\tB.Sc or HND in Mechanical Engineering, Building Services, or a related field\n\tSolid knowledge of HVAC systems and installations\n\tMinimum 3–5 years of project management experience (preferably in the HVAC or construction industry)\n\tStrong leadership, team management, and negotiation skills\n\tExcellent communication and client-facing abilities\n\tAbility to work under pressure and deliver projects on schedule and within budget\n\tPMP certification or similar is an advantage.\n\n\nSalary\nN500,000 / Month (Negotiable)    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Assistant Showroom Manager Job at Bedmate Furniture",
    "link": "https://www.jobgurus.com.ng/jobs/view/assistant-showroom-manager-job-at-bedmate-furniture",
    "pubDate": "Sat, 05 Jul 2025 16:17:51 GMT",
    "source": "JobGurus",
    "keyword": "bedmate furniture",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Bedmate Furniture, Nigeria's leading furniture company with a rich history spanning over two decades. Since our establishment in 2002, we have been dedicated to providing exceptional furniture solutions to homes, offices, and commercial spaces across the country.\n\nAs a socially responsible company, we strive to make a positive impact on our community and the environment. We adhere to sustainable practices, utilizing eco-friendly materials and minimizing waste in our production processes. Additionally, we actively engage in philanthropic initiatives, supporting local charities and organizations that promote education, healthcare, and social welfare. We have over 11 Showrooms all across Lagos, Abuja.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Assistant Showroom Manager\n\nJob Location: Wuse 2, Abuja (FCT) \nEmployment Type: Full-time\n\nSummary\n\n\n\tThe showroom manager is the direct person in charge of the showroom.\n\tHe/She is mainy responsible for the daily sales, showroom management, product management, staff management, organizatio, motivation, training and has overall responsibility for the management of the showroom.\n\n\nResponsibilties\nSales Management:\n\n\n\tThe sales manager will be reasonably formulate monthly, weekly and daily sales plans under the leadership of the regioanal Assistant Level A, to ensure the completion of sales target.\n\tThe sales target is determined by the sales manager. Sales manager should ask sales representatives about the specific daily sales, and resolve issues in a timely manner, and provide necessary assistance and support, to ensure sales task is completely achieved.\n\tBreak down the monthly sales target assigned by the company into weekly and daily sales, as well as allocating daily sales tasks to each sales person, ensuring everyone has a clear sales target.\n\tMemorize the company's product models and regional product sales \"characteristics\"\n\tHold daily morning meetings, convey the company sales ploicy to the sales representatives and carry out review of previous day sales.\n\tPrepare showroom sales statistics on a weekly basis and check whether the weekly task is completed . Note the gap,existing problems and give suggestions for improvement.\n\tSort out daily forms such as commission application/refund/special offer application forms, and timely submit them to Assistant Level A.\n\tExecute good daily after sales management of the showroom and resolve them in time.If it cannot be resolved, report to the regional manager in time. Carry out daily showroom supervision and management(for example this will cover price tags/product hygiene/employee working conditions,etc.).\n\tComplete other tasks assigned by superior leaders.\n\n\nProduct Management:\n\n\n\tCarry out a good showroom product management(including new product/regular product quality feedback/showroom product retrieval/rationality of showroom product layout/store product inventory,etc.).\n\tEnsure regular feedback,collect information on regional competitors , and feedback information on related product.\n\tRegularly study and master information about new products from the company to ensure a comprehensive understanding of all products.\n\tRegularly check product inventory to ensure that stock is sufficient and orderly managed, avoiding stockouts or overstock and collect and analyze customer feedback on products ,report to the company headquarters in a timely manner, and provide suggestions for improvement.\n\n\nQualifications\n\n\n\tInterested candidates should possess an HND qualification with at least 3 years of work experience.\n\n\nSalary\nN100,000 - N150,000 monthly.\n\nMethod of Application\nInterested and qualified candidates shoud send their CV and cover letter in one document to: markalaribe9@gmail.com and copy recruitmentbedmatefurniture@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Architect Job at Bedmate Furniture Nigeria",
    "link": "https://www.jobgurus.com.ng/jobs/view/architect-job-at-bedmate-furniture-nigeria",
    "pubDate": "Sat, 05 Jul 2025 16:17:51 GMT",
    "source": "JobGurus",
    "keyword": "bedmate furniture nigeria",
    "duplicate": false,
    "classifications": [],
    "content": "Bedmate furniture ranks as one of the best furniture company in Nigeria. Quality is our watchword is makes us rank among the very best furniture company in Nigeria. We led while other furniture company in Nigeria follows our footstep. The BEDMATE furniture company in Nigeria was founded in 2002 to offer Nigerians the very best in furniture products. Our Showrooms display Furniture ranging from Home furniture, dining set, office furniture, etc. in Lagos (Ikeja, Lekki), Abuja, and gradually expanding to other part of the country.\n\nWe are recruiting to fill the position below:\n\nJob Position: Architect\n\nJob Location: Opebi, Lagos\nEmployment Type: Full-time\n\nResponsibilties\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWork together with internal management and 3rd party vendors to achieve best practices and standardization across the brands\n\tManage the company’s corporate prototype designs ensuring design standards are met with an overall focus on reducing production costs\n\tTrack assigned tasks and prioritize completion of tasks accordingly\n\tCreate schematic layouts and elevations in CAD for new products, remodels and renovations\n\tRead and analyse existing blueprints, construction drawings, and plans\n\tWork with external partners including but not limited to Architects, Engineers, Sign Manufactures and Installers, Fixture Contractors and other applicable vendors to bid projects and assess project costs\n\tSupport the Planning team and Project Directors with timelines, scheduling, budgeting, project documentation and project delivery\n\tGenerate reports and checklists as directed\n\tSite visits for as-built measurements and field verification as required\n\tCarry outs task assigned by superiors.\n\n\nRequirements\n\n\n\tDegree in Architecture, Engineering, Design, Project / Construction Management, or related field\n\t3 to 6 years of experience with the production of furniture/engineering drawings\n\tStrong ability to work in CAD software required\n\t3-D modelling software and/or Adobe Creative Suite experience a plus\n\tProficiency in Ms Excel, Word, PowerPoint, and MS Project.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: recruitmentbedmatefurniture@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]