[
  {
    "title": "Chief Operating Officer (COO) Job at Flees Global Services",
    "link": "https://www.jobgurus.com.ng/jobs/view/chief-operating-officer-coo-job-at-flees-global-services",
    "pubDate": "Wed, 11 Jun 2025 11:13:51 GMT",
    "source": "JobGurus",
    "keyword": "flees global services",
    "duplicate": false,
    "classifications": [
      "Software Engineering"
    ],
    "content": "Flees Global Services (FGS) Limited is a leading Oil and Gas Company in Port Harcourt and we are recruiting to fill the position below:\n\nJob Position: Chief Operating Officer (COO)\n\nJob Location: Port Harcourt, Rivers\nEmployment Type: Full-time\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDesign and execute a 5-year EPCIM growth strategy aligned with Nigeria’s energy transition goals\n\tDrive market positioning to secure high-value EPCIM contracts (e.g., NNPC, TotalEnergies, Shell).\n\tOversee the integration of engineering, procurement, construction, installation, and maintenance functions to ensure cohesive project delivery and local content mandates (NCDMB Act).\n\tLead the positioning of the company in securing new EPCIM contracts through strategic business development and excellent project execution.\n\tIdentify opportunities for growth, operational improvements, and innovation within the EPCIM framework to maintain competitive advantage.\n\tIdentify targeted prospective client’s projects/budgets for the next one year and pursue at least two new business opportunities that must yield desired results per month\n\tOversee the development of engineering solutions and innovations that enhance project efficiency, cost-effectiveness, and safety.\n\tEnsure the company remains at the forefront of engineering job delivery by promoting the adoption of best practices and new technologies Oversee engineering design compliance with API, ASME, ISO 9001, and SON standards.\n\tLead R&D initiatives to reduce project costs by 15% through value engineering.\n\tProvide leadership in engineering design and execution processes, ensuring that all technical specifications and dispositions meet industry standards, project requirements, and regulatory compliance.\n\tDevelop a workplan and implement a growth strategy to expand our corporate fortunes/revenue drive Develop a prospect pipeline targeting 2+ new business opportunities monthly.\n\tProvide leadership in engineering design and execution processes, ensuring that all technical specifications and dispositions meet industry standards, project requirements, and regulatory compliance.\n\tOversee the development of engineering solutions and innovations that enhance project efficiency, cost-effectiveness, and safety.\n\tEnsure the company remains at the forefront of engineering job delivery by promoting the adoption of best practices and new technologies Oversee engineering design compliance with API, ASME, ISO 9001, and SON standards.\n\tLead R&D initiatives to reduce project costs by 15% through value engineering.\n\n\nQualifications & Experience\n\n\n\tBachelor’s Degree in Engineering, (An MBA or Master’s Degree Engineering Management is a plus.)\n\tMinimum of 20 - 25 years of experience as Chief Operating Officer or General Manager in the oil and gas or energy sector.\n\tMust be NSE or COREN certified\n\n\nKey Competencies:\n\n\n\tStrategic thinking and commercial awareness\n\tStrong industry network and client engagement skills\n\tTechnical understanding of energy products and services\n\tAbility to work independently and collaboratively\n\tGoal-oriented and highly motivated\n\tStrong Leadership and interpersonal relationship (networking skill)\n\tStrong negotiation skill\n\tStrong budget/financial management and reporting skill\n\tStrong business development skill\n\tStrong analytical and problem-solving abilities.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV in PDF to: robertituboala@gmail.com or info@fleesglobal.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Logistics Officer Job at Goonite (NG) Hygiene Product FZE",
    "link": "https://www.jobgurus.com.ng/jobs/view/logistics-officer-job-at-goonite-ng-hygiene-product-fze",
    "pubDate": "Wed, 11 Jun 2025 11:13:51 GMT",
    "source": "JobGurus",
    "keyword": "goonite (ng) hygiene product fze",
    "duplicate": false,
    "classifications": [],
    "content": "Goonite (NG) Hygiene Product FZE, a major manufacturer and distributor company in the FMCG Distribution Sector for premium brands in the Health and Personal Care category like Lebrace Diaper and Besense Sanitary Pads meeting household needs in a vastly diversified demography.\n\nWe are recruiting to fill the position below:\n\nJob Position: Logistics Officer\nJob Location: Ibeju-Lekki, Lagos\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWill be responsible for onboarding credible transporters with high emphasis on cost reduction/control.\n\tUnderstand the types and qualities of trucks required for shipment.\n\tWill be responsible for following up with transporters regarding truck bookings and transit issues.\n\tMust be abreast of the rate for various locations.\n\tCollaborating with Sales Managers to optimize shipping routes for efficient results.\n\tMust ensure that the respective expected time of arrivals are met.\n\tMust ensure trucks arrivals are timely and trucks offload without shortages\n\tMust have a good understanding of the parameters that affect rate fluctuation.\n\tProvide excellent customer service to internal and external stakeholders, addressing any concerns or questions related to shipments.\n\n\nRequirements\n\n\n\tHND or BSc in any related field.\n\tMust have 1 - 2 Years of working experience in same role.\n\tMust have worked in the FMCG Industry Preferably Diaper & Sanitary Pad companies.\n\tExcellent communication and analytical skills.\n\tProficient with Microsoft Office Suite or related software.\n\tMust reside within Ibeju-Lekki and it immediate environs.\n\n\nMethod of Application\nInterested and qualified candidates should send their updated CV to: estherajideofficial@gmail.com using the Job Position as the subject of the email.\n\nNote: Only qualified candidates who lives in the above location will be contacted.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Openings at Prince OJ Global Services Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-prince-oj-global-services-limited",
    "pubDate": "Wed, 11 Jun 2025 11:13:51 GMT",
    "source": "JobGurus",
    "keyword": "prince oj global services limited",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "Prince OJ Global Services Limited is a fast consumer goods company incorporated in Nigeria with head office in Onitsha Anambra state, We deal on importation and distribution of top quality wines and spirits, spices, tomato, spaghetti, oil, margarine, baking powder, liquid milk and many more...\n\nWe are recruiting to fill the following positions below:\n\n1.) Marketer (Male / Female)\n\nJob Location: Onitsha, Anambra\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tOverseeing all marketing-related activities within a territory\n\tExecuting marketing strategies to align with business goals, including brand building, market penetration, and revenue generation.\n\tDevelop and implement marketing campaigns across various channels, including digital, social media, content, and traditional marketing.\n\tWork jointly with the internal and external stakeholders, including sales teams, other departments, and external agencies.\n\tTracking and analyzing the effectiveness of marketing efforts and make data-driven decisions.\n\tAnalyzing market trends, competitive landscapes, and customer needs to identify opportunities and develop strategies.\n\tResponsible for analyzing sales numbers in comparison to the marketing budget in order to find the profit margin and which campaigns were most effective\n\tResearch competitors to stay current with similar products or services on the market\n\tWork with the sales team to develop successful strategies and campaigns that attract new customers and keep current clients.\n\n\nRequirements\n\n\n\tBachelor's degree or HND in a releted field\n\tMust have completed NYSC\n\tMust be computer literate\n\tAbility to market new products and achieve a success rate in a mapped territory\n\tProven experience in the position above, preferably in FMCG Company\n\tStrong leadership skills and the ability to effectively manage a team\n\tExcellent written and verbal communication skills\n\tGoal-oriented mindset and a driven personality\n\tSelf-motivated and results-driven with a strong work ethic\n\tAbility to work independently and as part of a team\n\tProficiency in Microsoft Office Suite.\n\n\nSalary\n\n\n\tN70,000 Monthly\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: careers@ojglobalservices.com using the Job Position as the subject of the email.\n\n \n\n \n\n2.) Experienced Auditor\n\nJob Location: Onitsha, Anambra\nEmployment Type: Full-time\n\nResponsibilities\n\n\n\tCarry out audit exercise as may be directed by head audit.\n\tConduct physical stock count and also monitor stock report on a daily basis on the whatsapp plat form.\n\tReview of closing and opening balance of stock to ascertain if they correspond.\n\tReview of daily sales to find out if the price of each product correspond with the price sold to the customer\n\tCheck cash sales to ensure that they are lodged into the bank or submitted to cashier in the case of head office branches.\n\tConfirm transfer from the customer into the various bank account to ensure they are correct and accurate as in the bank statement.\n\tReview of expenses to ensure that they are duly approved and that disbursements are in line with the company policy.\n\tPrepare and present audit reports on their findings to the management\n\tMonitor on a daily basis stock report and cash payment.\n\tVerify and reconcile all bank statement and sign off\n\n\nRequirements\n\n\n\tBachelor's Degree or HND in a related field.\n\tProven experience in the position above.\n\tMust have completed NYSC.\n\tMust have accounting background.\n\tSelf-motivated and results-driven with a strong work ethic.\n\tStrong leadership skills and the ability to effectively manage a team.\n\tExcellent written and verbal communication skills.\n\tGoal-oriented mindset and a driven personality.\n\tAbility to work independently and as part of a team.\n\tProficiency in Microsoft Office Suite.\n\n\nSalary\nN100,000 / Month.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: careers@ojglobalservices.com using the Job Position as the subject of the email.\n\n \n\n \n\n3.) Inventory Officer (Male or Female)\n\nJob Location: Onitsha, Anambra\nEmployment Type: Full-time\n\nResponsibilities\n\n\n\tRecord and keep accurate information on stock\n\tOverseeing daily/weekly/monthly updating of stock movement\n\tEnsure that warehouse staff are up to date with their records (book)\n\tPrompt distribution of products to branches and outlets as requested.\n\tEnsure there is no damage of products arising from personal handling.\n\tProvide stock reports as and at when needed\n\tEnsure periodic stock-taking and submission of stock reconciliation report\n\tSafeguard the warehouses\n\tMonitoring of sales of products through branch stock report before releasing products\n\tMonitor stock level to avoid over stocking or shortages\n\tEnsure products are picked up for delivery to branches as at when due.\n\tTraining - Provide training and understanding to various departments regarding stock control.\n\tOther ad hoc projects relating to stock and system management.\n\n\nRequirements\n\n\n\tMinimum of a Degree in a related field\n\tAt least 1 year of experience\n\tMust be computer literate\n\tExcellent communication skills, both oral and verbal\n\tGreat interpersonal skills\n\tCustomer service and relationship-building skills\n\tTeamworking skills\n\tStrong attention to details\n\tAnalytical Skills.\n\n\nSalary\nN70,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: careers@ojglobalservices.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Creative Assistant (Content Creator / Social Media Manager) Job at Classic Organics",
    "link": "https://www.jobgurus.com.ng/jobs/view/creative-assistant-content-creator-social-media-manager-job-at-classic-organics",
    "pubDate": "Wed, 11 Jun 2025 11:13:51 GMT",
    "source": "JobGurus",
    "keyword": "classic organics",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Classic Organics is a premium skincare and hair care brand dedicated to crafting exceptional products for children, adults, and men. We combine elegance with efficacy, offering premium solutions that nurture, protect, and enhance. Our range embodies the perfect harmony of science and nature, elevating everyday care into an indulgent experience.\n\nWe are recruiting to fill the position below:\n\nJob Position: Creative Assistant (Content Creator / Social Media Manager)\nJob Location: Lekki, Lagos\nEmployment Type: Full-time\n\nJob Overview\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a highly skilled and creative Content Creator to join our team.\n\tThe ideal candidate will be responsible for developing and managing engaging content, staying ahead of industry trends, and driving our brand’s presence on social media platforms.\n\tThis role demands a mix of creativity, strategic thinking, and expertise in social media management.\n\n\nKey Responsibilities\n\n\n\tDevelop and execute creative content strategies that align with the brand’s goals.\n\tCreate and schedule high-quality posts across all social media platforms.\n\tMonitor and respond to comments across platforms to foster engagement and community growth (excluding DMs).\n\tAnalyze social media performance and provide actionable insights to improve engagement.\n\tCollaborate with the team to brainstorm and execute innovative content ideas, including photo and video shoots.\n\tStay updated on industry trends and incorporate them into content creation.\n\tWork closely with other departments to ensure cohesive branding and messaging.\n\tEnsure all content is aligned with the company’s vision and standards of excellence.\n\n\nRequirements\n\n\n\tProven experience as a Content Creator or Social Media Manager.\n\tStrong knowledge of major social media platforms (Instagram, Facebook, Twitter, TikTok).\n\tAbility to create visually appealing and compelling content.\n\tExcellent communication and writing skills.\n\tA deep understanding of content trends and digital marketing strategies.\n\tExperience with social media analytics tools.\n\tCreative thinking and the ability to generate original ideas.\n\tHighly organized, with the ability to manage multiple projects simultaneously.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and Portfolio to: therecruit.classic@gmail.com using \"Application for Content Creator & Social Media Manager Position\" as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "General Manager Job at Fadac Resources and Services Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/general-manager-job-at-fadac-resources-and-services-limited-2",
    "pubDate": "Wed, 11 Jun 2025 11:13:51 GMT",
    "source": "JobGurus",
    "keyword": "fadac resources and services limited",
    "duplicate": false,
    "classifications": [],
    "content": "Fadac Resources and Services Limited - Our client, a leading firm dedicated to delivering innovative, high-quality solutions in the construction and engineering sectors, is recruiting to fill the position below:\n\nJob Position: General Manager\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a detail-oriented, thorough, and organized leader to oversee OMR’s daily operations and manage the business aspects of the company.\n\tIn this position, you will play a key role reviewing and implementing operational procedures, assisting departmental heads and managing company finances.\n\n\nResponsibilities\n\n\n\tSupervising staff performance across all levels.\n\tReleasing requested funds for company expenditure.\n\tReviewing periodic reports and adjusting operations to better meet company goals.\n\tConducting periodic employee appraisals.\n\tOverseeing procurement and staff recruitment.\n\tOverseeing staff training and development programs.\n\tMaking professional decisions on behalf of the company at all times.\n\tManage the company’s personnel, physical and financial resources to improve the company’s bottom line.\n\n\nRequirements\n\n\n\tBachelor’s degree in business administration, accounting, or related field preferred.\n\tMinimum eight (8) years of experience in Leadership/Managerial roles.\n\tProficient computer skills, including Microsoft Office Suite (Word, PowerPoint, Outlook, and Excel).\n\tAbility to analyze problems and strategize for better solutions.\n\tAbility to negotiate, establish, and administer contracts.\n\tExcellent verbal and written communication skills.\n\tAbility to multitask, prioritize, and manage time efficiently.\n\tAccurate and precise attention to detail.\n\tGoal-oriented, organized team player.\n\tThe Ideal candidate should be a Female and within26-34 years of age. Candidates outside this bracket would not be considered..\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: ebuka.o@fadacresources.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]