[
  {
    "title": "Front Desk Officer / Receptionist Job at Funtay Global Resources Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/front-desk-officer-receptionist-job-at-funtay-global-resources-limited",
    "pubDate": "Thu, 26 Jun 2025 16:19:36 GMT",
    "source": "JobGurus",
    "keyword": "funtay global resources limited",
    "duplicate": false,
    "classifications": [],
    "content": "Funtay Group is an Energy company involved in the Upstream, Midstream, and Downstream sector of the oil and gas industry.\n\nWe are recruiting to fill the position below:\n\nJob Position: Front Desk Officer / Receptionist\nJob Location: Lekki Phase 1, Lagos\nEmployment Type: Full-time\n\nAbout Us\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a Front Desk/Receptionist with 2 - 5 Years experience to join our team in Lagos. \n\tThe ideal candidate is a reliable and detail-oriented Front Desk/Receptionist who will manage front office operations while supporting administrative, facility management, and HR-related duties in a fast-paced environment.\n\n\nJob Responsibilities\n\n\n\tGreet and assist visitors, clients, and staff with professionalism.\n\tManage phone calls, emails, and general correspondence efficiently.\n\tCoordinate office supplies, deliveries, and facility-related tasks such as repairs, maintenance, and vendor follow-ups.\n\tAssist with administrative tasks including filing, data entry, and document preparation.\n\tOrganize and maintain schedules, appointments, and meeting logistics.\n\tMaintain a clean and organized front desk and office environment.\n\tSupport basic HR functions such as coordinating interviews, onboarding documentation, and staff records.\n\tProvide direct administrative support to senior management as needed.\n\n\nRequirements\n\n\n\tCandidates should possess relevant qualifications with experience.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Fleet Officer Job at White Soul Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/fleet-officer-job-at-white-soul-group-1",
    "pubDate": "Thu, 26 Jun 2025 16:19:36 GMT",
    "source": "JobGurus",
    "keyword": "white soul group",
    "duplicate": false,
    "classifications": [],
    "content": "White Soul Group is a leading provider of logistics solutions and vehicle sales and after-sales services, dedicated to delivering excellence in every aspect of our business. With a commitment to innovation, integrity, and customer satisfaction, we strive to exceed expectations and become your trusted partner in logistics and automobile needs.\n\nWe are recruiting to fill the position below:\n\nJob Position: Fleet Officer\n\nJob Location: Cross River \nEmployment Type: Full-time\n\nDuties and Responsibilities\nOperations\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tMange loading and scheduling of loads\n\tFollow up with drivers for prompt delivery and return\n\tManage diesel allocation for accuracy\n\tConfirm every delivery immediately after offloading to prevent losses and escalate every underdelivery\n\tReport all diversion requests and follow-up with prompt communication to driver and clients\n\tEmbark on rescue operations where required.\n\tPreparation of reports such as daily final offloading point reporting and weekly final offloading point reports amongst others.\n\tSupport activities and other tasks as assigned by the team lead\n\tEscalate all offloading delays for timely offloading\n\tOTD/TAT monitoring and management to ensure timely delivery and turnaround of driver\n\tMaintenance delay reporting to clients in the overall improvement of our OTD score\n\tMonthly truck accessories reporting with report to the management including recommendations of drivers with missing accessories\n\tManage drivers database, communicate absences of drivers, to drivers admin unit. Submit well compiled and up to date monthly active drivers’ list to the\n\n\nSalary\nN150,000 - N200,000 / month. \n\nMethod of Application\nInterested and qualified candidates should send their CV to: careers@whitesoulgroup.org using the Job Position and Location as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Internal Control Officer Job at Ascentech Services Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/internal-control-officer-job-at-ascentech-services-limited-1",
    "pubDate": "Thu, 26 Jun 2025 16:19:36 GMT",
    "source": "JobGurus",
    "keyword": "ascentech services limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Ascentech Services Limited is a full-fledged Human Resource Solution Provider incorporated in 2013 with its Head Office in Lagos, Nigeria. We are committed to forging long-term partnerships with our clients by creating and delivering robust and flexible services that address the changing needs of their business.\n\nWe are recruiting to fill the position below:\n\nJob Position: Internal Control Officer\n\nJob Location: Lekki, Lagos\nEmployment Type: Full-time\nDepartment: Financial Control\nReports To: Head of Financial Control\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are hiring a smart, detail-oriented Internal Control Officer with 6 months to 1 year of experience in accounting or finance.\n\tThe role involves supporting the internal control team to ensure compliance with policies, accurate financial records, and effective risk management.\n\n\nKey Responsibilities\n\n\n\tMonitor daily transactions for accuracy and compliance\n\tAssist in identifying control gaps and process improvements\n\tSupport implementation of audit findings and internal reviews\n\tHelp maintain proper records and audit documentation\n\tCollaborate with teams to ensure control standards are followed\n\n\nRequirements\n\n\n\tBSc in Accounting, Finance, or a related field\n\t6 months – 1 year of experience in accounting, audit, or internal control\n\tStrong Excel skills and basic understanding of internal controls\n\tAttention to detail and good communication skills\n\tHigh integrity and eagerness to learn.\n\n\nSalary\nN150,000/month\n\nMethod of Application\nInterested and qualified candidates should send their CV to: cv@ascentech.com.ng using the \"Internal Control Officer\" as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Executive Assistant Job at Resource Intermediaries Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/executive-assistant-job-at-resource-intermediaries-limited-1",
    "pubDate": "Thu, 26 Jun 2025 16:19:36 GMT",
    "source": "JobGurus",
    "keyword": "resource intermediaries limited",
    "duplicate": false,
    "classifications": [],
    "content": "Resource Intermediaries Limited is a distinguished HR Outsourcing and Consulting firm, specializing in customized recruitment solutions tailored to meet the unique needs of companies. Our proficiency extends across a wide spectrum of positions, ranging from top-tier executives to entry-level positions, covering technical, contractual, semi-skilled, and unskilled roles. Additionally, we are recognized experts in providing a range of services including Fumigation Services, Janitorial Services, Payroll Administration, Expatriate Management, Manpower Planning, Executive Training, and more.\n\nWe are recruiting to fill the position below:\n\nJob Position: Executive Assistant\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\nIndustry: Supply Chain\n\nPosition Summary\n\n\n\tProvides high-level executive support to senior leadership with a strong emphasis on digital coordination, advanced IT proficiency, and professional discretion.\n\tThis role demands a tech-savvy individual capable of managing complex schedules, handling confidential communications, and executing administrative tasks using modern business technologies with accuracy, speed, and intelligence.\n\n\nCore Responsibilities\n\n\n\tManage executive calendars, coordinate high-level meetings, and set reminders using digital planning tools(e.g., Outlook, Teams, Google Calendar).\n\tPrepare well-structured PowerPoint presentations, dashboards (Power BI), reports, and business documentation.\n\tDraft, edit, and manage internal and external communications using professional email tools and collaborative platforms.\n\tManage expense reports, petty cash reconciliation, and invoice submissions using Excel and accounting platforms.\n\tOversee meeting coordination, agenda preparation, and virtual meeting setup using Zoom, Teams, or Google Meet.\n\tCoordinate travel arrangements, accommodation, and logistics using online booking systems.\n\tImplement and maintain a digital filing and document retrieval system for efficient office organization.\n\tServe as the executive liaison across departments, ensuring prompt IT-enabled task execution.\n\tProtect highly confidential information with discretion, demonstrating ethical IT practices in data handling.\n\n\nMinimum Requirements\n\n\n\tBachelor’s Degree in Business Administration or any relevant field from a recognized institution.\n\t1+ year of experience in an administrative or executive support role (or a strong internship background).\n\tDemonstrated IT proficiency is non-negotiable.\n\tAdvanced skills in Microsoft Office Suite—Word, Excel, PowerPoint, and Outlook.\n\tFamiliarity with Power BI, virtual meeting software, and cloud-based file management systems.\n\tStrong writing and verbal communication abilities with a professional tone.\n\tExcellent time management, multitasking, and organizational skills.\n\tHigh attention to detail and capacity to operate independently under minimal supervision.\n\n\nPreferred Candidate Profile:\n\n\n\tFemale candidate preferred, in line with internal role balancing considerations.\n\tStrong interpersonal presence with an ability to manage tasks diplomatically.\n\tEager to grow within a fast-paced, digitally inclined business environment.\n\tExhibits initiative, emotional intelligence, and solution-oriented thinking.\n\n\nMonthly Net Salary\nN200,000 (Net) / month.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Vacancies at The Borough Lagos",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancies-at-the-borough-lagos-3",
    "pubDate": "Thu, 26 Jun 2025 16:19:36 GMT",
    "source": "JobGurus",
    "keyword": "the borough lagos",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "The Borough Lagos - Nestled in the heart of Lagos, our boutique hotel offers unparalleled luxury and service. Whether you’re in Lagos working, relocating or traveling with your family, our boutique hotel will delight you with plush amenities with upscale décor. The Borough Lagos is already the trusted choice for the world’s leading corporations, international organizations, and discerning private clients who want to relax in the stylish comfort and feel of their own home while on a long or short stay in the Lagos area.\n\nWe are recruiting to fill the following positions below:\n\n1.) Floor Manager\n\nJob Location: Lagos, Nigeria\nJob type: Full Time\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Description\n\n\n\tWe are seeking to hire a proactive, organized, and customer-focused floor manager to oversee daily operations on the floor, ensure excellent customer service, and support team performance.\n\tThe Floor Manager will supervise staff, resolve issues efficiently, and help drive sales and excellent service.\n\n\nResponsibilities\n\n\n\tSupervise daily floor operations to ensure smooth and efficient performance.\n\tAddress and resolve customer complaints and inquiries professionally.\n\tMonitor inventory levels and communicate with stock or inventory teams.\n\tAssist in scheduling, delegating tasks, and ensuring shift coverage.\n\tMaintain cleanliness, organization, and visual standards on the floor.\n\tEnsure adherence to company policies, safety procedures, and operational guidelines.\n\tPrepare shift reports and provide input on staff evaluations.\n\n\nRequirements\n\n\n\tProven experience in a supervisory or floor management role \n\tStrong leadership and excellent interpersonal skills.\n\tAbility to think quickly, troubleshoot issues, and make sound decisions\n\tAbility to work in a fast-paced, team-oriented environment.\n\tAttention to details, ensuring standards are met, from cleanliness to service quality.\n\n\nClick here to apply online\n\n \n\n2.) Kitchen Manager\n\nJob Location: Lagos, Nigeria\nJob type: Full Time\n\nJob Description\n\n\n\tWe are looking to hire an experienced chef to oversee the day-to-day operations of our kitchen.\n\tThe ideal candidate will ensure food quality, manage kitchen staff, maintain hygiene standards, lead stock counts, and control food costs while delivering a safe and productive work environment. \n\n\nResponsibilities\n\n\n\tCoordinate kitchen staff and organize the production and preparation of food.\n\tEnsure all dishes are prepared according to recipes, presentation standards, and safety guidelines.\n\tManage kitchen budgets, including labor costs, food costs, and waste reduction.\n\tHandle equipment maintenance and cleanliness of all kitchen areas.\n\tMonitor inventory levels and place orders to avoid shortages or overstocking.\n\tAssist in menu development, costing, and seasonal updates with the head chef or executive chef.\n\tWork closely with both team members and other staff members to ensure smooth service.\n\n\nRequirements\n\n\n\tProven experience as a kitchen manager, sous chef, or similar role.\n\tIn-depth understanding of food safety practices and kitchen operations.\n\tAbility to work in a fast-paced environment.\n\tStrong leadership, communication, and problem-solving skills.\n\tKnowledge of different cooking techniques and cuisines.\n\n\nClick here to apply online\n\n \n\n \n\n3.) Waitress\n\nJob Location: Lekki, Lagos\nJob type: Full Time\n\nJob Brief\n\n\n\tWe are looking for a skilled Waitress to take orders and deliver food and beverages to our customers.\n\tThe right waitress uplifts the dining experience for customers. We are looking for someone who will have the patience, personality, and perseverance to thrive in this role.\n\tWaitress responsibilities include greeting and serving customers, providing detailed information on menus, multi-tasking various front-of-the-house duties, and collecting the bill. If you are able to perform well in fast-paced environments, we’d like to meet you.\n\n\nResponsibilities\n\n\n\tGreet and escort customers to their tables\n\tPresent menu and provide detailed information when asked (e.g. about portions, ingredients or potential food allergies)\n\tPrepare tables by setting up linens, silverware and glasses\n\tTake accurate food and drink orders using POS ordering software, order  slips or by memorising\n\tCommunicate order details to the Kitchen Staff\n\tServe food and drink orders \n\tInform customers about the day’s specials \n\tOffer menu recommendations upon request\n\tUp-sell additional products when appropriate\n\tArrange table settings and maintain a tidy dining area \n\tDeliver checks and collect bill payments\n\tCarry dirty plates, glasses and silverware to kitchen for cleaning\n\tFollow all relevant health department regulations \n\tProvide excellent customer service to guests \n\n\nRequirements\n\n\n\tCandidates should possess relevant qualifications with 2 years of waitressing experience \n\tBasic math skills\n\tAttentiveness and patience for customers\n\tExcellent presentation skills\n\tStrong organisational and multitasking skills, with the ability to perform well in a fast-paced environment\n\tActive listening and effective communication skills\n\tTeam spirit\n\tFlexibility to work in shifts\n\tHigh school diploma; food safety training is a plus\n\n\nClick here to apply online    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]