[
  {
    "title": "Job Openings at Siemens",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-siemens-1",
    "pubDate": "Thu, 28 Aug 2025 18:46:58 GMT",
    "source": "JobGurus",
    "keyword": "siemens",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Siemens is an Integrated Technology Company. The business activities of our Energy, Health care, Industry and Infrastructure & Cities Sectors have enabled us to capture leading market and technology positions worldwide. Technological excellence, innovation, quality, reliability and international focus have been our hallmarks for 165 years, making us strong and linking us to our shareholders, employees and customers as a partner of trust.\n\nWe are recruiting to fill the following positions below:\n\n1.) Field Service Engineer - Centrifugal Compressor Mechanical\n     \n\n            \n    \n\n\n\nJob Location: Port Harcourt, Rivers\nJob type: Full-time\nOrganization: Gas Services\nBusiness Unit: Service Europe & Africa\n\nAbout the Job\n\n\n\tThis position serves as a company technical and administrative representative, resident engineer and deals with customer service assignment including on-site preventive maintenance and inspection service work, call-out services and commissioning activities on centrifugal gas compressors products line and packages.\n\n\nResponsibilities\nHow You’ll Make An Impact:\n\n\n\tUnderstands and aligns with Siemens and customer safety policies and procedures.\n\tEnsure alignment with the work permit system.\n\tEnsure safe site and practices. Participate by attending general safety and toolbox safety meetings.\n\tSuggest safety improvements.\n\tMust be able to recognize abnormal sounds vibrations and potential safety problems at inception and take appropriate action to prevent a serious safety hazard that could develop to equipment damage or loss of production.\n\tProvide timely and daily reports to the relevant manager on- going projects or daily work. Stay ahead of pending work and personnel required to complete the projects. Ensure that vital parts are available and submit materials requisitions when required.\n\tAdequate strategy of engaging operations in releasing equipment in a timely manner for maintenance.\n\tWill be, required to assist in a technical manner with the operations and maintenance crew in any area if the workload exceeds the number of personnel available.\n\tWill apply good judgment when analyzing problems.\n\tTackle problems with little or no supervision in a timely manner and at a nominal cost.\n\tMaster all procedures and available options of identifying sources of information and technical advice.\n\tWill have enough product knowledge to repair and adjust minor mechanical/electrical components/systems and will be capable of reading applicable drawings and technical manuals.\n\tSupervise maintenance services or installation support to ensure they are carried out within company policy, manufacturers’ recommendations and in a safe manner.\n\tEnsure major interventions are planned, completed on time and within commercial orders. \n\n\nRequirements\nWhat You Bring:\n\n\n\tWill possess a technical qualification e.g., an Engineering Degree, preferably in Mechanical Engineering.\n\tWith 10 years of working experience in a related industry.\n\tHigher experience/skill levels may balance lower academic qualifications, and vice versa.\n\tWill have served on recognized centrifugal compressors product line and/or preferably having a long period of continuous occupation on Dresser Rand Datum compressors as a mechanical engineer.\n\tExperience in an onshore/offshore environment.\n\tA strong rotating equipment background will be an asset.\n\tFamiliarity with gas compression theory, package systems and operation will be an asset.\n\tWill hold and maintain a full offshore medical and survival certificate to suit all areas of assignment.\n\n\nClick here to apply online\n\n \n\n \n\n2.) Technical Support Engineer\n\nJob Location: Lagos\nJob type: Full-time\nOrganization: Gas Services\nBusiness Unit: Service Europe & Africa\n\nResponsibilities\nHow You’ll Make An Impact:\n\n\n\tProvide technical support expertise for control systems, package, electrical and mechanical issues.\n\tDevelop work-packs and procedures for outages and projects.\n\tAnalyze problems and provide professional guidance in resolving issues.\n\tOccasionally travel to provide onsite technical support.\n\tEnsure compliance with company and customer EHS policies.\n\tProvide 1st line support to field service engineers during shutdowns and projects.\n\tGenerate the creation and preparation of work-packs for field service engineers.\n\tProvide 24-hour support functionality via an out-of-hours support hotline.\n\tExecutes processes for report approvals and design changes.\n\tMaintain technical libraries, share-drives, and knowledge databases.\n\tInteract with the service engineering departments to optimize procedures.\n\tMultiple travels to customers and jobs sites.\n\n\nRequirements\nWhat You Bring:\n\n\n\tUniversity degree in Electrical & Electronics, Electro-Mechanical, or Mechanical Engineering (2:2 minimum) or equivalent.\n\tOver 10 years of experience in rotating equipment and engine systems or equivalent field experience.\n\tWorking towards or has COREN status.\n\tA master’s degree in engineering will be an added advantage.\n\tElectrical, Controls Systems and Mechanical engineering skills with over 10 years of working experience on industrial gas turbines. Packages\n\tProven expertise in rotating equipment and electrical switching/control systems (HV, MV, LV).\n\tProficient in MS Office tools, with strong commercial awareness and graduate-level engineering competency.\n\tExperienced in decision-making, strategic development, and delivering specialist tasks on time and within budget.\n\tSkilled in troubleshooting, developing technical policies, and generating new business opportunities.\n\tEffective communicator, liaising with internal and external customers, and providing technical support and training.\n\tCapable of diagnosing complex technical issues and coordinating various technical activities under pressure\n\n\nBenefits\n\n\n\tWorking with a global team\n\tOpportunities to work on and lead a variety of innovative projects\n\tPossibility to take over further tasks within the company\n\tSupportive work culture\n\tMedical benefits\n\tRemote/Flexible work\n\tTime off/Paid holidays\n\tParental leave\n\tContinual learning through the Learn@Siemens-Energy platform\n\te-Learning\n\tMentorship\n\tCoaching.\n\n\nClick here to apply online\n\n \n\n \n\n3.) Commercial Project Manager\n\nJob Location: Lagos, Nigeria\nEmployment type: Full-Time\nOrganization: SE CFO\nBusiness Unit: Transformation of Industry\n\nAbout the Team\n\n\n\tOur Transformation of Industry division is decarbonizing the industrial sector. Increasing electrification and  efficiency are key and demand for green H2 and derivative fuels will rise.\n\tWe enable decarbonization of the  industrial sector and the transition to sustainable processes, building on a strong industrial customer base, a global network, diverse technologies, and integrated execution capabilities.\n\n\nAbout the Role\nA Snapshot of Your Day:\n\n\n\tOur Compression Service Organization is looking for a highly driven, self-motivated Commercial Expert to join our team.\n\tIn this role, you will be responsible for all commercial aspects and project financials for Service Orders and acting as finance partner to our sales and project management organization.\n\tThe position requires working in a dynamic environment, where financial expertise is brought to the bid, proposal, and contract execution processes.\n\n\nResponsibilities\nHow You’ll Make an Impact:\n\n\n\tReview, analyze and negotiate financial and commercial components of internal/external customer proposals and Master Frame Agreements.\n\tEnsure the accuracy of the cost and pricing calculation during contract negotiations together with the Sales Lead & Project Manager\n\tWork in collaboration with the project managers to provide commercial support for assigned projects according to PM@SE guidelines and contractual agreements.\n\tResponsible for all commercial aspects and project financials including monthly revenue recognition, forecasting, risk and opportunity management, lessons learned, and optimizing profit margins & cash flow.\n\tEnsure compliance with accounting rules (IFRS 15 & local GAAP) Legal, Compliance, Tax, Foreign Exchange and business models.\n\tPrepare and present regular project status reports to senior management and stakeholders, highlighting progress, challenges, and solutions.\n\tAbility for travel when necessary/planned up to 10%; must qualify for travel within region of employment.\n\n\nRequirements\nWhat You Bring:\n\n\n\tCandidates should possess a Bachelor’s Degree in Finance, Business Administration, Accounting or equivalent experience is required.\n\t3+ years of professional experience in Business Administration or in Finance, preferably with experience in Project Execution\n\tKnowledge of US GAAP/IFRS, percentage of completion (PoC) accounting, and strong skills with Microsoft Office applications and SAP are required.\n\tExcellent communication skills with the ability to work independently and in a team-oriented environment.\n\tAbility to multi-task and work under pressure to meet deadlines is required.\n\n\nRewards/Benefits\n\n\n\tWorking with a global team\n\tPossibility of taking over further tasks within the company\n\tSupportive work culture\n\tContinual learning through the Learn@Siemens-Energy platform\n\tCoaching and Mentorship\n\tOpen feedback culture\n\n\nClick here to apply online    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Executive Assistant to the Managing Director Job at DO-II Designs",
    "link": "https://www.jobgurus.com.ng/jobs/view/executive-assistant-to-the-managing-director-job-at-do-ii-designs",
    "pubDate": "Thu, 28 Aug 2025 18:46:58 GMT",
    "source": "JobGurus",
    "keyword": "do-ii designs",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance"
    ],
    "content": "(function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){\n        (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),\n        m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)\n    })(window,document,'script','//www.google-analytics.com/analytics.js','ga');\n\n    ga('create', 'UA-43112273-1', 'jobgurus.com.ng');\n    ga('send', 'pageview');\n\n\n\n\n    \n        \n    Home\n    Jobs\n    Free Aptitude Test Practice\n    Employer? Post a Job\n            Register\n        Sign in\n        Contact us\n    \n\n    \n\n        \n    \n        \n\n            \n\n                \n\n                    \n                        Toggle navigation\n                        \n                        \n                        \n                    \n\n                    \n                \n            \n\n            \n                \n\n\tJobs\n\tJob Seekers\n\tAptitude Test\n\tScholarships\n\n            \n\n            \n                \n\n                                            Register\n                        Sign in\n                    \n                    Employer? Post a Job\n                \n            \n\n        \n\n    \n\n        \n        \n            \n            \n                 \n    \n                    \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n        \n     \n\n\n                            \n                    \n        \n                        CLICK HERE TO JOIN OUR WHATSAPP CHANNEL \n                    \n    \n\n    \n                                \n                    \n\n                        \n                            \n                        \n\n                        \n                            \n                                Any Specialization\n                                                                    Accounting / Audit / Finance\n                                                                    Administration/ Office/ Operations\n                                                                    Advertising/ Social Media/ Marketing/ PR\n                                                                    Agriculture / Agro Allied\n                                                                    Analyst/ Quality Control\n                                                                    Automotive/ Car Services\n                                                                    Aviation / Airline\n                                                                    Banking / Insurance\n                                                                    Building Design / Architecture\n                                                                    Construction / Mining\n                                                                    Consulting / Business Strategy/ Planning\n                                                                    Craftsmen / Artisans\n                                                                    Creatives (Arts, Design, Fashion)\n                                                                    Customer Service\n                                                                    Domestic / Janitorial Services\n                                                                    Driving / Haulage\n                                                                    Education / Teaching / Training\n                                                                    Engineering / Technical\n                                                                    Executive / Management\n                                                                    Freelance / Data Entry\n                                                                    Government Agencies / Public Sector\n                                                                    Graduates / Freshers\n                                                                    Grants /  Scholarships\n                                                                    Hospitality / Food Services\n                                                                    HSE / Safety Management\n                                                                    Human Resources / Recruitment\n                                                                    Information Technology / ICT\n                                                                    Internship/ Industrial Training\n                                                                    Legal / Law\n                                                                    Logistics / Transportation/ Supply\n                                                                    Manufacturing / Production\n                                                                    Maritime Services / Shipping\n                                                                    Media / Art / Entertainment\n                                                                    Medical/ Healthcare / Pharmaceutical\n                                                                    Military / Para-Military\n                                                                    NGO / Community Services\n                                                                    Oil & Gas / Energy\n                                                                    Procurement/ Purchasing\n                                                                    Project Management\n                                                                    Real Estate / Property / Surveying\n                                                                    Research / Survey\n                                                                    Risk Management / Compliance\n                                                                    Sales / Business Development\n                                                                    Secretarial / PA\n                                                                    Security / Intelligence\n                                                                    Software/ Programming / Web development\n                                                                    Sports / Fitness\n                                                                    Supply Chain/ Store\n                                                                    Technicians\n                                                                    Telecommunications\n                                                                    Tourism / Travels\n                                                                    Vocational Trade and Services\n                                                            \n                        \n\n                        \n                            \n                                Any Work Level\n                                                                    Entry Level (Trainee)\n                                                                    Executive (Director, Head of Dept)\n                                                                    Experienced (Non-Manager)\n                                                                    Internship\n                                                                    Manager (Staff Supervisor)\n                                                                    Senior Executive (MD, CEO, COO)\n                                                                    Vocational (Skilled/Unskilled Labour)\n                                                            \n                        \n\n                        \n                            \n                                 Search\n                            \n                        \n                    \n                \n                            \n            \n\n\n\n\n\n\n            \n\n                \n                                        \n                    \n                                        \n                    \n                    \n\n                    \n                        \n                        \n\n{\n  \"@context\": \"https://schema.org\",\n  \"@type\": \"JobPosting\",\n  \"title\": \"Executive Assistant to the Managing Director\",\n  \"description\": \"DO-II Designs is an interior design firm located in Lagos, Nigeria, dedicated to creating lasting impressions through design. At the core of our approach is a passionate team of designers who share a common vision: crafting timeless and beautiful designs that resonate with our clients, whether they are seeking to transform their residences or commercial spaces.\n\nWe are recruiting to fill the position below:\n\nJob Position: Executive Assistant to the Managing Director\n\nJob Location:&amp;nbsp;Victoria Island, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe are seeking a highly organized and proactive Executive Assistant to the Managing Director to provide top-level administrative and operational support. This role requires exceptional organizational skills, attention to detail, and discretion in handling sensitive information.\n\tYou will act as a key liaison between the MD, internal teams, and external stakeholders to ensure smooth operations and effective communication within the Sales, Marketing &amp;amp; Projects department.\n\n\nKey Responsibilities\n\n\n\tManage and maintain the MD&amp;rsquo;s schedule, appointments, and meetings.\n\tOrganize meetings, prepare agendas, take minutes, and ensure follow-up on action points.\n\tHandle correspondence, emails, and calls on behalf of the MD.\n\tAct as the primary liaison between the MD and internal/external stakeholders.\n\tSupport communication and collaboration between Sales, Marketing &amp;amp; Projects and other departments.\n\tMaintain accurate records, files, and confidential information.\n\tProvide oversight support on operational activities as directed by the MD.\n\tIdentify opportunities to streamline workflows and improve efficiency.\n\n\nRequirements\n\n\n\tB.Sc. in Business Administration or related field.\n\tMinimum of 3 years&amp;rsquo; experience as an Administrative or Executive Assistant.\n\tStrong organizational, time-management, and multitasking skills.\n\tExcellent communication (written &amp;amp; verbal) and interpersonal skills.\n\tHigh level of discretion and professionalism in handling confidential matters.\n\tAbility to work independently and thrive in a fast-paced environment.\n\tProficiency in Microsoft Office and other relevant software.\n\n\nSalary\nN200,000 / Month.\n\nMethod of Application\nInterested and qualified candidates should send their Application to:&amp;nbsp;careers@doii-designs.com&amp;nbsp;using &amp;ldquo;Executive Assistant to the MD&amp;rdquo; as the subject of the email.\",\n  \"datePosted\": \"2025-08-28\",\n  \"validThrough\": \"2025-10-01\",\n  \"employmentType\": \"Full-Time\",\n  \"hiringOrganization\": {\n    \"@type\": \"Organization\",\n    \"name\": \"DO-II Designs\"\n    \n  },\n  \"jobLocation\": {\n    \"@type\": \"Place\",\n    \"address\": {\n      \"@type\": \"PostalAddress\",\n       \"postalCode\": \". \",\n       \"addressRegion\": \". \",\n       \"streetAddress\": \". \",\n      \"addressLocality\": \"Lagos\",\n      \"addressCountry\": \"NG\"\n     \n      \n    }\n  },\n  \"identifier\": {\n    \"@type\": \"PropertyValue\",\n    \"name\": \"\",\n    \"value\": \"186528\"\n  },\n  \"baseSalary\": {\n    \"@type\": \"MonetaryAmount\",\n    \"currency\": \"NGN\",\n    \"value\": {\n      \"@type\": \"QuantitativeValue\",\n      \"minValue\": 150000,\n      \"maxValue\": 250000,\n      \"unitText\": \"MONTH\"\n    }\n  }\n}\n\n\n\nExecutive Assistant to the Managing Director Job at DO-II Designs\n\n\n\n\n        \n    \n\n        \n        DO-II Designs is an interior design firm located in Lagos, Nigeria, dedicated to creating lasting impressions through design. At the core of our approach is a passionate team of designers who share a common vision: crafting timeless and beautiful designs that resonate with our clients, whether they are seeking to transform their residences or commercial spaces.\n\nWe are recruiting to fill the position below:\n\nJob Position: Executive Assistant to the Managing Director\n\nJob Location: Victoria Island, Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n            \n    \n\n\n\n\n\tWe are seeking a highly organized and proactive Executive Assistant to the Managing Director to provide top-level administrative and operational support. This role requires exceptional organizational skills, attention to detail, and discretion in handling sensitive information.\n\tYou will act as a key liaison between the MD, internal teams, and external stakeholders to ensure smooth operations and effective communication within the Sales, Marketing & Projects department.\n\n\nKey Responsibilities\n\n\n\tManage and maintain the MD’s schedule, appointments, and meetings.\n\tOrganize meetings, prepare agendas, take minutes, and ensure follow-up on action points.\n\tHandle correspondence, emails, and calls on behalf of the MD.\n\tAct as the primary liaison between the MD and internal/external stakeholders.\n\tSupport communication and collaboration between Sales, Marketing & Projects and other departments.\n\tMaintain accurate records, files, and confidential information.\n\tProvide oversight support on operational activities as directed by the MD.\n\tIdentify opportunities to streamline workflows and improve efficiency.\n\n\nRequirements\n\n\n\tB.Sc. in Business Administration or related field.\n\tMinimum of 3 years’ experience as an Administrative or Executive Assistant.\n\tStrong organizational, time-management, and multitasking skills.\n\tExcellent communication (written & verbal) and interpersonal skills.\n\tHigh level of discretion and professionalism in handling confidential matters.\n\tAbility to work independently and thrive in a fast-paced environment.\n\tProficiency in Microsoft Office and other relevant software.\n\n\nSalary\nN200,000 / Month.\n\nMethod of Application\nInterested and qualified candidates should send their Application to: careers@doii-designs.com using “Executive Assistant to the MD” as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n\n    \n    \n\n\n\n\n        \n        \n\n\n\n\n   \n\n\n    \n        Similar Jobs\n    \n\n    \n        \n                        Job Vacancies at CVM Career Company\n                        Executive Assistant Job at TeamAce Limited\n                        HR & Admin Manager Job at Dangote Group\n                        Documentation Officer Job at Shalina Healthcare\n                        General Manager, Buka Job at Prixair Group\n                        Virtual Assistant Job at Crescita Solutions\n                        Executive Assistant to the CEO & Business Director Job at Duob Recruitment\n                        Administrative Cadre Job at Federal University Dutse (FUD)\n                        IT Admin Officer Job at Clenn and Peak Co\n                        Admin / Front Desk Officer Job at Neveah Limited\n                    \n    \n\n\n\n                        \n                    \n\n                    \n                        \n\n\n\n    \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n\n\n\n\n\n          \n\n\n    \n\n        Hottest Jobs\n\n        \n        \n            \n\n                Job Openings at Nocturnus Security Limited\n\n               \n            \n        \n            \n\n                Human Resources Assistant Job at US Embassy\n\n               \n            \n        \n            \n\n                Job Openings at Lily hospitals Limited\n\n               \n            \n        \n            \n\n                Job Openings at Interswstik Nigeria Limited\n\n               \n            \n        \n            \n\n                Job Openings at MMT Consults\n\n               \n            \n        \n            \n\n                Job Vacancies at ViveluxeAesthetics\n\n               \n            \n        \n            \n\n                Job Openings at Dunn and Braxton Limited\n\n               \n            \n        \n            \n\n                Job Openings at Lafarge Africa Plc\n\n               \n            \n        \n            \n\n                Job Vacancies at SEID HQ\n\n               \n            \n        \n            \n\n                Job Openings  at T.O.N Corporate Services\n\n               \n            \n        \n        \n\n    \n\n\n\n\n        \n        \n   \n\n\n                    \n                            \n            \n        \n        \n        \n\n        \n\n    \n\n        \n\n            \n\n                \n\n                    Job Seekers\n\n                    \n\n                        Search for Jobs\n                         Featured Jobs\n                         Jobs by Specialization\n                         Jobs by Industry\n                         Jobs by Location\n                         \n                        Companies Currently Hiring\n\n                        Upload CV\n\n                        Free Aptitude Test Practice\n                        \n                        Scholarships and Financial Aid\n\n                        Testimonies\n                    \n\n                \n\n                \n\n                    Employers\n\n                    \n\n                        Post A Job\n\n                        Search Resumes/Profiles\n\n                        Create Employer Account\n\n                        Advertise\n\n                        Pricing\n\n                    \n\n                \n\n                \n\n                    Tools & Resources\n\n                    \n\n                        Contact us\n                        \n                        Our Blog\n\n                        Job XML/RSS Feeds\n \n                        Free Aptitude Test Practice\n\n                        Bank Details\n\n                        FAQ & Support\n\n                    \n\n                \n\n                \n\n                    Connect with us\n\n                    \n\n                        \n\n                            \n\n                            \n\n                        \n\n                        \n\n                            \n\n                            \n\n                        \n\n                \n\n                        \n\n                            \n\n                            \n\n                        \n\n                    \n\n\n\n                    \n\n                        Customer Care\n\n                        09134259221 \n\n                        (9am - 5pm) weekdays\n\n                         info [at] jobgurus.com.ng\n\n                    \n\n\n\n                \n\n            \n\n        \n\n    \n\n\n\n    \n\n        \n\n\n\n            \n\n                Privacy Policy\n\n                Terms & Conditions\n\n                Sitemap\n                \n                About us\n\n            \n\n\n\n            Copyright © 2025 Jobgurus.com.ng - Latest Jobs in Nigeria 2025. All right reserved.",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Vacancies at BIC",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancies-at-bic",
    "pubDate": "Thu, 28 Aug 2025 18:46:58 GMT",
    "source": "JobGurus",
    "keyword": "bic",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance"
    ],
    "content": "BIC® products are known and appreciated all over the world for their quality, their affordability and ease of use. The ballpoint pen, the pocket lighter, the one-piece shaver are all part of the daily lives of millions of consumers. These products make BIC® one of the best known international brands, present in 3.2 million retail outlets, in more than 160 countries. As we explore the tremendous opportunities ahead, we have a need for dedicated and dynamic employees to help build our team.\n\nWe are recruiting to fill the position below:\n\n1.) Sales Director / Head of Sales\n\nJob Location: Lagos\n\nJob Summary\nLead Business Development Function:\n     \n\n            \n    \n\n\n\n\n\tManage, Mentor and support national sales team to drive customer acquisition and ensure consistent volume & distribution growth\n\tDevelop a pool of multi-skilled and high potential candidates for future expansion.\n\tConsistently analyze the business environment and market trends in the geography of responsibility (Nigeria) to develop the BIC brand penetration and market-share within the assigned geography.\n\tSales Performance & Commercial Strategy:\n\tAchieve target volume and revenue goals through effective sales management and strategic account development.\n\tDeliver sales operational excellence in Nigeria by category, region, channel and customers through an aligned business plan\n\tGrow business partnership with the local distributors in the regions to find innovative and efficient ways to expand distribution for BIC products\n\tIdentify and harness business potential and opportunities in new geographies, products, channels and customers.\n\tReporting & Analytics:\n\tProvide regular performance reports to the General Manager, including updates on key business metrics, customer acquisition metrics and long-term growth forecasts.\n\n\nFunctional Role:\n\n\n\tResponsible for the growth of LSNL/BIC business in Nigeria\n\tPeople Development and capability building\n\tDevelop a business plan for BIC customers in assigned geography\n\n\nMain Responsibilities / Tasks\n\n\n\tAchieve LSNL/BIC business objective for total country; Sales Target (Volume and Value) and aligned Business Development initiatives\n\tDevelop Business Plan for Nigeria and the Joint Business Plan (JBP) for each customer in the territory.\n\tJBP: regularly review with the Customers, their performance and contribution in line with Joint Business Review template.\n\tDevelop new sales opportunities within assigned geography (Nigeria).\n\tCommunicate business priorities to customers and ensure realization of Marketing objective in the country.\n\tEnsure structure and due process in the generation of sales orders and ensure prompt cash collection payment in line with AR objectives.\n\tEffective liaison between customers with the relevant stakeholders (Finance, Supply Chain, Marketing and Manufacturing) to guarantee volume growth and customer satisfaction.\n\tCreate and manage a database of all customers, Traditional Trade, Corporate and Modern Trade Customers with the relevant personnel\n\tEnsure price and distribution compliance in the market\n\n\nMarket Intelligence:\n\n\n\t\n\tRegular field visits to understand and analyse local market trends for each product category (Stationery, Shavers, Lighters, and Other Products)\n\t\n\t\n\tScope of the analysis: Distribution network, Customer analysis, BIC positioning, Competition analysis (price, product, distribution, promotion), Anti-counterfeiting surveillance, etc.\n\t\n\n\nBusiness Development:\n\n\n\tDevelop and support local distributors\n\tTrain and support local sales team: product knowledge, field visit\n\tRespond to and follow up sales enquiries & orders\n\tPlan and prioritize personal sales activities and customer/prospect contact\n\tLead and manage the distributor relationship with Key Accounts\n\tFollow up implementation of agreed marketing plans in close cooperation with BIC Marketing Manager\n\tIn Market Sales (IMS) analysis\n\n\nKey Performance Indicators:\n\n\n\tAchieve sales targets (volume and value)\n\tNumber of new customers and channel execution in white spot areas\n\tFrequency of orders and cash collection\n\tService level (speed of delivery)\n\tStrong Numeric and Weighted Distribution and retail coverage (plus new channels)\n\n\nRequirements\n\n\n\tRelevant experience in sales and business development functions especially within FMCG sector\n\tPerfect knowledge and use of Microsoft operating system especially Power-Point & Excel\n\tBusiness and results oriented with proven communication & negotiation skills\n\tProven Commercial Expertise: demonstrated ability to lead and grow business development function with a track record in customer management, relationship building and distribution expansion.\n\tStrong leadership capabilities with experience managing a team of sales managers, mentoring and driving team performance\n\tHighly adaptable with the ability to work in a fast-paced, dynamic environment, taking initiative and energizing others.\n\tAdvanced understanding of commercial metrics and business development strategies, with experience in driving distribution & market share growth.\n\n\nClick here to apply online\n\nNote\n\n\n\tBIC is an Equal Opportunity Employer. We strongly commit to hiring people with different backgrounds and experiences to help us build better products, make better decisions, and better serve our customers.\n\tWe do not discriminate based upon race, religion, color, national origin, gender, sexual orientation, veteran status, disability status, or similar characteristics.\n\tAll employment is decided based on qualifications, merit, and business need.\n\tBIC is not seeking assistance or accepting unsolicited resumes from search firms for this employment opportunity.\n\tRegardless of past practice, all resumes submitted by search firms to any team member at BIC via email, or directly to a BIC team member in any form without a valid written search agreement in place for that position will be deemed the sole property of BIC, and no fee will be paid in the event the candidate is hired by BIC as a result of the referral or through other means.\n\n\n \n\n2.) Manager, Direct Procurement - Middle East and Africa\n\nJob Location: Sagamu, Ogun\n\nJob Description\n\n\n\tThe Sourcing Execution Manager is responsible for the implementation of the sourcing strategy and for the execution of the sourcing activities and events, as well as for smooth and compliant contracting implementation supporting the overall business and the awarding Tenders’ stage.\n\tThe SE Manager must execute the respective sourcing activities for assigned categories in close collaboration with entire P&PE team with focus within the MEA region.\n\tHe / She should support cost optimization for direct and indirect spend categories, sustain or improve quality and delivery, maintain or reduce risk in the supply chain.\n\n\nResponsibilities\n\n\n\tImplement Regional sourcing execution strategy, collaborating with the supply managers team, and manage the development and accomplishment  of team KPIs\n\tExecute RfX, use full data, analytics and Reco for Supplier Selection to Supply Management, Develop, launch auction results , execute tendering Process (with Supplier, Business) and ensure smooth supplier on-boarding process (prior any RfX in case of new awarded suppliers)\n\tIdentify potential suppliers, monitor, evaluate and communicate performance, develop and manage long-term supplier relationships that enhance capabilities\n\tSupport the negotiation and implementation of supply agreements, by working with cross-functional stakeholders and suppliers to reach agreement on optimal contract terms and conditions\n\tLead sourcing execution activities for assigned categories and within agreed thresholds\n\tReview industry leading commodity cost indicators and publications to drive competitive costing and mitigate cost associated risk in collaboration with supply management team.\n\tManage communications with suppliers regarding compliance requirements and adherence to business and regulatory guidelines.\n\tExecute spot bids triggered by operational procurement processes in case it is required, and support is needed\n\n\nKey Result Areas (KRA)\n\n\n\tSourcing strategy execution\n\tSupply base analysis\n\tSupplier prequalification assessment\n\tReport with eRfX consolidated outcomes\n\tExecute light tenders\n\n\nKey Performance indicators (KPI)\n\n\n\tCustomer satisfaction improvement\n\tProcess cycle time\n\tSpend via SE module in B4B (Ivalua)\n\tTender process’ savings\n\tAutomation degree\n\tProductivity\n\n\nStakeholders:\n\n\n\tInternal: Finance/ Legal & Compliance/ Supply Managers / Factory managers/ Business Partners in close collaboration\n\tExternal: Suppliers\n\n\nRequirements\n\n\n\tBachelor's or Master's Degree in Engineering, Supply chain / Procurement or Business administration.\n\t5+ years of relevant experience in direct procurement of raw materials sourcing\n\tExperience in preparing tenders for direct sourcing\n\tAgile, ability to deal with ambiguity and complex situations\n\tAbility to work cross-functionally across Middle east and Africa\n\tGood communication skills\n\n\nWhat do we offer\n\n\n\tWorking for an international FMCG leader with iconic brands\n\tA great team of highly motivated and enthusiastic people\n\tMany opportunities for growth within a global organization\n\tCompetitive salary package + corporate benefits \n\n\nClick here to apply online\n\nNote\n\n\n\tBIC is an Equal Opportunity Employer. We strongly commit to hiring people with different backgrounds and experiences to help us build better products, make better decisions, and better serve our customers.\n\tWe do not discriminate based upon race, religion, color, national origin, gender, sexual orientation, veteran status, disability status, or similar characteristics.\n\tAll employment is decided based on qualifications, merit, and business need.\n\tBIC is not seeking assistance or accepting unsolicited resumes from search firms for this employment opportunity.\n\tRegardless of past practice, all resumes submitted by search firms to any team member at BIC via email, or directly to a BIC team member in any form without a valid written search agreement in place for that position will be deemed the sole property of BIC, and no fee will be paid in the event the candidate is hired by BIC as a result of the referral or through other means.\n\n\n \n\n3.) Area Sales Representative\n\nJob Location: Jigawa\n\nMain Responsibilities / Tasks\n\n\n\tGenerate sales order and ensure delivery of products in the assigned sales areas and outlets\n\tEfficient retail redistribution of all LSNL/BIC products and effective coverage of relevant outlets in the assigned sales areas\n\tRegularly review of performance with the regional managers and customers in line with agreed target.\n\tDevelop coverage Plan for the territory.\n\tSeek new sales opportunities within designated sales areas.\n\tFlawless implementation of SFA and other projects in sales areas.\n\tFlawless promotion execution and POSM deployment\n\n\nKey Performance Indicators\n\n\n\tAchieving sales targets; Volume and Value\n\tAchieves coverage plan and number of new outlets listing\n\tFrequency of orders and cash collection\n\tSpeed to shelf and high impact visibility\n\tStrong Numeric and Weighted Distribution of LSNL/BIC products in region.\n\n\nComplex Criteria:\nProfessional skills:\n\n\n\tR - Business and results oriented with proven negotiation skills\n\tR - Able to identify new sales opportunities\n\tD - Understand needs of customers and provide solution lead\n\tR - Hard working, rigorous, well organized and able to work autonomously\n\tR - Ability to complete assigned task within a short period of time\n\tD - Analytic, accurate and quick interpretation of figures\n\n\nPersonal skills:\n\n\n\tR - A self-starter, working under their own initiative... and a completer/finisher\n\tR - Ability to analyze and provide clear recommendations\n\tR - Good communication skills (writing & verbal)\n\tR - Build strong relationships with both key external and internal customers\n\tR - Energy and passion for achievement of own commitments and delivering company objectives\n\tD - Able to influence and persuade others to take a specific course of action\n\n\nClick here to apply online\n\nNote\n\n\n\tBIC is an Equal Opportunity Employer. We strongly commit to hiring people with different backgrounds and experiences to help us build better products, make better decisions, and better serve our customers.\n\tWe do not discriminate based upon race, religion, color, national origin, gender, sexual orientation, veteran status, disability status, or similar characteristics. All employment is decided based on qualifications, merit, and business need.\n\tBIC is not seeking assistance or accepting unsolicited resumes from search firms for this employment opportunity.\n\tRegardless of past practice, all resumes submitted by search firms to any team member at BIC via email, or directly to a BIC team member in any form without a valid written search agreement in place for that position will be deemed the sole property of BIC, and no fee will be paid in the event the candidate is hired by BIC as a result of the referral or through other means.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Vacancies at CVM Career Company",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancies-at-cvm-career-company-1",
    "pubDate": "Thu, 28 Aug 2025 18:46:58 GMT",
    "source": "JobGurus",
    "keyword": "cvm career company",
    "duplicate": false,
    "classifications": [],
    "content": "CVM Career Company (A career consulting company) - We help professionals like you use their career stories to land job interviews by writing functional CV and Resumes and we also provide them with tools to navigate the world of work through our various coaching services.\n\nWe are recruiting to fill the following positions below:\n\n1.) Executive Assistant to the COO\n\nJob Location: Redemption Camp, Ogun\n\nSummary\n     \n\n            \n    \n\n\n\n\n\tRedeemer’s Health Village is seeking a highly organized, proactive, and discreet Executive Assistant to provide direct administrative and operational support to the Chief Operating Officer (COO).\n\tThe ideal candidate will be detail-oriented, resourceful, and able to thrive in a dynamic healthcare environment.\n\n\nKey Responsibilities\n\n\n\tManage the COO’s calendars, schedules, appointments, and meeting logistics.\n\tDraft, review, and manage reports, presentations, correspondence, and other documents on behalf of the COO.\n\tCoordinate travel arrangements, events, and stakeholder engagements.\n\tServe as a communication link between the COO, staff, and external partners.\n\tMonitor project deadlines, follow-ups, and ensure smooth execution of strategic initiatives.\n\tMaintain confidentiality and exercise discretion in handling sensitive information.\n\tProvide operational support to ensure the COO’s office functions efficiently.\n\n\nRequirements\n\n\n\tBachelor’s degree in Business Administration, Management, or a related field.\n\t3–5 years of proven experience as an Executive Assistant, preferably in healthcare or a fast-paced environment.\n\tExcellent organizational, time management, and multitasking skills.\n\tStrong written and verbal communication abilities.\n\tHigh level of professionalism, discretion, and interpersonal skills.\n\tAbility to work under pressure while managing multiple priorities.\n\n\nApplication Closing Date: 4th September, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: careers@redeemershealthvillage.org using the Job Position as the subject of the email.\n\n \n\n2.) Operations Officer\n\nJob Locations: Lagos and Ogun\nOrganization: Redeemer’s Health Village (RHV)\n\nKey Responsibilities\n\n\n\tOversee day-to-day operational activities within clinical and support units.\n\tMonitor compliance with healthcare standards, organizational policies, and procedures.\n\tCoordinate logistics, procurement, and management of medical consumables and equipment.\n\tWork closely with clinical teams to ensure smooth patient flow and service delivery.\n\tAssist in data collection, analysis, and preparation of operational reports.\n\tSupport cross-functional teams in achieving departmental and organizational goals.\n\n\nRequirements\n\n\n\tBachelor’s degree in Nursing, Health Administration, Operations\n\t2–4 years of relevant experience in healthcare operations or administration.\n\tManagement, or a related clinical/health field.\n\tStrong understanding of hospital processes, patient care workflows, and resource management.\n\tExcellent problem-solving, organizational, and communication skills.\n\tProficiency in Microsoft Office/Excel for reporting and analysis.\n\tAbility to work independently while collaborating effectively with clinical and non-clinical teams.\n\n\nApplication Closing Date: 5th September, 2025. \n\nMethod of Application\n\nInterested and qualified candidates should send their CV to: careers@redeemershealthvillage.org using the Job Position as the subject of the email.\n\n \n\n \n\n3.) Pharmacist (NYSC)\n\nJob Location: Redemption Camp, Ogun\n\nJob Summary\n\n\n\tWe are seeking a committed and enthusiastic NYSC Corps Member to serve as a Pharmacist during their service year.\n\tThis opportunity provides hands-on experience in patient care, pharmaceutical operations, and community health programs.\n\n\nKey Responsibilities\n\n\n\tDispense medications and provide patient counseling\n\tMonitor and manage pharmaceutical inventory\n\tParticipate in health education and outreach initiatives\n\tEnsure compliance with regulatory standards\n\tCollaborate with healthcare professionals to deliver quality care\n\n\nRequirements\n\n\n\tBachelor’s degree in Pharmacy (B.Pharm or PharmD)\n\tCurrently serving or posted to Ogun State under NYSC\n\tStrong communication and organizational skills\n\tPassion for healthcare and community service\n\tAbility to work independently and within a team.\n\n\nApplication Closing Date: 29th August, 2025. \n\nMethod of Applcation\nInterested and qualified candidates should send their CV and a brief cover letter to: cvmakeover.cv@gmail.com using the Job Position as the subject of the email.\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Openings at Nemitt Pharmaceuticals Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-nemitt-pharmaceuticals-limited",
    "pubDate": "Thu, 28 Aug 2025 18:46:58 GMT",
    "source": "JobGurus",
    "keyword": "nemitt pharmaceuticals limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Nemitt Pharmaceuticals Limited is an indigenous pharmaceutical company incorporated in July 1988 as a fully capitalized limited liability company with RC no 116 088 to among other activities, engage in the wholesale of Pharmaceutical products. Nemitt Pharmaceuticals Limited was born out of the dire need for an alternative to the hitherto existing chaotic distribution in the pharmaceutical supply chain. with the goal of addressing the gaps in the distribution value chain.\n\nWe are recruiting to fill the following positions below:\n\n1.) Warehouse Support Officer\n\nJob Location: Surulere, Lagos\nEmployment Type: Full-time\n\nJob Description\n     \n\n            \n    \n\n\n\n\n\tWarehouse support staff are responsible for the day-to-day operations of a warehouse.\n\tThis includes receiving and storing goods, picking and packing orders, and shelving products.\n\tWarehouse support staff must be able to work independently and as part of a team.\n\tThey must also be able to follow instructions and work safely in a fast-paced environment.\n\n\nResponsibilities\n\n\n\tReceive, upload, and shelf supplies\n\tPrepare and complete orders for delivery or pickup according to schedule (load, pack, wrap, label, ship)\n\tReceive and process warehouse stock products (pick, unload, label, store)\n\tKeep a clean and safe working environment and optimize space utilization\n\tReport any discrepancies\n\tPerform stock-related duties like returning, packing, and labelling\n\tInspect the delivery for discrepancies or damage\n\tReport damaged or short-dated inventories for record-keeping and reimbursement\n\tRotate stock and dispose of surplus and expired quantities\n\tCommunicate and cooperate with supervisors and coworkers\n\tFollow quality service standards and comply with procedures, rules, and regulations.\n\n\nQualification & Requirements\n\n\n\tMinimum of OND Qualification\n\t1 year of proven working experience as a Warehouse worker\n\tFamiliarity with modern warehousing practices\n\tMen for gender balance\n\tGood stamina and the ability to lift heavy objects\n\tGood organisational and time management skills.\n\tCandidates must live close to Surulere or Ojuelegba, orenvironment with proximity. This is very important.\n\n\nSalary\nN110,000 monthly.\n\nApplication Closing Date: 25th September, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hrnemitt@gmail.com using the Job Position as the subject of the email.\n\n \n\n \n\n2.) Warehouse Assistant\n\nJob Location: Surulere, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe are seeking a dedicated and organized Warehouse Assistant to join our team.\n\tAs a Warehouse assistant, you will be responsible for managing inventory, overseeing stock levels, and ensuring the smooth operation of our store.\n\tThe ideal candidate will have excellent organizational and problem-solving skills, attention to detail, and the ability to work independently in a fast-paced environment.\n\n\nJob Description\n\n\n\tReplenish supply inventories following company guidelines.\n\tMaintain a neat, clean, and safe working environment.\n\tManage the store layout.\n\tKeep a record of the inventory issued.\n\tReceive, upload, and shelf all supplies.\n\tReport damaged inventories for record-keeping and reimbursement\n\tRotate stock and dispose of surplus and expired quantities\n\tPerform stock-related duties like returning, packing, and labelling\n\tInspect deliveryfor discrepancies or damage.\n\tKeep an organised allocation of inventory placed in the warehouse and store\n\tCross-verify the monthly report at the end of each month\n\tEnsure proper completion of documentation to place an order and make a purchase.\n\n\nRequirements\n\n\n\tInterested candidates should possess a minimum of OND, HND with 1 year of work experience.\n\tOrganized and punctual.\n\tPrior experience in retail would be advantageous.\n\tGood verbal and written communication skills.\n\tPhysical stamina and the ability to lift and move cartons\n\tProficient in Microsoft Office.\n\tProximity to Ojuelegba is very important. ( Candidate residingaround Ojuelegba, Yaba, Ebute Metta, Apapa, Ajegunle, and environs ).\n\n\nSalary\nN100,000 - N120,000 / month.\n\nApplication Closing Date: 18th September, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hrnemitt@gmail.com using the Job Position as the subject of the email.\n\n \n\n \n\n3.) Sales Officer\n\nJob Location: Surulere, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tA Pharmaceutical wholesale distributor is looking for a competitive retail Sales Assistant to help customers identify products, process customer lists, and help purchase products.\n\tDuties include selling, restocking, and merchandising.\n\tThe goal is to provide high-class customer service and to increase the company’s growth and revenue through sales maximisation.\n\n\nResponsibilities\n\n\n\tWelcome and greet customers\n\tManage point-of-sale processes, picking, and invoicing\n\tDeveloping and sustaining long-lasting relationships with customers.\n\tProvide customers with information about products\n\tEnsure high levels of customer satisfaction through excellent sales service\n\tDeveloping in-depth knowledge of company products.\n\tAnswering customers' questions and escalating complex issues to the relevant departments as needed.\n\tMaintaining an accurate record of all sales, customer appointments, and customer complaints.\n\tRing up purchases.\n\tFollow all the company's policies and procedures.\n\n\nSales Assistant Requirements\n\n\n\tOND, HND\n\tMinimum of 11 year of work experience in sales,customer rep in a pharmacy or a retail store\n\tComputer literate.\n\tExcellent verbal and communication skills.\n\tExceptional customer service skills.\n\tProximity to Surulere, Ojuelegba, and Yaba would be most preferred.\n\n\nSalary\nN90,000 - N120,000 Monthly.\n\nApplication Closing Date: 10th September, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hrnemitt@gmail.com using the Job Position as the subject of the email.\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]