[
  {
    "title": "Accountant Job at La Roche Equipment Nigeria Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/accountant-job-at-la-roche-equipment-nigeria-limited-2",
    "pubDate": "Tue, 10 Jun 2025 15:17:15 GMT",
    "source": "JobGurus",
    "keyword": "la roche equipment nigeria limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "La Roche Equipment Nigeria Limited is a building materials and equipment company that provides innovative solutions to many leading contracting companies in the region.\n\nWe are recruiting to fill the position below:\n\nJob Position: Accountant\n\nJob Location: Lagos\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tPrepare and examine accounting records, financial statements, and other financial reports to assess accuracy, completeness, and conformance to reporting and procedural standards.\n\tManage all accounting transactions\n\tEnsure timely bank payments and monitor bank deposits.\n\tHandle monthly, quarterly, and annual closings.\n\tReconcile accounts payable and receivable.\n\tEnsure timely submission of tax returns and liaise with external auditors during audits.\n\tAnalyze financial information and summarize financial status.\n\tPrepare the schedules for statutory remittances (PAYE, WHT, Pension, Company tax, ITF, NSITF, among others) and ensuring timely remittance.\n\tMaintain a complete and accurate Fixed Asset Register for the company\n\tProvide technical support and advice on management.\n\tParticipate in financial standards setting and in forecast process.\n\tDevelop and document business processes and accounting policies to maintain and strengthen internal controls.\n\n\nRequirements\n\n\n\tHND/Bachelor’s Degree in Accounting or Finance\n\tMinimum of 7 years of proven experience as an Accountant in a trading company or related industry.\n\tMust have ICAN certification\n\tThorough knowledge of Accounting procedures and principles.\n\tExperience with general ledger functions and the month-end/year-end close process.\n\tHands-on experience with accounting software packages\n\tAdvanced MS Excel skills including Vlookups and pivot tables.\n\tAccuracy and attention to detail.\n\tAptitude for numbers and quantitative skills.\n\tExcellent organizational and time-management abilities.\n\tStrong communication and interpersonal skills.\n\n\nMethod of Application\nInterested and qualified candidates should forward their CV to: careerslrn@yahoo.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Vacancies at Duob Recruitment",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancies-at-duob-recruitment",
    "pubDate": "Tue, 10 Jun 2025 15:17:15 GMT",
    "source": "JobGurus",
    "keyword": "duob recruitment",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Duob Recruitment, a recruitment firm, is recruiting suitable candidates to fill the following positions below:\n\n1.) Junior Mechanical Engineer\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nOverview\n\n\n\tWe are recruiting a Junior Mechanical Engineer to assist in maintaining production machinery, improving efficiency, and supporting senior engineers in various technical operations.\n\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tCarry out routine maintenance and repairs on manufacturing equipment.\n\tAssist in the setup and calibration of machines.\n\tTrack and report equipment performance and issues.\n\tWork closely with the production team to ensure smooth operations.\n\tEnsure compliance with safety and environmental regulations.\n\n\nRequirements\n\n\n\tBSc / HND qualification in Mechanical Engineering.\n\t5 - 7 years of experience in a plastic or footwear production environment.\n\tFamiliarity with injection molding or extrusion processes.\n\tTechnically sound and willing to learn.\n\tStrong attention to detail and teamwork abilities.\n\n\nSalary\nN250,000 - N300,000 monthly.\n\nApplication Closing Date: 18th June, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their Applications to: hrdamilolaasoata@outlook.com using the Job Position as the subject of the email.\n\n \n\n \n\n2.) Head of HR (Manufacturing)\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nOverview\n\n\n\tOur client is hiring a Head of Human Resources to lead the people operations of a dynamic plastics manufacturing company.\n\tThis person must be a strategic HR leader with a strong manufacturing background, capable of aligning HR with business goals.\n\n\nKey Responsibilities\n\n\n\tLead HR planning, talent acquisition, performance management, and staff development.\n\tEnforce labor law compliance and internal policy implementation.\n\tManage employee relations, disciplinary procedures, and staff welfare.\n\tMonitor HR metrics and provide reports to management.\n\tCoordinate payroll and benefits in collaboration with finance.\n\tDrive employee engagement and build a culture of accountability and growth.\n\n\nRequirements\n\n\n\tBachelor’s degree in HR, Business Admin, or Industrial Relations (Master’s/CIPM is a plus).\n\t15+ years of experience,must include manufacturing industry HR leadership.\n\tExcellent knowledge of Nigerian labor law and workforce dynamics.\n\tStrong leadership, communication, and decision-making skills.\n\n\nSalary\nN500,000 per month. \n\nApplication Closing Date: 11th July, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their Resume to: damilola@toncorporateservices.com using the Job Position as the subject of the email.\n\n \n\n3.) Senior Accountant\n\nJob Locations: Lagos & Port Harcourt - Rivers\nReports To: Chief Operating Officer\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe are seeking a highly skilled and experienced Senior Accountant to oversee and manage the financial operations of our diverse business portfolio, including pharmacies, supermarkets, and hair & beauty salons.\n\tThe ideal candidate will ensure the accuracy of financial records, compliance with regulatory requirements, and provide critical financial insights to support strategic decision making.\n\tThis Role will require supervising over night stock count process, occasional weekend work due to the nature of the businesses. Also work during public holidays due to the nature of the businesses.\n\n\nKey Responsibilities\nFinancial Management:\n\n\n\tPrepare, review, and analyse financial statements, ensuring accuracy and compliance with regulatory standards.\n\tMaintain the general ledger and oversee monthly, quarterly, and annual closing processes.\n\tReconcile accounts, including bank statements, receivables, and payables.\n\tManage and monitor cash flow to ensure sufficient funds for operations. Budgeting and Forecasting\n\tDevelop, manage, and monitor budgets for all business units.\n\tProvide detailed variance analysis and recommend corrective actions.\n\tEnsure compliance with financial regulations and company policies. Internal Controls and Auditing\n\tDevelop and enforce effective internal controls to safeguard business stock.\n\tInclude developing processes and policies such as procurement process, internal audit plan\n\tPrepare financial forecasts and business performance reports. Taxation and Compliance\n\tEnsure compliance with local tax regulations, including VAT, PAYE, and corporate taxes.\n\tPrepare and file accurate tax returns and liaise with tax authorities when necessary.\n\tDevelop an accounting manual • Coordinate and support internal and external audit processes.\n\tIdentify risks and propose improvements to financial processes. Team Leadership and Collaboration\n\tSupervise and mentor junior accounting staff, fostering professional growth.\n\tCollaborate with department heads to provide financial guidance and support decision making.\n\tLiaise with external auditors, tax consultants, and regulatory bodies.\n\n\nQualifications and Experience\n\n\n\tBachelor’s degree in Accounting, Finance, or a related field.\n\tMinimum of 5-7 years of accounting experience, with at least 2 years in a senior role.\n\tProfessional certifications such as ACA, ACCA, ICAN\n\tExperience in the retail or service industry is an advantage.\n\n\nSkills and Competencies:\n\n\n\tStrong knowledge of accounting principles, financial reporting, and Nigerian tax laws.\n\tProficiency in accounting software and Microsoft Office Suite, particularly Excel.\n\tStrong organisational and time-management skills.\n\tEffective communication and interpersonal skills.\n\tExcellent analytical and problem-solving skills.\n\tHigh level of accuracy and attention to detail.\n\tAbility to work under pressure and meet tight deadlines.\n\n\nBenefits\n\n\n\tHMO\n\tAnnual Leave\n\n\nApplication Closing Date: 15th June, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: jobs@duobrecruitment.com using the Job Position as the subject of the email.\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Guest Relations Officer Job at Vista Lux Hospitality & Resorts",
    "link": "https://www.jobgurus.com.ng/jobs/view/guest-relations-officer-job-at-vista-lux-hospitality-resorts",
    "pubDate": "Tue, 10 Jun 2025 15:17:15 GMT",
    "source": "JobGurus",
    "keyword": "vista lux hospitality & resorts",
    "duplicate": false,
    "classifications": [],
    "content": "VistaLux Hospitality & Resorts is a modern and elegant hospitality brand built with the purpose of delivering unforgettable experiences to both local and international guests. We specialize in creating a peaceful and luxurious environment where relaxation meets comfort. Whether it's a weekend getaway, a business trip, or a family vacation, we provide well-designed spaces, top-class customer service, and a warm atmosphere that makes every guest feel special.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nOur services include high-end hotel accommodation, resort-style experiences, event hosting, tour packages, and travel support. Every branch of VistaLux is carefully planned to reflect beauty, class, and comfort. From our stylish rooms and delicious cuisine to our friendly staff and clean environment, we always put our guests first.At VistaLux, we don’t just offer hospitality, we create a lifestyle of ease, peace, and luxury. Our goal is to become one of the leading hospitality names that people trust, love, and look forward to. Whether you’re a traveler, tourist, or partner, VistaLux is where comfort meets elegance\n\nWe are recruiting to fill the position below:\n\nJob Position: Guest Relations Officer\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe are looking for a Guest Relations Officer to provide high-quality service to our hotel customers.\n\tYou will address complaints and go the extra mile to make sure our guests are satisfied.\n\tIn this role, you should be an excellent communicator who can stay positive when facing difficult situations.\n\tYou should also be reliable and customer-oriented, as you’ll serve as a primary point of contact for our customers.\n\tYour goal will be to ensure our guests enjoy themselves and plan to come back to our facilities.\n\n\nDuties and Responsibilities\n\n\n\tReview arrival lists to welcome guests\n\tAttend to special guests (e.g. VIPs) and answer their inquiries\n\tHelp prepare welcome folders with collateral (e.g. room service menus, area descriptions)\n\tProvide information about amenities, area and venues and promote services\n\tAnticipate guest needs and build rapport with customers\n\tOffer assistance with certain tasks (e.g. confirming travel arrangements, taking messages)\n\tAddress customers complaints.\n\tRecord information in the logbook daily\n\tEnsure compliance with health and quality standards\n\n\nRequirements and Skills\n\n\n\tInterested candidates should possess a relevant qualifications.\n\tFamiliarity with hospitality industry standards.\n\tA customer-oriented and professional attitude\n\tAn outgoing personality\n\tOutstanding communication abilities\n\tExcellent organizational and time-management skills.\n\n\nSalary\nN100,000 - N150,000 Monthly. \n\nMethod of Application\nInterested and qualified candidates should send their CV to: vistaluxhr@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Senior Sales Engineer Job at Fave Consulting",
    "link": "https://www.jobgurus.com.ng/jobs/view/senior-sales-engineer-job-at-fave-consulting",
    "pubDate": "Tue, 10 Jun 2025 15:17:15 GMT",
    "source": "JobGurus",
    "keyword": "fave consulting",
    "duplicate": false,
    "classifications": [],
    "content": "Fave Consulting is a Human Resources Management and consultancy firm that specializes in strategic HR management to enhance business growth, performance and transformation.\n\nWe are recruiting to fill the position below:\n\nJob Position: Senior Sales Engineer\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tEnsure to meet business goals in terms of product sales, sales growth, market share improvement, profitability, and customer satisfaction in the assigned territory.\n\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tGrow Sales: Achieve agreed sales budget for the company.\n\tDevelop sales in the assigned geographical territory through direct sales visits and contracted freelancers if any.\n\tStrictly follow & implement a guided sales strategy to achieve the growth and sales targets.\n\tDevelop and maintain positive relationships with established customers through close management of the accounts and attention to their needs.\n\tAssess and define customer applications so that the correct product can be represented. Ensure integrity in the application of the products.\n\tTo promote RPM brands with value sales process.\n\tProtect and promote sales price positioning and premium.\n\tAchieve the Gross Contribution of min. 30%.\n\tReporting: To report, (daily, weekly & monthly) using sales tools and databases, activities, and information collected in the market (customers, competitors, actions in progress).\n\tInteract actively with customers to become their consultant in selling our products.\n\tFollow-up on existing customer showing high degree of commitment and professionalism.\n\tSet and maintain coherent and clear sales activity agenda.\n\tSupport sales through undertaking sites survey and providing technical advice to both existing and new potential customers.\n\tContinuously improve technical knowledge on product technologies and applications.\n\tSupport the complete sales process with prospecting, discussions, demonstration, exhibition, reference selling, and negotiation to achieve the target.\n\tMaintain regular contact with all customers. Spend 70% of your time meeting existing potential customers & finding new potential customers. And 30% of your time for negotiations (closing the quick wins – immediate prospects).\n\n\nRequirements\n\n\n\tBSc or HND in any related field but an added advantage in Electrical, Mechanical, and Industrial Engineering.\n\tA minimum of 5 years of corporate B2B direct selling in CMC industries (Cement, Minning & Construction)\n\tExperience in sales of machines and parts (Compressors, Pumps, valves, conveyors, belts and other heavy machinery parts).\n\tExperience in a manufacturing or engineering company Proven records of high-performance sales.\n\tProven experience selling in the CMC industries (Cement, Minning & Construction).\n\tEnjoys the art of selling and be willing to go hands-on when required.\n\tAmbitious and performance-driven personality.\n\tSound judgment and good business sense.\n\tTeamworking ability.\n\tThe ability to build relationships with clients quickly.\n\tAnalytical and problem-solving skills.\n\tResilience and tenacity.\n\n\nSalary\nN500,000 monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV & cover letter in PDF to: recruitment@faveconsulting.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Restaurant Assistant Manager Job at Vista Lux Hospitality & Resorts",
    "link": "https://www.jobgurus.com.ng/jobs/view/restaurant-assistant-manager-job-at-vista-lux-hospitality-resorts",
    "pubDate": "Tue, 10 Jun 2025 15:17:15 GMT",
    "source": "JobGurus",
    "keyword": "vista lux hospitality & resorts",
    "duplicate": false,
    "classifications": [],
    "content": "Vista Lux Hospitality & Resorts is a modern and elegant hospitality brand built with the purpose of delivering unforgettable experiences to both local and international guests. We specialize in creating a peaceful and luxurious environment where relaxation meets comfort. Whether it's a weekend getaway, a business trip, or a family vacation, we provide well-designed spaces, top-class customer service, and a warm atmosphere that makes every guest feel special.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nOur services include high-end hotel accommodation, resort-style experiences, event hosting, tour packages, and travel support. Every branch of VistaLux is carefully planned to reflect beauty, class, and comfort. From our stylish rooms and delicious cuisine to our friendly staff and clean environment, we always put our guests first.\n\nWe are recruiting to fill the position below:\n\nJob Position: Restaurant Assistant Manager\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe are looking for a Restaurant Assistant Manager to ensure all daily activities run smoothly and efficiently.\n\tRestaurant Assistant Manager responsibilities include ordering kitchen utensils and equipment based on our needs, managing contracts and payroll and supervising restaurant staff performance.\n\tTo be successful in this role, you should be familiar with restaurant operations and have a good understanding of what makes a great customer service. You should also be available to work within opening hours, including weekends and holidays.\n\tUltimately, you will help minimise operating costs, boost our employee retention and deliver a positive dining experience for our guests.\n\n\nResponsibilities and Duties\n\n\n\tResearch new wholesale food suppliers and negotiate prices.\n\tCalculate future needs in kitchenware and equipment and place orders, as needed.\n\tManage and store vendors’ contracts and invoices.\n\tCoordinate communication between the front of the house and the back of the house staff.\n\tPrepare shift schedules.\n\tArrange for new employees’ proper onboarding (scheduling training and ordering uniforms).\n\tProcess payroll for all restaurant staff.\n\tSupervise kitchen and wait staff and provide assistance, as needed.\n\tKeep detailed records of daily, weekly and monthly costs and revenues.\n\tMonitor compliance with safety and hygiene regulations.\n\tGather guests’ feedback and recommend improvements to our menus.\n\n\nRequirements and Skills\n\n\n\tGood Customer service attitude.\n\tCommunication and team management abilities.\n\tAvailability to work within opening hours (e.g. evenings, holidays, weekends).\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: vistaluxhr@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]