[
  {
    "title": "Job Openings  at T.O.N Corporate Services",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-ton-corporate-services",
    "pubDate": "Mon, 25 Aug 2025 14:43:03 GMT",
    "source": "JobGurus",
    "keyword": "t.o.n corporate services",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance"
    ],
    "content": "T.O.N. Legal & Corporate Services is a business management firm committed to helping our clients create sustainable businesses. Our team of experienced professionals provide effective strategies and quality services tailored to your needs. We are dedicated to helping you reach your business goals and ensure that your company is set up for success. Our approach is based on deep understanding of the local market and its regulations.\n\nWe are recruiting to fill the following positions below:\n\n1.) Sales & Admin Officer\n\nJob Location: Lagos\nJob Type: Full Time\nIndustry: Retail\n\nJob Description\n     \n\n            \n    \n\n\n\n\n\tThe Sales & Admin Officer supports both the store’s sales and back-office administrative operations to ensure smooth daily functioning.\n\n\nKey Responsibilities\n\n\n\tAttend to walk-in customers and drive physical store sales\n\tTrack daily revenue and report to management\n\tPrint receipts and manage sales logs (system-generated)\n\tHandle basic admin tasks (vendor calls, stock checks, internal documents)\n\tCoordinate with the inventory and fulfillment team\n\n\nRequirements\n\n\n\tMinimum of OND in Business Admin, Marketing, or related field\n\t1 - 2 years of experience in retail or admin roles\n\tCustomer-friendly, detail-oriented, and organized\n\tFamiliarity with POS systems or sales tracking tools.\n\n\nClick here to apply online\n\n \n\n \n\n2.) Order Fulfillment Officer\n\nJob Location: Lagos\nJob Type: Full Time\nIndustry: Retail\n\nJob Summary\n\n\n\tOur client is a fast-growing tech retail company that offers gadgets and accessories through online and in-store channels, with a strong focus on innovation and customer satisfaction.\n\tThis role ensures all customer orders are processed, packaged, and delivered efficiently and accurately.\n\n\nKey Responsibilities\n\n\n\tMonitor app orders and prepare items for delivery\n\tEnsure timely dispatch with logistics partners (GIGL, DHL, etc.)\n\tHandle returns, replacements, and tracking updates\n\tCollaborate with inventory and customer service for smooth hand-offs\n\n\nRequirements\n\n\n\tOND / HND / Bachelor’s Degree\n\tPrevious experience in logistics or order processing is a plus\n\tGood communication and coordination skills\n\tMust be tech-savvy and proactive.\n\n\nClick here to apply online\n\n \n\n \n\n3.) Central Head of SPD (Spiritual Development Department)\n\nJob Location: Lagos\nJob Type: Full Time\nIndustry: Marketing\n\nJob Summary\n\n\n\tThe Head of SPD will be responsible for optimizing all the opportunities for spiritual formation in the Church by nurturing and edifying the members of the congregation. The Head of SPD will also design, oversee, and administer spiritual development opportunities.\n\tThe person will help members to grow in their faith, to grow in maturity and wisdom, and to build their faith on a strong foundation so that they can then disciple and lead others toward achieving the goal/objective of the Church\n\n\nPrincipal Duties and Responsibilities\nSpiritual Formation Program Development:\n\n\n\tDesign and implement programs that support spiritual growth, discipleship, and theological education.\n\tDevelop resources and curricula for Bible studies, small groups, discipleship classes, and mentoring initiatives.\n\tAssess and continuously improve programs to align with the Church’s vision and the needs of its members.\n\n\nMentorship & Discipleship:\n\n\n\tEstablish and oversee mentorship and discipleship programs that connect newer members with seasoned Church members.\n\tTrain and equip spiritual mentors and discipleship leaders to support members on their faith journeys.\n\tCreate pathways for members to develop and deepen their spiritual gifts in line with their calling.\n\n\nWorship and Prayer Initiatives:\n\n\n\tCollaborate with worship teams to create meaningful and engaging worship experiences.\n\tDevelop prayer programs, such as prayer groups, prayer chains, and spiritual retreats, to deepen the prayer life of the congregation.\n\tEncourage participation in regular worship and prayer as part of spiritual growth.\n\n\nCommunity Engagement & Small Groups:\n\n\n\tOversee the formation and growth of small groups, fostering a culture of accountability, encouragement, and shared faith.\n\tEnsure that small groups are accessible, diverse, and meet the varying spiritual needs of the congregation.\n\tProvide ongoing support, training, and resources to small group leaders to facilitate impactful group sessions.\n\n\nSpiritual Progress Measurement & Evaluation:\n\n\n\tDevelop methods to measure spiritual growth and satisfaction with spiritual formation programs.\n\tGather feedback and conduct surveys to evaluate the effectiveness of initiatives and make data-driven improvements.\n\tReport on spiritual progress metrics to Church leadership, including participation, engagement, and overall satisfaction.\n\n\nVolunteer Recruitment & Training:\n\n\n\tRecruit, train, and support volunteers who assist in spiritual programs and initiatives.\n\tFoster a sense of purpose and belonging among volunteers, equipping them with skills to lead spiritual programs effectively.\n\tRecognize and celebrate volunteer contributions to enhance engagement and retention.\n\n\nTheological Education & Resources:\n\n\n\tProvide members with access to resources that enhance theological understanding and personal Bible study.\n\tHost guest speakers, seminars, or workshops on relevant theological and spiritual topics.\n\tEnsure that all educational content aligns with the Church’s beliefs and teachings.\n\n\nRequirements\n\n\n\tBachelor’s degree in theology, ministry, or a related field; Master’s preferred.\n\tMinimum of 8 to 10 years of  work experience in an educational/learning space or related environment.\n\tAdditional professional qualifications will be an added advantage.\n\tDegree in Social Sciences/Management/Arts or any other related field.\n\tProficient in Microsoft Office (Outlook, Word, Excel, and PowerPoint), Adobe Acrobat, and social media web platforms.\n\tDeep understanding of Christian doctrine and Church teachings.\n\tExperience in discipleship, spiritual mentorship, and program management.\n\tStrong interpersonal and leadership skills, with the ability to inspire others.\n\n\nClick here to apply online    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Openings at MMT Consults",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-mmt-consults",
    "pubDate": "Mon, 25 Aug 2025 14:43:03 GMT",
    "source": "JobGurus",
    "keyword": "mmt consults",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "MMT Consults is a dynamic Human Resource Consulting and General Services firm dedicated to delivering innovative, practical, and sustainable solutions that empower organizations to achieve excellence. We partner with businesses across diverse sectors to optimize their people, processes, and performance, ensuring growth, efficiency, and long-term success.\n\nWe are recruiting to fill the following positions below:\n\n1.) Sales Representative\n\nJob Location: Lekki Phase 1, Lagos\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n            \n    \n\n\n\n\n\tThe Sales Representative will be responsible for promoting and selling makeup and cosmetic products, providing excellent customer service, and supporting the overall sales performance of the store.\n\tThe role involves engaging with customers, offering product knowledge and beauty advice, meeting sales targets, and maintaining the brand’s image in line with company standards.\n\n\nRequirements\n\n\n\tCandidates who reside around Lekki and environs will be given top priority.\n\tInterested candidates must possess relevant work experience.\n\n\nMethod of Application\nInterested and qualified candidates should send their Cover Letter and CV to: mmtconsults@gmail.com using the Job Position as the subject of the mail.\n\n \n\n2.) Makeup Artist\n\nJob Location: Lekki Phase 1, Lagos\nEmployment Type: Full-time\n\nResponsibilities\n\n\n\tThe Makeup Artist will provide professional makeup application services, beauty consultations, and product recommendations to clients.\n\tThe role involves demonstrating product usage, promoting cosmetics, and supporting sales by enhancing the customer’s shopping experience.\n\tThe Makeup Artist serves as a brand ambassador, ensuring clients feel confident, satisfied, and encouraged to purchase products.\n\n\nRequirements\n\n\n\tCandidates who reside around Lekki and environs will be highly prioritized.\n\n\nSalary\nN140,000 - N150,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: mmtconsults@gmail.com using the Job Position as the subject of the mail.\n\nNote: Male candidates are strongly advised to apply.\n\n \n\n \n\n3.) Content Creator\n\nJob Location: Lekki Phase 1, Lagos\nEmployment Type: Full-time\n\nRequirements\n\n\n\tBachelor’s Degree in Marketing, Communications, Media, or related field (preferred).\n\tProven experience as a content creator, social media manager, or similar role (experience in beauty/cosmetics industry is a plus).\n\tStrong skills in photography, videography, editing, and graphic design (Canva, Photoshop, Premiere Pro, CapCut, etc.).\n\tExcellent knowledge of social media platforms, algorithms, and trends.\n\tStrong writing, communication, and storytelling skills.\n\tCreativity, innovation, and attention to detail.\n\tAbility to work independently and meet deadlines in a fast-paced retail environment.\n\n\nSalary\nN140,000 - N150,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates who meets the recruitment requirements should send their application to: mmtconsults@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]