[
  {
    "title": "Job Vacancies at the Party Rental Station (TPRS) Events and Services",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancies-at-the-party-rental-station-tprs-events-and-services",
    "pubDate": "Mon, 16 Jun 2025 09:43:30 GMT",
    "source": "JobGurus",
    "keyword": "the party rental station (tprs) events and services",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "The Party Rental Station (TPRS) Events and Services is Stylish Event Rental Company offering the most unique line of luxury décor items and event solutions. Our Collection includes a variety of the finest and carefully selected luxury chairs, VVIP Tables,Mobile Tents, Mist fans/Air Coolers, Cocktail tables, bar stools, Upholstered Lounge sofas,Event lighting, Special effects, Tableware, and lots more.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWhether you are a Wedding Planner, Event Manager, Event Designer, Photographer, Industry Vendor, or Do-It-Yourselfer, Our In-House Team of Creative Event Professionals are available to offer you everything you need from our line of exclusive products designed to make your Event as special as possible. At the Party Rental Station, we pride ourselves in offering exceptional customer service as well as excellent service delivery. Our team is here to help ensure that your rental process is seamless and easy.\n\nWe are recruiting to fill the following positions below:\n\n1.) Facility Officer\n\nJob Location: Oshodi-Apapa Expressway, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tThe position will be responsible for providing assistance to ensure the day-to-day smooth management and operation of the office buildings/accommodation infrastructure through administrative support as well as, overseeing the general maintenance of tasks.\n\n\nResponsibilities\n\n\n\tMaintain all facilities and equipment within the system and their related issues including record keeping, repairs, and supervision of personnel working within the facility premises.\n\tMaintain records of all assets and conditions of occupancy, including sourcing and renewal of residence for both expatriates and local staff.\n\tCoordinate and monitor the services of outsourced companies e.g., Security and cleaning companies.\n\tSupervise support staff at the head office in the orderly discharge of their duties, e.g., janitorial staff\n\tMonitor the services of domestic workers in the company residence and be responsible for their accommodation\n\tResponsible for the monthly payment for utilities such as Energy used, waste disposal and cable subscription.\n\tAny other assigned task(s).\n\n\nRequirements\n\n\n\tB.Eng. / HND in Facility Management, Civil Engineering or Building Engineering or any other related discipline.\n\t2- 5 years minimum experience in a reputable organisation.\n\tProfessional certification in Engineering or Facility Management is an added advantage.\n\n\nCompetencies Required:\n\n\n\tGood knowledge of Facilities and space administration\n\tExperience in office management software like MS Office, Windows and Exchange\n\tGood interpersonal, communication and customer service skills\n\tExcellent organisational skills\n\tGood team player\n\tAttention to detail.\n\n\nSalary\nN150,000 Net Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their detailed CV to: hrtprs7@gmail.com using the Job Position as the subject of the email.\n\n \n\n \n\n2.) Junior Accountant \n\nJob Location: Oshodi-Apapa Expressway Way, Lagos\nEmployment Type: Full-time\n\nJob Brief\n\n\n\tWe are looking for an ambitious Junior Accountant to provide support to the financial department by managing daily accounting tasks.\n\tYou will be part of a team of professionals working to maintain order and transparency for the company’s finances.\n\tPreparing financial statements and reporting are a large part of the junior accountant’s day-to-day work.\n\tThe ideal candidate will be well-versed in accounting principles and able to work comfortably with numbers and attention to detail.\n\tThe goal is to contribute to the overall efficient operation of the department and help the company be fully aware of its financial condition.\n\tThis way it can make the right decisions and accomplish long term success.\n\n\nResponsibilities\n\n\n\tPost and process journal entries to ensure all business transactions are recorded\n\tUpdate accounts receivable and issue invoices\n\tUpdate accounts payable and perform reconciliations\n\tAssist in the processing of balance sheets, income statements and other financial statements according to legal and company accounting and financial guidelines\n\tAssist with reviewing of expenses, payroll records etc. as assigned\n\tUpdate financial data in databases to ensure that information will be accurate and immediately available when needed\n\tPrepare and submit weekly/monthly reports\n\tpreparation of monthly/yearly closings\n\tAssist with other accounting projects\n\tEnsure timely payment of invoices.\n\tconfirming validity of the debt and gathering appropriate signatures\n\tUpdating financial records via accounting software\n\tReviewing of expenses, payroll records etc.\n\n\nRequirements and Skills\n\n\n\tCandidates should possess minimum of BSC/HND qualification in Accounting, Finance or relevant fields\n\t2+ years of proven experience as a junior accountant.\n\tExcellent organizing abilities\n\tGreat attention to detail\n\tGood with numbers and figures and an analytical acumen\n\tGood understanding of accounting and financial reporting principles and practices\n\tExcellent knowledge of MS Office.\n\n\nSalary\nN150,000 Net Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their detailed CV to: hrtprs7@gmail.com using the Job Position as the subject of the email.\n\n \n\n \n\n3.) Field Operations Manager\n\nJob Location: Oshodi-Apapa Expressway, Lagos\nEmployment Type: Full-time\n\nObjective\n\n\n\tResponsible for designing and implementing viable strategic plans and initiatives to drive and improve operational development.\n\n\nResponsibilities\n\n\n\tManage the field operations team to ensure optimum prioritization of clients’ deliverables on time and in full.\n\tExamines all work plans, specification orders prior to dispatch and installation to ensure accuracy and clarity of instructions.\n\tResponsible for establishing and maintaining relationships with existing and prospective clients.\n\tUtilizes market knowledge and identifies current trends to advice top management on organizational growth strategies.\n\tProvides strategic leadership, technical and operational coaching and next level support to field staff\n\tRegular on-site inspection for proper execution of installations and overall field logistics coordination.\n\tMonitors the strict adherence of standards of professional conduct, HSE policies and highest level of customer service of field crew members.\n\tMaintains flexible schedule to be available to installation team at any time when active installations are taking place.\n\tEnsure proper documentation of all relevant financial and construction information for reference and report purposes\n\tProfessionally address and resolve all issues concerning field operations.\n\tAssign tasks to technical staffs and ensure they adhere to quality specifications and procedures.\n\n\nSkills & Requirements\n\n\n\tB.Sc / HND in the relevant field of study.\n\tMinimum of 5 years of prior experience in a similar role.\n\tWillingness to travel for projects when required.\n\tStrong leadership skills.\n\tExcellent Communication skills.\n\tExcellent Organizational skills.\n\tNegotiation skills.\n\tPeople Management skills.\n\tAbility to Multitask.\n\tExcellent Team player.\n\tAttention to detail with a proactive approach to problem-solving.\n\tTime Management Skills.\n\tStrong budgeting and Organizational skills.\n\tAbility to manage materials.\n\n\nSalary\nN240,000 Net Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their detailed CV to: hrtprs7@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Fuel Station Manager Job at Petrosafe",
    "link": "https://www.jobgurus.com.ng/jobs/view/fuel-station-manager-job-at-petrosafe",
    "pubDate": "Mon, 16 Jun 2025 09:43:30 GMT",
    "source": "JobGurus",
    "keyword": "petrosafe",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Petrosafe is a prominent player in the Nigerian Oil and Gas industry, the company’s operations span across major businesses in the Oil and Gas value chain.\n\nWe are recruiting to fill the position below:\n\nJob Position: Fuel Station Manager\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Description\n\n\n\tTo oversee the complete operations of a high-volume retail fuel station, ensuring exceptional customer service, operational efficiency, safety compliance, and profitability while leading a team of retail associates.\n\n\nResponsibilities\nOperations Management:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tManage and oversee daily retail station operations ensuring compliance with company policies, procedures and regulatory requirements.\n\tEnsure 100% product availability (fuel, lubricants, LPG) with proper inventory management.\n\tImplement visual merchandising standards for the convenience store.\n\tOversee equipment maintenance (dispensers, tanks, POS systems)\n\n\nCustomer Service:\n\n\n\tProvide exceptional customer service, including customer complaints and concerns in a timely and professional manner\n\n\nHSSE Compliance:\n\n\n\tEnforce strict safety protocols (fuel handling, fire prevention).\n\tConduct monthly safety drills and equipment checks.\n\tEnsure full compliance with DPR, SON, and environmental regulations.\n\n\nSite Maintenance:\n\n\n\tMaintain impeccable station cleanliness\n\tOversee landscaping and exterior appearance.\n\tManage third-party vendors (cleaning, security).\n\n\nQualifications\n\n\n\tOND Qualification in Accounting, Business Administration, Marketing or related field.\n\t5+ years of experience in retail management (fuel station preferred).\n\n\nExperience:\n\n\n\tExperience in the oil and gas sector.\n\tPOS and inventory management systems proficiency.\n\tComputer literate in Word, Excel, Office Outlook, and Financial Software. Skills:\n\tStrong leadership and team management skills.\n\tAbility to work in a fast-paced, dynamic environment.\n\tExcellent customer service and communication skills.\n\tProblem-solving skills.\n\tFuel volume throughput (Monthly).\n\tNon-fuel revenue contribution.\n\tShrinkage control (90%).\n\n\nMethod of Application\nInterested and qualified candidates should send their Resumes to: ralphedo21@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Experienced Human Resources Manager Job at Stretch-It Concepts Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/experienced-human-resources-manager-job-at-stretch-it-concepts-limited",
    "pubDate": "Mon, 16 Jun 2025 09:43:30 GMT",
    "source": "JobGurus",
    "keyword": "stretch-it concepts limited",
    "duplicate": false,
    "classifications": [],
    "content": "Stretch-It Concepts Limited - Our client, a reputable and forward-thinking Telecommunications company, is known for delivering high-quality, value-added solutions and management support services within the telecommunications sector.\n\nWe are recruiting to fill the position below:\n\nJob Position: Experienced Human Resources Manager\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThey are seeking a no-nonsense, seasoned Human Resource Manager to lead and manage our HR department with confidence, maturity, and a strong sense of discipline.\n\tWe are looking for a conservative and highly professional HR Manager who can independently set and enforce HR standards, implement processes, and drive workforce management with minimal supervision.\n\tThe ideal candidate must be grounded, firm, principled, and results-oriented — someone who can bring structure and excellence to our growing team.\n\n\nKey Responsibilities\n\n\n\tEstablish and maintain strong HR structures, policies, and standard operating procedures.\n\tOversee end-to-end employee lifecycle management (recruitment, onboarding, performance, discipline, exit).\n\tEnsure full compliance with labor laws and regulatory standards.\n\tProvide strategic HR support to management and ensure alignment with business goals.\n\tServe as the custodian of company culture, ethics, and values.\n\tImplement disciplinary systems that foster productivity and accountability.\n\tLead workforce planning, talent development, and succession planning.\n\tSupervise HR operations including payroll, records, benefits administration, and staff welfare.\n\n\nRequirements\n\n\n\tBachelor's degree in Human Resources, Business Administration, or a related field (CIPM or SHRM certification is a strong advantage).\n\tMinimum of 7 years of progressive HR experience, with at least 4 years in a senior management role.\n\tProven ability to work independently and deliver results without micromanagement.\n\tStrong knowledge of Nigerian labor law, HR practices, and modern HR systems.\n\tMust be assertive, conservative, firm, and principled with excellent leadership skills.\n\tExcellent communication, decision-making, and conflict-resolution skills.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and a Cover Letter to: jobs@stretchitconcepts.com using “HR Manager Application” as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Manufacturing Manager Job at PZ Cussons",
    "link": "https://www.jobgurus.com.ng/jobs/view/manufacturing-manager-job-at-pz-cussons-1",
    "pubDate": "Mon, 16 Jun 2025 09:43:30 GMT",
    "source": "JobGurus",
    "keyword": "pz cussons",
    "duplicate": false,
    "classifications": [],
    "content": "PZ Cussons is a dynamic consumer products group and innovator of some of the world's best known and loved brands. Calling on over 130 years of expertise, we operate internationally in carefully selected developed and emerging markets that present the greatest strategic potential for future growth. Our world-class supply chain and distribution networks enable us to meet our global consumer needs and deliver quality brands that add value and enhance everyday lives.\n\nWe are recruiting to fill the position below:\n\nJob Position: Manufacturing Manager\n\nJob ID: JR002142\nJob Location: Ikorodu, Lagos\nJob type: Full-time\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tTo ensure the planning, implementation, organizing, controlling and directing of the production and expense budget of Personal Care and Dish wash Operations whilst ensuring the overall development and growth of the SBU\n\tTo ensure that production/manufacturing at the site is at optimum level complying with SQDMC standards\n\tManaging team and individual performance through regular reviews, monitoring objectives and ensuring development needs are identified and actioned\n\tMaintain high safety standards on site\n\tTo manage the quality of raw materials, intermediates, and processes to achieve specified quality standards of the product.\n\tTo coordinate good manufacturing Practice activities on site in line with agreed GMP standards (PZC GMP Standard/NAFDAC GMP requirements).\n\tTakes responsibility for compliance with all EMS related activities in the Site to prevent, reduce or control environmental pollution arising from environmental aspects identified in the department as documented in the EMS Manual, Departmental Aspect and Impacts register, EMS related SOPs and other relevant documents.\n\n\nRequired Qualifications\n\n\n\tB.Sc Degree in Engineering / Chemistry, Master's in Business Administration\n\tComputer expertise especially in MS Word, MS Excel and PowerPoint.\n\n\nRequired Experience:\n\n\n\t10 years of working experience of which 5 must be in similar role\n\tExcellent Quantitative Analysis skills\n\tKnowledge of Financial Management\n\tBroad knowledge of manufacturing management.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Manufacturing Manager Job at PZ Cussons",
    "link": "https://www.jobgurus.com.ng/jobs/view/manufacturing-manager-job-at-pz-cussons",
    "pubDate": "Mon, 16 Jun 2025 09:43:30 GMT",
    "source": "JobGurus",
    "keyword": "pz cussons",
    "duplicate": false,
    "classifications": [],
    "content": "PZ Cussons is a dynamic consumer products group and innovator of some of the world's best known and loved brands. Calling on over 130 years of expertise, we operate internationally in carefully selected developed and emerging markets that present the greatest strategic potential for future growth. Our world-class supply chain and distribution networks enable us to meet our global consumer needs and deliver quality brands that add value and enhance everyday lives.\n\nWe are recruiting to fill the position below:\n\nJob Position: Manufacturing Manager\n\nJob ID: JR002142\nJob Location: Ikorodu, Lagos\nJob type: Full-time\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tTo ensure the planning, implementation, organizing, controlling and directing of the production and expense budget of Personal Care and Dish wash Operations whilst ensuring the overall development and growth of the SBU\n\tTo ensure that production/manufacturing at the site is at optimum level complying with SQDMC standards\n\tManaging team and individual performance through regular reviews, monitoring objectives and ensuring development needs are identified and actioned\n\tMaintain high safety standards on site\n\tTo manage the quality of raw materials, intermediates, and processes to achieve specified quality standards of the product.\n\tTo coordinate good manufacturing Practice activities on site in line with agreed GMP standards (PZC GMP Standard/NAFDAC GMP requirements).\n\tTakes responsibility for compliance with all EMS related activities in the Site to prevent, reduce or control environmental pollution arising from environmental aspects identified in the department as documented in the EMS Manual, Departmental Aspect and Impacts register, EMS related SOPs and other relevant documents.\n\n\nRequired Qualifications\n\n\n\tB.Sc Degree in Engineering / Chemistry, Master's in Business Administration\n\tComputer expertise especially in MS Word, MS Excel and PowerPoint.\n\n\nRequired Experience:\n\n\n\t10 years of working experience of which 5 must be in similar role\n\tExcellent Quantitative Analysis skills\n\tKnowledge of Financial Management\n\tBroad knowledge of manufacturing management.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]