[
  {
    "title": "Job Openings at Xpedient Services",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-xpedient-services",
    "pubDate": "Thu, 23 Oct 2025 14:43:27 GMT",
    "source": "JobGurus",
    "keyword": "xpedient services",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Xpedient Services is a human resource management, training and consulting company. We offer innovative, seamless HR services which include recruitment, training, organizational restructuring, HR payroll and other services that meet both individuals, small, medium and large organizational needs.\n\nWe are recruiting to fill the following positions below:\n\n1.) Content Creator / Photographer\n\nJob Location: Abuja\nEmployment Type: Full-time\n\nRole Summary\n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Content Creator/Photographer is responsible for producing high-quality visual and written content that showcases PayChex International’s projects, business activities, teams, and milestones.\n\tThis role requires frequent travel to various company locations to capture real-time images, videos, interviews, and stories that can be used across digital platforms, marketing materials, corporate reports, and internal communications.\n\n\nJob Descriptions\n\n\n\tCapture professional photos and videos of company projects, operations, events, and personnel across all locations.\n\tProduce creative digital content (short clips, reels, photo stories, interviews, behind the-scenes features, etc.).\n\tConduct on-site coverage of milestones, project progress, inaugurations, and client engagements. • Edit and enhance photos and videos for publication using industry-standard tools.\n\tCreate engaging captions, write-ups, and summaries to accompany visual content.\n\tDevelop human-interest stories, staff profiles, and project features for corporate communication channels.\n\tCollaborate with Communications/Marketing team to ensure alignment with brand identity and messaging.\n\tProvide content for the company’s website, social media pages, newsletters, and promotional materials.\n\tAssist in content planning and scheduling for campaigns and updates.\n\tPlan and execute content coverage trips in collaboration with project managers and site leads.\n\tMaintain a calendar of coverage activities and ensure timely content delivery.\n\tOrganize and maintain a digital archive of photos, videos, and content assets.\n\tEnsure all content is backed up, tagged, and classified for easy retrieval.\n\n\nQualifications & Experience\n\n\n\tBachelor’s Degree in any field\n\t2 – 5 years of proven experience in photography, videography, and digital content creation.\n\tStrong portfolio showcasing photo/video and storytelling skills.\n\tExperience covering corporate activities, construction sites, field projects, or events is an added advantage.\n\n\nAdditional Requirements:\n\n\n\tWillingness to travel across states or regions as required.\n\tAbility to work in dynamic environments (construction sites, field operations, offices, events).\n\tAvailability for weekend or extended-hour assignments when necessary.\n\n\nSkills & Competencies:\n\n\n\tProficiency in photography and video equipment.\n\tStrong editing skills using tools such as Adobe Photoshop, Premiere Pro, Lightroom, Final Cut Pro, or similar.\n\tCreative storytelling and copywriting ability.\n\tSocial media and digital content strategy awareness.\n\tAbility to work independently and travel frequently.\n\tStrong communication and interpersonal skills.\n\tTime management, flexibility, and attention to detail.\n\n\nSalary\nN150,000 - N200,000 / month.\n\nApplication Closing Date: 30th November, 2025.\n\nMethod of Application \nInterested and qualified candidates should send their CV to: samuelkise@xpedient.services using the Job Position as the subject of the email.\n\nNote: For more enquires send a WhatsApp message to: 08184305914.\n\n \n\n \n\n2.) Professional Nanny\n\nJob Location: Maitama, Abuja (FCT)\nReports To: Creche Supervisor / Creche Manager\nEmployment Type: Full-time\nWork Schedule: Monday - Friday.\n\nRole Summary\n\n\n\tThe Nanny is responsible for providing attentive and professional care to children within the creche.\n\tThis includes supporting their daily routines, ensuring their safety and well-being, and under the guidance of the Crèche Supervisor and Manager.\n\n\nDescription\n\n\n\tProvide direct care for children, including feeding, changing, and supervising playtime.\n\tEnsure a safe, clean, and nurturing environment at all times.\n\tObserve and report any health, behavioural, or developmental concerns to the Crèchesupervisor.\n\tFollow daily routines such as eating, resting, and playtime.\n\tCare for children’s safety, comfort, and well-being at all times.\n\tFollow set times for meals, naps, and bedtime.\n\tEngage children in simple learning and creative play.\n\tBuild warm and caring relationships with children.\n\tClean toys, play areas, and equipment regularly.\n\tAssist parents during drop-off and pick-up times.\n\tObserve children’s behaviour and development.\n\tEncourage parents to talk to the supervisor about children’s daily activities and needs.\n\tEnsure a safe and tidy environment, including cleaning and organizing children’s spaces.\n\tReport health concerns quickly.\n\tEncourage good manners and positive behaviour.\n\tKeep children’s areas clean and organized.\n\tRespect family privacy and maintain confidentiality at all times.\n\tBe flexible and adaptable to the parents' schedule and needs..\n\tUndertake any additional duties as may be assigned by management.\n\n\nQualifications and Skills\n\n\n\tQualifications: Secondary School Certificate.\n\tExperience: No prior experience required; training provided.\n\tSkills: Willingness to learn, basic child development understanding\n\n\nSalary\nN100,00 - N150,000 Monthly.\n\nApplication Closing Date: 2nd November, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: chizimushie@xpedient.services using the Job Position as the subject of the email.\n\n \n\n \n\n3.) Creche Manager\n\nJob Location: Maitama, Abuja (FCT)\nEmployment Type: Full-time\nWork Schedule: Monday - Friday\nReports To: Management\n\nRole Summary\n\n\n\tThe Crèche Manager is responsible for the overall leadership, management, and smooth running of the crèche facility.\n\tThe role demands a balance of childcare expertise, operational management, and excellent interpersonal skills.\n\n\nResponsibilities\n\n\n\tEnsure the health, safety, and welfare of all children at all times.\n\tDevelop and implement age-appropriate learning and play activities.\n\tMonitor and record the developmental progress of children.\n\tOversee daily crèche operations, ensuring a clean, safe, and welcoming environment.\n\tManage resources, equipment, and supplies efficiently.\n\tMaintain accurate documentation, including attendance, incident, and health records.\n\tTrain, and supervise childcare staff\n\tPrepare duty rosters and delegate responsibilities effectively.\n\tConduct staff performance reviews and promote professional development.\n\tAct as the primary point of contact for parents and guardians.\n\tProvide regular updates on children’s progress and well-being.\n\tHandle concerns and complaints professionally and promptly.\n\tManage budgets, procurement, and financial planning for the crèche.\n\tEnsure compliance with all childcare regulations and inspection requirements.\n\tBuild and maintain relationships with external agencies, healthcare providers, and regulators.\n\tPrepare and submit timely reports to management.\n\tFoster an inclusive environment that supports diversity and respect for all children.\n\tCollaborate with parents to create individualized care or learning plans where necessary\n\tEstablish and enforce policies on hygiene, nutrition, and behavior management\n\tDevelop emergency preparedness plans and conduct regular safety drills.\n\tEnsure a positive, supportive work culture that encourages teamwork among staff.\n\tUndertake any additional duties as may be assigned by management.\n\n\nRequirements\n\n\n\tQualifications: Registered Nurse, Postgraduate Diploma in Public Health.\n\tExperience: 5 years in childcare or related field.\n\tSkills: Leadership, communication, and health and safety knowledge.\n\n\nSalary\nN300,00 - N400,000 monthly.\n\nApplication Closing Date: 3rd November, 2025.\n\nMethod of Application \nInterested and qualified candidates should send their updated CV with professional Cover letter to: chizimushie@xpedient.services using the Job Position as the subject of the email.\n\nNote: Only qualified and suitable candidates will be contacted.\n\n     \n\n    \n\n        Click here to Apply",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Account Officer Job at Vixa Pharmaceutical Company Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/account-officer-job-at-vixa-pharmaceutical-company-limited-5",
    "pubDate": "Thu, 23 Oct 2025 14:43:27 GMT",
    "source": "JobGurus",
    "keyword": "vixa pharmaceutical company limited",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing",
      "Software Engineering"
    ],
    "content": "(function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){\n        (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),\n        m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)\n    })(window,document,'script','//www.google-analytics.com/analytics.js','ga');\n\n    ga('create', 'UA-43112273-1', 'jobgurus.com.ng');\n    ga('send', 'pageview');\n\n\n\n\n    \n        \n    Home\n    Jobs\n    Free Aptitude Test Practice\n    Employer? Post a Job\n            Register\n        Sign in\n        Contact us\n    \n\n    \n\n        \n    \n        \n\n            \n\n                \n\n                    \n                        Toggle navigation\n                        \n                        \n                        \n                    \n\n                    \n                \n            \n\n            \n                \n\n\tJobs\n\tJob Seekers\n\tAptitude Test\n\tScholarships\n\n            \n\n            \n                \n\n                                            Register\n                        Sign in\n                    \n                    Employer? Post a Job\n                \n            \n\n        \n\n    \n\n        \n        \n            \n            \n                 \n    \n                    \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n        \n     \n\n\n                            \n                    \n        \n                        CLICK HERE TO JOIN OUR WHATSAPP CHANNEL \n                    \n    \n\n    \n                                \n                    \n\n                        \n                            \n                        \n\n                        \n                            \n                                Any Specialization\n                                                                    Accounting / Audit / Finance\n                                                                    Administration/ Office/ Operations\n                                                                    Advertising/ Social Media/ Marketing/ PR\n                                                                    Agriculture / Agro Allied\n                                                                    Analyst/ Quality Control\n                                                                    Automotive/ Car Services\n                                                                    Aviation / Airline\n                                                                    Banking / Insurance\n                                                                    Building Design / Architecture\n                                                                    Construction / Mining\n                                                                    Consulting / Business Strategy/ Planning\n                                                                    Craftsmen / Artisans\n                                                                    Creatives (Arts, Design, Fashion)\n                                                                    Customer Service\n                                                                    Domestic / Janitorial Services\n                                                                    Driving / Haulage\n                                                                    Education / Teaching / Training\n                                                                    Engineering / Technical\n                                                                    Executive / Management\n                                                                    Freelance / Data Entry\n                                                                    Government Agencies / Public Sector\n                                                                    Graduates / Freshers\n                                                                    Grants /  Scholarships\n                                                                    Hospitality / Food Services\n                                                                    HSE / Safety Management\n                                                                    Human Resources / Recruitment\n                                                                    Information Technology / ICT\n                                                                    Internship/ Industrial Training\n                                                                    Legal / Law\n                                                                    Logistics / Transportation/ Supply\n                                                                    Manufacturing / Production\n                                                                    Maritime Services / Shipping\n                                                                    Media / Art / Entertainment\n                                                                    Medical/ Healthcare / Pharmaceutical\n                                                                    Military / Para-Military\n                                                                    NGO / Community Services\n                                                                    Oil & Gas / Energy\n                                                                    Procurement/ Purchasing\n                                                                    Project Management\n                                                                    Real Estate / Property / Surveying\n                                                                    Research / Survey\n                                                                    Risk Management / Compliance\n                                                                    Sales / Business Development\n                                                                    Secretarial / PA\n                                                                    Security / Intelligence\n                                                                    Software/ Programming / Web development\n                                                                    Sports / Fitness\n                                                                    Supply Chain/ Store\n                                                                    Technicians\n                                                                    Telecommunications\n                                                                    Tourism / Travels\n                                                                    Vocational Trade and Services\n                                                            \n                        \n\n                        \n                            \n                                Any Work Level\n                                                                    Entry Level (Trainee)\n                                                                    Executive (Director, Head of Dept)\n                                                                    Experienced (Non-Manager)\n                                                                    Internship\n                                                                    Manager (Staff Supervisor)\n                                                                    Senior Executive (MD, CEO, COO)\n                                                                    Vocational (Skilled/Unskilled Labour)\n                                                            \n                        \n\n                        \n                            \n                                 Search\n                            \n                        \n                    \n                \n                            \n            \n\n\n\n\n\n\n            \n\n                \n                                        \n                    \n                                        \n                    \n                    \n\n                    \n                        \n                        \n\n{\n  \"@context\": \"https://schema.org\",\n  \"@type\": \"JobPosting\",\n  \"title\": \"Account Officer\",\n  \"description\": \"Vixa Pharmaceutical Co Ltd was founded by Chief Sir Ebuka Okafor, an entrepreneur with vast experience in the pharmaceutical industry. Vixa Pharmaceutical Co Ltd has come of age with an imposing record of over 10 years meeting the needs of sick and needy through a range of globally sourced, best-in-their-class life saving medicines.\n\nOur range of pharmaceutical products include critical care, super specialty products covering the categories of Anti-Malarial, Anti-Biotic, Anti-Fungal, Anti-Emetic, Steroid, NSAID drugs, Anti-Spasmodic, Anti-Hypertensive, Worm Expellant, Anti-Hastimine and Anti-Psychotic drugs. Today, Vixa Pharmaceutical Co Ltd. is a house hold name with diverse marketing activities all over Nigeria and with a staff strength of over 150.\n\nOur major partners are mainly from China and India and we have over 100 registered products with NAFDAC. We are poised for the future in the mission to be the leading pharmaceutical company in Nigeria through the provision of world class services to our customers and other stakeholders and the vision to be the largest manufacturer of drugs in the whole of West Africa.\n\nWe are recruiting to fill the position below:\n\nJob Position: Account Officer\n\nJob Location:&amp;nbsp;Lagos\nEmployment Type: Full-time\n\nJob Description\n\n\n\tOversee the assigned business unit financial resources so as to ensure efficient and effective functioning of its operations.\n\tManaging the portfolio of the respective Sales accrued account holder.\n\tReview the company&amp;rsquo;s accounting policies, from time to time, to ascertain their suitability to a dynamic business environment.\n\n\nDuties/Responsibilities\n\n\n\tAnalyze potential contracts and mergers and manage all investments for company.\n\tResponsible for the input of financial transactions into the company&amp;rsquo;s accounting software.\n\tAdminister all accounting functions for acquisition and integration of processes.\n\tPrepare monthly revenue report based on list of stock distribution to customers/client.\n\tSupervise all functions of Corporate Controller and subsidiaries.\n\tMaintain records of all data and evaluate it to recommend product improvements.\n\tReconciles financial discrepancies by collecting and analyzing account information.\n\tMaintains accounting controls by preparing and recommending policies and procedures.\n\tEnsure proper documentation of invoices and purchase order for the respective financial transaction.\n\tAssessing correctness of claim, review computation of stocks/goods amount and make necessary adjustments.\n\tMonitor Company&amp;rsquo;s various cash flow forecasts.\n\tMaintains customer confidence and protects operations by keeping financial information confidential.\n\tExecute other duties as may be required by immediate manager and other members of the management.\n\n\nQualifications\n\n\n\tA minimum of B.Sc. in Accounting.\n\tMinimum of 2 years of experience in a reputable organization.\n\tVersatile Knowledge in the use of SAGE Software &amp;amp; ERP is essential.\n\tProfessional qualification will be added advantage.\n\tBelow 30 years.\n\n\nSkills/Knowledge Requirements:\n\n\n\tSelf-motivation.\n\tIntegrity.\n\tBusiness acumen and interest.\n\tOrganizational skills and ability to manage deadlines.\n\tTeam-work ability.\n\tCommunication and interpersonal skills.\n\tProficiency in IT (sage software).\n\tPresentation and reporting skills.\n\tAttention to detail.\n\tA keen interest in numeracy.\n\n\nMethod of Application\nInterested and qualified candidates should forward their CV and Application Letter to:&amp;nbsp;pharmarecruitment2online@gmail.com&amp;nbsp;with the Job Position applied for as the Subject of the email.\n\nNote:&amp;nbsp;Only shortlisted candidate will be contacted.\",\n  \"datePosted\": \"2025-10-23\",\n  \"validThrough\": \"2025-11-06\",\n  \"employmentType\": \"Full-Time\",\n  \"hiringOrganization\": {\n    \"@type\": \"Organization\",\n    \"name\": \"Vixa Pharmaceutical Company Limited\"\n    \n  },\n  \"jobLocation\": {\n    \"@type\": \"Place\",\n    \"address\": {\n      \"@type\": \"PostalAddress\",\n       \"postalCode\": \". \",\n       \"addressRegion\": \". \",\n       \"streetAddress\": \". \",\n      \"addressLocality\": \"Lagos\",\n      \"addressCountry\": \"NG\"\n     \n      \n    }\n  },\n  \"identifier\": {\n    \"@type\": \"PropertyValue\",\n    \"name\": \"\",\n    \"value\": \"189301\"\n  },\n  \"baseSalary\": {\n    \"@type\": \"MonetaryAmount\",\n    \"currency\": \"NGN\",\n    \"value\": {\n      \"@type\": \"QuantitativeValue\",\n      \"minValue\": 0,\n      \"maxValue\": 0,\n      \"unitText\": \"MONTH\"\n    }\n  }\n}\n\n\n\nAccount Officer Job at Vixa Pharmaceutical Company Limited\n\n\n\n\n        \n    \n\n        \n        Vixa Pharmaceutical Co Ltd was founded by Chief Sir Ebuka Okafor, an entrepreneur with vast experience in the pharmaceutical industry. Vixa Pharmaceutical Co Ltd has come of age with an imposing record of over 10 years meeting the needs of sick and needy through a range of globally sourced, best-in-their-class life saving medicines.\n\nOur range of pharmaceutical products include critical care, super specialty products covering the categories of Anti-Malarial, Anti-Biotic, Anti-Fungal, Anti-Emetic, Steroid, NSAID drugs, Anti-Spasmodic, Anti-Hypertensive, Worm Expellant, Anti-Hastimine and Anti-Psychotic drugs. Today, Vixa Pharmaceutical Co Ltd. is a house hold name with diverse marketing activities all over Nigeria and with a staff strength of over 150.\n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nOur major partners are mainly from China and India and we have over 100 registered products with NAFDAC. We are poised for the future in the mission to be the leading pharmaceutical company in Nigeria through the provision of world class services to our customers and other stakeholders and the vision to be the largest manufacturer of drugs in the whole of West Africa.\n\nWe are recruiting to fill the position below:\n\nJob Position: Account Officer\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Description\n\n\n\tOversee the assigned business unit financial resources so as to ensure efficient and effective functioning of its operations.\n\tManaging the portfolio of the respective Sales accrued account holder.\n\tReview the company’s accounting policies, from time to time, to ascertain their suitability to a dynamic business environment.\n\n\nDuties/Responsibilities\n\n\n\tAnalyze potential contracts and mergers and manage all investments for company.\n\tResponsible for the input of financial transactions into the company’s accounting software.\n\tAdminister all accounting functions for acquisition and integration of processes.\n\tPrepare monthly revenue report based on list of stock distribution to customers/client.\n\tSupervise all functions of Corporate Controller and subsidiaries.\n\tMaintain records of all data and evaluate it to recommend product improvements.\n\tReconciles financial discrepancies by collecting and analyzing account information.\n\tMaintains accounting controls by preparing and recommending policies and procedures.\n\tEnsure proper documentation of invoices and purchase order for the respective financial transaction.\n\tAssessing correctness of claim, review computation of stocks/goods amount and make necessary adjustments.\n\tMonitor Company’s various cash flow forecasts.\n\tMaintains customer confidence and protects operations by keeping financial information confidential.\n\tExecute other duties as may be required by immediate manager and other members of the management.\n\n\nQualifications\n\n\n\tA minimum of B.Sc. in Accounting.\n\tMinimum of 2 years of experience in a reputable organization.\n\tVersatile Knowledge in the use of SAGE Software & ERP is essential.\n\tProfessional qualification will be added advantage.\n\tBelow 30 years.\n\n\nSkills/Knowledge Requirements:\n\n\n\tSelf-motivation.\n\tIntegrity.\n\tBusiness acumen and interest.\n\tOrganizational skills and ability to manage deadlines.\n\tTeam-work ability.\n\tCommunication and interpersonal skills.\n\tProficiency in IT (sage software).\n\tPresentation and reporting skills.\n\tAttention to detail.\n\tA keen interest in numeracy.\n\n\nMethod of Application\nInterested and qualified candidates should forward their CV and Application Letter to: pharmarecruitment2online@gmail.com with the Job Position applied for as the Subject of the email.\n\nNote: Only shortlisted candidate will be contacted.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n\n\n\n        \n        \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n   \n\n\n    \n        Similar Jobs\n    \n\n    \n        \n                        Job Openings at Amo Farm Sieberer Hatchery Limited\n                        Regional Administrative / Finance Officer Job at BlueBrain Services Limited\n                        Administrative / Accounting Officer Job at D&M Data Solutions Limited\n                        Finance Director (F/H) Job at Group Vivendi Africa\n                        Accounts Payable Officer Job at Deloitte\n                        Accounts Associate Job at Volition Capital\n                        Accountant Job at Total Child School\n                        Accountant Job at Resource Divine Energy and Logistics\n                        Female Accountant Job at HTSF Global Nigeria Limited\n                        Accounts Officer Job at University Press Plc\n                    \n    \n\n\n\n                        \n                    \n\n                    \n                        \n\n\n\n    \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n\n\n\n\n\n          \n\n\n    \n\n        Hottest Jobs\n\n        \n        \n            \n\n                Apply Before November 24 and Become a Software Developer\n\n               \n            \n        \n            \n\n                Personal Assistant\n\n               \n            \n        \n            \n\n                Customer Service Representative Job at GUO Transport Company\n\n               \n            \n        \n            \n\n                Job Openings at Ganfeng Lithium Industry Limited\n\n               \n            \n        \n            \n\n                IT Support Specialist Job at PalmPay\n\n               \n            \n        \n            \n\n                Job Openings at Don Quester Consulting\n\n               \n            \n        \n            \n\n                Facilities Supervisor\n\n               \n            \n        \n            \n\n                Front Desk / Customer Service Officer Job at Elan Orris Real Estate Limited\n\n               \n            \n        \n            \n\n                Supply Chain Officer Job at LifeBank\n\n               \n            \n        \n            \n\n                Warehouse / Logistics Manager Job at Welcome U Shopping Centre\n\n               \n            \n        \n        \n\n    \n\n\n\n\n        \n        \n   \n\n\n                    \n                            \n            \n        \n        \n        \n\n        \n\n    \n\n        \n\n            \n\n                \n\n                    Job Seekers\n\n                    \n\n                        Search for Jobs\n                         Featured Jobs\n                         Jobs by Specialization\n                         Jobs by Industry\n                         Jobs by Location\n                         \n                        Companies Currently Hiring\n\n                        Upload CV\n\n                        Free Aptitude Test Practice\n                        \n                        Scholarships and Financial Aid\n\n                        Testimonies\n                    \n\n                \n\n                \n\n                    Employers\n\n                    \n\n                        Post A Job\n\n                        Search Resumes/Profiles\n\n                        Create Employer Account\n\n                        Advertise\n\n                        Pricing\n\n                    \n\n                \n\n                \n\n                    Tools & Resources\n\n                    \n\n                        Contact us\n                        \n                        Our Blog\n\n                        Job XML/RSS Feeds\n \n                        Free Aptitude Test Practice\n\n                        Bank Details\n\n                        FAQ & Support\n\n                    \n\n                \n\n                \n\n                    Connect with us\n\n                    \n\n                        \n\n                            \n\n                            \n\n                        \n\n                        \n\n                            \n\n                            \n\n                        \n\n                \n\n                        \n\n                            \n\n                            \n\n                        \n\n                    \n\n\n\n                    \n\n                        Customer Care\n\n                        09134259221 \n\n                        (9am - 5pm) weekdays\n\n                         info [at] jobgurus.com.ng\n\n                    \n\n\n\n                \n\n            \n\n        \n\n    \n\n\n\n    \n\n        \n\n\n\n            \n\n                Privacy Policy\n\n                Terms & Conditions\n\n                Sitemap\n                \n                About us\n\n            \n\n\n\n            Copyright © 2025 Jobgurus.com.ng - Latest Jobs in Nigeria 2025. All right reserved.",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Openings at Hec Recruit",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-hec-recruit",
    "pubDate": "Thu, 23 Oct 2025 14:43:27 GMT",
    "source": "JobGurus",
    "keyword": "hec recruit",
    "duplicate": false,
    "classifications": [],
    "content": "Hec Recruit is a full-service HR consulting firm with a unique approach. Since 2020 we have been helping our clients find a job best suited for their skills and interests, and helping local companies locate the best employees.\n\nWe are recruiting to fill the following positions below:\n\n1.) Pharmacist\n\nJob Locations: Victoria Island & Lekki, Lagos\nEmployment Type: Full-time\nIndustry: Community Pharmacy\nWorkplace Type: On Site\n\nJob Description\n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tCommunity pharmacists are well-respected professionals within their local community who use their expert knowledge of medicines to help patients get the best possible care and outcomes from their medicines.\n\tAs a community pharmacist, you'll be responsible for dispensing prescription and over-the-counter medicines that help people to maintain and improve their lives, in a cost-effective way.\n\tYou will be responsible for constantly monitoring the quality, safety, and use of medicines, which requires a high level of interaction with patients, providing advice and information about the use of medicines and medical appliances.\n\tAs a community pharmacist, you will work alongside pharmacy technicians and pharmacy support staff, such as pharmacy assistants to deliver the pharmacy service.\n\tEach person is a high valued member of the pharmacy team.\n\tYour location of work will typically be a high street pharmacy, part of a chain or an independent, or you might work in a doctor's practice or health centre.\n\n\nRequirements\n\n\n\tB.Pharm\n\tPost NYSC experience.\n\n\nSalary\nN300,000 monthly.\n\nMethod of Application \nInterested and qualified candidates should send their CV to: hecrecruitment.hrconsulting@gmail.com using the Job Position as the subject of the email.\n\n \n\n \n\n2.) Baker\n\nJob Location: Surulere, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe are seeking a skilled and experienced Baker to join our team in Surulere, Lagos.\n\tThe successful candidate will be responsible for preparing a variety of baked goods, such as bread, cakes, and pastries, to the highest standards of quality and presentation.\n\tIf you have a passion for baking and a keen eye for detail, we would love to hear from you.\n\n\nKey Responsibilities\n\n\n\tPrepare and bake a variety of bread, cakes, and pastries to the highest standards of quality and presentation\n\tFollow recipes and production schedules to ensure timely delivery of products\n\tMaintain a clean and safe working environment, adhering to all health and safety regulations\n\tMonitor ingredient levels and order supplies as needed\n\tCollaborate with other team members to achieve production targets and meet customer demands\n\tDevelop and implement new recipes and products to stay ahead of trends and customer preferences\n\n\nRequirements\n\n\n\tInterested candidates should possess an SSCE / GCE / NECO qualification\n\t2+ years of experience as a Baker in a commercial bakery or similar environment\n\tProven experience with baking bread, cakes, and pastries\n\tStrong knowledge of baking techniques, ingredients, and recipes\n\tExcellent attention to detail and quality control skills\n\tAbility to work efficiently in a fast-paced environment\n\tGood communication and teamwork skills.\n\n\nSalary\nN100,000 - N120,000 / Month.\n\nMethod of Application \nInterested and qualified candidates should send their CV to: hecrecruitment.hrconsulting@gmail.com using the Job Position as the subject of the email.\n\n \n\n \n\n3.) Cook\n\nJob Location: Ojota, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe are seeking a skilled and experienced Cook to prepare delicious meals for our team.\n\tThe successful candidate will be responsible for preparing and cooking a variety of dishes, maintaining a clean and safe kitchen environment, and ensuring that all meals are prepared to a high standard.\n\n\nResponsibilities\n\n\n\tPrepare and cook a variety of meals, including breakfast, lunch, and dinner\n\tPlan and organize menus, taking into account dietary restrictions and preferences\n\tMaintain a clean and safe kitchen environment, adhering to health and safety regulations\n\tEnsure all meals are prepared to a high standard and presented in an appealing way\n\tManage kitchen supplies and ingredients, ensuring that all items are stored properly and used efficiently\n\tCollaborate with other team members to ensure seamless service\n\n\nRequirements\n\n\n\t2+ years of experience as a Cook in a busy kitchen environment\n\tProven experience in preparing delicious and nutritious meals\n\tAbility to work efficiently and effectively in a fast-paced environment\n\tGood communication and teamwork skills\n\tAbility to follow recipes and instructions accurately\n\tPhysical ability to stand for long periods and lift heavy objects\n\n\nSalary\nN80,000 per month.\n\nMethod of Application \nInterested and qualified candidates should send their CV to: hecrecruitment.hrconsulting@gmail.com using the Job Position as the subject of the email.\n\n \n\n \n\n4.) Medical Doctor\n\nJob Location: Surulere, Lagos\nEmployment Type: Full-time\n\nSummary\n\n\n\tWe are seeking a qualified and compassionate Medical Doctor to join our healthcare team.\n\tThe successful candidate will provide high-quality patient care, diagnose and treat various medical conditions, and work collaboratively with other healthcare professionals to ensure excellent patient outcomes.\n\n\nKey Responsibilities\n\n\n\tConduct thorough medical examinations and assessments.\n\tDiagnose and manage various medical conditions, including acute and chronic illnesses.\n\tDevelop and implement treatment plans.\n\tPrescribe medications and therapies.\n\tProvide preventive care and health education.\n\tCollaborate with multidisciplinary teams.\n\tMaintain accurate medical records.\n\tStay updated with medical advancements.\n\n\nRequirements\n\n\n\tMedical Degree (MBBS).\n\t2 years of post NYSC experience.\n\n\nSalary\nN400,000 monthly.\n\nMethod of Application \nInterested and qualified candidates should send their CV to: hecrecruitment.hrconsulting@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Vacancies at Eric Kayser Nigeria",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancies-at-eric-kayser-nigeria",
    "pubDate": "Thu, 23 Oct 2025 14:43:27 GMT",
    "source": "JobGurus",
    "keyword": "eric kayser nigeria",
    "duplicate": false,
    "classifications": [],
    "content": "Eric Kayser Nigeria is part of the globally renowned Maison Kayser brand, founded by master baker Eric Kayser in Paris, France. Established in Nigeria to bring authentic French bakery excellence to the local market, Eric Kayser Nigeria is known for its commitment to artisanal craftsmanship, high-quality ingredients, and exceptional customer experience. With locations in key parts of Lagos—including Victoria Island, Ikoyi, and the Murtala Muhammed Airport—Eric Kayser Nigeria offers a wide range of freshly baked breads, viennoiseries, pastries, and gourmet meals, all made with the finest techniques and natural sourdough.\n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nAt the heart of Eric Kayser Nigeria is a dedication to excellence, innovation, and hospitality, making it a preferred destination for both everyday indulgence and premium café experiences. We are proud to uphold the global Kayser tradition while infusing it with local relevance and exceptional service tailored to the Nigerian market.\n\nWe are recruiting to fill the following positions below:\n\n1.) Maintenance Technician (Coffee Machine Specialist)\n\nJob Location: Victoria Island, Ikoyi, Leila, Airport, and Chevron - Lagos\nEmployment Type: Full-time\nDepartment: Engineering / Maintenance\nReports To: Facility Manager\n\nJob Summary\n\n\n\tThe Maintenance Technician (Coffee Machine Specialist) is responsible for the preventive and corrective maintenance of all electrical, mechanical, and kitchen equipment across Eric Kayser outlets — with a strong focus on coffee machine servicing, calibration, and repair.\n\tThe role ensures that all equipment functions optimally to support uninterrupted operations, product quality, and customer satisfaction. The ideal candidate should possess solid technical knowledge of espresso machines, grinders, and brewing systems, along with general expertise in kitchen and bakery equipment maintenance.\n\n\nKey Responsibilities\nEquipment Maintenance & Repair:\n\n\n\tCarry out routine preventive maintenance on all coffee machines, grinders, ovens, chillers, freezers, dishwashers, mixers, and other electrical appliances.\n\tDiagnose faults and perform prompt corrective repairs on coffee machines (e.g., La Marzocco, Nuova Simonelli, Rancilio, or equivalent brands).\n\tReplace worn-out components (seals, gaskets, solenoids, thermostats, heating elements, etc.) to restore full functionality.\n\tEnsure all equipment is calibrated according to manufacturer and company standards.\n\tMaintain proper water filtration systems for all coffee machines.\n\n\nTechnical Troubleshooting:\n\n\n\tRespond quickly to emergency repair calls from outlets and diagnose issues on-site.\n\tDocument fault causes, repair actions, and parts replaced after every service.\n\tCoordinate with vendors or external engineers where specialized repairs are required.\n\tEnsure all safety standards and protocols are followed during maintenance and electrical work.\n\n\nPreventive Maintenance:\n\n\n\tDevelop and implement a monthly preventive maintenance schedule for all outlets.\n\tConduct performance checks and service logs for each coffee machine and other key kitchen equipment.\n\tAdvise management on potential risks, recurring faults, or obsolete equipment that require replacement or upgrade.\n\n\nCoordination & Reporting:\n\n\n\tWork closely with the Facility Manager and Operations Team to plan maintenance visits with minimal disruption to operations.\n\tKeep accurate records of maintenance activities, spare parts used, and work completed.\n\tPrepare weekly maintenance reports and share updates with the Facility Manager and HR.\n\tRecommend sourcing options for high-quality spare parts and consumables for coffee machines.\n\n\n•General Maintenance Support:\n\n\n\tSupport electrical and plumbing repairs across outlets as needed.\n\tPerform installation, relocation, or calibration of new equipment.\n\tMaintain cleanliness and proper organization of the maintenance workshop and tools.\n\n\nQualifications & Experience\n\n\n\tOND / HND / B.Eng in Electrical or Mechanical Engineering or related technical discipline.\n\tMinimum of 3–5 years of proven experience as a Maintenance Technician in a hospitality, bakery, or café environment.\n\tHands-on experience with commercial coffee machine brands (e.g., La Marzocco, Rancilio, Simonelli, Wega, or Expobar).\n\tCertification or formal training in coffee machine maintenance is an added advantage.\n\tMust be physically fit, reliable, and willing to travel between outlets when required.\n\n\nKey Competencies & Skills:\n\n\n\tStrong expertise in coffee machine troubleshooting, descaling, programming, and calibration.\n\tGood knowledge of electrical systems, plumbing, and kitchen equipment.\n\tExcellent problem-solving and analytical skills.\n\tAbility to work under pressure and respond swiftly to emergencies.\n\tAttention to detail and commitment to quality.\n\tStrong communication and teamwork abilities.\n\n\nWorking Conditions:\n\n\n\tRegular travel between outlets (V.I., Ikoyi, Leila, Airport, and Chevron).\n\tMay be required to work weekends or after hours for urgent repairs.\n\tMust adhere strictly to safety, hygiene, and operational protocols.\n\n\nSalary\nN250,000 / month.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: careers@erickayserng.com using the Job Position as the subject of the email.\n\n \n\n \n\n2.) Driver\n\nJob Location: Victoria Island, Lagos\nEmployment Type: Full-time\n\nResponsibilities\n\n\n\tSafely transport food items, supplies, and staff as required.\n\tMaintain cleanliness and good condition of the vehicle.\n\tConduct routine checks on the vehicle to ensure it’s roadworthy.\n\tFollow all traffic laws and safety regulations.\n\tPerform other logistics or delivery duties as assigned.\n\n\nRequirements\n\n\n\tMinimum of SSCE certification or equivalent qualification.\n\t3 - 5 years of relevant work experience.\n\tValid driver’s license with a good driving record.\n\tProven experience as a driver (experience in restaurant or logistics delivery is an advantage).\n\tFamiliar with Lagos routes (or insert your city/area).\n\tPunctual, reliable, and well-organized.\n\tGood communication and interpersonal skills.\n\n\nSalary\nN150,000 monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: careers@erickayserng.com using the Job Position as the subject of the mail.\n\n \n\n3.) Display Attendant\n\nJob Location: Victoria Island, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe are looking for a smart, attentive, and organized Display Attendant to join our team and help maintain an appealing and well-arranged food display area.\n\n\nResponsibilities\n\n\n\tArrange and restock food displays attractively and neatly.\n\tEnsure all displayed items are properly labeled and presented.\n\tMonitor food quality and appearance throughout the day.\n\tMaintain cleanliness and hygiene of the display area at all times.\n\tAssist customers courteously when needed.\n\tWork closely with the kitchen and service staff to ensure timely replenishment.\n\n\nRequirements\n\n\n\tMinimum of SSCE or equivalent qualification.\n\tPrevious experience in a restaurant or food service environment is an added advantage.\n\tGood communication and interpersonal skills.\n\tStrong attention to detail and cleanliness.\n\tMust be reliable, punctual, and presentable.\n\n\nSalary\nN80,000 per month. \n\nMethod  of Application \nInterested and qualified candidates should send their CV to: careers@erickayserng.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Head of IT Job at American Open University Nigeria",
    "link": "https://www.jobgurus.com.ng/jobs/view/head-of-it-job-at-american-open-university-nigeria-1",
    "pubDate": "Thu, 23 Oct 2025 14:43:27 GMT",
    "source": "JobGurus",
    "keyword": "american open university nigeria",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing",
      "Software Engineering"
    ],
    "content": "(function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){\n        (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),\n        m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)\n    })(window,document,'script','//www.google-analytics.com/analytics.js','ga');\n\n    ga('create', 'UA-43112273-1', 'jobgurus.com.ng');\n    ga('send', 'pageview');\n\n\n\n\n    \n        \n    Home\n    Jobs\n    Free Aptitude Test Practice\n    Employer? Post a Job\n            Register\n        Sign in\n        Contact us\n    \n\n    \n\n        \n    \n        \n\n            \n\n                \n\n                    \n                        Toggle navigation\n                        \n                        \n                        \n                    \n\n                    \n                \n            \n\n            \n                \n\n\tJobs\n\tJob Seekers\n\tAptitude Test\n\tScholarships\n\n            \n\n            \n                \n\n                                            Register\n                        Sign in\n                    \n                    Employer? Post a Job\n                \n            \n\n        \n\n    \n\n        \n        \n            \n            \n                 \n    \n                    \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n        \n     \n\n\n                            \n                    \n        \n                        CLICK HERE TO JOIN OUR WHATSAPP CHANNEL \n                    \n    \n\n    \n                                \n                    \n\n                        \n                            \n                        \n\n                        \n                            \n                                Any Specialization\n                                                                    Accounting / Audit / Finance\n                                                                    Administration/ Office/ Operations\n                                                                    Advertising/ Social Media/ Marketing/ PR\n                                                                    Agriculture / Agro Allied\n                                                                    Analyst/ Quality Control\n                                                                    Automotive/ Car Services\n                                                                    Aviation / Airline\n                                                                    Banking / Insurance\n                                                                    Building Design / Architecture\n                                                                    Construction / Mining\n                                                                    Consulting / Business Strategy/ Planning\n                                                                    Craftsmen / Artisans\n                                                                    Creatives (Arts, Design, Fashion)\n                                                                    Customer Service\n                                                                    Domestic / Janitorial Services\n                                                                    Driving / Haulage\n                                                                    Education / Teaching / Training\n                                                                    Engineering / Technical\n                                                                    Executive / Management\n                                                                    Freelance / Data Entry\n                                                                    Government Agencies / Public Sector\n                                                                    Graduates / Freshers\n                                                                    Grants /  Scholarships\n                                                                    Hospitality / Food Services\n                                                                    HSE / Safety Management\n                                                                    Human Resources / Recruitment\n                                                                    Information Technology / ICT\n                                                                    Internship/ Industrial Training\n                                                                    Legal / Law\n                                                                    Logistics / Transportation/ Supply\n                                                                    Manufacturing / Production\n                                                                    Maritime Services / Shipping\n                                                                    Media / Art / Entertainment\n                                                                    Medical/ Healthcare / Pharmaceutical\n                                                                    Military / Para-Military\n                                                                    NGO / Community Services\n                                                                    Oil & Gas / Energy\n                                                                    Procurement/ Purchasing\n                                                                    Project Management\n                                                                    Real Estate / Property / Surveying\n                                                                    Research / Survey\n                                                                    Risk Management / Compliance\n                                                                    Sales / Business Development\n                                                                    Secretarial / PA\n                                                                    Security / Intelligence\n                                                                    Software/ Programming / Web development\n                                                                    Sports / Fitness\n                                                                    Supply Chain/ Store\n                                                                    Technicians\n                                                                    Telecommunications\n                                                                    Tourism / Travels\n                                                                    Vocational Trade and Services\n                                                            \n                        \n\n                        \n                            \n                                Any Work Level\n                                                                    Entry Level (Trainee)\n                                                                    Executive (Director, Head of Dept)\n                                                                    Experienced (Non-Manager)\n                                                                    Internship\n                                                                    Manager (Staff Supervisor)\n                                                                    Senior Executive (MD, CEO, COO)\n                                                                    Vocational (Skilled/Unskilled Labour)\n                                                            \n                        \n\n                        \n                            \n                                 Search\n                            \n                        \n                    \n                \n                            \n            \n\n\n\n\n\n\n            \n\n                \n                                        \n                    \n                                        \n                    \n                    \n\n                    \n                        \n                        \n\n{\n  \"@context\": \"https://schema.org\",\n  \"@type\": \"JobPosting\",\n  \"title\": \"Head of IT\",\n  \"description\": \"American Open University Nigeria is not merely a new university; it is a transformative, industry-engaged, and competency-based institution designed to redefine higher education and prepare students for the future of work. Our mission is to empower students to learn locally and earn globally. Through our custom-built enterprise applications and strategic partnerships with tech giants like Google, Cisco, and Microsoft, we provide a learning experience on a par with the world&amp;#39;s leading universities.&amp;nbsp;\n\nApplications are invited from visionary builders and transformative leaders to join our senior management team in the capacity below:\n\nJob Position:&amp;nbsp;Head of IT\n\nJob Location:&amp;nbsp;Bodija, Ibadan - Oyo\n\nYour Mission\n\n\n\tArchitect and lead a world-class digital ecosystem that is the foundation of our university.\n\tYou will drive our digital transformation, ensuring our custom enterprise applications, LMS, and IT infrastructure deliver a seamless, secure, and globally competitive user experience.&amp;nbsp;\n\n\nYour Profile\n\n\n\tMaster&amp;#39;s in IT or a related field, 10+ years of strategic IT leadership, and key industry certifications (e.g., CISSP, PMP, ITIL).\n\tYou must be an expert in ODeL platforms and have a proven record of leading tech initiatives in a complex, global-facing organization.\n\n\nCore Requirements:\n\n\n\tTech-Savvy &amp;amp; Digitally Fluent: You must be proficient in leveraging technology to drive efficiency and innovation. Hands-on experience with enterprise applications (like ERPs, LMS) is essential.\n\tGlobal Mindset: You will contribute to an environment that opens global advantages to our students and staff, preparing them for international careers and collaboration.\n\tCommitment to Global Best Practices: You must have a deep understanding of the standards and experiences obtainable in leading global universities to support our diverse and international student body.\n\tDeep Industry Knowledge: Your expertise will be critical in shaping ourcompetency-based curriculum and fostering the industry engagement that defines our educational model.\n\tRecognized Industry Certifications: In addition to academic qualifications, relevant professional and industry certifications are required to demonstrate your commitment to applied excellence.\n\n\nMethod of Application\nInterested and qualified candidates should send their&amp;nbsp;CV, a cover letter detailing their vision for the role, and proof of relevant industry certifications to:&amp;nbsp;careers@aouniversity.org&amp;nbsp;using the Job Position as the subject of the mail.\n\nNote:&amp;nbsp;If you are a builder with a global mindset and a passion for technology-driven education, we invite you to join us.\",\n  \"datePosted\": \"2025-10-23\",\n  \"validThrough\": \"2025-11-16\",\n  \"employmentType\": \"Full-Time\",\n  \"hiringOrganization\": {\n    \"@type\": \"Organization\",\n    \"name\": \"American Open University Nigeria\"\n    \n  },\n  \"jobLocation\": {\n    \"@type\": \"Place\",\n    \"address\": {\n      \"@type\": \"PostalAddress\",\n       \"postalCode\": \". \",\n       \"addressRegion\": \". \",\n       \"streetAddress\": \". \",\n      \"addressLocality\": \"Oyo\",\n      \"addressCountry\": \"NG\"\n     \n      \n    }\n  },\n  \"identifier\": {\n    \"@type\": \"PropertyValue\",\n    \"name\": \"\",\n    \"value\": \"189283\"\n  },\n  \"baseSalary\": {\n    \"@type\": \"MonetaryAmount\",\n    \"currency\": \"NGN\",\n    \"value\": {\n      \"@type\": \"QuantitativeValue\",\n      \"minValue\": 0,\n      \"maxValue\": 0,\n      \"unitText\": \"MONTH\"\n    }\n  }\n}\n\n\n\nHead of IT Job at American Open University Nigeria\n\n\n\n\n        \n    \n\n        \n        American Open University Nigeria is not merely a new university; it is a transformative, industry-engaged, and competency-based institution designed to redefine higher education and prepare students for the future of work. Our mission is to empower students to learn locally and earn globally. Through our custom-built enterprise applications and strategic partnerships with tech giants like Google, Cisco, and Microsoft, we provide a learning experience on a par with the world's leading universities. \n\nApplications are invited from visionary builders and transformative leaders to join our senior management team in the capacity below:\n\nJob Position: Head of IT\n\nJob Location: Bodija, Ibadan - Oyo\n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nYour Mission\n\n\n\tArchitect and lead a world-class digital ecosystem that is the foundation of our university.\n\tYou will drive our digital transformation, ensuring our custom enterprise applications, LMS, and IT infrastructure deliver a seamless, secure, and globally competitive user experience. \n\n\nYour Profile\n\n\n\tMaster's in IT or a related field, 10+ years of strategic IT leadership, and key industry certifications (e.g., CISSP, PMP, ITIL).\n\tYou must be an expert in ODeL platforms and have a proven record of leading tech initiatives in a complex, global-facing organization.\n\n\nCore Requirements:\n\n\n\tTech-Savvy & Digitally Fluent: You must be proficient in leveraging technology to drive efficiency and innovation. Hands-on experience with enterprise applications (like ERPs, LMS) is essential.\n\tGlobal Mindset: You will contribute to an environment that opens global advantages to our students and staff, preparing them for international careers and collaboration.\n\tCommitment to Global Best Practices: You must have a deep understanding of the standards and experiences obtainable in leading global universities to support our diverse and international student body.\n\tDeep Industry Knowledge: Your expertise will be critical in shaping ourcompetency-based curriculum and fostering the industry engagement that defines our educational model.\n\tRecognized Industry Certifications: In addition to academic qualifications, relevant professional and industry certifications are required to demonstrate your commitment to applied excellence.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV, a cover letter detailing their vision for the role, and proof of relevant industry certifications to: careers@aouniversity.org using the Job Position as the subject of the mail.\n\nNote: If you are a builder with a global mindset and a passion for technology-driven education, we invite you to join us.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n\n\n\n        \n        \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n   \n\n\n    \n        Similar Jobs\n    \n\n    \n        \n                        Head of IT Job at American Open University Nigeria\n                        I.T Officer Job at D.I.K International Limited\n                        Job Vacancies at D.I.K International Limited\n                        IP & Security Engineer Job at Lebara Nigeria\n                        Job Openings at Molaprise\n                        IT Support Specialist Job at PalmPay\n                        Network & Server Administrator Job at Koins Microfinance Bank Limited\n                        Job Openings at Coollink Limited\n                        IT Officer Job at First Ally Capital\n                        IT Support Officer (HMO) Job at Mediplan Healthcare Limited\n                    \n    \n\n\n\n                        \n                    \n\n                    \n                        \n\n\n\n    \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n\n\n\n\n\n          \n\n\n    \n\n        Hottest Jobs\n\n        \n        \n            \n\n                Apply Before November 24 and Become a Software Developer\n\n               \n            \n        \n            \n\n                Personal Assistant\n\n               \n            \n        \n            \n\n                Customer Service Representative Job at GUO Transport Company\n\n               \n            \n        \n            \n\n                Job Openings at Ganfeng Lithium Industry Limited\n\n               \n            \n        \n            \n\n                IT Support Specialist Job at PalmPay\n\n               \n            \n        \n            \n\n                Job Openings at Don Quester Consulting\n\n               \n            \n        \n            \n\n                Facilities Supervisor\n\n               \n            \n        \n            \n\n                Front Desk / Customer Service Officer Job at Elan Orris Real Estate Limited\n\n               \n            \n        \n            \n\n                Supply Chain Officer Job at LifeBank\n\n               \n            \n        \n            \n\n                Warehouse / Logistics Manager Job at Welcome U Shopping Centre\n\n               \n            \n        \n        \n\n    \n\n\n\n\n        \n        \n   \n\n\n                    \n                            \n            \n        \n        \n        \n\n        \n\n    \n\n        \n\n            \n\n                \n\n                    Job Seekers\n\n                    \n\n                        Search for Jobs\n                         Featured Jobs\n                         Jobs by Specialization\n                         Jobs by Industry\n                         Jobs by Location\n                         \n                        Companies Currently Hiring\n\n                        Upload CV\n\n                        Free Aptitude Test Practice\n                        \n                        Scholarships and Financial Aid\n\n                        Testimonies\n                    \n\n                \n\n                \n\n                    Employers\n\n                    \n\n                        Post A Job\n\n                        Search Resumes/Profiles\n\n                        Create Employer Account\n\n                        Advertise\n\n                        Pricing\n\n                    \n\n                \n\n                \n\n                    Tools & Resources\n\n                    \n\n                        Contact us\n                        \n                        Our Blog\n\n                        Job XML/RSS Feeds\n \n                        Free Aptitude Test Practice\n\n                        Bank Details\n\n                        FAQ & Support\n\n                    \n\n                \n\n                \n\n                    Connect with us\n\n                    \n\n                        \n\n                            \n\n                            \n\n                        \n\n                        \n\n                            \n\n                            \n\n                        \n\n                \n\n                        \n\n                            \n\n                            \n\n                        \n\n                    \n\n\n\n                    \n\n                        Customer Care\n\n                        09134259221 \n\n                        (9am - 5pm) weekdays\n\n                         info [at] jobgurus.com.ng\n\n                    \n\n\n\n                \n\n            \n\n        \n\n    \n\n\n\n    \n\n        \n\n\n\n            \n\n                Privacy Policy\n\n                Terms & Conditions\n\n                Sitemap\n                \n                About us\n\n            \n\n\n\n            Copyright © 2025 Jobgurus.com.ng - Latest Jobs in Nigeria 2025. All right reserved.",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]