[
  {
    "title": "Job Openings at ISurf Global Services",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-isurf-global-services",
    "pubDate": "Mon, 23 Jun 2025 11:37:40 GMT",
    "source": "JobGurus",
    "keyword": "isurf global services",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance"
    ],
    "content": "ISurf Global Service is an Information Technology Consulting Services Company with specialization in delivering technology solutions to meet the needs of our clients. Our Consulting experience provides practical, cost effective innovative change, insights and knowledge to help you organize and maintain an effective Optimal model for your business growth and flexibility.\n\nOur main activities are focused on providing professional consulting and technical services, carrying out research and training in the use of ICT and organizing events and workshops. The solutions we build help our customers achieve profitable growth, reduce costs and take advantage of new business opportunities.\n\nWe are recruiting to fill the following positions below:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n1.) Sales Representative / Marketer (Cross Border Trade)\n\nJob Locations: Tradefair, Alaba, Ojo, Oshodi, Lagos Island and Ikeja, Lagos\nEmployment Type: Full-time\nIndustry: E-Commerce\n\nKey Responsibilities\n\n\n\tPromote Egatee’s wide range of products and support the launch of new offerings.\n\tConduct market research, analyze industry trends, and drive actionable marketing strategies.\n\tBuild strategic partnerships with wholesalers, vendors, and key industry players.\n\tPropose and implement strategic sales and marketing initiatives.\n\tMaintain daily communication and reporting with Chinese suppliers via WeChat.\n\tDeliver consistent sales performance and reporting.\n\n\nRequirements\n\n\n\tND, HND, or BSc in Marketing or related field.\n\t0 - 2 years of experience in Marketing, B2B, or B2C Sales.\n\tStrong communication skills – written and verbal.\n\tMust own a smartphone (Android or iPhone) with WeChat compatibility.\n\tIdeal for proactive, self-driven individuals passionate about sales growth.\n\n\nProduct Categories Include (but not limited to):\n\n\n\tJewelries, Cosmetics, Household Items, Children Toys\n\tContact Lenses, Printed Products, Nail Beauty, Sunglasses\n\tLarge-Scale Audio Equipment, Power Transformers, Outdoor Power\n\tClothing, Shoes, Bags, Mugs, Hardware, Work Gloves, Baby Shoes.\n\n\nSalary\nN100,000 Gross + Tiered Sales Bonus + Commission.\n\nApplication Closing Date: 24th July, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CVs to: jobs.david@isurfglobal.com using the Job Position as the subject of the email.\n\nNote:  For more information contact: 07049905970 via WhatsApp only.\n\n \n\n \n\n2.)  Loan Collection Officer\n\nJob Location: Jericho Hill, Aleshinloye - Ibadan Oyo\nEmployment Type: Full-time\n\nJob Description\n\n\n\tWe are seeking a dedicated and motivated Loan Collection Agent to join our team! If you are looking for an opportunity to grow in a dynamic work environment, we want to hear from you.\n\n\nKey Responsibilities\n\n\n\tEngage with clients to facilitate loan recovery.\n\tMaintain accurate records of all transactions and communications.\n\tDevelop and implement effective collection strategies.\n\tCollaborate with team members to achieve departmental goals.\n\n\nRequirements\n\n\n\tCandidates should possess an SSCE. A statement of result is required with the application.\n\tMust possess either an Android phone or an iPhone.\n\tProximity to *Jericho Hill, Aleshinloye, Ibadan, is essential.\n\tAvailability to work Monday to Friday, with two Saturdays a month.\n\tImmediate Resumption Required.\n\n\nCompensation and Benefits\n\n\n\tSalary: N65,000 / Month.\n\tTransportation Allowance (prorated based on attendance).\n\tFood Allowance (prorated based on attendance).\n\tFull Attendance Bonus (payable only for full attendance).\n\tPerformance Bonus\n\tHealth Maintenance Organization (HMO) coverage fully paid by the company.\n\tPension plan fully funded by the company.\n\n\nApplication Closing Date: 31st July, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CVs to: jobs.david@isurfglobal.com using the Job Position as the subject of the email.\n\nNote:  For more information contact: 07049905970.\n\n \n\n \n\n3.) Loan Collection Officer\n\nJob Location: Ikeja GRA, Lagos\nEmployment Type: Full-time, Onsite\n\nRequirements\n\n\n\tMinimum OND (OND, NCE, HND, BSc accepted)\n\tMust reside in Ikeja or nearby.\n\n\nSalary\n\n\n\tN80,000 - N100,000 per month + Performance Bonus\n\tPerks: HMO, Pension, Daily Free Lunch.\n\n\nApplication Closing Date: 31st July, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV and a brief cover letter to: jobs.david@isurfglobal.com using the Job Position as the subject of the mail.\n\nNote: For more information contact 07049905970.\n\n \n\n \n\n4.) Business Development Manager\n\nJob Location: Port Harcourt, Rivers\nEmployment Type: Full-time (Permanent)\n\nJob Description\n\n\n\tWe are seeking an experienced and motivated Business Development Manager (BDM) to join our dynamic team in port-hacourt.\n\tThis role is ideal for a results-driven professional with a strong background in sales, partnerships, and business strategy within the FinTech or finance industry.\n\tThe BDM will be responsible for developing and maintaining long-term commercial and strategic relationships with agents, vendors, distributors, and partner organizations.\n\tThe ideal candidate will bring a proven track record in expanding business opportunities and driving revenue growth.\n\n\nResponsibilities\n\n\n\tIdentify, onboard, and manage new agents, partners, and business opportunities.\n\tDrive bulk purchase transactions from organizations and corporate entities.\n\tBuild and maintain strong relationships with existing and prospective clients, vendors, and stakeholders.\n\tConsistently exceed revenue targets for the assigned coverage area.\n\tEducate customers on the features, benefits, and value proposition of our products and services.\n\tCollaborate with cross-functional teams to deliver customer-focused solutions.\n\n\nRequirements\n\n\n\tA Bachelor's Degree from a reputable institution is compulsory\n\tMinimum of 3 years of proven experience in partnership development, business development, or account management.\n\tPrevious experience in the *FinTech industry is an *added advantage\n\tStrong communication, negotiation, and interpersonal skills.\n\tAbility to work independently, manage multiple projects, and meet deadlines.\n\n\nSalary\nN300,000 / Month.\n\nApplication Closing Date: 30th June, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV and a brief cover letter to: jobs.david@isurfglobal.com using the Job Position as the subject of the mail.\n\nNote: For more information contact 07049905970.\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Associate Nursing Officer Job at Reliance Health",
    "link": "https://www.jobgurus.com.ng/jobs/view/associate-nursing-officer-job-at-reliance-health",
    "pubDate": "Mon, 23 Jun 2025 11:37:40 GMT",
    "source": "JobGurus",
    "keyword": "reliance health",
    "duplicate": false,
    "classifications": [],
    "content": "Reliance Health uses Technology to Make Healthcare Accessible and Affordable. Through an integrated approach that includes affordable health insurance, telemedicine, and a combination of partner and proprietary healthcare facilities, Reliance Health offers innovative healthcare solutions that meet the needs of emerging markets.\n\nWe are recruiting to fill the position below:\n\nJob Position: Associate Nursing Officer\nJob Location: Lekki, Lagos\nEmployment Type: Full-time\n\nDescription\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are looking for an ambitious and result-oriented genius to join our clinical team as a Nurse to help provide top-notch medical care to our clients.\n\n\nResponsibilities\n\n\n\tUndertake an initial intake of patient history and physical exam to appropriately triage patients.\n\tCollect and tag specimens exactly as outlined in each medical requisition.\n\tDevelop effective collection techniques as they relate to groups such as paediatric and geriatric patients.\n\tProperly package each specimen and ensure that every specimen is delivered to the laboratory on time.\n\tMaintain an organized and clean work area based on state health laws and the guidelines of our medical organization.\n\tAnswer patient questions regarding collection techniques and offer additional resources on the collection process if a patient request them.\n\n\nRequirements\n\n\n\tRegistered nurse with license to practice.\n\t2 years of experience in Mid-wifery or Nursing\n\tComfortable using basic technology including laptops and tablet devices.\n\tProven experience of success in a multidisciplinary team\n\tAbility to provide patient counselling and advising in multiple relevant languages is a plus.\n\tCandidates must reside around Lekki.\n\n\nBenefits\nAt Reliance Health, we prioritize our people and their well-being. Our benefits package is designed to support your success, growth, and happiness. Here’s what you’ll enjoy:\n\n\n\t Competitive Salary and Benefits: We offer a salary that’s benchmarked against the best in the industry, ensuring your expertise and impact are fully rewarded.\n\t Premium Health Insurance: Comprehensive health coverage for you and your family, because your well-being comes first.\n\t Unlimited Leave: Take the time you need when you need it—no limits, no questions.\n\t Meaningful Impact: Play a key role in transforming customer experiences and shaping healthcare innovation.\n\t Collaborative Work Culture: Join a supportive, inclusive, and team-focused environment that celebrates diversity.\n\t Growth Opportunities: Access tools, mentorship, and resources to elevate your skills and career.\n\t Learning & Development Allowance: We provide an allowance to support your ongoing professional growth and skill enhancement. \n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Head of Operations, Onboarding & Retention Job at Moniepoint",
    "link": "https://www.jobgurus.com.ng/jobs/view/head-of-operations-onboarding-retention-job-at-moniepoint",
    "pubDate": "Mon, 23 Jun 2025 11:37:40 GMT",
    "source": "JobGurus",
    "keyword": "moniepoint",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Moniepoint Incorporated is a global business payments and banking platform and recently became QED Investors’ first investment in Africa. We are the partner of choice for over 600,000 businesses of all sizes, powering the dreams of SMBs and providing them with equal access to the tools they need to grow and scale.\n\nWe are recruiting to fill the position below:\n\nJob Position: Head of Operations, Onboarding & Retention\n\nJob Location: Lagos\nReports to: SVP, Onboarding & Retention\nWork mode: Hybrid\n\nAbout the Role\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThis role will own end-to-end product and field operations for both individual and business accounts.\n\tYou will be the operational leader driving seamless new-account openings, KYC upgrades, address verifications (including proof-of-address checks and physical visits), and ongoing due-diligence processes (e.g., nature-of-business verifications).\n\tYou’ll partner closely with our sales network, product, compliance, and risk teams to design, implement, and continuously optimize workflows that meet or exceed our SLA, success-rate, and compliance goals.\n\n\nKey Responsibilities\nEnd-to-End Operations Ownership:\n\n\n\tLead, scale, and refine the operational processes for new account openings (L1 and L2) for individuals and businesses.\n\tDesign and manage KYC upgrade flows—from basic identity checks to full business-registration & KYB.\n\tOversee proof-of-address verification programs, including document review and in-person visits where required.\n\tOwn ongoing monitoring and re-verification (e.g., nature-of-business checks, periodic refreshes).\n\n\nSLA & Performance Management:\n\n\n\tDefine, monitor, and report on key operational KPIs (e.g., onboarding completion rate, TAT percentiles, verification success rates, SLA adherence).\n\tEstablish playbooks and escalation protocols to rapidly detect and remedy bottlenecks or compliance exceptions.\n\tImplement continuous-improvement practices (A/B testing, root-cause analysis, feedback loops) to drive efficiency and quality.\n\n\nResource Planning & Team Leadership:\n\n\n\tBuild and lead a cross-functional team of field agents, process analysts, and operational specialists.\n\tForecast capacity needs (headcount, tools, budgets) to meet projected account volumes while maintaining high service levels.\n\tRecruit, train, and mentor operations staff, ensuring deep expertise in KYC, KYB, and field verification best practices.\n\n\nProcess & Technology Enablement:\n\n\n\tCollaborate with Product and Engineering to develop or enhance digital onboarding and verification tools (e.g., OCR, facial match, automated name/DOB checks, USSD flows).\n\tOwn rollout of field-operations tooling (e.g., mobile apps for agents, audit dashboards).\n\tDrive integration with 3rd-party identity and address-verification partners (NIMC, BVN, Corporate Affairs Commission).\n\n\nCross-Functional Collaboration:\n\n\n\tLiaise with Sales & Partnership teams to align onboarding capacity with customer acquisition targets.\n\tPartner with Compliance, Risk, and Legal to ensure all processes meet regulatory standards and internal policies.\n\tWork with Customer Success and Support to triage and resolve escalated onboarding/KYC issues.\n\n\nGovernance & Compliance:\n\n\n\tMaintain robust audit trails and documentation for all verification activities.\n\tLead periodic internal and external audits, ensuring readiness for regulatory examinations.\n\tStay abreast of evolving KYC/KYB regulations and best practices; proactively update policies and procedures.\n\n\nQualifications & Experience\n\n\n\tBachelor’s Degree in Business Administration, Finance, Operations Management, or related field; MBA or advanced degree a plus.\n\t8+ years of operations leadership experience in financial services, fintech, or banking, with a minimum of 3 years owning KYC/KYB or onboarding operations at scale.\n\tProven track record managing both digital and field-based verification teams.\n\tDeep understanding of Nigerian identity systems (BVN, NIN), Corporate Affairs Commission processes, and relevant regulatory frameworks.\n\tDemonstrated success meeting aggressive SLA, quality, and compliance targets in a high-growth environment.\n\n\nCore Skills & Competencies:\n\n\n\tOperational Excellence: Strong process-mapping, workflow optimization, and continuous improvement mindset.\n\tAnalytical Rigor: Expert in data-driven decision making; comfortable building and interpreting dashboards and operational metrics.\n\tLeadership & People Management: Proven ability to recruit, inspire, and develop high-performing operations teams.\n\tCross-Functional Collaboration: Skilled at influencing stakeholders across product, engineering, risk, compliance, and sales.\n\tTechnology Savvy: Experience with digital onboarding platforms, identity-verification APIs, CRM systems, and field-agent tooling.\n\tCommunication: Excellent verbal and written communication skills, with the ability to translate complex processes into clear playbooks and training materials.\n\n\nWhat We Can Offer You\n\n\n\tCulture: We put our people first and prioritize the well-being of every team member. We’ve built a company where all opinions carry weight and where all voices are heard. We value and respect each other and always look out for one another. Above all, we are human.\n\tLearning: We have a learning and development-focused environment with an emphasis on knowledge sharing, training, and regular internal technical talks.\n\tCompensation: You’ll receive an attractive salary, pension, health insurance, annual bonus, plus other benefits.\n\n\nWhat to expect in the hiring process:\n\n\n\tA preliminary phone call with the recruiter\n\tAn interview with a business lead.\n\tA behavioural and technical interview with a member of the executive team.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Logistics Assistant Job at TAF Africa",
    "link": "https://www.jobgurus.com.ng/jobs/view/logistics-assistant-job-at-taf-africa",
    "pubDate": "Mon, 23 Jun 2025 11:37:40 GMT",
    "source": "JobGurus",
    "keyword": "taf africa",
    "duplicate": false,
    "classifications": [],
    "content": "TAF Africa is an independent non-governmental/not-for profit organization originally established to promote health, socio-economic rights, well-being, and empowerment of persons with albinism. The organization has since evolved to become a focus organization that advocates for the recognition and respect of the rights, socio-economic and political inclusion of persons with disabilities and other vulnerable groups in Nigeria and the around the World. The foundation contributes to legislative and policy action that promotes the rights of PWDs, and effective mainstreaming of inclusion.\n\nWe are recruiting to fill the position below:\n\nJob Position: Logistics Assistant\nJob Location: Delta\nEmployment Type: Contract\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nResponsibilities\nVehicle maintenance and management:\n\n\n\tCleans vehicle and performs routine checks to ensure it has proper working tools daily.\n\tRefuels vehicle using an approved fuel voucher and records this on the vehicle log sheet timeously.\n\tParks vehicles safely at the designated place at the end of each working day not later than 6pm.\n\tEnsures that after-hours travel has prior formal approval by the necessary department.\n\tEnsure vehicle movement logbook is filled timely and regularly.\n\tTo report immediately to the Logistic & Facility Officer, all accidents or issues involving TAF Africa vehicles.\n\tCompliance with the motor vehicle and travel policy provisions of TAF Africa\n\n\nStaff and material transportation:\n\n\n\tTransports staff and designated people to all areas as instructed and with approved vehicle request forms.\n\tFerries goods to required points as may be directed from time to time.\n\tEnsure vehicles have necessary materials such as umbrellas, first aid boxes, map, fire extinguishers, etc.\n\tEnsure that all TAF Africa assets are not left unattended in the vehicle whilst parked.\n\tFiles in accurate vehicle logbooks and submits to the Facility and Logistics Officer.\n\tPrepares monthly vehicle maintenance reports for allocated vehicles.\n\n\nOther services provision:\n\n\n\tDispatch and deliver all documents between TAF Africa and other service providers.\n\tDispatch of goods and materials to various projects offices to facilitate program delivery without any reports of loss or destruction of items.\n\tPerform any other duties that may be assigned from time to time to support the attainment of organizational goals.\n\n\nDealing with Problems:\n\n\n\tHave a basic knowledge of the organization’s mission and values, and staff roles to support and direct visitors to the appropriate staff.\n\tEstablish and maintain good working relationships with staff, managers, visitors, and partners.\n\n\nQualifications\n\n\n\tClass B driver’s license.\n\tA minimum of 3 years of experience in vehicle maintenance and driving.\n\tDriving terrain and road network of Delta State.\n\tAdvanced or Ordinary level certificate\n\tWork experience in an NGO setup will be an added advantage.\n\tAny relevant certification in driving/clerical services will be an added advantage.\n\n\nMethod \nInterested and qualified candidates should send their CV and Cover Letter in PDF format to: careers@tafafrica.co using “Logistics Assistant Delta” as the subject of the mail.\n\nNote\n\n\n\tOnly shortlisted applicants will be contacted.\n\tDiversity and Inclusion: TAF Africa strongly encourages applications from women and persons with disabilities. All submissions will be handled with the highest level of confidentiality.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Front Desk Officer Job at Stremvans Fund Management",
    "link": "https://www.jobgurus.com.ng/jobs/view/front-desk-officer-job-at-stremvans-fund-management",
    "pubDate": "Mon, 23 Jun 2025 11:37:40 GMT",
    "source": "JobGurus",
    "keyword": "stremvans fund management",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Stremvans Fund Management is a dynamic and growing fund management company based in the Federal Capital Territory, Nigeria. We are dedicated to delivering superior investment returns for our clients through innovative strategies and robust financial management. We are committed to operational excellence, fostering a collaborative work environment, and empowering our team to achieve their full potential while serving our clients with integrity and professionalism.\n\nWe are recruiting to fill the position below:\n\nJob Position: Front Desk Officer\n\nJob Location: Abuja (FCT) \nReports To: Operations Officer\nJob Type: Full-time\nExperience Level: Entry-level\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Front Desk Officer will be the first point of contact for clients and visitors, both in person and over the phone.\n\tThis role requires a friendly, professional, and organized individual who can provide excellent customer service and administrative support.\n\tThe ideal candidate will possess excellent communication skills, a professional demeanor, and a proactive approach to managing administrative tasks.\n\n\nKey Responsibilities\n\n\n\tGreet and welcome clients and visitors in a professional manner.\n\tAnswer and direct incoming phone calls.\n\tManage the reception area, ensuring it is tidy and presentable.\n\tHandle incoming and outgoing mail and deliveries.\n\tProvide basic administrative support, such as scheduling appointments and managing meeting rooms.\n\tMaintain office supplies inventory, placing orders when necessary, and ensuring common areas are stocked.\n\tServe as a central point for general inquiries, providing accurate information about the company and its services.\n\tRelay messages and information effectively between internal teams and external contacts.\n\n\nQualifications\n\n\n\tEducation: OND or Bachelor's degree in any discipline.\n\tExperience: Minimum 1 year of experience in a front desk or customer service role is preferred.\n\tTechnical Skills: Proficiency in Microsoft Office Suite.\n\tKnowledge: Basic knowledge of office procedures.\n\tSoft Skills: Excellent verbal communication and interpersonal skills. Professional appearance and demeanor. Strong organizational and time management skills.\n\n\nWhat We Offer\n\n\n\tCompetitive salary and benefits package.\n\tOpportunity to work in a fast-paced and growing fund management firm.\n\tProfessional development and growth opportunities.\n\tA collaborative and supportive work environment.\n\n\nMethod of Application\nInterested and qualified candidates should submit their Resume and a cover letter outlining their qualifications and experience to: hr@sticltd.com with \"Front Desk Officer Application - [Your Name]\" as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]