[
  {
    "title": "Job Openings at Chilis Restaurant",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-chilis-restaurant",
    "pubDate": "Mon, 27 Oct 2025 12:33:30 GMT",
    "source": "JobGurus",
    "keyword": "chilis restaurant",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Chilis Restaurant is a 24-hours restaurant with good quality of food and good services.\n\nWe are recruiting to fill the following positions below:\n\n1.) CCTV Personnel\n\nJob Location: Ibadan, Oyo\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tMonitoring: Continuously monitoring CCTV footage to ensure safety and security.\n\tIncident Response: Responding promptly to incidents, such as theft or violence, and alerting management and authorities.\n\tSurveillance: Keeping watch on high-risk areas, like entrances, exits, and cash handling areas.\n\tCrime prevention: Deterrent effect, discouraging potential criminals from committing crimes.\n\tInvestigation Assistance: Aiding investigators by providing footage and information related to incidents.\n\tMaintenance: Regularly checking and maintaining CCTV equipment to ensure optimal function.\n\tQuality Control: Ensuring footage quality and resolving technical issues.\n\tTraining: Educating staff on CCTV usage and security protocols.\n\tCompliance: Ensuring CCTV usage complies with privacy laws and regulations.\n\tIncident Reporting: Documenting and reporting incidents to management and authorities.\n\tIts a 24hrs restaurant that runs morning, afternoon and night shifts\n\tProximity to Ringroad is preferred.\n\n\nRequirements\n\n\n\tInterested candidates should possess relevant qualifications with 0-5 years of experience.\n\n\nSalary\nN50,000 - N60,000 per month. \n\nApplication Closing Date: 30th November, 2025.\n\nMethod of Application \nInterested and qualified candidates should send their CV to: chilisrestaurant.ibadan@gmail.com using the Job Position as the subject of the email.\n\n \n\n2.) Pastry Assistant\n\nJob Location: Ibadan, Oyo\nEmployment Type: Full-time\n\nResponsibilities\n\n\n\tPastry Preparation: Preparing and baking pastries, cakes, and other sweet treats.\n\tDecorating: Decorating cakes and pastries with intricate designs and patterns.\n\tIngredient Management: Measuring, mixing, and preparing ingredients for pastry dough and fillings\n\tEquipment Maintenance: Cleaning and maintaining pastry equipment, such as mixers and ovens.\n\tQuality Control: Ensuring pastries are of high quality and meet presentation standards.\n\tInventory Management: Managing inventory of pastry ingredients and supplies.\n\tCleaning and Sanitation: Maintaining a clean and sanitary workspace, adhering to food safety regulations.\n\tTeam Support: Assisting other pastry staff members with tasks and responsibilities as needed.\n\tRecipe Development: Assisting in developing new recipes and ideas for pastries and desserts.\n\tPlating and presentation: Presenting pastries and desserts attractively for service\n\tIt is a 24hrs restaurant that runs morning, afternoon and night shifts.\n\n\nQualifications\n\n\n\tInterested candidates should possess relevant qualifications with 0-5 years of experience.\n\tProximity to Awolowo is preferred.\n\n\nSalary\nN35,000 - N70,000 / Month.\n\nApplication Closing Date: 31st October, 2025.\n\nMethod of Application \nInterested and qualified candidates should send their CV to: chilisresaturant.ibadan@gmail.com using the Job Position as the subject of the email.\n\n \n\n \n\n3.) Procurement Officer\n\nJob Location: Ring Road - Ibadan, Oyo\nEmployment Type: Full-time\n\nResponsibilities\n\n\n\tSupplier Selection: Finding and evaluating suppliers for ingredients, equipment, and services\n\tContract Negotiation: Negotiating prices, terms, and conditions with suppliers.\n\tPurchasing: Buying ingredients, beverages, equipment, and supplies necessary for operations\n\tInventory Management: Managing inventory levels, tracking usage, and optimising stock levels.\n\tCost Control: Analysing prices, tracking expenses, and identifying opportunities for cost savings.\n\tQuality Control: Ensuring purchased products meet quality and safety standards.\n\tSupplier Relationship Management: Building and maintaining relationships with suppliers.\n\tRisk Management: Mitigating risks associated with supply chain disruptions, price fluctuations, and supplier insolvency.\n\tCompliance: Ensuring compliance with regulations, such as food safety and labeling requirements\n\tData Analysis: Analysing procurement data to identify trends, optimize purchasing decisions, and improve operations\n\tMenu Engineering: Collaborating with chefs to develop menus that balance profitability and customer appeal.\n\tWaste Management: Minimising waste and optimizing inventory usage to reduce environment impact.\n\tProximity to Ring Road is preferred\n\n\nRequirements\n\n\n\tCandidates should possess relevant qualifications with 2 - 5 years of work experience.\n\n\nSalary\nN60,000 - N80,000 Monthly.\n\nApplication Closing Date: 31st October, 2025.\n\nMethod of Application \nInterested and qualified candidates should send their CV to: chilisrestaurant.ibadan@gmail.com using the Job Position as the subject of the email.\n\n     \n\n    \n\n        Click here to Apply",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Openings at The Reddington Multi-specialist Hospital",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-the-reddington-multi-specialist-hospital",
    "pubDate": "Mon, 27 Oct 2025 12:33:30 GMT",
    "source": "JobGurus",
    "keyword": "the reddington multi-specialist hospital",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "The Reddington Multi-specialist Hospital built on nine floors provides fully comprehensive tertiary hospital solutions in most medical areas. Our journey as a healthcare provider began in March 2006 with the establishment of the Cardiac Centre, in Victoria Island, in association with the renowned Cromwell Hospital in London.\n\nWe are recruiting to fill the following positions below:\n\n1.) Business Development and Marketing Officer\n\nJob Location: Lagos\n\nMain Responsibilities\n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tPromote Hospital Services: Champion the hospital’s brand and services and generate high-value leads through personal and professional networks, within the community, to corporate organisations, and to Health Maintenance Organisations (HMOs).\n\tStrategy: Provide leadership and strategic direction for marketing and sales strategies, processes, and standard operating procedures.\n\tFormulate quarterly strategies to drive revenue growth and market competitiveness.\n\tIdentify and Acquire New Clients: Proactively source and approach potential business clients, HMOs, and other partners to grow our network and revenue streams.\n\tRelationship Management: Foster and maintain strong, long-term relationships with existing clients, ensuring high levels of satisfaction and loyalty.\n\tContract Management: Oversee the initiation, negotiation, and renewal of contracts with clients, ensuring compliance and mutually beneficial agreements.\n\tBrand Ambassadorship: Act as the public face of the hospital group, representing our values and mission at events, presentations, and meetings.\n\tContent Oversight for Social Media: Lead the planning, creation, and management of content across all social media platforms to engage audiences and promote services.\n\tProposal Documentation: Produce tailored customer proposals that address client-specific needs and expectations.\n\tReporting: Deliver monthly performance reports and strategic insights to the CEO and senior management.\n\n\nQualification/Knowledge\n\n\n\tA University Degree in a relevant field.\n\tA postgraduate degree or professional certification in a related discipline. Strong knowledge and understanding of the Nigerian healthcare system. Extensive business and professional network.\n\tMembership of a recognized professional body in Marketing, Sales, or Communications.\n\n\nCore Competencies and Skills:\n\n\n\tExcellent Communication: Superior verbal and written communication skills, with the ability to engage, persuade, and build trust with diverse stakeholders.\n\tRelationship Building: Demonstrated ability to establish and nurture professional relationships with clients, HMOs, and partners.\n\tStrategic Thinking: Strong analytical and problem-solving skills to identify opportunities and develop effective business growth strategies.\n\tNegotiation and Contract Management: Proven experience in negotiating contracts, managing renewals, and ensuring mutually beneficial outcomes.\n\tDigital Savvy: Experience managing or overseeing social media content, with an understanding of digital marketing best practices.\n\tOrganisational Skills: Highly organised, able to manage multiple projects and deadlines in a fast-paced environment.\n\tProfessionalism and Integrity: Represents the hospital group with the highest standards of ethics, professionalism, and confidentiality.\n\n\nBroad Key Performance Indicators:\n\n\n\tAchievement of annual revenue and new business targets.\n\tGrowth of corporate client portfolio and strategic partnerships.\n\tWeekly activity benchmarks: calls, proposals, and conversion rates.\n\tClient retention and satisfaction metrics.\n\tTimely and accurate reporting to senior management.\n\tDevelopment and maintenance of a robust customer relationship database.\n\n\nMethod of Application \nInterested and qualified candidates should forward their CV and Cover Letter to: hr@reddingtonhospital.com using the Job Position as the subject of the email.\n\n \n\n \n\n2.) Quality Assurance Manager\n\nJob Location: Lagos\nEmployment Type: Full Time\n\nJob Description\n\n\n\tThe Quality Assurance Manager will be responsible for developing, implementing, and monitoring quality management systems to ensure compliance with healthcare standards, policies, and regulatory requirements.\n\tThe ideal candidate will play a key role in promoting continuous quality improvement, patient safety, and clinical excellence within the organization.\n\n\nKey Responsibilities\n\n\n\tDevelop, implement, and oversee the hospital’s Quality Management and Patient Safety programs.\n\tConduct regular quality audits and risk assessments to ensure compliance with national and international healthcare standards.\n\tMonitor and evaluate clinical and non-clinical processes to improve service delivery.\n\tAnalyze data and prepare quality performance reports for management review.\n\tFacilitate incident reporting, root cause analysis, and corrective action implementation.\n\tCoordinate accreditation and certification processes.\n\tProvide training and support to staff on quality standards, safety, and best practices.\n\tCollaborate with department heads to identify and implement quality improvement initiatives.\n\tPromote a culture of excellence, accountability, and continuous learning across all units.\n\n\nRequirements\n\n\n\tBachelor of Medicine and Bachelor of Surgery (MBBS / MBChB) from a recognized institution.\n\t5–7 years of post-qualification experience, including at least 3 years in healthcare quality management, clinical governance, or hospital administration.\n\tMust be a licensed medical practitioner with a valid practicing license from the Medical and Dental Council of Nigeria (MDCN).\n\tStrong knowledge of clinical quality improvement frameworks, patient safety standards, and healthcare regulations.\n\tExperience with hospital accreditation systems (ISO, JCI, or COHSASA) is an added advantage.\n\tExcellent analytical, communication, and leadership skills.\n\tProven ability to lead multidisciplinary teams and drive organizational change.\n\n\nMethod of Application \nInterested and qualified candidates should forward their CV and Cover Letter to: hr@reddingtonhospital.com and copy gabriel.akomolafe@reddingtonhospital.com using the Job Position as the subject of the email.\nOr\nClick here to apply online\n\n \n\n \n\n3.) Consultant Obstetrician & Gynaecologist\n\nJob Location: Lagos\nEmployment Type: Full Time\n\nJob Summary\n\n\n\tReddington Hospital Group is seeking a qualified and experienced Consultant Obstetrician & Gynaecologist to join our multidisciplinary clinical team.\n\tThe ideal candidate will provide high-quality specialist care in obstetrics and gynaecology, demonstrating clinical excellence, leadership, and a commitment to patient-centered service delivery.\n\n\nKey Responsibilities\n\n\n\tProvide expert medical care in the management of obstetric and gynaecological conditions.\n\tOversee antenatal, intrapartum, and postnatal care for patients.\n\tPerform surgical and non-surgical gynaecological procedures as required.\n\tCollaborate with other consultants, nurses, and healthcare professionals to ensure optimal patient outcomes.\n\tParticipate in clinical meetings, training, and case reviews.\n\tEnsure compliance with professional and ethical standards of medical practice.\n\tContribute to continuous quality improvement and clinical governance initiatives.\n\n\nRequirements\n\n\n\tBachelor of Medicine and Bachelor of Surgery (MBBS/MBChB) from a recognized institution.\n\tMinimum of 4 years of post-fellowship experience as a Consultant O&G Specialist.\n\tFellowship of the West African College of Surgeons (WACS) or National Postgraduate Medical College of Nigeria (NPMCN) in Obstetrics & Gynaecology.\n\tValid practicing license from the Medical and Dental Council of Nigeria (MDCN).\n\tDemonstrated expertise in both obstetric and gynaecological procedures.\n\tExcellent clinical judgment, communication, and interpersonal skills.\n\tProven ability to work effectively within a multidisciplinary team.\n\n\nMethod of Application \nInterested and qualified candidates should forward their CV and Cover Letter to: hr@reddingtonhospital.com and copy gabriel.akomolafe@reddingtonhospital.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]