[
  {
    "title": "Audit and Tax Manager Job at Momsar Financial Consulting Services",
    "link": "https://www.jobgurus.com.ng/jobs/view/audit-and-tax-manager-job-at-momsar-financial-consulting-services",
    "pubDate": "Mon, 09 Jun 2025 16:49:03 GMT",
    "source": "JobGurus",
    "keyword": "momsar financial consulting services",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Momsar Financial Consulting services is registered with the Corporate Affairs Commission (CAC) as a Financial Consulting Firm. We aim to provide efficient and effective service delivery to our clients using cutting edge technology. We provide a variety of professional services in the areas of auditing, accounting and financial management, consulting, tax services, staff management services, financial investigation, receivership and liquidation as well as capacity building.\n\nWe are recruiting to fill the position below:\n\nJob Position: Audit and Tax Manager\nJob Location: Abuja\nEmployment Type: Full-time\n\nThe Role\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAs an Audit and Tax Manager, you will manage multiple client engagements across industries, ensure the delivery of high-quality audit services, and provide insights that support our clients’ financial integrity and strategic decisions.\n\tThis is a client-facing role requiring strong technical knowledge, leadership, and business acumen.\n\n\nKey Responsibilities\n\n\n\tPlan, manage, and deliver external audit engagements for a range of clients, from SMEs to large corporations.\n\tSupervise, mentor, and develop a team of auditors, reviewing work for quality and compliance.\n\tBuild and maintain strong client relationships, understanding their businesses and needs.\n\tIdentify risk areas and provide value-added recommendations in areas of internal control and financial reporting.\n\tEnsure audit documentation and reporting aligns with professional standards (e.g. IFRS, GAAP, ISA).\n\tCollaborate with the tax and consulting teams to offer integrated service solutions.\n\tMonitor engagement profitability and support business development efforts where appropriate.\n\n\nQualifications\n\n\n\tBachelor’s degree in Accounting, Finance, or a related field (required).\n\tProfessional qualification: ICAN, CA, CPA, ACCA, or equivalent (required).\n\t5+ years of progressive external audit experience in public accounting or a consulting firm, with at least 2 years at a supervisory/managerial level.\n\tExperience in Nigeria FIRS compliances and laws\n\tStrong technical understanding of accounting and auditing standards (IFRS, local GAAP).\n\tExperience managing audit engagements for clients in various sectors (including financial services, manufacturing, nonprofits, etc.) is a plus.\n\tExcellent communication and leadership skills.\n\tExperience with audit and accounting software (e.g., CaseWare, QuickBooks, or similar).\n\n\nWhat We Offer\n\n\n\tCompetitive compensation and performance-based bonuses\n\tProfessional development support\n\tA collaborative, client-focused culture with room for growth\n\tExposure to a variety of industries and complex client challenges\n\n\nApplication Closing Date\n20th June, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV and a Cover Letter (only in PDF) to: mmc.hr.recruits@gmail.com using \"Audit Manager Application\" as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Operations Manager Job at the Vault Recruitment (TVR)",
    "link": "https://www.jobgurus.com.ng/jobs/view/operations-manager-job-at-the-vault-recruitment-tvr-1",
    "pubDate": "Mon, 09 Jun 2025 16:49:03 GMT",
    "source": "JobGurus",
    "keyword": "the vault recruitment (tvr)",
    "duplicate": false,
    "classifications": [],
    "content": "The Vault Recruitment (TVR) is a fast growing recruitment firm specializing in connecting top talent with SME's and Startup organizations. Our team of experienced recruiters understands the unique needs and challenges of the modern job market and uses our extensive network and industry knowledge to find the best candidates for our clients.\n\nWe are recruiting to fill the position below:\n\nJob Position: Operations Manager\n\nVacancy Code: RUNS001\nJob Location: Surulere, Lagos\nEmployment Type: Full-time\n\nDescription\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tA growing logistics startup, is seeking a Operations Manager to lead strategy, drive revenue growth, and oversee smooth logistics execution across departments. If you are a goal-oriented leader who thrives in fast-paced environments, this is for you.\n\n\nQualifications\n\n\n\tEducation: BSc or HND\n\tMinimum of 3 years in operations, with at least 2 in a leadership role\n\tStrong communication, project management, and team leadership skills\n\tPrevious experience in a startup or fast-growing organization\n\tKnowledge of logistics, FMCG, or delivery operations\n\tAbility to manage resources, deadlines, and teams under pressure\n\tStrong problem-solving and people management capabilities\n\tMust be highly proactive and results-driven.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Front Desk Officer Job at Express Resource Connect",
    "link": "https://www.jobgurus.com.ng/jobs/view/front-desk-officer-job-at-express-resource-connect",
    "pubDate": "Mon, 09 Jun 2025 16:49:03 GMT",
    "source": "JobGurus",
    "keyword": "express resource connect",
    "duplicate": false,
    "classifications": [],
    "content": "Express Resource Connect was launched in 2020 as a response to developing a home grown business management solution simplified enough to be used by an owner manager of any business or an enterprise with multiple business processes and employees. We offer a comprehensive business management solution, empowering smal, mid-size, and large enterprises to automate, digitise, and seamlessly manage al their business operations in one integrated platform.\n\nWe are recruiting to fill the position below:\n\nJob Position: Front Desk Officer\nJob Location: Ibadan, Oyo\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a professional and courteous Front Desk Officer to serve as the first point of contact for guests.\n\tThe ideal candidate (male preferred for operational balance) will be responsible for providing exceptional customer service, handling guest check-ins and check-outs, and managing front desk operations efficiently and professionally.\n\n\nKey Responsibilities\n\n\n\tGreet and welcome guests promptly with a warm and friendly attitude.\n\tManage check-in and check-out procedures smoothly and accurately.\n\tCoordinate with housekeeping and other departments to ensure guest satisfaction.\n\tEnsure the lobby and reception area remain tidy and presentable.\n\tAnswer and direct phone calls, respond to inquiries, and take messages.\n\tHandle guest complaints and requests with professionalism and escalate when necessary.\n\tMaintain accurate guest records and process payments efficiently.\n\tMonitor guest reservations and room availability using the hotel booking system.\n\tAssist in administrative tasks and hotel security procedures when required.\n\n\nRequirements\n\n\n\tPrior experience in a hotel or customer service role is an added advantage.\n\tMale (preferred)\n\tExcellent communication and interpersonal skills.\n\tStrong attention to detail and organizational abilities.\n\tMust be well-groomed, courteous, and professional in appearance.\n\tProficient in Microsoft Office Suite and hotel management software.\n\tMust be able to work on weekends, holidays, and in shifts.\n\n\nSalary\nN80,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: recruitment@express-resource.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]