[
  {
    "title": "Job Openings at Wema Bank Plc",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-wema-bank-plc-2",
    "pubDate": "Fri, 07 Nov 2025 21:36:04 GMT",
    "source": "JobGurus",
    "keyword": "wema bank plc",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Wema Bank Plc - Widely reputed as the longest surviving and most resilient indigenous bank in Nigeria, Wema Bank Plc has over the years, diligently offered a fully-fledged range of value-adding banking and financial advisory services to the Nigerian public.\n\nWe are recruiting to fill the following positions below:\n\n1.) Recovery Officer, Remedial Asset Management\n\nJob Location: Lagos\n\nJob Summary\n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Legal Officer in the Remedial Asset Management Department is responsible for providing legal support in the recovery and restructuring of impaired/delinquent facilities.\n\tThe role involves advising on legal strategies for NPL recovery, managing litigation processes, drafting and reviewing legal documents, and ensuring compliance with regulatory and contractual obligations.\n\tThe officer works closely with internal stakeholders and external counsel to maximize recovery and minimize legal risks.\n\n\nKey Responsibilities\nLegal Advisory & Strategy:\n\n\n\tProvide legal advice on recovery strategies including restructuring, foreclosure, asset disposal, and litigation.\n\tAdvise on legal implications of remedial actions and ensure alignment with regulatory frameworks.\n\n\nDocumentation & Review:\n\n\n\tDraft, review, and negotiate legal documents including demand notices, settlement agreements, guarantees, and court processes.\n\tEnsure all documentation complies with applicable laws and internal policies.\n\n\nLitigation Management:\n\n\n\tLiaise with external solicitors and monitor progress of recovery-related litigation.\n\tRepresent the Bank in court proceedings where necessary and ensure timely resolution of cases.\n\n\nAsset Recovery Support:\n\n\n\tSupport the execution of recovery actions including repossession of financed assets.\n\tCoordinate with law enforcement agencies and estate management for lawful access and recovery.\n\n\nStakeholder Engagement:\n\n\n\tCollaborate with Loan Monitoring and other relevant departments to develop and implement recovery strategies.\n\tEngage with customers and guarantors to negotiate settlements and enforce obligations.\n\n\nRequirements\nEducational Qualifications:\n\n\n\tBachelor of Laws (LL.B) degree from a recognized institution.\n\tBarrister-at-Law (B.L) and current membership of the Nigerian Bar Association (NBA).\n\tA Master’s degree in Law (LL.M), Finance, or related field is an added advantage.\n\n\nProfessional Experience:\n\n\n\t3–5 years of post-call experience in banking, finance, or commercial law practice.\n\tProven experience in debt recovery, credit remediation, or loan restructuring within a financial institution or reputable law firm.\n\tStrong understanding of litigation processes, enforcement procedures, and asset recovery mechanisms.\n\tExperience liaising with external solicitors, law enforcement agencies, and regulatory bodies.\n\n\nClick here to apply online\n\n \n\n2.) Commercial Relationship Management Officer \n\nJob Location: Nigeria\n\nRole Description\n\n\n\tThis is a full-time, on-site role based in Nigeria for a Commercial Relationship Management Officer.\n\tThe role involves building and maintaining strong relationships with commercial clients, identifying their financial needs, and providing tailored banking solutions.\n\tKey responsibilities include managing client portfolios, driving revenue growth, analyzing financial data, identifying business opportunities, and ensuring exceptional customer service.\n\tThe officer will collaborate with internal teams to deliver innovative banking solutions and achieve business objectives.\n\n\nQualifications\n\n\n\tStrong relationship management and customer service skills\n\tProficiency in financial analysis, risk assessment, and banking operations\n\tExperience in business development, sales, and strategic planning\n\tExcellent negotiation, communication, and interpersonal skills\n\tAbility to work independently and handle multiple client portfolios\n\tBachelor's degree in Business, Finance, Economics, or related fields\n\tPrior experience in a commercial banking environment is an advantage.\n\n\nClick here to apply online    \n\n    \n\n        Click here to Apply",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]