[
  {
    "title": "Front Desk Officer Job at St. Dominic Catholic Hospital",
    "link": "https://www.jobgurus.com.ng/jobs/view/front-desk-officer-job-at-st-dominic-catholic-hospital",
    "pubDate": "Fri, 06 Jun 2025 13:48:16 GMT",
    "source": "JobGurus",
    "keyword": "st. dominic catholic hospital",
    "duplicate": false,
    "classifications": [],
    "content": "St. Dominic Catholic Hospital is a 64-bed hospital located in Ogungbade off New Ife road in Ibadan. St. Dominic Catholic Hospital is the vision of the Dominican Sisters of St. Catherine of Siena (Italy). We offer various medical services such as: General medicine, internal medicine, O & G, Laboratory, and Radiology, to mention just a few. The hospital is run in collaboration with foreign partners. We are registered and licensed by the Corporate Affairs Commission and the Ministry of Health. Also, we are accredited by the NHIS as both primary and secondary health care providers.\n\nWe are recruiting to fill the position below:\n\nJob Position: Front Desk Officer\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Location: Ibadan, Oyo\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tThe Hospital Front Desk Officer is the first point of contact for patients, visitors, and healthcare providers.\n\tThis role is responsible for providing exceptional customer service, managing patient registration, scheduling appointments, and ensuring seamless communication between patients, families, and hospital staff.\n\n\nKey Responsibilities\nPatient Registration:\n\n\n\tGreet patients, visitors, and healthcare providers in a professional and friendly manner.\n\tRegister patients, verify insurance information, and obtain necessary consent.\n\tEnsure accurate and complete patient demographic information.\n\n\nScheduling Appointments:\n\n\n\tSchedule appointments for patients, ensuring timely and efficient scheduling.\n\tCoordinate with healthcare providers and other departments to ensure availability.\n\n\nCustomer Service:\n\n\n\tProvide exceptional customer service, responding to patient inquiries and concerns.\n\tResolve patient complaints and issues in a timely and professional manner.\n\n\nCommunication:\n\n\n\tCommunicate effectively with patients, families, healthcare providers, and hospital staff.\n\tEnsure seamless communication between departments and teams.\n\n\nData Entry and Record-Keeping:\n\n\n\tAccurately enter patient information into hospital systems.\n\tMaintain accurate and up-to-date patient records.\n\tAssist customers/patients with their transactions and reports\n\n\nSecurity and Emergency Procedures:\n\n\n\tFollow hospital security protocols and emergency procedures.\n\tReport any security concerns or incidents to management.\n\n\nRequirements\n\n\n\tHigh School Diploma or equivalent required; Associate's or Bachelor's Degree preferred.\n\t2-7 years of experience in customer service, healthcare, or a related field.\n\tExcellent communication, interpersonal, and customer service skills.\n\tAbility to work in a fast-paced environment and prioritize multiple tasks.\n\tBasic computer skills and knowledge of hospital software systems.\n\n\nWork Environment:\n\n\n\tFront office setting with frequent interaction with patients, visitors, and healthcare providers.\n\tMay require working evenings, weekends, or holidays.\n\n\nSalary\nN60,000 - N80,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their Application Letters and CV to: adm.sdchib2019@yahoo.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Openings at United Nations International Children's Emergency Fund",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-united-nations-international-childrens-emergency-fund-1",
    "pubDate": "Fri, 06 Jun 2025 13:48:16 GMT",
    "source": "JobGurus",
    "keyword": "united nations international children's emergency fund",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "United Nations International Children's Emergency Fund (UNICEF) works in some of the world’s toughest places, to reach the world’s most disadvantaged children. To save their lives. To defend their rights. To help them fulfill their potential. Across 190 countries and territories, we work for every child, everywhere, every day, to build a better world for everyone.\n\nWe are recruiting to fill the following positions below:\n\n1.) National Consultant to Support Climate Risk and Vulnerability Analysis\n\nJob ID: 581662\nJob Location: Abuja (FCT)\nEmpoloyment Type: Full-time\nCategories: WASH (Water, Sanitation and Hygiene)\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nOrganizational Context and Purpose for the job\n\n\n\tNigeria is one of the top ten most climate change vulnerable countries in the world. UNICEF Nigeria has been implementing several climate change initiatives, including Green Rising, WASH sector climate risk and vulnerability analysis, climate resilient infrastructure for basic services (CRIBS) among others.\n\tUNICEF Nigeria in collaboration with the FCDO has successfully implemented the first phase (April ’24 - March ‘25) of the Climate Resilient Infrastructure for Basic Services - Health and Education (CRIBS) project.\n\tThe first phase of the project successfully designed and tested an approach for assessing facility level climate risks and vulnerabilities, identifying interventions to minimize those risks and implementing those interventions in primary healthcare (PHC) facilities and schools in Kano and Jigawa states.\n\tOverall, 84 facilities (45 schools and 39 PHCs) located in 9 LGAs are receiving various climate resilient (CR) rehabilitations.\n\tA major achievement of the CRIBS project has been the successful development and field testing of a tool for climate risk and vulnerability analysis at PHC and school facility level.\n\tThe tool was field tested in 3 LGAs of Kano state and later validated at two levels, first by the state level authorities in Kano and Jigawa states of Nigeria, and subsequently, by a wider ‘expert and oversight group’ representing FCDO, UNICEF, WHO, World Bank, Government of Nigeria and several international experts working in the field of climate and health.\n\tBased on the initial good results, FCDO and UNICEF in collaboration with the NPHCDA and the Health Sector-wide Approach Coordination Office are preparing for scaling up of CRIBS to more states in Nigeria, under the second phase of the CRIBS project.\n\tThe first step of the CRIBS Phase 2 project is the climate risk and vulnerability analysis, including minor revisions on the tool developed in the first phase of CRIBS, which needs to be completed in the first 2-3 months. This Consultancy TOR is developed to support the initial steps of the CRIBS project phase II.\n\tUNICEF is seeking services of a consultant to support the following activities:\n\t\n\t\tRevision of CRIBS Assessment Tool and inputs to modify the tool on Kobo\n\t\tIdentification and orientation to the Core Group of Enumerators on the tool\n\t\tTraining of State level Enumerators on the tool\n\t\tQuality assurance in data collection by the state Enumerators from the 5-6 State focus states using the tool\n\t\tAnalysis and visualization of survey data on dashboards / reports\n\t\tPresentation on the overall CRIBS analysis to authorities.\n\t\n\t\n\n\nScope of work\n\n\n\tThe consultant will be the key expert responsible for providing overall guidance to the UNICEF CRIBS teams in Abuja and Field Offices across Nigeria in the design and carrying out of the climate risk and vulnerability analysis of PHCs and schools under the CRIBS phase II.\n\tThe consultant will provide close guidance and support on all key aspects of climate risk and vulnerability analysis, and be responsible for the following deliverables:\n\tInception report submitted with details of the methodology and timeline\n\tRevised tool for climate risk and vulnerability analysis developed – should be ready to use on Kobo tool\n\tCore group of Enumerators (National) identified for engagement; and materials for their training developed - Training materials and list of Enumerators\n\tSessions designed for training of State level Enumerators – Session plan and notes for the trainers\n\tQuality assurance of data collection – Data cleaning done on daily basis\n\tReport on the data collection process and final reports – estimated 150 facility level reports, 30 LGA-wise summaries, and 6 state-wise summaries of the analysis, using graphs and charts\n\tA comprehensive PPT outlining the overall process, outcomes, and lessons developed\n\tFinal report on the climate risk and vulnerability analysis\n\n\nDeliverables / Outputs\n\n\n\tInception report with detailed methodology and timeline\n\tRevised tool for climate risk and vulnerability analysis developed – should be ready to use on Kobo tool\n\tCore group of Enumerators (National) identified for engagement; and materials for their training developed – Training materials and list of Enumerators\n\tSessions designed for training of State level Enumerators – Session plan and guidance notes for the Trainers\n\tQuality assurance of data collection – Data cleaning done on daily basis\n\tReport on the data collection process and final reports – estimated 150 facility level reports, 30 LGA-wise summaries, and 6 state-wise summaries of the analysis, using graphs and charts\n\tA comprehensive PPT outlining the overall process, outcomes, and lessons\n\tFinal report incorporating UNICEF feedback\n\n\nRequirements\nEducation:\n\n\n\tAdvanced Degree in Climate Change, Environment, Development Studies, Economics, Public Health, Community Health, Public Administration, Engineering, and any other related field.\n\tPhD in Climate Change related field is highly desired.\n\n\nExperience:\n\n\n\tThe consultant shall have a minimum of 8 years’ experience in national and sub-national work in the field of climate change, data management, training, dash-board development and data visualization. S/he should also have a demonstrated analytical and writing skills in English language, with evidence of having done similar kinds of work at the national and sub-national level. Samples of written work could be asked for, if needed.\n\n\nLanguage Requirements:\n\n\n\tFluency in English Language. Knowledge of language of duty station would be an added advantage.\n\n\nApplication Closing Date: 19th June, 2025.\n\nClick here to apply online\n\n \n\n \n\n2.) International Consultant - Quality Assurance Engineer, Abuja Premier Medical Warehouse (APMW)\n\nJob ID: 581579\nJob Location: Abuja (FCT)\nEmpoloyment Type: Full-time\nCategories: Health\n\nBackground\n\n\n\tThe Abuja Premier Medical Warehouse (APMW) Project is a major construction project, encompassing a wide range of technical construction work, including structural, electrical, mechanical, plumbing, HVAC, fittings and fixtures, and external works. \n\tTo ensure a full adherence to the desired UNICEF's and international quality standards for construction throughout the execution of the project, a recruitment of International Quality Assurance (QA) Engineer (consultant) is highly required to further strengthen UNICEF’s quality control and quality assurance of the construction work on top of existing mechanism of UNICEF’s day-to-day monitoring and supervision on site.\n\n\nPurpose Of The Assignment\n\n\n\tThe expected role of the consultant is to review and provide technical inputs for Quality Assurance (QA) and Quality Control (QC) plans and procedures for refinement, followed by performing overall QA oversight for all technical aspects of the Abuja Premier Warehouse Project, ensuring that all construction works meet specified standards, codes, and best practices in engineering and construction. \n\tBesides, the consultant is to ensure that all the work performed at the site are in strict adherence with the specifications and requirements set in the technical drawings and bills of quantity (BOQ).\n\n\nScope of Work\nThe International QA Engineer will be responsible for:\n\n\n\tReviewing and providing technical inputs for refining the plans and procedures for QA and QC by addressing all project components, including structural, mechanical, electrical, and plumbing works.\n\tOverseeing and monitoring the implementation of QA and QC processes for:\n\t\n\t\tHVAC system supply and installation.\n\t\tStructural, electrical, mechanical, and plumbing installations.\n\t\tSupply and installation of fittings and fixtures.\n\t\n\t\n\tConducting regular site inspections and audits to verify compliance with design, specifications, and safety standards.\n\tReviewing and endorsing material submittals, method statements, and data sheets for quality compliance.\n\tCoordinating with contractors, suppliers, and the project management team to resolve quality-related issues.\n\tPreparing and submitting monthly QA assessment reports and a final QA report at project completion.\n\tAdvising on corrective actions and improvements to ensure continuous quality enhancement.\n\tEnsuring that all project documentation related to QA and QC is maintained and archived.\n\tAttending project-meetings (in-person and online) and ad-hoc meetings (in-person and online) and providing inputs on QA-related subjects when requested.\n\n\nWork Assignment Overview\nTasks/Milestone:\n\n\n\tComplete the review and provide the inputs for refinement of QA and QC plans and procedures by addressing all project components, including HVAC, mechanical, electrical, and plumbing works.\n\n\nDeliverables/Outputs:\n\n\n\tFinalized QA and QC plans and procedures.\n\tConduct site inspections, audits, material testing, and issue resolution.\n\n\nDeliverables/Outputs:\n\n\n\tMonthly QA assessment reports (findings, non-conformities, corrective actions): June-December 2025.\n\tFinalize quality audits, verify compliance, and archive documentation.\n\n\nDeliverables/Outputs:\n\n\n\tFinal QA report (summary of quality performance and future recommendations).\n\n\nRequirements\n\n\n\tAn advanced University Begree in Mechanical or Electrical or related field.\n\tA minimum of 10 years of relevant professional experience in QA and QC for large-scale building or warehouse projects, including international assignments.\n\tProven track record in QA and QC oversight for HVAC, MEP, and finishing works.\n\tFamiliarity with international standards (e.g., ISO, ASTM, BS, or equivalent) and best practices in construction quality management.\n\tDeveloping country work experience and/or familiarity with emergency is considered an asset.\n\tFluency in English is required. Knowledge of another official UN language (Arabic, Chinese, French, Russian or Spanish) or a local language is an asset.\n\n\nApplication Closing Date: 10th June, 2025.\n\nClick here to apply online\n\n \n\n \n\n3.) Supply Specialist, P3\n\n\nJob ID: 21044\nJob Location: Abuja (FCT)\nEmpoloyment Type: Full-time\nCategories: Supply Management\n\nJob Summary\n\n\n\tThe Supply and Logistics Specialist reports to the Chief of Operations or Supply and Logistics Manager as per the Country Office (CO) set-up and is responsible for managing the supply chains of a small sized country office, and/or small sized emergency response operation, or elements of the supply chains of a larger supply operation. \n\tThe supply chain operations include planning, procurement, contracting, customs clearance, warehousing, in country transport and distribution, as well as monitoring of supplies, services and construction works. \n\tThe incumbent supports management collaboration with programmes in defining supply interventions to meet programmatic needs and achieve results for children, and provides technical and advisory support to governments, national systems and partners on supply chain management\n\n\nSummary of Key Functions / Accountabilities\n\n\n\tManagement of the supply team\n\tSupply Chain service delivery and emergency response\n\tCollaboration with programme and implementing partners\n\tTechnical, advisory support to government/national systems\n\tInnovation, products and markets\n\n\nManagement of the Supply team:\n\n\n\tPrepare the annual work plan for the Supply team and the annual Supply Procurement and Distribution Plan for goods and services; determine priorities/targets and performance measurements and monitor work progress to ensure that results are achieved according to schedule and performance standards.\n\tSupervise and coach team members, ensure timely performance management of staff. In collaboration with Supply Division, Regional Office and the global supply community, ensure knowledge sharing and learning is prioritized in order to continuously build capacity of individuals and the team.\n\tIn consultation with supervisor, ensure establishment and maintenance of operational capacity to handle CO supply chains, including staffing (appropriate staffing structure, timely recruitment, clarity of roles and responsibilities) and contracting of third-party services if applicable (e.g. customs clearance, warehousing, transport, distribution)\n\n\nSupply chain service delivery and emergency response:\n\n\n\tIn consultation with supervisor, provide input to the Country Programme Action Planning and advice on Supply requirements for the Plan of Operations and Annual Work Plans. Ensure appropriate planning, implementation, monitoring and evaluation of the supply chain operations, including establishment of performance indicators, and assessment of fit for purpose of products and services.\n\tAnalyze supply spend and develop procurement strategies based on category management in order to focus on strategic, essential supplies and services that contribute to results for children, including establishment of long term agreements (LTAs) where relevant. Ensure effective procurement of goods, contracting of services and construction works, while maintaining the highest level of integrity, ethical standards and accountability.\n\tEnsure appropriate vendor management practices e.g. supply performance reviews are established and applied.\n\tAnalyze supply dashboards, implementation rates of key performance indicators and supply information/data from various systems and conduct root cause analysis of supply chain bottlenecks and challenges, with a view to drive improvements and ensure efficient and effective supply chains for children.\n\tIn consultation with supervisor, develop an emergency supply and institutional service contracting strategy based on risk assessment analysis and Programme assumptions. Ensure an emergency supply and institutional service contracting preparedness action plan for the CO is established in line with Core Commitments for Children in Humanitarian Action (CCC), and implemented (establishment of relevant LTAs and frame agreements for emergency response, prepositioning of stock, and training of staff in the country office).\n\tParticipate in high level emergency coordination, implementation and monitoring meetings with internal and external partners and establish close collaboration with UN Procurement Network/Working Group if such is activated/existing.\n\tIn collaboration with supervisor, establish strong working relations with Regional Chiefs of Supply/Regional Chief of Operations, as well as Supply Division, to align with global and regional approaches and initiatives in supply chain management.\n\n\nCollaboration with programme and implementing partners:\n\n\n\tIn collaboration with supervisor, develop close collaboration with programme sections through involvement in programme design, planning, and preparation for implementation of supply components as well as monitoring and evaluation. Establish accountability framework with programmes, for delivery of results for children.\n\tProvide supply input to donor dialogue, and support development of supply components of proposals to donors including budgeting and use of innovative financing mechanisms for supplies, services and construction works.\n\tSupport assessment of and collaboration with implementing partners including civil society, establishment of Programme Cooperation Agreements (PCAs), and monitoring of supply components under Harmonized Approach to Cash Transfers (HACT).\n\tDevelop and maintain partnership and collaborative relations with Government, UN organizations and bilateral counterparts in supply chain activities including harmonized and collaborative procurement.\n\n\nTechnical and advisory support to government/national systems:\n\n\n\tPromote/drive supply chain strengthening and change management initiatives with governments and partners, to ensure efficient and effective supply chains for children.\n\tProvide input to capacity development initiatives in the area of supply chains for children, in close collaboration with programme colleagues. Support supply components of health systems strengthening as might be relevant in the country context.\n\tAdvisory support to Governments/national systems in defining and determining supply solutions for children, such as use of procurement services; supply financing solutions; local market development; private sector engagement.\n\n\nInnovation, products and markets:\n\n\n\tContribute to pilots and support the actual roll-out of new products and services, in close collaboration with Supply Division.\n\tPromote critical thinking, innovative approaches and good practices on supply chain management within the organization as well as with externals to ensure effective and efficient supply chains for children.\n\tFurther to analysis of supply spend and related procurement strategies, in collaboration with supervisor run initiatives to ensure local market development where relevant.\n\n\nQualifications\nTo qualify as an advocate for every child you will have…\nEducation:\n\n\n\tAn advanced university degree is required in Business Administration, Management, Economics, Supply Chain Management, Logistics, Procurement, Contract/Commercial Law, International Development, Health or related social science field, or relevant first-level university degree (Bachelor’s) in conjunction with a valid relevant professional certification is required.\n\n\nExperience:\n\n\n\tA minimum of five (5) years of relevant experience, at the national and international levels, in supply, logistics, procurement, contracting, administration and/or other directly related technical fields is required.\n\tUnderstanding of development and humanitarian work.\n\tEmergency experience an advantage.\n\tHealth supply chain management experience an advantage.\n\n\nApplication Closing Date: 9th June, 2025.\n\nClick here to apply online\n\nNote: Only shortlisted candidates will be contacted and advance to the next stage of the selection process.\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Deputy General Manager (DGM) Job at Dangote Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/deputy-general-manager-dgm-job-at-dangote-group",
    "pubDate": "Fri, 06 Jun 2025 13:48:16 GMT",
    "source": "JobGurus",
    "keyword": "dangote group",
    "duplicate": [
      {
        "site": "Example Site",
        "id": "931a4b36a0363d1a3091f995fafc4d41",
        "timestamp": 1748870561278
      },
      {
        "site": "JobGurus",
        "id": "ed021726df1a03209ab5850fd1887342",
        "timestamp": 1748949214016
      },
      {
        "site": "JobGurus",
        "id": "588752c5dca4899706ac3b4253acdfab",
        "timestamp": 1749216438631
      },
      {
        "site": "JobGurus",
        "id": "b33c1cb0bb83f4fd24e6363e8ee67d2a",
        "timestamp": 1749217687942
      }
    ],
    "classifications": [],
    "content": "Dangote Group is one of Nigeria’s most diversified business conglomerates with a hard – earned reputation for excellent business practices and products’ quality with its operational headquarters in the bustling metropolis of Lagos, Nigeria in West Africa.\n\nWe are recruiting to fill the position below:\n\nJob Position: Deputy General Manager (DGM)\n\nJob Location: Ibese, Ogun\nJob type: Full-time\n\nDescription\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a Deputy General Manager (DGM), HEMM to join its team. The ideal candidate will play a critical role in meeting the short-term and long-term objectives of the organization by ensuring the smooth, safe and efficient functioning of Heavy Earth Moving Machinery (HEMM).\n\n\nResponsibilities\n\n\n\tDeveloping and implementing systems to manage and control HEMM across the plants in the DCP.\n\tDeveloping and implementing HEMM metrics to be used to identify gaps in productivity.\n\tEnsuring that all HEMM operators are properly trained, have the requisite certification and are competent to operate the equipment safely and efficiently.\n\tMonitoring HEMM maintenance and repairs to ensure optimal asset performance and minimal downtime.\n\tEnsuring that all relevant administrative documentation, such as maintenance logs is completed and accurate.\n\tEnsuring that HEMM procurement is carried out in a timely manner.\n\tParticipating in the planning and execution of projects.\n\n\nRequirements\n\n\n\tBSc. /HND in mechanical engineering or its equivalent.\n\tAt least 15 to 21 years of experience managing HEMM in an industrial or construction setting.\n\tUnderstanding of HEMM technology and best practices for their maintenance and repair.\n\tKnowledge of safety standards and measures in relation to HEMM operations.\n\tIn-depth experience in project management and project planning.\n\tAbility to manage a diverse team effectively, and function as a collaborative team player.\n\tIn-depth knowledge of the Cement Industry will be an added advantage.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Openings at Domeo Resources International",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-domeo-resources-international",
    "pubDate": "Fri, 06 Jun 2025 13:48:16 GMT",
    "source": "JobGurus",
    "keyword": "domeo resources international",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Domeo Resources International (DRI) is a prolific organisation which proffers HR and Management Consultancy solutions premised on excellence and innovation. DRI analyses various organisational problems, develops improvement plans, deploys those plans and monitors the plans to ensure improved organisational performance.\n\nWe are recruiting to fill the following positions below:\n\n1.)  Accountant\n\nJob Location: Abuja (FCT)\nReports to: Chief Financial Officer (CFO)\nDirect Reports: None\n\nMain Function\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Accountant at Stanel Group is responsible for managing and overseeing the company’s financial operations, ensuring accurate record-keeping, financial reporting, cost analysis, and compliance with financial regulations.\n\tThis role involves tracking and analyzing costs related to production, sales, and operational activities, while also providing strategic insights to optimize financial performance.\n\tAs a key member of the finance team, the Accountant will contribute to the company’s decision-making processes by providing detailed cost reports, identifying cost-saving opportunities, and ensuring the company’s resources are being used efficiently.\n\n\nRole Responsibilities\nGeneral Accounting Functions:\n\n\n\tFinancial Record-Keeping: Accurately prepare and maintain comprehensive financial records, including journals, ledgers, and reconciliations, ensuring they comply with accounting standards.\n\tFinancial Reporting: Prepare monthly, quarterly, and annual financial statements, providing management with clear, insightful reports to support decision-making.\n\tTransaction Management: Oversee the processing of payments, receipts, and invoices, ensuring accuracy and compliance with company policies.\n\tRegulatory Compliance: Ensure compliance with tax laws and financial regulations, including VAT, payroll taxes, and corporate tax obligations.\n\tAudit Support: Assist in the preparation for annual audits by providing necessary documentation and explanations for financial records.\n\n\nCost Accounting and Control:\n\n\n\tCost Tracking and Reporting: Monitor, analyze, and report on costs associated with the company’s production, sales, and operational activities.\n\tInventory Costing: Oversee the costing of inventory, ensuring that stock levels are maintained efficiently, and that costs are accurately allocated to products and services.\n\tCost Optimization: Identify opportunities for cost savings across operations by conducting detailed cost analysis and proposing actionable strategies to reduce waste and improve efficiency.\n\tBudgeting and Forecasting: Collaborate with other departments to prepare annual budgets and forecasts, offering detailed cost projections and ensuring adherence to set financial targets.\n\tVariance Analysis: Regularly review budgeted versus actual costs, identifying significant variances and implementing corrective actions to align actual costs with budget expectations.\n\n\nFinancial Analysis and Strategic Support:\n\n\n\tData-Driven Insights: Provide the leadership team with actionable financial insights based on cost trends, variances, and market conditions.\n\tPerformance Metrics: Track key performance indicators (KPIs) related to financial performance, including profitability, operational efficiency, and cost ratios.\n\tAd-hoc Reporting: Prepare financial analyses on an ad-hoc basis for specific projects or strategic initiatives to help guide operational decisions.\n\tCost-Effectiveness: Work with department heads to identify areas where cost reductions can be made without sacrificing quality or operational performance.\n\n\nInternal Controls and Risk Management:\n\n\n\tProcess Improvement: Work to improve internal financial processes and controls, ensuring that financial transactions are recorded accurately and efficiently.\n\tRisk Assessment: Assess and identify potential risks in financial operations, implementing mitigation strategies to safeguard company assets.\n\tCompliance Assurance: Ensure that all financial transactions and accounting practices adhere to industry standards and legal requirements.\n\n\nTax and Regulatory Compliance:\n\n\n\tTax Returns: Prepare and file tax returns in a timely and accurate manner, ensuring full compliance with local and national tax regulations.\n\tTax Planning: Advise management on potential tax-saving strategies, ensuring that the company remains compliant while minimizing tax liabilities.\n\tRegulatory Reporting: Stay current with changes in financial regulations and ensure that the company’s accounting practices align with new compliance requirements.\n\n\nQualifications and Requirements\nEducation and Certifications\n\n\n\tA University Degree in Accounting, Finance, or a related field.\n\tProfessional certification, such as ICAN (Institute of Chartered Accountants of Nigeria) or ACCA (Association of Chartered Certified Accountants), is highly preferred.\n\n\nExperience:\n\n\n\tAt least 3-5 years of experience in accounting, with significant exposure to cost accounting in a manufacturing or services environment.\n\tProven track record in financial reporting, cost analysis, and financial forecasting.\n\tExperience in utilizing accounting software (e.g., QuickBooks, SAP, Microsoft Dynamics) and advanced proficiency in Microsoft Excel.\n\n\nSkills:\nAnalytical and Strategic Thinking:\n\n\n\tAdvanced analytical skills, with the ability to extract key insights from financial data to influence business decisions.\n\tStrong problem-solving capabilities, particularly in areas of cost reduction and financial process improvement.\n\n\nAttention to Detail and Accuracy:\n\n\n\tHigh level of accuracy and attention to detail in all aspects of financial record-keeping and reporting.\n\n\nFinancial Planning and Control:\n\n\n\tExpertise in budgeting, forecasting, and managing financial performance.\n\tAbility to collaborate with other departments to align operational goals with financial performance metrics.\n\n\nCommunication Skills:\n\n\n\tStrong verbal and written communication skills for presenting financial data to management and other stakeholders.\n\tAbility to communicate complex financial information in a clear and concise manner.\n\n\nTime Management and Multitasking:\n\n\n\tAbility to prioritize tasks, manage multiple projects, and meet deadlines in a fast-paced environment.\n\tStrong organizational skills and the capacity to handle large volumes of financial data without sacrificing quality or accuracy.\n\n\nKnowledge of Accounting Standards:\n\n\n\tIn-depth knowledge of Generally Accepted Accounting Principles (GAAP) and International Financial Reporting Standards (IFRS).\n\tFamiliarity with tax laws, VAT, and other compliance regulations.\n\n\nTeam Leadership and Collaboration:\n\n\n\tAbility to work both independently and as part of a team, offering leadership when required and contributing to the achievement of team objectives.\n\n\nApplication Closing Date: 11th June, 2025.\n\nMethod of Application\nInterested and qualified candidates should forward their CVs and cover letters to: recruitment@domeoresources.org with \"Accountant\" as the subject of the mail.\n\nNote: Only shortlisted candidates will be contacted.\n\n \n\n \n\n2.) Internal Auditor\n\nJob Location: Abuja (FCT)\nReports to: the CEO\nDirect Reports: Internal Audit Team\n\nMain Function\n\n\n\tThe Group Internal Auditor is responsible for evaluating the effectiveness of the Group’s internal controls, risk management practices, and governance processes.\n\tThis role ensures compliance with regulatory standards, identifies areas for improvement, and recommends strategies to enhance operational efficiency.\n\n\nRole Responsibilities\nAudit Planning and Execution:\n\n\n\tDevelop and implement the annual internal audit plan based on a risk assessment.\n\tConduct financial, operational, and compliance audits across all subsidiaries of the Group.\n\tIdentify inefficiencies, risks, and non-compliance issues, and recommend corrective actions.\n\n\nRisk Management and Internal Controls:\n\n\n\tEvaluate the effectiveness of internal controls and risk management practices.\n\tCollaborate with management to design and implement risk mitigation strategies.\n\tMonitor compliance with policies, procedures, and regulatory requirements.\n\n\nReporting and Communication:\n\n\n\tPrepare detailed audit reports with findings, recommendations, and management responses.\n\tPresent audit results to the Audit Committee and senior management.\n\tFollow up on the implementation of audit recommendations to ensure timely resolution.\n\n\nFraud Detection and Prevention:\n\n\n\tInvestigate cases of fraud, irregularities, or breaches of company policies.\n\tDevelop strategies and training programs to prevent fraudulent activities.\n\n\nProcess Improvement:\n\n\n\tIdentify opportunities to improve operational efficiency and effectiveness.\n\tRecommend best practices for governance, risk management, and compliance.\n\n\nTeam Leadership and Development:\n\n\n\tSupervise and mentor the internal audit team, ensuring high-quality audit execution.\n\tProvide training and development opportunities for team members.\n\n\nEducation and Certifications\n\n\n\tBachelor's Degree in Accounting, Finance, or a related field.\n\tProfessional certifications such as CIA, CISA, ACCA, or ACA are mandatory.\n\n\nExperience:\n\n\n\tMinimum of 8 years in auditing, with at least 3 years in a leadership role.\n\tExperience in internal audit within a group structure or multiple industries is an advantage\n\n\nSkills:\n\n\n\tAudit and Risk Expertise:\n\tStrong understanding of auditing standards, risk management, and internal controls.\n\tAnalytical and Critical Thinking:\n\tAbility to analyse complex data and identify patterns, risks, or inefficiencies\n\tCommunication and Reporting:\n\tExcellent report-writing and presentation skills.\n\tLeadership and Team Management:\n\tAbility to manage and develop a high-performing audit team.\n\tTechnical Proficiency:\n\tProficiency in audit software and ERP systems.\n\n\nApplication Closing Date: 11th June, 2025.\n\nMethod of Application\nInterested and qualified candidates should forward their CVs and cover letters to: recruitment@domeoresources.org with \"Internal Auditor\" as the subject of the mail.\n\nNote: Only shortlisted candidates will be contacted.\n\n \n\n \n\n3.) Caregiver\n\nJob Location: Abuja\nReports to: Head of Centre\nDirect Reports: None\nOpenings: 6\n\nMain Function\n\n\n\tThe Caregiver provides attentive, compassionate, and professional care to children at the edu-play centre.\n\tThis includes supervising activities, fostering a safe and nurturing environment, and promoting the physical, emotional, and social development of each child.\n\tThe role requires a high level of patience, creativity, and a genuine passion for working with children.\n\n\nRole Responsibilities\nChild Supervision and Interaction:\n\n\n\tSupervise and engage children during playtime, educational activities, and mealtimes.\n\tProvide personalized attention to each child, ensuring their needs are met promptly and professionally.\n\tFoster positive relationships among children to encourage social development.\n\n\nProgram Support:\n\n\n\tAssist in organizing and implementing age-appropriate educational and recreational activities.\n\tEncourage creativity, exploration, and learning through structured and unstructured play.\n\tMonitor children’s progress and behavior, reporting any concerns to the Head of Centre.\n\n\nHealth, Safety, and Hygiene:\n\n\n\tEnsure a clean and safe environment, including sanitizing toys, play areas, and equipment.\n\tAdhere to health and safety protocols, such as emergency procedures and first aid guidelines.\n\tSupport children with basic needs, including feeding, diaper changes, and potty training when required.\n\n\nParent Communication:\n\n\n\tCommunicate daily updates about each child’s activities, achievements, and challenges to parents.\n\tBuild trust and rapport with parents by addressing their concerns in a professional and caring manner.\n\n\nQualifications\nEducation and Certifications\n\n\n\tDegree in a related field\n\tCertification in child care, early childhood education and first aid is an advantage.\n\n\nExperience:\n\n\n\tMinimum of 2 years of experience working with children in a similar capacity.\n\n\nSkills:\nInterpersonal Skills:\n\n\n\tPatience, empathy, and the ability to connect with children.\n\tStrong communication and teamwork skills.\n\n\nChildcare Knowledge:\n\n\n\tUnderstanding of child development and age-appropriate activities.\n\n\nPersonal Attributes:\n\n\n\tReliable, responsible, and proactive in addressing children’s needs.\n\n\nApplication Closing Date: 11th June, 2025.\n\nMethod of Application\nInterested and qualified candidates should forward their CVs and cover letters to: recruitment@domeoresources.org with \"Caregiver\" as the subject of the mail.\n\nNote: Only shortlisted candidates will be contacted.\n\n \n\n \n\n4.) Chief Financial Officer\n\nJob Location: Abuja (FCT) and Lagos\n\nMain Function\n\n\n\tThe CFO will oversee the financial operations of the organization, providing strategic financial leadership to drive the organization’s financial performance and growth.\n\tThis role is responsible for developing and implementing financial strategies, managing budgets, optimizing the financial structure, and ensuring compliance with regulatory requirements.\n\n\nRole Responsibilities\nStrategic Financial Leadership:\n\n\n\tDevelop and execute financial strategies to achieve the Group’s business objectives.\n\tProvide financial insights and recommendations to the Chairman and Board of Directors to support strategic decision-making.\n\tIdentify growth opportunities, including potential investments, mergers, and acquisitions.\n\n\nFinancial Planning and Analysis:\n\n\n\tLead the preparation of annual budgets, forecasts, and financial models.\n\tAnalyze financial data to identify trends, risks, and opportunities.\n\tMonitor key performance indicators (KPIs) to evaluate financial performance.\n\n\nAccounting and Reporting:\n\n\n\tOversee the preparation of accurate and timely financial reports, including monthly, quarterly, and annual statements.\n\tEnsure compliance with accounting standards, tax regulations, and corporate governance requirements.\n\tCoordinate with external auditors for annual audits and ensure timely resolution of audit findings.\n\n\nTreasury and Cash Management:\n\n\n\tManage the Group’s liquidity, cash flow, and capital structure to optimize financial health.\n\tOversee debt management, including negotiations with financial institutions for loans and credit facilities.\n\tDevelop and maintain relationships with banks, investors, and other financial stakeholders.\n\n\nRisk Management and Compliance:\n\n\n\tIdentify financial risks and implement mitigation strategies.\n\tEnsure compliance with all financial regulations, laws, and internal policies.\n\tMaintain robust internal controls to safeguard the Group’s assets\n\n\nLeadership and Team Development:\n\n\n\tLead, mentor, and manage the finance team to achieve high levels of performance.\n\tFoster a culture of continuous improvement, innovation, and accountability within the department.\n\tEnsure knowledge sharing and training for team members to enhance financial expertise.\n\n\nQualifications\nEducation and Certifications:\n\n\n\tBachelor’s degree in Accounting, Finance, Economics, or a related field.\n\tA Master’s degree or MBA is an advantage.\n\tProfessional certifications such as ACCA, ACA, CPA, or CFA are mandatory\n\n\nExperience:\n\n\n\tMinimum of 10 years of senior financial management experience, with at least 5 years in a CFO or equivalent role.\n\tExperience in diverse industries, including FMCG, Oil and Gas, or Hospitality, is an advantage.\n\n\nSkills\nStrategic Thinking and Leadership:\n\n\n\tAbility to align financial strategies with business goals.\n\tExceptional decision-making and problem-solving abilities.\n\n\nTechnical Financial Expertise:\n\n\n\tProficiency in financial modeling, analysis, and reporting.\n\tStrong understanding of IFRS, tax laws, and corporate governance.\n\n\nCommunication and Interpersonal Skills:\n\n\n\tStrong presentation skills with the ability to communicate complex financial information clearly.\n\tAbility to build relationships with internal and external stakeholders.\n\n\nTechnology Proficiency:\n\n\n\tFamiliarity with ERP systems and advanced financial software tools.\n\n\nApplication Closing Date: 10th June, 2025.\n\nMethod of Application\nInterested and qualified candidates should forward their CV and Cover Letter to: recruitment@domeoresources.org using \"Chief Financial Officer (CFO)\" as the subject of the mail.\n\nNote: Only shortlisted candidates will be contacted.\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]