[
  {
    "title": "Senior Human Resources (HR) & Admin Manager Job at Herbal Goodness",
    "link": "https://www.jobgurus.com.ng/jobs/view/senior-human-resources-hr-admin-manager-job-at-herbal-goodness",
    "pubDate": "Sat, 07 Jun 2025 14:39:12 GMT",
    "source": "JobGurus",
    "keyword": "herbal goodness",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Herbal Goodness is a manufacturer of premium quality, unique, organic, non-GMO superfoods, and herbal products to support healthy living and impact lives. Founded in 2013, the company excels in the botanical and natural supplements industry and manufactures product lines such as Herbal Teas, Supplements, Extracts, Essential Oils, Smoothies, and Juices. The company is unique in its values of Quality, Sustainability, and Impact. 100% women and minority-owned, Herbal Goodness believes in Business for social good. We donate 10% of our profits to promote the education of girls.\n\nWe are recruiting to fill the position below:\n\nJob Position: Senior Human Resources (HR) & Admin Manager\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Location: Remote\nEmployment type: Full-time\nDepartment: Admin & Human Resources Management\nReports To: COO or CEO\n\nJob Summary\n\n\n\tWe are seeking an organized, detail-oriented, and proactive Senior Manager of Admin & HR to oversee and manage all HR and administrative functions within our fully remote team.\n\tThis role is key to ensuring that we maintain strong HR practices, including talent acquisition, performance management, compliance, and employee engagement.\n\tThe ideal candidate will have significant experience in developing and implementing policies, leading recruitment efforts, and enhancing the overall employee experience while ensuring seamless administrative operations.\n\tAs a Senior Manager in this role, you will be instrumental in building a positive company culture, supporting employee growth, and ensuring that our workforce is equipped to meet the evolving demands of a rapidly growing business.\n\n\nKey Responsibilities\nTalent Acquisition & Onboarding:\n\n\n\tLead full-cycle recruitment for U.S. and Nigerian roles, including job postings, sourcing, screening, interviewing, and hiring.\n\tCollaborate with department heads to define 30/60/90-day goals for new hires, ensuring alignment in offer letters.\n\tOversee a smooth and welcoming onboarding experience using platforms like BambooHR, TalentLMS, and Scribe.\n\tEnsure compliance with local labor laws in offer letters, contracts, and employee documents.\n\n\nPerformance Management & Employee Development:\n\n\n\tAdminister performance review cycles, ensuring managers set clear KPIs and development goals for all employees.\n\tMaintain and implement a skills matrix and competency mapping system.\n\tCoordinate leadership and employee training programs using both internal resources and external vendors.\n\tSupport the coaching, mentoring, and development of staff across all departments.\n\n\nEmployee Relations & Engagement:\n\n\n\tFoster a positive and inclusive workplace culture, aligned with the company’s core values of empowerment and sustainability.\n\tHandle employee concerns, conflicts, and disputes with professionalism, fairness, and confidentiality.\n\tManage quarterly team feedback loops and engagement activities, including wellness programs and company town halls.\n\tOversee employee recognition programs and retention strategies, including alumni networks.\n\n\nCompensation & Benefits Administration:\n\n\n\tMaintain up-to-date compensation and benefits structures aligned with industry standards and internal equity.\n\tWork closely with payroll contractors to ensure accurate and timely processing of salaries, taxes, and benefits.\n\tMonitor the RPP (Roles, Pay & Performance) framework to ensure alignment between job roles and compensation.\n\tAssist with managing health benefits, leave policies, and statutory deductions across locations.\n\n\nCompliance & HR Policy Management:\n\n\n\tEnsure adherence to U.S. and Nigerian labor laws in all HR-related matters.\n\tContinuously update and enforce company policies related to leave, ethics, remote work, and employee conduct.\n\tManage and maintain accurate employee records and follow proper document retention processes.\n\tCoordinate compliance audits and manage regulatory filing requirements.\n\n\nSystems & Reporting:\n\n\n\tOptimize the use of HR systems, including HRIS, Google Workspace, and LMS.\n\tTrack key HR metrics such as turnover, employee satisfaction, training completion rates, and diversity statistics.\n\tPrepare monthly HR dashboards and provide reports on HR performance for executive leadership.\n\n\nRequirements\n\n\n\t7+ years of experience in HR and administrative management, particularly with remote teams. An advanced degree, such as an MBA, and relevant HR certifications are required.\n\tProven expertise in recruitment, onboarding, employee performance management, and employee engagement.\n\tSolid experience in policy development and training program implementation.\n\tStrong background in compliance management, certification handling, and document administration.\n\tProficient in HRIS (Human Resources Information Systems).\n\tExperience with project management tools such as Notion, Asana; CRM experience is a plus.\n\tExcellent proficiency in Google Workspace and collaborative tools.\n\tAbility to effectively manage and support a diverse, remote workforce. International experience a strong plus.\n\tOutstanding problem-solving, data analysis, and decision-making abilities.\n\n\nWhy You Should Join Us\n\n\n\tN350,000 / Month + Benefits\n\tImpact: Work with a company that prioritizes quality, sustainability, and empowerment.\n\tGrowth: Be part of a team that values professional development and encourages continuous learning.\n\tFlexibility: Enjoy the flexibility of a remote role with a dynamic and mission-driven team\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Quality Assurance (QA) and Logistics Associate Job at Herbal Goodness",
    "link": "https://www.jobgurus.com.ng/jobs/view/quality-assurance-qa-and-logistics-associate-job-at-herbal-goodness",
    "pubDate": "Sat, 07 Jun 2025 14:39:12 GMT",
    "source": "JobGurus",
    "keyword": "herbal goodness",
    "duplicate": false,
    "classifications": [],
    "content": "Herbal Goodness is a manufacturer of premium quality, unique, organic, non-GMO superfoods, and herbal products to support healthy living and impact lives. Founded in 2013, the company excels in the botanical and natural supplements industry and manufactures product lines such as Herbal Teas, Supplements, Extracts, Essential Oils, Smoothies, and Juices. The company is unique in its values of Quality, Sustainability, and Impact. 100% women and minority-owned, Herbal Goodness believes in Business for social good. We donate 10% of our profits to promote the education of girls.\n\nWe are recruiting to fill the position below:\n\nJob Position: Quality Assurance (QA) and Logistics Associate\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Location: Abuja (Remote)\nCategory: Operations & Quality\n\nJob Description\n\n\n\tQA and Logistics Associate who will play a key role in ensuring product quality and efficient movement of goods across the supply chain.\n\tThis role is responsible for supporting quality assurance processes, inspecting incoming and outgoing products, maintaining compliance with organic and wellness standards, and coordinating logistics operations to ensure timely deliveries and accurate inventory management.\n\n\nKey Responsibilities\nQuality Assurance:\n\n\n\tConduct routine quality checks on raw materials and finished products to ensure they meet Herbal Goodness standards.\n\tDocument inspection results, maintain accurate QA records, and report any deviations or issues.\n\tSupport the implementation of GMP, HACCP, and other applicable food safety standards.\n\tAssist in investigating customer complaints related to product quality and recommend corrective actions.\n\tCollaborate with production and R&D teams to maintain consistent product integrity and compliance.\n\n\nLogistics and Inventory:\n\n\n\tCoordinate with suppliers, couriers, and warehouse teams to manage inbound and outbound shipments.\n\tEnsure timely and accurate order fulfillment, particularly for Amazon, Walmart, and wholesale channels.\n\tTrack and manage inventory levels, flag discrepancies, and assist with periodic inventory audits.\n\tMaintain accurate documentation of shipping records, packing lists, and delivery confirmations.\n\tSupport cross-border and international shipping compliance, including customs documentation where needed.\n\n\nGeneral Support:\n\n\n\tCommunicate clearly across teams to ensure alignment on QA and logistics tasks.\n\tSuggest process improvements to optimize supply chain efficiency and product quality.\n\tAssist with administrative tasks related to logistics, procurement, and compliance.\n\n\nQualifications\n\n\n\tBachelor's Degree or relevant experience in Logistics, Quality Assurance, Supply Chain, or a related field.\n\t3-4 years of experience in a QA or logistics role, preferably within the food, wellness, or FMCG industry.\n\tStrong attention to detail and organizational skills.\n\tFamiliarity with inventory systems and logistics tools; experience with Amazon/Walmart platforms is a plus.\n\tUnderstanding of organic product standards and basic regulatory requirements.\n\tAbility to work independently in a fast-paced, remote-friendly environment.\n\n\nWhy Herbal Goodness\n\n\n\tYou’ll play an instrumental role in a mission-driven company with a focus on holistic health and social impact.\n\tFlexible remote work with opportunities for growth, learning, and career advancement.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Finance & Bookkeeping Associate Job at Herbal Goodness",
    "link": "https://www.jobgurus.com.ng/jobs/view/finance-bookkeeping-associate-job-at-herbal-goodness",
    "pubDate": "Sat, 07 Jun 2025 14:39:12 GMT",
    "source": "JobGurus",
    "keyword": "herbal goodness",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Herbal Goodness is a manufacturer of premium quality, unique, organic, non-GMO superfoods, and herbal products to support healthy living and impact lives. Founded in 2013, the company excels in the botanical and natural supplements industry and manufactures product lines such as Herbal Teas, Supplements, Extracts, Essential Oils, Smoothies, and Juices. The company is unique in its values of Quality, Sustainability, and Impact. 100% women and minority-owned, Herbal Goodness believes in Business for social good. We donate 10% of our profits to promote the education of girls.\n\nWe are recruiting to fill the position below:\n\nJob Position: Finance & Bookkeeping Associate\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Location: Abuja (Remote)\nEmployment type: Full-time\nDepartment: Operations\n\nJob Summary\n\n\n\tWe are seeking a detail-oriented and proactive Finance & Bookkeeping Associate to join our team. This role is responsible for managing financial records, assisting with financial analysis, and ensuring compliance with accounting standards.\n\tThe ideal candidate will have a strong background in bookkeeping and financial processes, with the ability to work independently and collaboratively to support the company’s financial operations.\n\n\nKey Responsibilities\n\n\n\tFinancial Records and Reporting: Maintain and update the general ledger, support month-end close processes, and ensure accurate QuickBooks entries.\n\tGeneral Ledger Management: Ensure accurate postings in QuickBooks, reviewing for appropriate categorization within the correct General Ledger accounts.\n\tAccounts Payable/Receivable and Compliance: Support AP/AR processes, ensure timely and accurate payments, and assist with regulatory compliance requirements.\n\tExpense Tracking and Budget Management: Monitor and analyze expenses, assist in budget planning, and identify cost-saving opportunities.\n\tInventory Reconciliation: Collaborate with the operations team to track and reconcile inventory, ensuring data accuracy and optimal stock levels.\n\tProcess Automation and Efficiency Improvements: Identify opportunities for automation to streamline financial processes and improve operational efficiency.\n\tDashboard and Reporting: Assist in creating insightful financial dashboards and reports to support decision-making.\n\tData Collection and Analysis: Work with business heads to gather channel-specific data, ensuring timely and accurate reporting across teams.\n\n\nRequirements\n\n\n\tBachelor’s Degree in Finance, Accounting, Business, or a related field.\n\t2+ years in bookkeeping, finance, or accounting\n\tExcellent verbal and written communication skills, including the ability to effectively communicate with internal and external customers.\n\tExperience with payroll processing and reconciliation.\n\tFamiliarity with financial compliance standards and audit preparation.\n\tStrong understanding of accounting principles and practices.\n\tProficiency in accounting software (e.g., QuickBooks, Xero).\n\tAbility to work independently and as part of a team.\n\tMust have excellent Internet connection, working laptop, and ability to adjust work hours to Central Standard Time (Between 9 am - 5 pm CST / 4 pm -12 am WAT).\n\n\nRemuneration\n\n\n\tN180,000 - N250,000 / Month (Gross)\n\tHealth Insurance\n\tTime off Benefits (PTO, Company Paid Holidays, Maternity/Parternity Leave etc)\n\tSign-on bonus\n\tData Allowance\n\tBonuses\n\tProfessional Development opportunities.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Marketer (Male) Job at Value Dynamix",
    "link": "https://www.jobgurus.com.ng/jobs/view/marketer-male-job-at-value-dynamix",
    "pubDate": "Sat, 07 Jun 2025 14:39:12 GMT",
    "source": "JobGurus",
    "keyword": "value dynamix",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Value Dynamix provides IT services that solves daily problems.\n\nWe are recruiting to fill the position below:\n\nJob Position: Marketer (Male)\nJob Location: Abuja (FCT)\nEmployment Type: Full-time\n\nJob Description\n\n\n\tMarketing of IT solution to real estate firms, landlord-owned estates, restaurants, bars, lounges and clubs.\n\n\nRequirements\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tMust speak good english\n\tMust be deadline-driven\n\tStrong communication skills\n\tMust be proactive\n\tMust have the ability to convince a potential client\n\tMust be confident\n\tMust be male\n\tMust reside in abuja\n\tMust live in lokongoma or lifecamp(lokongoma preferably).\n\n\nRequirements\n\n\n\tCandidates should possess a B.Sc Degree with 2 years of work experience.\n\n\nBenefits\n\n\n\tSalary: NGN50,000 Monthly.\n\tTransportation for Marketing: N80,000(N20,000 will be issued on a weekly basis)\n\tCommissions:\n\t\n\t\tN50,000 per estate delivered\n\t\tN30,000 per club, restaurant, lounge or bar delivered.\n\t\n\t\n\n\nMethod of Application\nInterested and qualified candidateds should send their CV to: victoria.negedu@handymandaige.com using \"Markerter\" as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Human Resource Business Partner (HRBP) Job at DMOT Enterprises",
    "link": "https://www.jobgurus.com.ng/jobs/view/human-resource-business-partner-hrbp-job-at-dmot-enterprises",
    "pubDate": "Sat, 07 Jun 2025 14:39:12 GMT",
    "source": "JobGurus",
    "keyword": "dmot enterprises",
    "duplicate": false,
    "classifications": [],
    "content": "DMOT Enterprises - Our client, a leading FMCG company, is recruiting to fill the position below:\n\nJob Position: Human Resource Business Partner (HRBP)\nJob Location: Sagamu, Ogun\nEmployment Type: Full-time\n\nRequirements\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\t5 years of experience in a manufacturing environment and in a similar position (FMCG preferred)\n\tGood in handling Recruitment and other HR related issues.\n\tReady to attend interviews and work in Sagamu.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: ayomaku@yahoo.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]