[
  {
    "title": "Strategy Execution Manager Job at Associates Consulting Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/strategy-execution-manager-job-at-associates-consulting-limited",
    "pubDate": "Mon, 16 Jun 2025 10:17:50 GMT",
    "source": "JobGurus",
    "keyword": "associates consulting limited",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "Associates Consulting Limited - Our client, a world class food and beverage company offering a variety of beverages across the country with its state-of-the-art manufacturing plant in Ogun State, is recruiting to fill the position below:\n\nJob Position: Strategy Execution Manager\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Overview\n\n\n\tOur client is currently in need of a Strategy Execution Manager who will be responsible for the formulation and execution of the company’s corporate strategy.\n\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tLead the formulation and execution of the company’s corporate strategy, including long-term vision, growth initiatives, and market expansion plans.\n\tDevelop implementation frameworks for approved strategic plans.\n\tMonitor the execution of strategic initiatives, ensuring alignment with goals.\n\tProvide regular updates and insights to senior leadership.\n\tEnsures execution of strategic projects, including the backward integration projects, as well as the new plant expansion.\n\tManages S&OP governance, ensuring alignment between demand, production, and supply chain execution.\n\tLead the implementation of corporate strategy, ensuring alignment with business goals.\n\tStandardizes project governance, risk assessment, and milestone tracking.\n\tFacilitate stakeholder engagement and cross-department collaboration.\n\tIdentify and address challenges or gaps in execution processes.\n\tDevelop detailed project plans, timelines, and KPIs to track execution progress.\n\tCollaborate with cross-functional teams (Marketing, Operations, Finance, Legal, etc.) to drive strategic initiatives.\n\tConduct regular reviews to assess progress, identify roadblocks, and recommend corrective actions.\n\n\nRequirements\n\n\n\tB.Sc./HND in a relevant field of study.\n\tMust have relevant years of work experience in a similar role, with at least 3 years in a supervisory role in the FMCG industry.\n\tMaster’s degree will be an added advantage.\n\tMust have a Relevant Professional certification i.e Chartered Financial Analyst (CFA), Project Management Professional (PMP), Six Sigma or Lean Management, Certified Strategy Professional (CSP),\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: associatesconsultantsltd@gmail.com using \"Strategy Execution Manager\" as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Credit Officer Job at Lendha",
    "link": "https://www.jobgurus.com.ng/jobs/view/credit-officer-job-at-lendha-1",
    "pubDate": "Mon, 16 Jun 2025 10:17:50 GMT",
    "source": "JobGurus",
    "keyword": "lendha",
    "duplicate": false,
    "classifications": [],
    "content": "Lendha is a quick money lending platform. We provide facility for emergency funds, house / office / shop rent and lifestyle loans.\n\nWe are recruiting to fill the position below:\n\nJob Position: Credit Officer\n\nJob Location: Ikorodu, Lagos\nJob Schedule: Full time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tManage the debt collection processes and work with analysts to develop, recommend, and enact payment plans to eliminate client debt in an agreed timeframe aligned with Lendha’s collections policy.\n\tDebt Settlements: Accurately maintain client records and manage all past due accounts and determine the appropriate collection action to be taken for each individual client.\n\tCollect delinquent accounts by contacting customers via telephone, email, and visiting the place of business.\n\tCompile daily, weekly, and monthly reports on the status of delinquent accounts, collection activity, and accounts receivable status.\n\tLoan Portfolio Growth: Support the evaluation of loans given to customers by ensuring that credit appraisals are completed properly and uphold monitoring of accounts to identify outstanding debts.\n\tReport progress of collections to Supervisor, make recommendations for next steps and write-offs.\n\tCustomer Acquisition: Present, promote and sell Lendha’s products using solid negotiations to existing and prospective clients across relevant sectors, including but not limited to companies in the e-commerce, consumer goods, healthcare, and financial services industries.\n\tReview terms of contract and service with client and clearly communicate various payment options.\n\tWork cooperatively with other departments to best determine how to balance both the customer's and Lendha's needs.\n\n\nQualifications\n\n\n\tBachelor`s Degree or Higher National Diploma in any discipline from accredited polytechnic or University with NYSC discharge certificate or NYSC Exclusion Letter.\n\tGood relationship and communication skills with strong team spirit \n\tStrong analytical skills \n\tGood computer skills \n\tReal motivation to work and grow in a performance based environment\n\tTaste for fieldwork \n\n\nAdditional Knowledge / Skills Required:\n\n\n\tPractical knowledge of micro / small / medium businesses \n\tKnowledge of microfinance bank sector is an advantage\n\tGood writing skills \n\tKnowledge of the major local languages\n\tLives in Ikorodu - Lagos axis.\n\n\nBenefits and Perks\n\n\n\tHMO and other statutory benefits.\n\tJoin a young, passionate, hungry and growing team of entrepreneurs & facilitators\n\tFlexible working hours.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Openings at Springfield Agro Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-springfield-agro-limited",
    "pubDate": "Mon, 16 Jun 2025 10:17:50 GMT",
    "source": "JobGurus",
    "keyword": "springfield agro limited",
    "duplicate": false,
    "classifications": [],
    "content": "Springfield Agro Limited are recruiting to fill the following positions below:\n\n1.) Security Guard\n\nJob Location: Isolo, Lagos\nEmployment Type: Full-time\n\nJob Description\n\n\n\tWe are seeking a reliable and vigilant Security Guard to join our team in Lagos.\n\n\nRequirements\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tExperience: 3 – 5 Years in security, preferably in auto or industrial environments\n\tWAEC holder (OND is an added advantage)\n\tGood knowledge of security protocols and procedures\n\tPhysically fit and alert\n\tAbility to respond quickly and effectively to incidents\n\n\nResponsibilities\n\n\n\tMonitor and safeguard vehicles, equipment, and premises\n\tPerform routine patrols and surveillance\n\tControl access to restricted areas\n\tRecord daily security reports and incidents\n\tReport suspicious activities immediately\n\n\nWhat We Offer\n\n\n\tCompetitive salary.\n\tStable work environment.\n\tTraining and career support.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: careers@kewalramnigeria.com using “Security Guard” as the subject of the mail.\n\n \n\n \n\n2.) Internal Audit Executive\n\nJob Location: Sagamu, Ogun\nEmployment Type: Full-time\n\n\n\n\nKey Responsibilities\n\n\n\tConduct internal audits and risk assessments\n\tReview financial records and processes for accuracy and compliance\n\tPrepare audit reports with findings and recommendations\n\tSupport external audits and regulatory reviews\n\tEnsure proper documentation and internal control systems.\n\n\nRequirements\n\n\n\tHND / B.Sc Degree in Accounting\n\t2 - 4 years of relevant experience\n\tStrong analytical and reporting skills\n\tGood knowledge of internal controls, compliance, and financial regulations\n\tProficiency in Microsoft Excel and accounting software.\n\n\nWhat We Offer\n\n\n\tCompetitive salary\n\tProfessional growth opportunities\n\tStable and structured work environment.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: careers@kewalramnigeria.com using “Audit Executive” as the subject of the mail.\n\n \n\n3.) Cold Room Engineer\n\nJob Location: Isolo, Lagos\nEmployment Type: Full-time\n\nKey Responsibilities\n\n\n\tInstall, troubleshoot, and maintain cold room systems and refrigeration units.\n\tConduct routine inspections and preventive maintenance.\n\tDiagnose faults and perform timely repairs to minimize downtime.\n\tEnsure all systems operate efficiently and in compliance with safety standards.\n\tKeep accurate maintenance logs and service reports.\n\n\nRequirements\n\n\n\tOND in Electrical Engineering or Technical certification in refrigeration and air conditioning (e.g., NABTEB, Trade Test, or equivalent).\n\t2–4 years of proven experience as a Cold Room or Refrigeration Engineer.\n\tStrong understanding of refrigeration cycle, electrical systems, and control panels.\n\n\nWhat We Offer\n\n\n\tCompetitive salary and benefits.\n\tOpportunities for training and career growth.\n\tSupportive work environment.\n\n\nMethod of Application\nInterested and qualified candidates should send their Resume to: careers@kewalramnigeria.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Junior Account Officer Job at J-Six Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/junior-account-officer-job-at-j-six-group-1",
    "pubDate": "Mon, 16 Jun 2025 10:17:50 GMT",
    "source": "JobGurus",
    "keyword": "j-six group",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "J-Six Group is a conglomerate of five subsidiaries in Agro, Cafe, Trade and Logistics, Just Eggs and Quick Service Restaurant; poised towards customers satisfaction, quality products, and friendly discount on purchases.\n\nWe are recruiting to fill the position below:\n\nJob Position: Junior Account Officer\n\nJob Location: Abraham Adesanya, Lagos\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tMonitor usage of products and escalate discrepancies\n\tKeeping track of inventory and ensuring proper record is kept\n\tContribute in the weekly and daily product/production cost analysisers\n\tIssuing out waybills to the Van Sales Representatives\n\tCollect minute of technical meetings and forward to Management\n\tMonitor the inbound of goods and issue invoices to custom\n\tAssist in preparing the monthly Management account\n\tReconciliation of all modes of payment and ensuring payment is remitted appropriately.\n\n\nRequirements\n\n\n\tA minimum of an HND in Accounting, Business Administration or similar field.\n\t1 year of experience in a finance or accounting department.\n\tOpen to learning.\n\tData analysis and reporting\n\tBasic use of Microsoft Excel is important.\n\tProactivity and the ability to pay attention to details\n\tOutstanding documentation skills and being well organized.\n\n\nRemuneration\n\n\n\tNet Salary: N130,000 Monthly.\n\tBenefit(s): HMO\n\n\nMethod of Application\nInterested and qualified candidates should send their Applications to: recruitment@jsixgroup.com using \"Junior Account Officer\" as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Account / Finance Officer Job at DemyHealth Clinic and Genomic Medicine",
    "link": "https://www.jobgurus.com.ng/jobs/view/account-finance-officer-job-at-demyhealth-clinic-and-genomic-medicine",
    "pubDate": "Mon, 16 Jun 2025 10:17:50 GMT",
    "source": "JobGurus",
    "keyword": "demyhealth clinic and genomic medicine",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "DemyHealth is impacting lives in Africa through healthcare innovation and accessibility with our team of highly trained professionals with proven track record as industry leaders within and outside the country. Our core expertise span accross Medical Devices, PCR testing, Diagnostics, Research, Biomedical Engineering, Biorepository and Sequencing services.\n\nWe are recruiting to fill the position below:\n\nJob Position: Account / Finance Officer\n\nJob Location: Anambra\nEmployment Type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAn Accountant manages inventory accuracy, records financial transactions on the software, and prepares reports, ensuring financial integrity and compliance.\n\tThey are responsible for recording accurate inventory transactions, reconciling inventory records, and preparing reports for management.\n\tTheir duties also include analysing inventory trends, identifying discrepancies, and collaborating with other departments to improve inventory management. Assist in Marketing of product and services.\n\n\nResponsibilities\n\n\n\tTrack and manage the company’s inventory.\n\tThis includes maintaining inventory records, conducting physical inventory counts, and reconciling inventory records to physical counts.\n\tEnsure that inventory levels are accurate. This includes identifying and correcting inventory errors, and recommending inventory levels based on sales forecasts and demand.\n\tManagement Protocols · Record all financial transactions in the accounting system\n\tPrepare reports on inventory levels, costs, and variances.\n\tEnsure compliance with accounting standards (GAAP) and company policies.\n\tSupport month-end and year-end closing processes.\n\tPrepare and maintain accurate financial records, including accounts payable, receivable, and general ledger. Reconcile bank statements and other accounts.\n\tPrepare and pay staff Salaries\n\tPrepare and analyse Month end financial reports, including income statements and balance sheets.\n\tInternal Controls: It is crucial to implement and oversee procedures to safeguard assets and keep the precision of financial information, known as internal controls. Inventory Accountants ensure inventory records are accurate by enhancing systems for reporting, reconciling, and auditing inventory to prevent discrepancies and fraud.\n\tDevelop and maintain inventory control systems.\n\tReport all risks and exposures identified.\n\tIdentify any additional controls required based on risks and exposures identified.\n\tAssist in inventory audits.\n\tCollaborate with other departments on inventory-related issues\n\tPerform Client Services and Administrative roles.\n\tAssist in Marketing of product and services\n\n\nQualifications\n\n\n\tBachelor's degree in Accounting, Finance or related field\n\tAt least 2 years of experience working in an inventory accounting role Knowledge of:\n\tExcellent knowledge of accounting principles\n\tProficient in Microsoft Office and accounting software\n\tOperational and field experience\n\tMedical Field experience is a bonus\n\tProficiency in MS Office, particularly MS Excel.\n\n\nSalary\nN100,000 - N150,000 / month\n\nMethod of Application\nInterested and qualified candidates should send their CV to: demyhealthhq@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]