[
  {
    "title": "Project Manager Job at Tunmise Johnson Household Foundation",
    "link": "https://www.jobgurus.com.ng/jobs/view/project-manager-job-at-tunmise-johnson-household-foundation",
    "pubDate": "Fri, 06 Jun 2025 10:45:12 GMT",
    "source": "JobGurus",
    "keyword": "tunmise johnson household foundation",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "(adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\nTunmise Johnson Household Foundation - Through addressing dependency, the TA community seeks to lower the rate of poverty around the world, with Nigeria serving as its starting point. Our hope is to offer youths possibilities such as practical training, mentorship programs, internships, job creation, asset finance, and many more. Our mission is to expand into a global organization that provides empowerment initiatives, global services with a core interest in education. Our initiative will provide a sustainable future for the youth without compromising integrity and hard work while leaning on development partnerships. We plan to develop collaborative partnership programs with other organizations and non-governmental organizations that align with our central goal of harnessing efforts in creating the youth for the future.\n\nWe are recruiting to fill the position below:\n\nJob Position: Project Manager\nJob Location: Kwara\nEmployment Type: Full-time\nProject: Tech4Market Women (T4MW)\nDuration: 12 months (with possibility of renewal based on performance and funding)\nReports to: Program Director / Executive Director\n\nBackground\n\n\n\tTech4Market Women (T4MW) is an initiative designed to empower market women by providing access to financial literacy, digital tools, and improved, tailored financial products. Through targeted training, mentorship, and partnerships, T4MW aims to build the capacity of women to thrive in the digital and formal economy, particularly in underserved markets like Ilorin and surrounding regions.\n\n\nObjective of the Role\n\n\n\tThe Project Manager will oversee the day-to-day implementation, coordination, and delivery of the T4MW project in Ilorin. The role involves managing the project team, engaging with stakeholders, and ensuring the timely delivery of activities in alignment with project goals and donor expectations.\n\n\nKey Responsibilities\nProject Planning & Execution:\n\n\n\tDevelop and manage the detailed project implementation plan.\n\tCoordinate all project activities per timelines and deliverables.\n\tTrack implementation progress, flagging risks and proposing mitigation actions.\n\n\nTeam and Stakeholder Coordination:\n\n\n\tSupervise project staff and local facilitators to ensure high performance and accountability.\n\tLiaise with market associations, local government actors, financial institutions, and digital platforms to foster strategic partnerships.\n\tRepresent T4MW in community and stakeholder meetings.\n\n\nMonitoring, Evaluation, and Reporting:\n\n\n\tWork closely with the M&E team to monitor outcomes and impact.\n\tEnsure high-quality, timely reporting (monthly and quarterly) to both internal and external stakeholders.\n\tSupport documentation of success stories, challenges, and lessons learned.\n\n\nFinancial Management and Compliance:\n\n\n\tOversee project expenditures and ensure value-for-money in all procurement and activities.\n\tMonitor financial transactions in line with donor and internal policies.\n\tCoordinate with finance officers to track budgets and prepare financial reports.\n\n\nInnovation and Sustainability:\n\n\n\tIntegrate digital tools and innovative approaches to enhance project delivery.\n\tIdentify pathways for scaling and sustainability of interventions.\n\tPromote ownership of project outcomes by local actors and beneficiaries.\n\n\nDeliverables and Performance Indicators\n\n\n\tApproved work plan and budget within the first month.\n\tMonthly progress and financial reports.\n\t80% or more of planned project activities delivered on time and within scope.\n\tAt least three new partnership engagements or MOUs facilitated during the project.\n\tDocumented project closeout report with recommendations for sustainability and scale.\n\n\nRequired Qualifications and Experience\n\n\n\tBachelor's Degree in Project Management, Social Sciences, International Development, Economics, or related fields.\n\tMinimum 5 years of relevant project or program management experience.\n\tA master’s degree is an advantage.\n\tExperience working with women-led microenterprises, financial institutions, or market systems is highly desirable.\n\tDemonstrated leadership, team coordination, and problem-solving skills.\n\tStrong report writing, budgeting, and communication abilities.\n\tProficiency in Microsoft Office Suite and project management tools.\n\tFamiliarity with donor-funded projects, especially those focused on gender, digital access, or economic empowerment.\n\tExperience managing donor-funded projects with strong compliance and reporting requirements.\n\tStrong background in community engagement, stakeholder mobilization, and field implementation.\n\tFluent in Yoruba with excellent communication skills for local engagement.\n\n\nDuration & Remuneration\n\n\n\tFull-time role based in Ilorin, Kwara State, with regular field activities across the project area.\n\tCompetitive salary based on experience and organisational salary band.\n\tInitial contract for 12 months with potential extension subject to performance and    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]