[
  {
    "title": "Deputy General Manager Job at Dangote Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/deputy-general-manager-job-at-dangote-group",
    "pubDate": "Tue, 03 Jun 2025 11:13:41 GMT",
    "source": "JobGurus",
    "keyword": "dangote group",
    "duplicate": [
      {
        "site": "Example Site",
        "id": "931a4b36a0363d1a3091f995fafc4d41",
        "timestamp": 1748870561278
      },
      {
        "site": "JobGurus",
        "id": "ed021726df1a03209ab5850fd1887342",
        "timestamp": 1748949214016
      }
    ],
    "classifications": [],
    "content": "Dangote Group is one of Nigeria’s most diversified business conglomerates with a hard – earned reputation for excellent business practices and products’ quality with its operational headquarters in the bustling metropolis of Lagos, Nigeria in West Africa.\n\nWe are recruiting to fill the position below:\n\nJob Position: Deputy General Manager, HEMM\n\nJob Ref.: DGM-HEMM-LA010652025\nJobLocation: Lagos, Nigeria\nJob type: Full-time\nCategory: DCP - Operations\n\nDescription\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDangote Cement Plc is seeking a Deputy General Manager (DGM), HEMM to join its team. The ideal candidate will play a critical role in meeting the short-term and long-term objectives of the organization by ensuring the smooth, safe and efficient functioning of Heavy Earth Moving Machinery (HEMM).\n\n\nResponsibilities\n\n\n\tDeveloping and implementing systems to manage and control HEMM across the plants in the DCP.\n\tDeveloping and implementing HEMM metrics to be used to identify gaps in productivity.\n\tEnsuring that all HEMM operators are properly trained, have the requisite certification and are competent to operate the equipment safely and efficiently.\n\tMonitoring HEMM maintenance and repairs to ensure optimal asset performance and minimal downtime.\n\tEnsuring that all relevant administrative documentation, such as maintenance logs, is complete and accurate.\n\tEnsuring that HEMM procurement is carried out in a timely manner.\n\tParticipating in the planning and execution of projects.\n\n\nRequirements\n\n\n\tBachelor’s Degree in Mechanical Engineering or its equivalent.\n\tAt least 20 years of experience managing HEMM in an industrial or construction setting.\n\tUnderstanding of HEMM technology and best practices for their maintenance and repair.\n\tAbility to manage a diverse team effectively, and function as a collaborative team player.\n\tKnowledge of safety standards and measures in relation to HEMM operations.\n\tIn-depth experience in project management and project planning.\n\tIn-depth knowledge of the Cement Industry will be an added advantage.\n\n\nBenefits\n\n\n\tPrivate Health Insurance\n\tPaid Time Off\n\tTraining and Development\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Health, Safety, Security, and Environment (HSSE) Officer Job at LGV Gas Systems",
    "link": "https://www.jobgurus.com.ng/jobs/view/health-safety-security-and-environment-hsse-officer-job-at-lgv-gas-systems",
    "pubDate": "Tue, 03 Jun 2025 11:13:41 GMT",
    "source": "JobGurus",
    "keyword": "lgv gas systems",
    "duplicate": false,
    "classifications": [],
    "content": "LGV Gas Systems is a leading provider of clean energy solutions, specializing in Liquefied Petroleum Gas (LPG) and ancillary devices. We are committed to delivering reliable, innovative, and cost-effective solutions to our customers.\n\nWe are recruiting to fill the position below:\n\nJob Position: Health, Safety, Security, and Environment (HSSE) Officer\nJob Location: Before Interchange, Lagos - Ibadan Express Way - Ogun\nEmployment Type: Full-time\nIndustry: Gas Terminal\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a dedicated Health, Safety, Security, and Environment (HSSE) Officer to join our team. The successful candidate will be responsible for implementing and monitoring HSSE policies, ensuring compliance with industry regulations, and promoting a safe working environment.\n\n\nKey Responsibilities\n\n\n\tDevelop and enforce HSSE policies and procedures.\n\tConduct risk assessments and hazard identification.\n\tInvestigate incidents and recommend corrective actions.\n\tMaintain HSSE records and prepare reports for management.\n\tEnsure compliance with local and international safety regulations.\n\tLead safety training sessions and emergency response drills.\n\tCollaborate with teams to promote a culture of safety.\n\n\nQualifications & Experience\n\n\n\tBachelor's degree in Environmental Science, Occupational Health & Safety, or a related field.\n\tMinimum of 3-5 years of experience in HSSE within the gas industry.\n\tCertification in NEBOSH, IOSH, or equivalent is preferred.\n\tStrong knowledge of HSE regulations and best practices.\n\tExcellent communication and leadership skills.\n\n\nMethod of Application\nInterested and qualfiied candidates should send their CV and a Cover Letter to: career@lgvgassystems.ng using “HSSE Officer” as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "QA Executive Job at Sagar Vitaceuticals Nigeria Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/qa-executive-job-at-sagar-vitaceuticals-nigeria-limited",
    "pubDate": "Tue, 03 Jun 2025 11:13:41 GMT",
    "source": "JobGurus",
    "keyword": "sagar vitaceuticals nigeria limited",
    "duplicate": false,
    "classifications": [],
    "content": "Sagar Vitaceuticals Nigeria Limited (SVNL) is a pharmaceutical manufacturing company based in Ikeja, Lagos. Originally established as a joint venture, it is now owned by Sagar Overseas Ltd. SVNL operates a modern facility with high-capacity production lines for tablets, capsules, ointments, and more, adhering to GMP standards.\n\nThe company is NAFDAC-approved and partners with Nigeria’s Federal Ministry of Health to support local drug production. Its product portfolio includes vitamins, antibiotics, and over-the-counter supplements.\n\nWe are recruiting to fill the position below:\n\nJob Position: QA Executive \n\nJob Location: Makun, Ogun\nEmployment Type: Full-time\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Summary\n\n\n\tThe QA Executive is responsible for ensuring that all products and processes comply with internal quality standards and regulatory requirements. \n\tThis role involves monitoring production activities, reviewing documentation, conducting audits, and implementing quality systems to maintain product integrity and regulatory compliance.\n\n\nKey Responsibilities\n\n\n\tQuality System Implementation: Assist in developing, implementing, and maintaining quality management systems (QMS) and SOPs.\n\tDocumentation Review: Review batch production records, deviation reports, and change controls to ensure compliance.\n\tConduct Audits: Perform internal audits and support external audits to verify adherence to GMP and regulatory standards.\n\tInvestigate Non-Conformances: Analyze deviations, complaints, and CAPA (Corrective and Preventive Actions) to resolve quality issues.\n\tTraining & Compliance: Support staff training on quality policies and ensure compliance with regulatory requirements.\n\n\nRequirements\n\n\n\tCandidates should possess a Bachelor's Degree with at least 1 year of experience.\n\n\nSalary\nN120,000 - N150,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: nosa@svnl.in using the Job Position as the subject of the mail.\n\nNote: For more information, Call: 08023135542.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Guest Relations Officer Job at Radisson Hotel Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/guest-relations-officer-job-at-radisson-hotel-group",
    "pubDate": "Tue, 03 Jun 2025 11:13:41 GMT",
    "source": "JobGurus",
    "keyword": "radisson hotel group",
    "duplicate": false,
    "classifications": [],
    "content": "Radisson Hotel Group is one of the world's largest and most dynamic hotel groups with seven distinctive hotel brands with more than 1,100 hotels in destinations around the world. Our portfolio of hotel brands includes: Radisson Collection, Radisson Blu, Radisson, Radisson RED, Park Plaza, Park Inn by Radisson and Country Inn & Suites by Radisson.\n\nRadisson Hotels’ highest priority is the health, safety & security of our guests, employees and business partners worldwide.\n\nWe are recruiting to fill the position below:\n\nJob Position: Guest Relations Officer\n\nLocation: Victoria Island, Lagos\nJob type: Full-time\nCategory: Room\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nDescription\n\n\n\tCan you be our guests’ superhero? Is guest service your ultimate passion? Then why not come and join us at the Radisson Hotel Group to Make Every Moment Matter! where our guests can relax and enjoy the experience!\n\tOur first class Guest Relations Team is the heart of the house, providing a warm welcome and happy smile and where we strive to deliver a hospitality experience that is beyond expectation - creating memorable moments for our guests.\n\tAs Guest Relations Officer, you will join a team that is passionate about delivering exceptional service where we believe that anything is possible, whilst having fun in all that we do!\n\tInterested then why not say Yes I Can! as we are looking for passionate people just like you!\n\n\nKey Responsibilities\n\n\n\tSupports the smooth running of the guest relations department, where all aspects of the guest journey and experience are delivered to the highest level\n\tWorks as part of a team that maximizes guest satisfaction and comfort, delivering a positive and timely response to guest enquiries and problem resolution\n\tTakes responsibility for the duties and tasks assigned to the role, ensuring that all work is carried out in a timely and professional manner\n\tDelivers on departmental plans and objectives, where hotel initiatives & targets are achieved\n\tCollaborates with their immediate report, ensuring that costs and inventory are controlled, that productivity and performance levels are attained\n\tBuilds and maintains effective working relationships whilst promoting the company culture and values.\n\tEnsures adherence and compliance to all legislation where due diligence requirements and best practice activities are planned, delivered and documented for internal and external audit, performing follow-up as required\n\n\nRequirements\n\n\n\tCandidates should possess a Degree (BSc or HND) in a related field with 2 years experience\n\tExperience in guest relations beneficial and essential\n\tHands-on approach with a can-do work style\n\tCommitment to delivering exceptional guest service with a passion for the hospitality industry\n\tAbility to find creative solutions taking ownership for duties and tasks assigned\n\tPersonal integrity, with the ability to work in an environment that demands excellence\n\tExperience of working with IT systems on various platforms\n\tStrong communication skills.\n\n\nSalary\nTo be discussed.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Openings at Reliance HMO",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-reliance-hmo-1",
    "pubDate": "Tue, 03 Jun 2025 11:13:41 GMT",
    "source": "JobGurus",
    "keyword": "reliance hmo",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Reliance HMO is a health insurance company that acts like a technology company. We’re using software, data science and telemedicine to make health insurance more affordable, easier to access and more of a delightful experience.\n\nWe are recruiting suitably qualified candidates for the following positions below:\n\n1.) Medical Officer\n\nJob Location: Port Harcourt, Rivers\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe role sits in our clinical team to provide excellent primary care to our patients.\n\tThe role holder ideally will be an individual comfortable with providing appropriate counselling to patients of all ages, at all levels of health literacy and has an interest in driving ongoing innovations in improving primary care delivery.\n\n\nResponsibilities\n\n\n\tDeliver excellent, evidence-based, patient-centred primary care services to all patients\n\tDevelop and utilize treatment tools that standardize the provision of care in the clinic\n\tCounsel patients on preventive healthcare practices.\n\tDevelop and execute strategies and initiatives including but not limited to corporate events, wellness checks, etc that will lead to a better experience for corporate clients\n\tUse electronic medical records systems and electronic diagnostic tools.\n\n\nRequirements\n\n\n\tMinimum MBBS, MBChB.\n\t2-3 years of post NYSC experience in comprehensive primary care\n\tDemonstrated experience with developing clinical/scientific research or utilizing medical research findings to guide treatment decisions.\n\tAble to recognize symptoms and signs of various illness and injuries to order appropriate tests and prescribe treatments.\n\tUnderstand proper format for patient note documentation\n\tStrong written and spoken communication skills.\n\tAble to work 8am to 8pm on days of shift.\n\n\nClick here to apply online\n\n \n\n2.) Senior Product Manager - Clinical Services\n\nJob Location: Remote\nJob type: Full time\nDepartment: Product and Design\n\nDescription\n\n\n\tAt Reliance Health, our mission is to make quality healthcare delightful, affordable, and accessible in emerging markets. From Nigeria to Egypt and beyond, we provide comprehensive health plans tailored to the needs of employers and employees through an integrated model that includes telemedicine, affordable insurance, and a mix of partner and proprietary healthcare facilities. \n\tWe are looking for an experienced Senior Product Manager who will take on Clinical Tools. This scope is our most user-facing product as it includes telemedicine where we serve more than 20000 enrollees each month. This makes us the largest telemedicine provider in Nigeria and is also a foundational offer to our new markets.\n\tTelemedicine is foundational to our mission, as it increases the accessibility of health care, not only with available doctors 24/7 but where we offer delivery of prescriptions within the same day in large cities such as Lagos.  \n\tYou will own the full user experience, from requesting a consultation through the app, to the doctor handling the consultation, to the internal staff admin to ensure that operations meet SLA and Key success metrics. \n\tAside from the Telemedicine app, you will be responsible for all the Clinical tools we use at our Reliance Family Clinics. This includes the EMR that our doctors work in and the tools used in our pharmacies.  \n\tShape a compelling vision and strategy for your part of our product, based on a deep understanding of users’ needs, the market and the competition  \n\tFormulate hypotheses that help validate what experiences to design, implement, run and evaluate product experiments to reach your objectives  \n\tEvaluate the product’s success and ensure that we use data to drive product decisions.  \n\tDefine and align meaningful objectives and key results and own the roadmap for your domain  \n\tEnsure that valuable features, enhancements, and bug fixes are prioritised and shipped, making thoughtful product decisions along the way, and sharing insights with the rest of the company  \n\tYou will have two Associate Product Managers reporting directly to you, so you must have experience managing people to ensure that they grow with the responsibilities.  \n\tYou will be instrumental in shaping the strategy of our clinical tools and ensuring that we meet the needs of our users when they need us the most. Aside from building on the existing product, you will be instrumental in expanding the telemedicine offer to our new markets, where we will add at least two new markets in 2024, aside from Nigeria, Senegal, and Egypt. \n\tManage internal and external stakeholders, such as doctors, pharmacists and third-party providers.  \n\tManage the Associate Product Managers, and set the priorities for the UX Designer in your squad, ensuring that we focus on the most important tasks and grow your junior team members into world-class Product managers.  \n\tSet the priorities for a cross-functional product team on a day-to-day basis, prioritizing sprints, removing blockers and ultimately building and owning a product with a real impact on our users  \n\tBe the expert in knowing who your customer is and what problems you are solving for, always making decisions in favour of the customer  \n\tBe ultimately responsible for making that product valuable and viable \n\n\nRequirements\n\n\n\tPrevious experience as Product Manager (minimum 7 years)  \n\tExperience in taking a product from concept to launch, creating product roadmaps, driving UX decisions  \n\tExperience at a high-growth company. \n\tExperience working with user-facing products, health care is a plus, not a must  \n\tProven record of improving product KPIs that are directly impacting user satisfaction and operational efficiency  \n\tStrong analytical skills, attention to detail and a passion for solving real problems  \n\tAbility to build trust with key stakeholders to align multiple teams and deliver on strategic initiatives; experience working with internal and external stakeholders  \n\tData-driven, using numbers to back up priorities and estimate impact before implementation begins of new initiatives  \n\tExperience working in tools such as Mixpanel and Amplitude, to be able to track a product success and give insights on where improvements can be made in the user journeys.  \n\tYou have good verbal and written communication skills, the ability to communicate your product vision in simple and easy-to-understand language for a broad audience, including senior management, your teams, as well as colleagues from within and outside the team  \n\tYou are an empathetic product manager and are genuinely excited about our mission. \n\n\nBenefits\nAt Reliance Health, we prioritize our people and their well-being. Our benefits package is designed to support your success, growth, and happiness. Here’s what you’ll enjoy:\n\n\n\tRemote-First Environment: Work from anywhere while staying connected to a vibrant, collaborative team.\n\tCompetitive Salary and Benefits: We offer a salary that’s benchmarked against the best in the industry, ensuring your expertise and impact are fully rewarded.\n\tPremium Health Insurance: Comprehensive health coverage for you and your family, because your well-being comes first.\n\tUnlimited Leave: Take the time you need when you need it—no limits, no questions.\n\tMeaningful Impact: Play a key role in transforming customer experiences and shaping healthcare innovation.\n\tCollaborative Work Culture: Join a supportive, inclusive, and team-focused environment that celebrates diversity.\n\tGrowth Opportunities: Access tools, mentorship, and resources to elevate your skills and career.\n\tLearning & Development Allowance: We provide an allowance to support your ongoing professional growth and skill enhancement.\n\n\nClick here to apply online\n\n \n\n2.) Senior Product Manager - Clinical Services\n\nJob Location: Remote\nJob type: Full time\nDepartment: Product and Design\n\nDescription\n\n\n\tAt Reliance Health, our mission is to make quality healthcare delightful, affordable, and accessible in emerging markets. From Nigeria to Egypt and beyond, we provide comprehensive health plans tailored to the needs of employers and employees through an integrated model that includes telemedicine, affordable insurance, and a mix of partner and proprietary healthcare facilities. \n\tWe are looking for an experienced Senior Product Manager who will take on Clinical Tools. This scope is our most user-facing product as it includes telemedicine where we serve more than 20000 enrollees each month. This makes us the largest telemedicine provider in Nigeria and is also a foundational offer to our new markets.\n\tTelemedicine is foundational to our mission, as it increases the accessibility of health care, not only with available doctors 24/7 but where we offer delivery of prescriptions within the same day in large cities such as Lagos.  \n\tYou will have two Associate Product Managers reporting directly to you, so you must have experience managing people to ensure that they grow with the responsibilities.  \n\tYou will be instrumental in shaping the strategy of our clinical tools and ensuring that we meet the needs of our users when they need us the most. Aside from building on the existing product, you will be instrumental in expanding the telemedicine offer to our new markets, where we will add at least two new markets in 2024, aside from Nigeria, Senegal, and Egypt. \n\tYou will own the full user experience, from requesting a consultation through the app, to the doctor handling the consultation, to the internal staff admin to ensure that operations meet SLA and Key success metrics. \n\tAside from the Telemedicine app, you will be responsible for all the Clinical tools we use at our Reliance Family Clinics. This includes the EMR that our doctors work in and the tools used in our pharmacies.  \n\tShape a compelling vision and strategy for your part of our product, based on a deep understanding of users’ needs, the market and the competition  \n\tFormulate hypotheses that help validate what experiences to design, implement, run and evaluate product experiments to reach your objectives  \n\tEvaluate the product’s success and ensure that we use data to drive product decisions.  \n\tDefine and align meaningful objectives and key results and own the roadmap for your domain  \n\tEnsure that valuable features, enhancements, and bug fixes are prioritised and shipped, making thoughtful product decisions along the way, and sharing insights with the rest of the company  \n\tManage internal and external stakeholders, such as doctors, pharmacists and third-party providers.  \n\tManage the Associate Product Managers, and set the priorities for the UX Designer in your squad, ensuring that we focus on the most important tasks and grow your junior team members into world-class Product managers.  \n\tSet the priorities for a cross-functional product team on a day-to-day basis, prioritizing sprints, removing blockers and ultimately building and owning a product with a real impact on our users  \n\tBe the expert in knowing who your customer is and what problems you are solving for, always making decisions in favour of the customer  \n\tBe ultimately responsible for making that product valuable and viable \n\n\nRequirements\n\n\n\tPrevious experience as Product Manager (minimum 7 years)  \n\tExperience in taking a product from concept to launch, creating product roadmaps, driving UX decisions  \n\tExperience at a high-growth company. \n\tExperience working with user-facing products, health care is a plus, not a must  \n\tProven record of improving product KPIs that are directly impacting user satisfaction and operational efficiency  \n\tData-driven, using numbers to back up priorities and estimate impact before implementation begins of new initiatives  \n\tExperience working in tools such as Mixpanel and Amplitude, to be able to track a product success and give insights on where improvements can be made in the user journeys.  \n\tStrong analytical skills, attention to detail and a passion for solving real problems  \n\tAbility to build trust with key stakeholders to align multiple teams and deliver on strategic initiatives; experience working with internal and external stakeholders  \n\tYou have good verbal and written communication skills, the ability to communicate your product vision in simple and easy-to-understand language for a broad audience, including senior management, your teams, as well as colleagues from within and outside the team  \n\tYou are an empathetic product manager and are genuinely excited about our mission. \n\n\nBenefits\nAt Reliance Health, we prioritize our people and their well-being. Our benefits package is designed to support your success, growth, and happiness. Here’s what you’ll enjoy:\n\n\n\tRemote-First Environment: Work from anywhere while staying connected to a vibrant, collaborative team.\n\tCompetitive Salary and Benefits: We offer a salary that’s benchmarked against the best in the industry, ensuring your expertise and impact are fully rewarded.\n\tPremium Health Insurance: Comprehensive health coverage for you and your family, because your well-being comes first.\n\tUnlimited Leave: Take the time you need when you need it—no limits, no questions.\n\tMeaningful Impact: Play a key role in transforming customer experiences and shaping healthcare innovation.\n\tCollaborative Work Culture: Join a supportive, inclusive, and team-focused environment that celebrates diversity.\n\tGrowth Opportunities: Access tools, mentorship, and resources to elevate your skills and career.\n\tLearning & Development Allowance: We provide an allowance to support your ongoing professional growth and skill enhancement.\n\n\nClick here to apply online\n\n \n\n3.) Director, Finance\n\nJob Location: Nigeria (Remote)\nEmployment Type: Full Time\n\nJob Description\n\n\n\tWe are currently hiring a Director, Finance role to serve as a strategic financial leader, overseeing multi-market financial operations, driving enterprise-wide financial strategy, and ensuring strong financial governance across the business.\n\tThis role will be critical in guiding long-term growth, leading financial planning and analysis, and providing data-driven insights to executive leadership.\n\n\nResponsibilities\nThe ideal candidate will bring deep expertise from high-growth environments and will play a central role in shaping Reliance Health’s financial future.\n\n\n\tLead the development and implementation of financial strategies to support the company's long-term goals.\n\tOversee the annual budgeting process, providing accurate forecasts and financial analysis to guide business decisions.\n\tEvaluate investment opportunities and manage the company's investment portfolio to maximize returns.\n\tImplement cost control measures to improve operational efficiency and profitability.\n\tEnsure timely and accurate financial reporting, including monthly, quarterly, and annual reports.\n\tIdentify financial risks and develop strategies to mitigate them, ensuring compliance with regulatory requirements.\n\tLead and mentor the finance team, fostering a culture of continuous improvement and professional development.\n\tCollaborate with senior management and external stakeholders to provide financial insights and support decision-making processes.\n\n\nRequirements\n\n\n\tBachelor’s degree in Finance, Accounting, or a related field; MBA or relevant advanced degree preferred.\n\tMinimum of 12 years of progressive financial experience, with at least 5–7 years in a top finance leadership role.\n\tMust have led financial operations across multiple countries or markets, preferably in sectors like healthcare, insurance, financial services, or high-growth, tech-enabled businesses.\n\tProfessional finance certification (e.g., CFA, ACCA) is highly desirable.\n\tProven track record of driving company-wide financial strategy, capital efficiency, and stakeholder confidence.\n\tStrong leadership, interpersonal, and communication skills; able to influence at the board and executive level, and to translate complex financial concepts into actionable insights for non-finance audiences.\n\tDemonstrated experience in strategic financial planning, budgeting, and analysis.\n\tStrong knowledge of financial regulations and standards.\n\tProven ability to lead, mentor, and develop a high-performing finance team.\n\tExcellent analytical, problem-solving, and decision-making skills.\n\tExperience building finance infrastructure in high-growth or transformation-stage environments is a plus.\n\n\nBenefits\nAt Reliance Health, we prioritize our people and their well-being. Our benefits package is designed to support your success, growth, and happiness. Here’s what you’ll enjoy:\n\n\n\t Remote-First Environment\n\tWork from anywhere while staying connected to a vibrant, collaborative team.\n\t Competitive Salary and Benefits\n\tWe offer a salary that’s benchmarked against the best in the industry, ensuring your expertise and impact are fully rewarded.\n\t Premium Health Insurance\n\tComprehensive health coverage for you and your family, because your well-being comes first.\n\t Unlimited Leave\n\tTake the time you need when you need it—no limits, no questions.\n\t Meaningful Impact\n\tPlay a key role in transforming customer experiences and shaping healthcare innovation.\n\t Collaborative Work Culture\n\tJoin a supportive, inclusive, and team-focused environment that celebrates diversity.\n\t Growth Opportunities\n\tAccess tools, mentorship, and resources to elevate your skills and career.\n\t Learning & Development Allowance\n\tWe provide an allowance to support your ongoing professional growth and skill enhancement. \n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]