[
  {
    "title": "Job Vacancies at Jameda Concepts",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancies-at-jameda-concepts",
    "pubDate": "Thu, 05 Jun 2025 11:14:04 GMT",
    "source": "JobGurus",
    "keyword": "jameda concepts",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Jameda Concepts is recruiting suitably qualified candidates to fill the following positions below:\n\n1.) Executive Assistant (Female)\n\nJob Location: Chisco, Lekki - Lagos\nResumption time: 8:30am - 5pm\n\nRequirement\n\n\n\tCandidates should possess relevant qualifications\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: Jamedaconcepts@gmail.com using the Job Position as the subject of the email.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nNote: For more information contact the recruiter on: 08036423766.\n\n \n\n \n\n2.) Social Media / Content Creator\n\nJob Location: Chisco - Lekki, Lagos\nResumes: 8:30pm - 5;00pm\n\nRequirements\n\n\n\tInterested candidates should possess relevant qualifications.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: Jamedaconcepts@gmail.com using the Job Position as the subject of the mail.\n\nNote: For further enquiries, message: 08036423766.\n\n \n\n \n\n3.) Video Editor / Camera Man\n\nJob Location: Chisco - Lekki, Lagos\nResumes: 8:30pm - 5;00pm\n\nRequirements\n\n\n\tInterested candidates should possess relevant qualifications.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: Jamedaconcepts@gmail.com using the Job Position as the subject of the mail.\n\nNote: For further enquiries, message: 08036423766.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Account Manager Job at International Flavors & Fragrances",
    "link": "https://www.jobgurus.com.ng/jobs/view/account-manager-job-at-international-flavors-fragrances-3",
    "pubDate": "Thu, 05 Jun 2025 11:14:04 GMT",
    "source": "JobGurus",
    "keyword": "international flavors & fragrances",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance"
    ],
    "content": "International Flavors & Fragrances is an industry leader in food, beverage, health, biosciences and sensorial experiences, where science and creativity meet to create essential solutions for a better world – from global icons to unexpected innovations and experiences. With the beauty of art and the precision of science, we are an international collection of thinkers who partner with customers to bring scents, tastes, experiences, ingredients and solutions for products the world craves. Together, we will do more good for people and planet.\n\nWe are recruiting to fill the position below:\n\nJob Position: Account Manager\n\nJob Requisition ID: R6517\nJob Location: Lagos (Remote)\nJob type: Full-time\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Summary\n\n\n\tResponsible for driving sustainable profitable sales and market share growth by identifying the customer needs and opportunities, establishing solid customer relationship, leading, coordinating and reporting IFF activities and promoting relevant solutions aligned with corporate strategy. For a defined territory, category, coordinated or global account:\n\tEnsure financial targets are met and business performance is constantly monitored and reported; develop and maintain sustainable relationships with internal and external customers; prepare account plan and report relevant market information\n\tCollaborate with internal departments to explore innovations and new concepts related to customers’ products and on-going projects; monitor market development in terms of competitors, products, and trends\n\tPartner with operation team to ensure customer satisfaction in terms of service, quality, and supply.\n\n\nResponsibilities\n\n\n\tUnderstand specific market and customer ecosystem including activities, strategies, brands, markets, consumers via different sources\n\tDevelop multi-level cross-functional customer relationships with key customer decision makers/influencers\n\tContribute/lead commercial negotiation(e.g., core listing, annual pricing, payment terms, rebates/cost savings agreements, supply contracts)\n\tMaximize potential advantage to IFF while delivering optimal solutions to customer (GP improvement, catalogue optimization, complexity reduction, etc.)\n\tDemonstrate IFF Culture Principles and live our values\n\tManage and/or mentor junior team members/peers, and onboard and coach new team members\n\tInfluencing stakeholders to align on shared objectives\n\tEnsure customer supply chain requirements, processes and KPIs are well communicated to IFF Operations to ensure we meet customer needs\n\tUnderstand customer regulatory requirements/changes and update data to GRA and input to project management system\n\tActs as the main customer point of contact in all matters\n\tLead projects through effective communication, and collaboration with key external and internal stakeholders(CI/Marketing/Creative Teams/formulation etc.)\n\tEnsure objectives are aligned to the business and personal development plans are in place\n\tProactively solicit and give feedback to nurture high performing teams\n\tDemonstrate leadership courage by challenging the status quo and holding self and others accountable to always doing the right things\n\tDevelop commercial strategy for allocated customer portfolio\n\tBuild and execute account plans successfully\n\tResponsible for setting clear commercial targets (Sales/GP/New Win/Grow Market share) with the manager / Achieve new wins / grow market / market share aligned with account strategic plan\n\tDefine and suggest the required account resources, investment, and relevant service model to support the account\n\tEffectively communicate the account plans with stakeholders including internal and external team members\n\tReview/update the progress of account plans versus KPI targets\n\tEnsure accurate monthly sales forecast to allow for effective operations planning and financial analysis\n\tConduct retrospective reviews on projects wins and losses\n\tReview brief and ensure all objectives and parameters are clear\n\tInfluence customer brief definition to IFF’s advantage\n\tOrganize a formal commercial kick off with relevant stakeholders and finalize action plan, objectives & timelines with clear deliverables and key milestones and update Project Management System\n\tLiaise with Global/Regional/Category stakeholders on overall plan, strategy, and deliverables\n\tEvaluate and decide on final submissions with Scent Design Group and Creative teams\n\tEffectively promote the most appropriate IFF product solutions / portfolio aligned with the brief\n\tGenerate proposal/price aligned with category margin guidelines or pricing officer\n\tPrepare presentation materials and staging submissions with stakeholders that maximizes IFF commercial advantage and resources\n\tMonitor and ensure cost-to-serve of projects adhere to guidelines\n\tCommunicate project results and conduct retrospective reviews on projects wins and losses\n\tUpdate Project management system and issue adoption report in a timely manner\n\tManage volumes/timing expectations and liaise with Operations to ensure supply chain readiness\n\tDefend and grow accounts whilst actively scouting for new customers, transforming leads into profitable business opportunities\n\tAccurately forecast and update sales forecast tool (SFT) to capture performance vs budget, business risk & opportunities, new wins\n\tMonitor & Provide Account sales performance (monthly / quarterly / annually) and provide strategic project updates to Manager\n\tImplement price increase in line with country/region strategy\n\tLead internal and external teams to win projects\n\n\nRequirements \n\n\n\tEssential: Bachelor’s degree\n\tApproximately 3-5 years of experience in sales, sales service, product development, or marketing preferably fragrance, cosmetics, FMCG, flavors, chemical or ingredients industries\n\tStrong track record at a similar level with a passion to succeed in commercial Skills:\n\tCustomer centric with B2B management experience\n\tAnalytical with the ability to deal with financial concepts/processes(pricing/margin/forecasting)\n\tStrong interests in product development, consumers, and market understanding(Marketing/R&D/CI)\n\tSound fragrance knowledge and olfactive skills or skin care and biochemistry knowledge, where applicable\n\tCreative and innovative thinking\n\tProject management with effective collaboration and orchestration skills\n\tStrong communication, presentation, storytelling, and negotiation skills\n\tUnderstanding of digital marketing and ecommerce environment\n\tEffective business English with a global mindset and ability to work with different cultures\n\tDigital savvy with an ability to leverage online resources\n\tAbility to gather and leverage competitive market intelligence, Training / Certifications\n\n\nPreferred:\n\n\n\tConcentration in Business, Marketing, Chemistry, or Biology / Arts & Fashion Master's Degree.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Recruitment Officer Job at LibertyPay",
    "link": "https://www.jobgurus.com.ng/jobs/view/recruitment-officer-job-at-libertypay",
    "pubDate": "Thu, 05 Jun 2025 11:14:04 GMT",
    "source": "JobGurus",
    "keyword": "libertypay",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "LibertyPay is a digital and payment solution institution that is led by Individuals with a passion to bridge the divide in every economic sphere. We seek to bring Financial Liberty and Freedom by filling the payments void within the business sectors in areas with Limited internet or reliable electricity ranging from Nano-Micro businesses to SMEs and personal finances.\n\nWe are recruiting to fill the position below:\n\nJob Position: Recruitment Officer\n\nJob Location: Lagos\nEmployment Type: Contract\nDuration: 3-Month Contract\n\nJob Overview\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are looking for a skilled and motivated Recruitment Officer to join our HR team on a short-term basis.\n\tThe ideal candidate will support the organization’s recruitment efforts by managing the full recruitment life cycle, from job posting to onboarding.\n\tThis is a hands-on role requiring initiative, professionalism, and the ability to work under tight timelines.\n\n\nKey Responsibilities\n\n\n\tCollaborate with department heads to identify hiring needs and job specifications.\n\tPrepare and publish job postings on internal and external platforms.\n\tSource candidates through online channels (LinkedIn, job boards, social media).\n\tSupport pre-boarding and onboarding procedures for selected candidates.\n\tReview applications, shortlist candidates, and conduct initial screenings.\n\tSchedule interviews and manage communication between candidates and hiring teams.\n\tMaintain candidate records and reports in the applicant tracking system (ATS).\n\tAssist in the development and refinement of recruitment policies and tools.\n\tEnsure all hiring practices align with internal policies and relevant labor regulations.\n\n\nQualifications\n\n\n\tBachelor’s Degree in Human Resources, Business Administration, or a related field.\n\tAt least 1 - 3 years of experience in recruitment or HR operations.\n\tStrong familiarity with sourcing techniques, interview formats, and screening methods.\n\tProficiency in Microsoft Office and recruitment software.\n\tExperience in contract-based or project-based hiring is a plus.\n\n\nKey Skills:\n\n\n\tExcellent verbal and written communication skills.\n\tAbility to work with multiple stakeholders and manage competing priorities.\n\tHigh attention to detail and organizational ability.\n\tSound judgment, discretion, and a professional demeanor.\n\tStrong problem-solving skills and the ability to work independently.\n\n\nMethod of Application\nInterested and qualified candidates should send their CVs to: recruitment.libertyassured@gmail.com using \"Recruitment Officer (3-Month Contract)->22605020-0c28-4d62-a53e-348f628d8a04\" as the subject of the mail.\n\nNote: Do not alter the prefilled email subject, for your application to be accepted!!    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Officer, Buyer Job at DP World",
    "link": "https://www.jobgurus.com.ng/jobs/view/officer-buyer-job-at-dp-world",
    "pubDate": "Thu, 05 Jun 2025 11:14:04 GMT",
    "source": "JobGurus",
    "keyword": "dp world",
    "duplicate": false,
    "classifications": [],
    "content": "DP World - We exist to make the world’s trade flow better, changing what’s possible for the customers and communities we serve globally. With a dedicated, diverse and professional team of more than 108,100 employees spanning 74 countries on six continents. We are pushing trade further and faster towards a seamless supply chain that’s fit for the future. We’re rapidly transforming and integrating our businesses - Ports and Terminals, Marine Services, Logistics and Technology – and uniting our global infrastructure with local expertise to create stronger, more efficient end-to-end supply chain solutions that can change the way the world trades.\n\nWe are recruiting to fill the position below:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Position: Officer, Buyer\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Function\n\n\n\tResponsible for identifying and procuring the spares and materials needed to maintain the constant operation of the transport unit of MDS Logistics Limited and management of the procurement of fuel to the dumps and all needed equipment and items by the transport unit.\n\n\nKey Performance Areas\n\n\n\tFormulate implement procurement strategies aligned with organizational objectives, considering technical requirements, budgetary constraints, and supplier market dynamics.\n\tConduct market research and analysis to identify potential suppliers, evaluate their capabilities, and select the most suitable vendors.\n\tBuild and maintain relationships with key suppliers, ensuring effective communication, performance evaluation, and resolution of any issues or disputes.\n\tFacilitate negotiation of contracts, terms, and pricing with suppliers to obtain favourable conditions and achieve cost savings without compromising quality or timelines.\n\tEnsure proper monitoring of supplier performance, assess risks, and implement necessary corrective actions to maintain supplier compliance and maximize value.\n\tSupervise the end-to-end procurement process, including requisition processing, purchase order creation, supplier evaluation, and delivery coordination.\n\tReview technical specifications and collaborate with internal stakeholders to ensure accurate and comprehensive procurement documentation.\n\tImplement effective cost control measures, such as contract management, demand forecasting, and inventory optimization.\n\tConduct supplier evaluations, quality assessments, and inspections to ensure compliance with specifications, standards, and contractual requirements.\n\tIdentify opportunities for cost savings and efficiency improvements within the technical procurement process.\n\tAnalyse pricing trends, market dynamics, and supplier performance to negotiate competitive rates and achieve cost reductions.\n\tEnsure compliance with relevant procurement regulations, policies, and procedures.\n\tAssess and mitigate procurement-related risks, such as supplier reliability, quality control, and legal compliance.\n\n\nRequirements\n\n\n\tGraduate Degree in Mechanical or Electrical Engineering.\n\tMinimum 3-5 years of experience.\n\tExperience in tactical alignment to work within budgetary constraints\n\tExperience in having managed relationships at different levels.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]