[
  {
    "title": "Assistant General Manager Job at Dangote Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/assistant-general-manager-job-at-dangote-group-1",
    "pubDate": "Fri, 06 Jun 2025 13:27:23 GMT",
    "source": "JobGurus",
    "keyword": "dangote group",
    "duplicate": [
      {
        "site": "Example Site",
        "id": "931a4b36a0363d1a3091f995fafc4d41",
        "timestamp": 1748870561278
      },
      {
        "site": "JobGurus",
        "id": "ed021726df1a03209ab5850fd1887342",
        "timestamp": 1748949214016
      },
      {
        "site": "JobGurus",
        "id": "588752c5dca4899706ac3b4253acdfab",
        "timestamp": 1749216438631
      }
    ],
    "classifications": [],
    "content": "Dangote Group is one of Nigeria’s most diversified business conglomerates with a hard – earned reputation for excellent business practices and products’ quality with its operational headquarters in the bustling metropolis of Lagos, Nigeria in West Africa.\n\nWe are recruiting to fill the position below:\n\nJob Position: Assistant General Manager, HEMM - Mines\n\nJob Location: Ibese, Ogun\nJob type: Full-time\n\nDescription\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAs the company continues to grow, it seeks an Assistant General Manager for HEMM operations. In this role, the AGM will be responsible for overseeing the Heavy Earth Moving Machinery (HEMM) operations, ensuring that they are carried out safely and efficiently.\n\n\nResponsibilities\n\n\n\tOversee the daily operations of HEMM, ensuring they are performed safely and efficiently\n\tDevelop and maintain standard operating procedures (SOPs) for HEMM operations to maximize productivity and minimize downtime\n\tMonitor equipment usage, repair and maintenance schedules, and work with the maintenance team to ensure compliance with maintenance procedures\n\tTrain and supervise HEMM operators, providing ongoing support and guidance to help them perform their duties efficiently and safely\n\tDevelop and maintain a preventive maintenance program for all HEMM equipment\n\tDevelop and manage budgets for HEMM operations while ensuring strict compliance with company policies\n\tStreamline HEMM operations, identifying areas for improvement and developing plans to minimize downtime and reduce costs\n\n\nRequirements\n\n\n\tBachelor's Degree / HND in Mechanical Engineering or equivalent +21 years of experience\n\tStrong technical knowledge of HEMM operations and maintenance\n\tDemonstrated ability to manage HEMM operations, ensuring safety and efficiency\n\tExcellent leadership skills, with the ability to provide guidance and support to team members\n\tStrong analytical and problem-solving skills, with attention to detail and accuracy\n\tExcellent communication skills, with the ability to interact with various stakeholders within the organization and externally.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Country Manager Job at Uber",
    "link": "https://www.jobgurus.com.ng/jobs/view/country-manager-job-at-uber-1",
    "pubDate": "Fri, 06 Jun 2025 13:27:23 GMT",
    "source": "JobGurus",
    "keyword": "uber",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Uber - Good things happen when people can move, whether across town or toward their dreams. Opportunities appear, open up, become reality. What started as a way to tap a button to get a ride has led to billions of moments of human connection as people around the world go all kinds of places in all kinds of ways with the help of our technology.\n\nWe are recruiting to fill the position below:\n\nJob Position: Country Manager, Nigeria\n\nJob Location: Lagos\nCategory: Operations\n\nAbout the Role\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Country Manager, Nigeria role is part of our Sub-Saharan Africa (SSA) rides organization. Together with the General Manager SSA, this role will be the lead in driving Uber’s growth and success in Nigeria.\n\tThis hands-on role calls for a combination of customer obsession, savvy analytics, critical thinking, and strong execution skills. \n\tYou will have to think creatively to find ways to continuously enhance Uber's value proposition to our users (riders & drivers) and optimize their experience of using the Uber app in Nigeria.\n\tYou will act as the local market lead, managing both implementation of our global and regional programs, and driving your own local growth and improvement projects. \n\tYou will set the vision and strategy for the markets together with the SSA leadership team and translate strategy to tactics across all aspects of the business.\n\n\nResponsibilities\nWhat the Candidate Will Do:\n\n\n\tOwn the Nigeria market and drive the Business Growth and Development\n\tPartner Management: Own the relationship with our main partners in Nigeria and together craft and implement the vision, strategy and day to day tactics for driver partner acquisition and engagement through data-centric analytics, creative campaigns, and partnership programs\n\tRider acquisition and engagement: Develop and lead acquisition & engagement strategy for riders by working on both new riders and engaging with existing riders and growing the use cases for Uber\n\tDevelop and manage partnerships: Develop and manage strategic partnerships and relationships in the market through compelling value propositions and collaborations of mutual benefits\n\tProject management: Strategically lead multiple projects for the region and assume responsibility for communicating progress/success/challenges with senior stakeholders\n\tCross-functional collaboration: Work collaboratively with local, regional and global teams like policy, communications, product, marketing, legal and customer support\n\n\nRequirements\nWhat the Candidate Will Need:\n\n\n\tMinimum of 7 years of experience in a technology/consulting/or other fast-paced operational environment\n\tCommunication skills: Using interpersonal skills and situational awareness to clearly deliver information to a variety of audiences\n\tProject management skills: You have a proven understanding of the project management fundamentals, and can deliver projects end to end\n\tAnalytical skills: You can independently extract and combine data from a variety of sources to uncover root causes and generate actionable insights (preferable skills: SQL, data analytics, and visualization skills)\n\n\nPreferred Qualifications:\n\n\n\tBusiness Acumen: Understanding of how our business operates and how it makes money and sustains profitable growth, now and in the future\n\tPlanning and Organization: Setting up and maintaining processes and tools to appropriately structure and keep track of tasks and projects\n\tProblem Solving: Efficiently resolving issues that involve people, things, and processes by using logic and common sense\n\tPartner Management: Taking time to build helpful relationships; earning the trust of others within the organization through strong situational awareness and reliability\n\tTeamwork: Demonstrates optimism, respects others and works well in a team\n\tAbility and willingness to travel, mainly within Nigeria, Ghana & Côte d'Ivoire\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Senior Software Engineer, Frontend Job at Telnyx",
    "link": "https://www.jobgurus.com.ng/jobs/view/senior-software-engineer-frontend-job-at-telnyx",
    "pubDate": "Fri, 06 Jun 2025 13:27:23 GMT",
    "source": "JobGurus",
    "keyword": "telnyx",
    "duplicate": false,
    "classifications": [
      "Software Engineering"
    ],
    "content": "Telnyx is an industry leader that's not just imagining the future of global connectivity—we're building it. From architecting and amplifying the reach of a private, global, multi-cloud IP network, to bringing hyperlocal edge technology right to your fingertips through intuitive APIs, we're shaping a new era of seamless interconnection between people, devices, and applications.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe're driven by a desire to transform and modernize what's antiquated, automate the manual, and solve real-world problems through innovative connectivity solutions. As a testament to our success, we're proud to stand as a financially stable and profitable company. Our robust profitability allows us not only to invest in pioneering technologies but also to foster an environment of continuous learning and growth for our team.\n\nWe are recruiting to fill the position below:\n\nJob Position: Senior Software Engineer, Frontend\n\nJob Location: Lagos, Nigeria\n\nJob Description\n\n\n\tYou relish the interaction details that make products delightful, the technical challenges involved in building a highly performant web app, and the research, experimentation and coaching that goes into applying better systems of abstraction in a collaborative codebase. \n\tProduct intuition and empathy with the user are as much of a necessity as applied technical knowledge of best practices in frontend engineering.\n\tWe are seeking an experienced Front-End Engineer with a strong background in React.js, Next.js, and modern DevOps processes to join our growing engineering team. \n\tThis role is ideal for someone who thrives at the intersection of development and deployment, with a keen eye for performance, scalability, and maintainability.\n\tYou’ll play a pivotal role in enhancing our user interfaces, leading front-end best practice. If you're passionate about creating seamless, responsive, and robust web applications while ensuring smooth deployment pipelines, we’d love to meet you.\n\n\nKey Responsibilities\n\n\n\tBuild, maintain, and optimize modern web applications using React.js and Next.js.\n\tCollaborate closely with designers, product managers, and backend engineers to implement engaging user experiences.\n\tManage deployment workflows using Vercel and CI/CD pipelines to ensure fast, reliable releases.\n\tStay up-to-date with evolving front-end technologies and propose improvements to our tech stack and workflows.\n\tParticipate in end-to-end DevOps processes, including monitoring, logging, and performance optimization.\n\tWrite clean, maintainable, and well-documented code that follows industry best practices.\n\tActively participate in code reviews, architecture discussions, and technical planning.\n\tLead and contribute to the migration of our styling system from Stitches CSS to Tailwind CSS.\n\n\nQualifications\n\n\n\tDegree in Computer Science or Software Engineering, or a very related field.\n\t4+ years of professional experience developing and deploying production-grade web applications using Next.js and React.js.\n\tDeep understanding of Next.js features like server-side rendering (SSR), static site generation (SSG), API routes, and incremental static regeneration (ISR).\n\tProven experience deploying applications on Vercel and working with its platform features (e.g., previews, analytics, edge functions).\n\tHands-on experience with CI/CD pipelines and modern DevOps practices in a front-end context.\n\tStrong familiarity with CSS-in-JS solutions (ideally Stitches) and hands-on experience or enthusiasm for Tailwind CSS.\n\tProficient in writing unit, integration, and end-to-end tests using tools like Jest or similar.\n\tSolid understanding of performance optimization techniques for web applications.\n\tComfortable working in Agile or Lean development environments with tools like Jira, GitHub Projects, or similar.\n\n\nNice to Have:\n\n\n\tExperience integrating front-end applications with headless CMSs such as Contentful and Strapi.\n\tFamiliarity with TypeScript and adopting type-safe coding practices.\n\tExposure to edge computing concepts, CDN configuration, or security best practices for front-end applications.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "HMO / NHIS Officer Job at St. Dominic Catholic Hospital",
    "link": "https://www.jobgurus.com.ng/jobs/view/hmo-nhis-officer-job-at-st-dominic-catholic-hospital",
    "pubDate": "Fri, 06 Jun 2025 13:27:23 GMT",
    "source": "JobGurus",
    "keyword": "st. dominic catholic hospital",
    "duplicate": false,
    "classifications": [
      "Software Engineering"
    ],
    "content": "St. Dominic Catholic Hospital is a 64-bed hospital located in Ogungbade off New Ife road in Ibadan. St. Dominic Catholic Hospital is the vision of the Dominican Sisters of St. Catherine of Siena (Italy). We offer various medical services such as: General medicine, internal medicine, O & G, Laboratory, and Radiology, to mention just a few. The hospital is run in collaboration with foreign partners. We are registered and licensed by the Corporate Affairs Commission and the Ministry of Health. Also, we are accredited by the NHIS as both primary and secondary health care providers.\n\nWe are recruiting to fill the position below:\n\nJob Position: HMO / NHIS Officer\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Location: Ibadan, Oyo\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tThe Health Insurance Officer is responsible for managing all health insurance related activities within the hospital, including claim verification, processing, and payment reconciliation.\n\tThey act as a key liaison between the hospital, insurance providers, and patients, ensuring accurate and timely billing and payment for services rendered.\n\n\nKey Responsibilities\n\n\n\tOversee the entire billing process for health insurance claims, ensuring accurate and timely submission to insurance providers (HMOs).\n\tEnsure proper documentation for insurance claims, including medical coding, billing codes, and patient information.\n\tResolve any discrepancies or issues with rejected claims, working closely with insurance companies and healthcare\n\n\nCompliance & Documentation:\n\n\n\tMaintain accurate records of all billing transactions, claims, and payments.\n\tStay updated on changes in healthcare insurance Policies.\n\n\nCustomer Service & Dispute Resolution:\n\n\n\tHandle inquiries from insurance companies, patients, and other stakeholders regarding billing issues, claims status, and payments.\n\tWork closely with the patient services department to resolve any billing-related concerns, ensuring a positive patient experience.\n\tResolve billing disputes and follow up on unpaid claims to ensure timely and accurate payments.\n\tPrepare and process medical expressions and related documents.\n\tMaintain accurate insurance records and ensure timely follow-ups.\n\tCollaborate with departments and liaise with insurance companies effectively.\n\n\nRequirements\n\n\n\tMinimum of 2 years of relevant experience.\n\tProficiency in MS Office Suite (Word, Excel, PowerPoint).\n\tExcellent communication, attention to detail, and organizational skills.\n\n\nSalary\nN50,000 - N80,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their Application Letters and CV to: adm.sdchib2019@yahoo.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Account Receivable Officer Job at LifeBank",
    "link": "https://www.jobgurus.com.ng/jobs/view/account-receivable-officer-job-at-lifebank-1",
    "pubDate": "Fri, 06 Jun 2025 13:27:23 GMT",
    "source": "JobGurus",
    "keyword": "lifebank",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "LifeBank is a technology company that powers hospitals and care centers to deliver quality healthcare to patients in emerging markets. The company’s technology, infrastructure, agile production, and distribution networks enable hospitals in emerging markets to catch up with their global peers. The company has distributed 45,000+ medical products to 1000+ healthcare facilities, saving 18,000+ lives across Nigeria, Ethiopia and Kenya. At LifeBank, we are the technology-led healthcare system for the future.\n\nWe are recruiting to fill the position below:\n\nJob Position: Account Receivable Officer\nJob Location: Yaba, Lagos\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Accounts Receivable Officer is responsible for proactively managing the Accounts Receivable process, including the management of debtors, invoicing, account management, collections, and the provision of information to the business as required to support collections.\n\n\nResponsibilities\n\n\n\tPerform monthly bank reconciliations to ensure accuracy and completeness of financial records.\n\tManage receivables collection process, including invoicing clients, tracking payments, and following up on overdue accounts.\n\tPrepare documentation and assist with tax fillings,ensuring compliance with local regulations and deadlines.\n\tMaintain accurate manual and electronic filing systems for invoices,receipts and other financial documents.\n\tAssist in financial reporting processes, including preparation of revenue reports\n\tCollaborate with other members of the finance team to support day to day operations and special projects as needed.\n\tStay up to date with changes in financial regulations and best practices to ensure compliance and efficiency.\n\n\nRequirements\n\n\n\tB.Sc Degree in Accounting or other finance-related disciplines\n\t3 - 4 years of experience.\n\tGood Communications, Analytical skills, Critical thinking, Have good administrative and organization skills, the use of Microsoft office and other accounting software.\n\n\n\n\n\nSalary\nN350,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their Resume to: team@lifebank.ng using the Job Positon and Location as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]