[
  {
    "title": "Well Engineer - HLP Job at WTS Energy",
    "link": "https://www.jobgurus.com.ng/jobs/view/well-engineer-hlp-job-at-wts-energy",
    "pubDate": "Thu, 19 Jun 2025 17:13:18 GMT",
    "source": "JobGurus",
    "keyword": "wts energy",
    "duplicate": false,
    "classifications": [],
    "content": "WTS Energy - Our client, Heritage Energy Operational Services Limited (HEOSL) is a leading indigenous energy company in Nigeria, committed to delivering safe, efficient, and sustainable energy solutions. As the operator of the OML 30 asset, HEOSL plays a pivotal role in Nigeria's oil and gas sector, focusing on maximizing production while adhering to the highest standards of environmental and operational excellence.\n\nThey are recruiting to fill the position below:\n\nJob Position: Well Engineer - HLP\nJob Location: Lagos \nDepartment: Well Engineering\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThis HLP role provides a structured exposure to well planning, drilling operations, and well integrity management.\n\tThe successful candidate will work with the Drilling & Completions team and gain field and office experience in delivering safe, efficient, and cost-effective wells for OML30's onshore operations.\n\n\nKey Accountabilities\n\n\n\tAssist in the preparation of well designs, drilling programs, and time/cost estimates.\n\tSupport daily drilling operations, including monitoring performance and managing drilling records.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Human Resource Assistant Job at Prixair Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/human-resource-assistant-job-at-prixair-group",
    "pubDate": "Thu, 19 Jun 2025 17:13:18 GMT",
    "source": "JobGurus",
    "keyword": "prixair group",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Prixair Group is a dynamic and diversified company committed to excellence across various industries including hospitality, beauty, events, logistics, media, and lifestyle services. With a passion for delivering world-class experiences, Prixair has built a strong reputation for quality, professionalism, and innovation.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nDriven by a customer-first philosophy, Prixair Group continuously sets industry benchmarks through exceptional service delivery, operational efficiency, and a dedicated workforce. Our diverse portfolio of brands works seamlessly together to provide top-tier solutions that meet the evolving needs of individuals and organizations. From premium spa treatments to event planning, media production, transport, and hotel management, Prixair Group is dedicated to creating value and inspiring trust across every touchpoint.\n\nWe are recruiting to fill the position below:\n\nJob Position: Human Resource Assistant\n\nJob Location: Gaduwa, Abuja (FCT) \nEmployment Type: Full-time\nDepartment: Human Resources\nReports To: HR Officer\n\nJob Summary\n\n\n\tThe Human Resource Assistant provides administrative and operational support to the HR department.\n\tThis role assists in recruitment, employee records management, onboarding, training coordination, and other HR functions to ensure smooth day-to-day operations.\n\n\nKey Responsibilities\n\n\n\tAssist with recruitment processes including posting job ads, scheduling interviews, and communicating with candidates.\n\tMaintain and update employee records, files, and databases.\n\tSupport onboarding and orientation for new hires.\n\tTrack employee attendance, leave requests, and HR documentation.\n\tEnsure proper filing of confidential HR documents in compliance with policies.\n\tPrepare HR documents such as employment contracts, letters, and reports.\n\tHandle employee inquiries and direct them to the appropriate HR personnel.\n\tHelp coordinate training sessions, workshops, and performance appraisals.\n\tAssist with organizing staff events, welfare activities, or health programs.\n\tSupport compliance with labor laws and company policies.\n\n\nRequirements\n\n\n\tOND / HND / B.Sc. in Human Resource Management, Business Admin, or a related field.\n\t1 - 2 years of relevant experience (internship or full-time).\n\tProficient in Microsoft Office (Word, Excel, PowerPoint).\n\tExcellent communication and organizational skills.\n\tAbility to maintain confidentiality and handle sensitive information.\n\tDetail-oriented and proactive with strong multitasking ability.\n\n\nPreferred Skills:\n\n\n\tBasic knowledge of HR software or HRIS systems.\n\tFamiliarity with Nigerian labor laws and HR best practices.\n\tStrong interpersonal skills and a supportive attitude.\n\n\nSalary\nN80,000 - N90,000 / Month.\n\nMethod of Application\nInterested and qualified candidates should forward their CVs to: amandaosifoedwards@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Data Analyst Job at Bottleking Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/data-analyst-job-at-bottleking-limited",
    "pubDate": "Thu, 19 Jun 2025 17:13:18 GMT",
    "source": "JobGurus",
    "keyword": "bottleking limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Bottleking Limited, the Minister of Enjoyment, at 27 Castle Rock Ave, Lekki Peninsula II, Lekki 105102, Lagos. We specialize in offering an exquisite selection of exotic wines and premium drinks. Our dedication to quality and customer satisfaction has made us a trusted name in the beverage industry. At Bottleking, we believe in celebrating life's moments with the finest drinks from around the world. Join us and experience the true taste of luxury.\n\nWe are recruiting to fill the position below:\n\nJob Position: Data Analyst\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Data Analyst will be responsible for collecting, analyzing, and interpreting data to help improve BottleKing’s business performance.\n\tYou will transform raw data into meaningful insights and dashboards, support strategic initiatives, and help optimize inventory, pricing, customer experience, and sales trends.\n\n\nKey Responsibilities\n\n\n\tCollect, organize, and interpret data from sales, inventory, marketing, and customer feedback.\n\tAnalyze trends, identify patterns, and provide actionable insights to inform business decisions.\n\tMonitor KPIs, identify data discrepancies, and recommend improvements in processes or strategy.\n\tConduct competitor and market analysis to inform pricing and promotional strategies.\n\tCreate and maintain interactive dashboards and reports using tools like Power BI, Excel, or Tableau.\n\tCollaborate with departments (Sales, Marketing, Procurement, Logistics) to understand data needs and support projects.\n\tPresent data findings to management in clear, concise formats.\n\tMaintain databases and ensure data accuracy, integrity, and security.\n\tSupport demand forecasting and restocking decisions using historical and real-time data.\n\n\nRequirements\n\n\n\tBachelor’s degree in Statistics, Mathematics, Data Science, Economics, Computer Science, or a related field.\n\tMinimum of 2 years of experience in a data analysis role (Retail or FMCG experience is a plus).\n\tStrong proficiency in Microsoft Excel (pivot tables, VLOOKUP, etc.) and SQL etc\n\tFamiliarity with data visualization tools like Power BI, Tableau, or Google Data Studio etc\n\tStrong analytical and problem-solving skills.\n\tExcellent communication skills – able to translate data into understandable insights.\n\tDetail-oriented, with a keen eye for identifying trends and anomalies.\n\n\nPreferred Skills:\n\n\n\tExperience in retail data analytics (especially in the wine or beverage sector).\n\tKnowledge of inventory and POS systems.\n\tAbility to work independently and manage multiple data-related tasks concurrently.\n\n\nWhat We Offer\n\n\n\tCompetitive salary and benefits package.\n\tOpportunity to work with a passionate and growth-oriented team.\n\tCareer development and learning opportunities.\n\tDynamic work environment in a rapidly growing retail company.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and a short Cover Letter to: hr@bottleking.ng using \"Data Analyst Application - BottleKing\" as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]