[
  {
    "title": "Digital Marketing Officer Job at KizzyTelsConcept",
    "link": "https://www.jobgurus.com.ng/jobs/view/digital-marketing-officer-job-at-kizzytelsconcept",
    "pubDate": "Wed, 02 Jul 2025 20:15:52 GMT",
    "source": "JobGurus",
    "keyword": "kizzytelsconcept",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "KizzyTelsConcept is a dynamic and forward-thinking digital company that was established in 2020 in Port Harcourt, Nigeria. We are passionate about bridging the gap between creativity and technology by delivering high-quality digital content and marketing solutions across various sectors. From our humble beginnings, KizzyTelsConcept has evolved into a budding digital hub that provides unique marketing services for audiobooks, digital learning content, and fashion materials, using innovative digital platforms to reach a broad and diverse audience.\n\nWe are recruiting to fill the position below:\n\nJob Position: Digital Marketing Officer\nJob Location: Rivers\nEmployment Type: Full-time\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nResponsibilities\nMarket Analysis and Research:\n\n\n\tConducts market research to identify trends, customer needs, and competitive positioning.\n\tCollects and analyses data to support strategic decision-making.\n\n\nStrategic Planning and Development:\n\n\n\tHelps define target markets and positioning strategies.\n\tSupports product development and pricing strategies through market feedback.\n\n\nTeam Coordination and Supervision:\n\n\n\tAssigns tasks, provides training, and evaluates team performance.\n\tFacilitates collaboration between departments (e.g., sales, product, and branding).\n\n\nStakeholder Communication and Reporting:\n\n\n\tCommunicates findings and marketing strategies to management and other stakeholders.\n\tPrepare periodic reports, dashboards, and presentations to guide leadership decisions.\n\n\nRequirements\n\n\n\tCandidates should possess an OND qualification with 3 years of proven experience.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and a brief Cover Message to: kizzytelsconcept@gmail.com with \"Digital Marketing Officer\" as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]