[
  {
    "title": "Personal Assistant to the MD Job at Future Moves Recruitment Agency",
    "link": "https://www.jobgurus.com.ng/jobs/view/personal-assistant-to-the-md-job-at-future-moves-recruitment-agency",
    "pubDate": "Mon, 07 Jul 2025 15:41:16 GMT",
    "source": "JobGurus",
    "keyword": "future moves recruitment agency",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Future Moves Recruitment Agency is a licensed full-fledged Human Resource Firm with extensive expertise and experience in human capital development and staffing.\n\nWe are recruiting to fill the position below:\n\nJob Position: Personal Assistant to the MD\nJob Location: Abuja (FCT)\n\nAbout the Role\n\n\n\tWe’re looking for a Personal Assistant to support the MD in daily operations.\n\tThis person will be the right hand to the executive—managing calendars, coordinating tasks, and ensuring things don’t slip through the cracks.\n\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tManage and optimize the MD’s calendar, appointments, and travel plans\n\tHandle confidential information with utmost discretion\n\tAct as a liaison between the MD and internal teams, partners, and stakeholders\n\tTrack key deliverables across departments and ensure timely execution\n\tDraft, edit, and manage official correspondence, reports, and presentations\n\tPrepare briefing materials, agendas, and notes ahead of meetings\n\tCoordinate and follow up on decisions made during leadership and strategy meetings\n\tHelp plan and execute internal events, board meetings, and strategy sessions\n\tAnticipate the MD’s needs and proactively solve operational bottlenecks\n\tMaintain a clear system for tracking deadlines, goals, and follow-through tasks.\n\n\nRequirements\n\n\n\tBachelor’s Degree in Business Administration, Social Sciences, or related field\n\t3 - 4 years of experience in an administrative, personal assistant, or executive support role\n\tStrong organizational and multitasking abilities\n\tExcellent written and verbal communication skills\n\tHigh emotional intelligence, discretion, and professionalism\n\tProficient in Google Workspace or Microsoft Office Suite\n\tMust be willing to relocate to Abuja (accommodation provided).\n\n\nSalary\nN180,000 - N250,000 monthly.\n\nMethod of Application\nInterested and qualified candidates should send CV to: recruiter.k@fmragency.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Customer Service Representative Job at FD Naturales",
    "link": "https://www.jobgurus.com.ng/jobs/view/customer-service-representative-job-at-fd-naturales",
    "pubDate": "Mon, 07 Jul 2025 15:41:16 GMT",
    "source": "JobGurus",
    "keyword": "fd naturales",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "FD Naturales is a multi-faceted company which is both a public health and agro-processing Company which specializes in the production of spices, herbs, essential oils and holistic health services.\n\nWe are recruiting to fill the position below:\n\nJob Position: Customer Service Representative\nJob Location: Lagos\nEmployment Type: Full-time\n\nSummary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Customer Service Representative (CSR) is responsible for providing excellent customer support by addressing inquiries, resolving complaints, processing orders, and ensuring a seamless client experience.\n\tThe role requires strong communication skills, product and service knowledge, and a commitment to customer satisfaction.  \n\n\nJob Description\n\n\n\tProcess orders from the website accurately, speedily, and efficiently. \n\tServe as the primary point of contact for clients via phone, email, chat, and in-person interactions.\n\tMaintain records of customer interactions, transactions, and complaints \n\tAssist customers with product and service selection based on their needs. \n\tIdentify opportunities to upsell or cross-sell products and services to meet customer needs. \n\tCoordinate logistics by liasing with 3rd party logistics and tracking orders.\n\n\nMust-Have Requirements \n\n\n\tMust be a graduate\n\tMust live within Anthony, Maryland, or its environs.\n\tMust be able to use spreadsheets & other MS Office applications well\n\tMust be numeric, able to calculate numbers & keep tidy records\n\tMust be able to handle daily reporting\n\tMust have high learning quotient\n\tMust be available for immediate employment\n\tExcellent communication and interpersonal skills.\n\tMust be techy & conversant with social media communication platforms (Instagram, Facebook, tiktok, Whatsapp)\n\tStrong problem-solving and conflict resolution abilities\n\tAbility to multitask and to  work effectively in a high-intensity atmosphere (speed and accuracy are of the essence)\n\tMust be able to follow instructions, work with excellence & open to correction.  \n\tAttention to detail and a customer-first mindset\n\tAbility to upsell & cross-sell\n\tAbility to generate leads\n\tMust be fast at typing.\n\n\nDress code:\n\n\n\tBusiness casual.\n\n\nWork Hours:\n\n\n\tMonday- Friday: 9am-5pm\n\tSaturday: 10am-2pm.\n\n\nSalary\nN100,000 - N150,000 monthly.\n\nMethod of Application\nInterested and qualified candidates should send the following below to: vacancies@fdnaturales.com using the Job Position as the subject of the mail.\n\nApplication Process:\n\n\n\tRecord a 1-minute screen share showing us how you would find product information on our website (www.fdnaturales.com) to answer a client who asked about a product you’re not familiar with\n\tOpen MS Excel or Google Sheets and show us how you would create a basic customer complaint log (Name, Date, Complaint, Status). Record a screen share & show the final table on video.\n\tMake a 2-minute (max) video of yourself explaining how you would up-sell these 2 products to a prospective client.\n\t\n\t\tProduct A: helps general breast health for those without any breast health concerns.\n\t\tProduct B: helps general breast health, but is particularly helpful for those with breast health concerns.\n\t\n\t\n\tMake a 2-minute (max) video explaining how you meet the MUST-HAVEs of the job opening.\n\tUpload the videos to a Google Drive folder & share the link to the folder and send to the mail above.\n\n\nNote\n\n\n\tDo NOT submit any CV.\n\tWe will request for it if your video applications meet our requirements.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Shipping Officer Job at Promasidor",
    "link": "https://www.jobgurus.com.ng/jobs/view/shipping-officer-job-at-promasidor-1",
    "pubDate": "Mon, 07 Jul 2025 15:41:16 GMT",
    "source": "JobGurus",
    "keyword": "promasidor",
    "duplicate": false,
    "classifications": [],
    "content": "Promasidor - We are an African company proud of our heritage and totally committed to the continent. We manufacture, market and sell unique brands which bring practicality and pleasure to millions of consumers across Africa.\n\nWe are recruiting to fill the position below:\n\nJob Position: Shipping Officer\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Shipping Officer role is responsible for overseeing pre- and post-clearing processes, ensuring full compliance with customs and government agency requirements, and maintaining accurate and up-to-date tracking and reporting of all logistics activities.\n\n\nResponsibilities\n\n\n\tInterface with third party agents in ensuring timely clearing of shipments from both sea and air ports within the stipulated timeframe.\n\tWill be responsible for all clearing activities of assigned third party agents and daily follow up on assignment shipments to ensure the ensure clearing process (Pre and Post Clearing) are adhered to.\n\tOptimize the activities of Third Party service providers and report the evaluation of their performance on a monthly basis.\n\tDaily monitoring and tracking of shipments in transit to ascertain the arrival time and reporting the transit details regularly.\n\tRegular follow up with both internal and external stakeholders for required clearing documentation and checking correctness.\n\tThe officer must be familiar with all customs, NAFDAC, SON related activities and must be able to resolve issues relating to these government agencies.\n\tTimely follow up with third party agents for shipment assessment and prepare the duty payment schedule.\n\tCheck to ensure that all shipments have necessary import permit as soon as pre-alert notice is given.\n\tWill be responsible for the processing and follow up of duty payment to receive duty receipt within 48 hours.\n\tEnsure timely preparation of NAFDAC costing and processing of payments to obtain draft (in 24 hours) by ensuring correctness of information.\n\tTimely processing of received shipment PFI for SONCAP online processing, payment and activation.\n\tVerification of invoices to identify availability of refunds and the processing of the refunds from both shipping lines and terminals.\n\tSubmission of monthly reports on all import related activities.\n\tMust be familiar with the export process and will be involved in all export activities for Promasidor Nigeria Limited.\n\n\nRequirements\n\n\n\tMinimum of Bachelors degree (B.Sc)\n\tAt least three years of experience in related field\n\tKnowledge of PBI will be an added advantage\n\n\nKey Compentencies:\n\n\n\tMust be familiar with freight forwarding and clearing process in Nigeria.\n\tMust be able to resolve simple and complex problems relating to work with government agencies like the NAFDAC, SON, NCS etc.\n\tMust be familiar with shipping documents and be able to identify errors (If any).\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Team Manager - Merchant Lending Job at FairMoney",
    "link": "https://www.jobgurus.com.ng/jobs/view/team-manager-merchant-lending-job-at-fairmoney",
    "pubDate": "Mon, 07 Jul 2025 15:41:16 GMT",
    "source": "JobGurus",
    "keyword": "fairmoney",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "FairMoney is building the leading mobile bank for emerging markets. We started with a digital microcredit application on Android, and currently roll out additional financial services (current account, savings, debit card) while expanding the product to Western Africa and South-East Asia.\n\nWe are recruiting to fill the position below:\n\nJob Position: Team Manager - Merchant Lending\n\nJob Location: Nigeria\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Team Manager will Manage with effectiveness and efficiency, a team portfolio of customers with the strict minimum risk acceptance level by selling the different products of the company.\n\tThe Por supervisor remains responsible of the portfolio activities of his/her team from promotion, loan assessment, disbursement collection and complete recovery.\n\tHe/she is also responsible for having a good relationship with FairMoney's clients and encourage them to buy all the products they are qualified for.\n\n\nKey Responsibilities\nLoan Officer Supervision:\n\n\n\tManage Team of Portfolio managers play a team leadership role that motivates team members to achieve excellence\n\tEnsure that individual loan officers on team meet monthly disbursement objectives\n\tEnsure that individual loan officers on team meet monthly quality targets by maintaining a very strict minimum risk level\n\tMonitor performance to make sure that every team member is performing to the optimum level and ensure that the policy and procedures are respected\n\tConduct pre-disbursement field visits with loan officers on team\n\tMonitor daily repayment\n\tSupport loan officers with loan recovery, client acquisition\n\tApproving loans when approval authorities are granted\n\tAssessing periodically the performance of his/her team member for decision making\n\tSupport the area manager or the state manager in building a good working environment\n\tRepresent the institution towards active and potential partners with dignity and pride\n\n\nTraining:\n\n\n\tProvide regular training for loan officers on team\n\tCoach and mentor loan officers\n\n\nReporting:\n\n\n\tPrepare daily reports on individual loan officer performance\n\tOther tasks as assigned\n\n\nRequirements\n\n\n\tHND/Bachelor's Degree in Sales and Marketing or related fields\n\tA minimum of 6 years of experience in Loan Sales / Portfolio Management and team management\n\tAbility to motivate a team of Sales Managers for performance\n\tExtremely flexible, result-oriented, and hardworking with a strong track record of success\n\tAbility to self-motivate and manage self\n\tGood communication and interpersonal skills\n\tHigh level of integrity\n\tDynamic and motivated and individuals who like to work outdoors\n\tTarget Driven.\n\n\nBenefits\n\n\n\tPrivate Health Insurance\n\tPerformance Bonus\n\tPension Plan\n\tTraining & Development.\n\n\nRecruitment Process\n\n\n\tA screening call with a member of the recruitment team for 30 minutes\n\tTechnical interview with the hiring manager for 30 to 60 minutes.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Customer Service Representative (Front Desk) Job at EMedical Comprehensive Consults Hospital",
    "link": "https://www.jobgurus.com.ng/jobs/view/customer-service-representative-front-desk-job-at-emedical-comprehensive-consults-hospital",
    "pubDate": "Mon, 07 Jul 2025 15:41:16 GMT",
    "source": "JobGurus",
    "keyword": "emedical comprehensive consults hospital",
    "duplicate": false,
    "classifications": [],
    "content": "EMedical Comprehensive Consults Hospital is a modern, patient-centered healthcare facility committed to delivering premium and accessible medical care “A Capite Ad Calcem” – from head to toe. Located in the heart of Ikota Villa Estate, Lekki-Ajah, Lagos, we serve individuals, families, and communities across Lagos with professional excellence and compassion.\n\nWe provide a wide range of in-person and virtual services including Family Medicine, General Surgery, Obstetrics/Gynecology, Laboratory and Imaging diagnostics, Antenatal and Immunization clinics, and 24/7 Emergency care.\n\nWe are recruiting to fill the position below:\n\nJob Position: Customer Service Representative (Front Desk)\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Location: Ikota, Ajah, Lekki - Lagos\nEmployment Type: Full-time\n\nJob Description\n\n\n\tAre you a Customer Service Professional with experience in a hospital, clinic, pharmacy, or any medical field? This is your chance to be part of a dedicated healthcare team!\n\n\nRequirements\n\n\n\tMinimum of 2 years of experience in a hospital, clinic, pharmacy, or medical-related field\n\tStrong communication and interpersonal skills\n\tAbility to manage front desk operations efficiently\n\t Proficiency in handling appointments, inquiries, and patient support\n\tCustomer-focused and able to multitask in a fast-paced environment.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: info@emc2clinics.com using \"Customer Service Rep - Front Desk Application\" as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]