[
  {
    "title": "Recruiter Job at ETC Workforce Services Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/recruiter-job-at-etc-workforce-services-limited",
    "pubDate": "Fri, 04 Jul 2025 16:46:37 GMT",
    "source": "JobGurus",
    "keyword": "etc workforce services limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "ETC Workforce Services Limited is a leading workforce management, outsourcing and advisory organization, empowering businesses to focus on their core competencies while we handle the complexities of HR, staffing, and operational support.\n\nWe are recruiting to fill the position below:\n\nJob Position: Recruiter\n\nJob Location: Lagos\nEmployment Type: Full-time (Hybrid)\nIndustry: We do not mind, but just know the rudiments of recruitment\n\nAbout the Role\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are looking for a proactive and resourceful Recruiter to join our team and help us identify, attract, and hire top talent across various functions.\n\tAs a Recruiter, you will play a hands-on role in managing the full recruitment cycle—from sourcing candidates to facilitating interviews and closing offers—while ensuring a smooth and engaging experience for all stakeholders.\n\n\nKey Responsibilities\n\n\n\tWork closely with hiring managers to understand job requirements and team dynamics.\n\tCreate and post job descriptions on appropriate platforms to attract qualified candidates.\n\tSource, screen, and shortlist candidates through job boards, social media, databases, and networking.\n\tConduct initial interviews and coordinate next steps with hiring teams.\n\tSchedule interviews, gather feedback, and facilitate timely decision-making.\n\tManage candidate communication to ensure a positive experience throughout the recruitment process.\n\tMaintain accurate and up-to-date candidate records using the Applicant Tracking System (ATS).\n\tSupport employer branding initiatives and talent outreach campaigns.\n\n\nRequirements\n\n\n\tBachelor’s Degree in Human Resources, Business, or a related field.\n\t2 - 4 years of proven experience in recruitment or talent sourcing.\n\tStrong knowledge of recruitment techniques and platforms (e.g., LinkedIn, Indeed, ATS).\n\tExcellent communication and interpersonal skills.\n\tAbility to manage multiple roles and prioritize tasks effectively.\n\tHigh level of professionalism, integrity, and attention to detail.\n\n\nPreferred Qualifications:\n\n\n\tExperience recruiting for multiple departments or industries.\n\tFamiliarity with HR software and recruitment tools.\n\tCertification in HR or Recruiting (e.g., SHRM-CP, PHR) is a plus.\n\n\nWhat We Offer\n\n\n\tA collaborative and supportive work environment.\n\tOpportunities for career growth and development.\n\tFlexible work options.\n\tCompetitive salary and benefits.\n\n\nNote: Ready to help us build a strong and diverse team?    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Restaurant Accountant Job at Jibs-Ray Nigeria Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/restaurant-accountant-job-at-jibs-ray-nigeria-limited",
    "pubDate": "Fri, 04 Jul 2025 16:46:37 GMT",
    "source": "JobGurus",
    "keyword": "jibs-ray nigeria limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Jibs-Ray Nigeria Limited is a recruitment and consulting company established in 2018 to proffer manpower solutions to its clients.\n\nWe are recruiting to fill the position below:\n\nJob Position: Restaurant Accountant\nJob Location: Victoria Island, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tAccountant duty is to keep and interpret the outlet’s financial records and manages all financial transactions of the outlet, from fixed payments and variable expenses to bank deposits through various channels.\n\n\nRoles & Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tKeep records and manage daily sales after checking all related source documents.\n\tManage petty cash disbursement, recording and documentation.\n\tMaintain all receivables and payables accounts of the outlet.\n\tReconciliation of current accounts with head office and other outlets.\n\tReviewing of all postings: general ledger, fixed assets, inventory, receivable and payable.\n\tPeriodic reporting of outlet financial performance.\n\tUpdate records using the accounting system, carry out regular database back up and system maintenance.\n\tHandle monthly, quarterly and annual closings.\n\tCompute taxes, prepare tax returns comply with financial policies and regulations.\n\n\nRequirements\n\n\n\tHND / B.Sc in Accounting, Finance or any relevant Degree.\n\t2 - 5 years of work experience as an Accountant.\n\tStrong attention to detail and good analytical skills.\n\tGood knowledge of SAGE application.\n\n\nSalary\nN150,000 / Month.\n\nMethod of Application\nInterested and qualified candidates should send their Application / CV to: jibs.ray@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Marketer Job at Vector Cube Outsourcing Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/marketer-job-at-vector-cube-outsourcing-limited",
    "pubDate": "Fri, 04 Jul 2025 16:46:37 GMT",
    "source": "JobGurus",
    "keyword": "vector cube outsourcing limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Vector Cube Outsourcing Limited is recruiting suitably qualified candidates to fill the position below:\n\nJob Position: Marketer\n\nJob Location: Agbara, Ogun\nEmployment Type: Full-time\n\nJob Requirements\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tCandidates should possess relevant qualifications with 1 - 4 years of experience.\n\tMust be able to confidently approach people and convince them to buy\n\tMust have previous experience in field marketing, sales, or customer engagement\n\tMust be energetic, proactive, and target-driven\n\tKnowledge of the Lagos market is an added advantage\n\tMust be ready to resume immediately.\n\tProximity to Agbara.\n\n\nRemuneration\n\n\n\tCompetitive salary (N100,000 - N120,000 Monthly) + performance bonuses\n\tFriendly and supportive team\n\tGrowth and learning opportunities.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and a brief cover letter to: Careeronsite@proton.me using \"Marketer\" as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Internal Control Officer Job at Prestige Superstores",
    "link": "https://www.jobgurus.com.ng/jobs/view/internal-control-officer-job-at-prestige-superstores",
    "pubDate": "Fri, 04 Jul 2025 16:46:37 GMT",
    "source": "JobGurus",
    "keyword": "prestige superstores",
    "duplicate": false,
    "classifications": [],
    "content": "Prestige Superstores is an evolving, multi-location grocery headquartered in Iyana-Ipaja, Lagos, Nigeria. We are the aqueduct to personal and basic household needs. We maintain a conducive shopping atmosphere, pleasant shopping experience, and we pay attention to customers’ needs and feedbacks. PRESTIGE was founded in July 2019; and has built a reputation as a world-class grocery that consistently leaves shoppers with a smile. Our operations spans across three (3) outlets in the populated areas of Lagos metropolis and one (1) outlet in Ogun State. At PRESTIGE, we see our shoppers as part of our family, and we place premium on satisfactory customer experience daily; this has earned us customer loyalty.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Internal Control Officer\nJob Location: Iyana Ipaja, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe are seeking a detail-oriented and proactive Internal Control Officer to join our team at our Alimosho (Iyana Ipaja) branch.\n\tThis role is critical to ensuring compliance, minimizing risk, and safeguarding the company’s assets through effective internal control processes.\n\n\nKey Responsibilities\n\n\n\tMonitor and evaluate the effectiveness of internal controls across store operations.\n\tConduct regular audits of processes including inventory, cash handling, bakery, and point-of-sale systems.\n\tInvestigate irregularities or suspected integrity issue and report findings to management.\n\tSupport in the implementation of risk management strategies.\n\tIdentify weaknesses or gaps in procedures and recommend improvements.\n\tWork with HR/Risk & Control to ensure compliance with company policies, procedures, and regulatory requirements.\n\tPrepare accurate and timely internal control reports.\n\n\nRequirements\n\n\n\tB.Sc./HND\n\tMinimum of 2 years of experience in internal control, or compliance (retail experience is an added advantage).\n\tStrong knowledge of accounting principles and internal control systems.\n\tProficiency in Microsoft Office, especially Excel.\n\tAttention to detail, integrity, and strong analytical skills.\n\tExcellent written and verbal communication skills.\n\n\nMethod of Application\nInterested and qualified candidates should submit their CV to: feedback.prestigesuperstores@gmail.com using “Internal Control Officer – Alimosho” as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]