[
  {
    "title": "Project Manager Job at Romanspage Global",
    "link": "https://www.jobgurus.com.ng/jobs/view/project-manager-job-at-romanspage-global",
    "pubDate": "Thu, 26 Jun 2025 18:22:13 GMT",
    "source": "JobGurus",
    "keyword": "romanspage global",
    "duplicate": false,
    "classifications": [],
    "content": "Romanspage Global is an HR Consulting firm with a focus on Recruitment, Staff Outsourcing, Payroll Management, Restructuring and more.\n\nWe are recruiting to fill the position below:\n\nJob Position: Project Manager\n\nJob Location: Edo\nEmployment Type: Full Time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tLead the planning and implementation of projects across various sectors.\n\tDefine project scope, goals, deliverables, and KPIs in collaboration with senior management.\n\tCoordinate internal resources and third parties/vendors for the flawless execution of projects.\n\tManage relationships with clients, partners, community leaders, and government stakeholders.\n\tEnsure compliance with donor guidelines, reporting requirements, and accountability standards.\n\tDocument project processes, lessons learned, and success stories to support organizational learning.\n\tWork with M&E teams to assess project impact and make data-driven adjustments.\n\tManage project budgets and ensure resource availability and allocation.\n\tEnsure that all projects are delivered on time, within scope, and within budget.\n\tDevelop detailed project plans to monitor and track progress.\n\tPlan sustainability and exit strategies for projects to ensure long-term impact.\n\tMentor project staff, interns, or junior officers assigned to project implementation.\n\tOrganize regular meetings to align teams on project progress and address potential risks.\n\n\nQualifications\n\n\n\tBachelor’s Degree in Project Management, Development Studies, Social Sciences, or related field.\n\tMinimum of 3 years of proven experience managing projects, preferably in a development or consulting environment.\n\tStrong understanding of project management methodologies\n\tExperience managing donor-funded or grant-based projects is a plus.\n\tExcellent communication, interpersonal, and stakeholder engagement skills.\n\tDemonstrated ability to lead cross-functional teams and work collaboratively.\n\tStrong organizational skills with a problem-solving mindset.\n\tProficiency in project management software\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Inventory Control Personnel Job at Cayce Food International Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/inventory-control-personnel-job-at-cayce-food-international-limited",
    "pubDate": "Thu, 26 Jun 2025 18:22:13 GMT",
    "source": "JobGurus",
    "keyword": "cayce food international limited",
    "duplicate": false,
    "classifications": [],
    "content": "Cayce Food International Limited is recruiting suitably qualified candidates to fill the position below:\n\nJob Position: Inventory Control Personnel\n\nJob Location: Satellite Town, Lagos\n\nResponsibilities\n\n\n\tTo receive and record inventories, give a report on all purchases.\n\n\nRequirements\n\n\n\tCandidates should possess an SSCE with experience in computer knowledge in Excel and Word.\n\n\nSalary\nN75,000 Monthly.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nMethod of Application\nInterested and qualified candidates should send their resumes and applications to: eunice.caycefoods@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Hotel Procurement Officer Job at Invealth Partners Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/hotel-procurement-officer-job-at-invealth-partners-limited",
    "pubDate": "Thu, 26 Jun 2025 18:22:13 GMT",
    "source": "JobGurus",
    "keyword": "invealth partners limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "(adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\nInvealth Partners Limited is an Investment and Management company with a focus on creating investment opportunities and strategic partnerships in the African continent. The company is poised to create efficiency and viability in the Infrastructure, healthcare, energy, retail and commodity sector while attracting investment and management of this portfolio to ensure sustainable growth and directly impact on service delivery across targeted ecosystems.  Invealths strategy is one that takes advantage of the need for entry into the African opportunity marmet and developes strategies, models and vehicles that are familiar to investors especially financial management and value growth over an acceptable period. Our company and processes are designed to give investor confidence, and we have a due diligence process that ensures that we only partner in the value based solutions.\n\nInvealth Partners serve to create a link between business opportunities and investors, either private or institutional, with a mid to long-term overview. Our business focus is guided by a strong Environment, Social and Government partnership justification. Africa is the next investment destination…Invealth provides the strategic partnership that provides holistic value.\n\nWe are recruiting to fill the position below:\n\nJob Position: Hotel Procurement Officer\nJob Location: Port Harcourt, Rivers\nEmployment Type: Full-time\nIndustry: Health Care\n\nJob Summary\n\n\n\tAs a Procurement Officer, you’ll be responsible for sourcing, purchasing, and managing the procurement of goods and services for the hospital.\n\tThey ensure timely delivery, optimal pricing, and quality standards.\n\n\nKey Responsibilities\n\n\n\tIdentify and establish relationships with reputable suppliers, vendors, and service providers.\n\tNegotiate favorable terms, pricing, and service-level agreements (SLAs).\n\tEvaluate supplier performance to ensure consistency and reliability.\n\tCollaborate with department heads to assess procurement needs and priorities.\n\tOversee inventory levels and reorder items to prevent shortages and stockout.\n\tEnsure procured items meet required quality standards and specifications. \n\tPromptly address discrepancies or defective deliveries promptly.\n\tDevelop and implement procurement plans based on budget, and hospital objectives and needs.\n\tMaintain a database of suppliers, pricing, and historical purchase records.\n\tEnsure compliance with hospital policies, standards, and regulatory requirements for all procurement activities.\n\tPrepare and process purchase orders, ensuring proper documentation and authorization before issuance of same.\n\tEnsure procured items meet required quality standards and specifications.\n\tPrepare regular (weekly and monthly) reports on procurement activities, expenditures, and vendor performance.\n\tAnalyze market trends to identify cost or process improvement opportunities.\n\tAdvise management on procurement related issues.\n\n\nRequirements\nEducational Qualifications:\n\n\n\tBachelor's Degree in Supply Chain Management, Procurement, or a related field.\n\n\nSpecific Certification or Licenses:\n\n\n\tCertified Purchasing Professional (CPP) or Certified Professional in Supply Management (CPSM)\n\n\nSpecific Skills and Experience Levels:\n\n\n\tMinimum of 3 years of experience in Procurement, preferably in a healthcare setting\n\tStrong understanding of procurement principles and practices\n\tProficiency in procurement software\n\tExcellent negotiation and contract management skills\n\tStrong organizational and analytical skills\n\tAttention to detail\n\tStrong communication and interpersonal skills\n\tAbility to work independently and as part of a team\n\tKnowledge of healthcare procurement regulations and standards. \n\n\nBenefits / Salary Range\nN100,000 - N150,000 / month.\n\nOthers: \n\n\n\tHealth and Pension cover\n\tLeave    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Accountant Job at Paga Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/accountant-job-at-paga-limited",
    "pubDate": "Thu, 26 Jun 2025 18:22:13 GMT",
    "source": "JobGurus",
    "keyword": "paga limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Paga is a licensed financial services company and a leading payments company in Nigeria with a massive transformative purpose - to make it simple for one billion people to access and use money. It was founded on the simple belief that the ubiquity of mobile phones can be leveraged in building an ecosystem that enables people to digitally send and receive money and creating simple financial access for everyone.\n\nWe are recruiting to fill the position below:\n\nJob Position: Accountant\n\nJob Location: Yaba, Lagos\nJob Type: Full-time\nReport to: Finance Manager\n\nAbout the Role\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are looking for a passionate, self-driven and experienced Accountant to join our team! As the Accountant, you will keep financial records, prepare reports, monitor revenue, and update financial information.\n\tYou must be familiar with accounting procedures and should have experience with accounting software programs (like SAP and Oracle).\n\tThe ideal candidate will be able to understand revenue models, handle accounts payable and receivable, expense reports, receipts, and other financial matters. Proven accounting experience is required.\n\n\nPrimary Responsibilities\n\n\n\tWork diligently with relevant team members to report revenue weekly and monthly\n\tReconcile revenue weekly and ensure it reports correctly to receivables\n\tContinuously work to understand revenue recognition and mitigate losses to ensure the highest levels of revenue recognition. Reconcile activity when there is portal downtime and charges applied.\n\tPromote quality assurance for all processes impacting revenue\n\tMonitor and ensure accurate capturing of all inventory and other direct costs associated to revenue\n\tContribute towards the timely delivery of month end report\n\tEnsuring taxes are applied correctly on revenue\n\tEnsure compliance with all revenue models\n\tProcessing invoices and timely collection of payments\n\tRelate with partners; manage receivables from partners, agents and intercompany\n\tSpot system glitches and their effect to the financial report. Suggest ways to improve and resolve such\n\tComply with International Financial Reporting Standard for financial statements\n\tProvide input into department’s goal setting process\n\tWork closely with the senior accountant to ensure seamless month end closure\n\tProduce error-free ad-hoc reports and present their results to management\n\n\nKnowledge and Skill Requirements\n\n\n\tBachelor’s Degree in Accounting\n\tMinimum of 4-years of experience in accounting, audit, or finance related function\n\tProficiency across Data and Financial Analysis\n\tProfessional qualification or final stage in ACCA, CIMA or ICAN) is desirable\n\tAdvanced computer software skills, including Excel, PowerPoint, and other accounting packages\n\tMust have completed the mandatory NYSC\n\n\nKey Competencies:\n\n\n\tHighly motivated and result oriented with a keen eye for details\n\tRevenue assurance\n\tGood time management skills and the ability to prioritize\n\tStrong attention to detail and an investigative mind\n\tProblem-solving skills and initiative\n\tAbility to keep confidential information and always remain discreet\n\tAbility to work and deliver within deadline with minimal supervision\n\tGood understanding of IFRS 15\n\tAbility and willingness to meet deadlines consistently\n\tIntegrity and high personal ethical standard\n\tProven ability to calculate and manage financial records\n\tHigh analytical skills\n\tAbility to prioritize and multitask\n\tHigh level of accuracy and attention to detail\n\tExcellent verbal and written communication skills\n\tAbility to work as part of a broader team of different levels\n\tIntermediate computer software skills, including Excel and Accounting packages\n\tExperience in communicating and influencing senior stakeholders\n\tDecisiveness, good judgement, strong organizational skills\n\tSelf-Driven and smart working.\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Facilities Manager Job at Paga Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/facilities-manager-job-at-paga-limited",
    "pubDate": "Thu, 26 Jun 2025 18:22:13 GMT",
    "source": "JobGurus",
    "keyword": "paga limited",
    "duplicate": false,
    "classifications": [],
    "content": "Paga is a licensed financial services company and a leading payments company in Nigeria with a massive transformative purpose - to make it simple for one billion people to access and use money. It was founded on the simple belief that the ubiquity of mobile phones can be leveraged in building an ecosystem that enables people to digitally send and receive money and creating simple financial access for everyone.\n\nWe are recruiting to fill the position below:\n\nJob Position: Facilities Manager\n\nJob Location: Yaba, Lagos\nJob type: Full Time (Hybrid)\nDepartment: Admin\nReporting to: Senior People Operations Business Partner\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Facilities Manager oversees services and processes crucial to the company's core business, ensuring an optimal working environment across all Paga office buildings and premises in every region. This role involves both strategic planning and daily operations.\n\tThe ideal candidate will utilize best business practices to boost efficiency, reduce operating costs, and increase productivity.\n\tThey must be technically competent with excellent problem-solving, analytical, IT, and managerial skills.\n\tStrong interpersonal and communication skills are essential for collaborating with diverse individuals, while organization, time management, and the ability to handle complex workloads are vital given the varied nature of the work.\n\n\nPrimary Responsibilities\nMaintenance & Operations:\n\n\n\tMonitoring of office appliances and lightings – tracking and ensuring proper usage.\n\tReview utilities consumption and strive to minimize costs.\n\tMonitor office supplies usage across all offices.\n\tMonitor generator and diesel usage and maintenance.\n\tSupervise the installation and ensuring regular maintenance of air conditioning services.\n\tRegular Inspection of the facilities to determine the need for repairs or renovations.\n\tRegular scheduling of office generator maintenance and servicing.\n\tPerforming routine maintenance on all facilities and carrying out repairs as needed or provide and oversee the completion of the work by artisans.\n\tReporting on maintenance, repairs, safety and other occurrences for supervisors and other relevant staff.\n\n\nHealth, Safety & Security:\n\n\n\tSupervising office security guards and cleaners\n\tDaily lock-up and opening of office premises.\n\tEnsure that facilities meet government regulations and environmental, health and security standards.\n\n\nVendor Management:\n\n\n\tManage vendors across all regional offices.\n\tMonitor and ensure payments of vendors handling parking, waste disposal, building security etc.\n\tMaintain vendors and supplier’s relationships.\n\tManage and supervise office opening and closing schedules.\n\n\nKey Competencies and Requirements\n\n\n\tCandidates should possess a Bachelor’s degree with a minimum of Second Class Division with 3+ years of working experience in similar role.\n\tExcellent communication and problem-solving skills.\n\tStrong knowledge of MS Office, including Word, Excel, PowerPoint.\n\tExperience successfully creating and/or modifying processes.\n\tOrganizational and planning skills.\n\tInitiative and multi-tasking skills.\n\tExperience working in a fast-paced and high growth environment.\n\tDemonstrated skills in managing multiple projects successfully.\n\tAbility to work with little or no supervision.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]