[
  {
    "title": "HR Manager Job at HR-Aid Consults",
    "link": "https://www.jobgurus.com.ng/jobs/view/hr-manager-job-at-hr-aid-consults",
    "pubDate": "Thu, 19 Jun 2025 09:41:54 GMT",
    "source": "JobGurus",
    "keyword": "hr-aid consults",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "HR-Aid Consults - Our client in the beauty & fashion industry is recruiting to fill the position below:\n\nJob Position: HR Manager\n\nJob Location: Ikoyi, Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tIn this role, under the supervision of the Chief Operating Officer, you will be responsible for leading the HR functions of the company and juggle various administrative tasks in a timely manner.\n\tAs the HR/Admin Manager, you will provide oversight and guidance to the development and monitoring of processes related to HR Operations, recruitment and retention, compliance, compensation, benefits, training, and development, as well as oversee administrative processes\n\n\nKey Responsibilities\n\n\n\tCreate and implement effective onboarding plans\n\tCoordinate with training centres for employee development and follow up until receiving training certificates\n\tReview the employment and working conditions to ensure legal compliance\n\tTrack staffing requirements and oversee the hiring of new employees as needed\n\tCoordinate general leave administration; this includes maintaining an annual leave calendar for leave projections, outstanding leave days, payment of leave allowances\n\tMaintain and update all staff personnel files using appropriate checklist to ensure complete documentation\n\tTake the lead on performance management process with collation of mid-year and end of year review documentations as well as draft confirmation letters for staff who are due\n\tEnsure the smooth and adequate flow of information within the company to facilitate other business operations\n\tMonitor inventory of office supplies and the purchasing of new material with attention to budgetary constraints\n\tProvide advice to management on employee relations issues including maintaining payment schedules and issuing memos to accounts for payment/due dates for Pension, Health Insurance and other statutory deductions\n\tPlanning and coordinating administrative procedures and systems and devising ways to streamline processes\n\tMonitor costs and expenses to assist in budget preparation\n\tEnsure regular update of the HR database with information on personnel records, bio data, salaries, or promotion as well as negotiations.\n\n\nKey Qualifications and Experience\n\n\n\tBSc in a Human Resources Management/Industrial Relations & Personnel Management Master’s degree in Business Administration is an added advantage\n\tCIPM certification is a key requirement\n\tMinimum of 5 years of relevant experience, 2 of which should be an administrative role. Experience in the fashion industry is compulsory\n\n\nSkills:\n\n\n\tExcellent leadership skills\n\tStrong written and oral communication\n\tOrganization and attention to detail\n\tAnalytical and problem-solving skills\n\tTime management\n\tAbility to navigate stressful situations Must demonstrate a high level of confidentiality, tact, discretion, initiative, and sound judgement\n\tAbility to cope with pressures and setbacks\n\tAbility to deliver results and meet customer expectations.\n\tMust demonstrate the confidence and ability to relate with stakeholders (clients, vendors, suppliers etc.) in an assertive and professional way\n\tMust have the ability to manage the flow of people and business, liaise and consult with internal and external stakeholders for maximum efficiency.\n\n\nSalary\nN400,000 - N500,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: ada@hr-aidconsults.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Front Desk Officer Job at Nigeria Society of Engineers (NSE)",
    "link": "https://www.jobgurus.com.ng/jobs/view/front-desk-officer-job-at-nigeria-society-of-engineers-nse",
    "pubDate": "Thu, 19 Jun 2025 09:41:54 GMT",
    "source": "JobGurus",
    "keyword": "nigeria society of engineers (nse)",
    "duplicate": false,
    "classifications": [],
    "content": "The Nigeria Society of Engineers (NSE) is the umbrella organisation for the engineering profession in Nigeria. It looks after the professional needs of all Engineers in their vide spectrum of specializations through structured initiatives in membership and other high professional standard and ethical practices.\n\nWe are recruiting to fill the position below:\n\nJob Position: Front Desk Officer\nJob Location: Abuja (FCT)\n\nJob Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWelcoming and offering assistance to guests and clients\n\tHandling incoming calls and providing information on enquiries Managing appointment calendars, booking meetings and coordinating schedules as may be required\n\tReceiving, sorting, and distributing mails and deliveries Keeping and organised and welcoming front office at all times Maintaining and updating a central telephone directory and other essential documentation\n\tMonitoring visitor access and ensuring compliance with security protocols.\n\n\nRequirements\nQualifications:\n\n\n\tHigher National Diploma or a Bachelor's Degree in Business Administration, Office and Information Management, Mass Communication or any other related course.\n\tAdditional certification in customer care will be an advantage.\n\n\nExperience:\n\n\n\tMinimum of three (3) years of work experience in a customer service role.\n\n\nCompetencies:\n\n\n\tExceptional communication and interpersonal skills, with immaculate telephone conversation skills\n\tAbility to maintain professional demeanour and attitude always\n\tGood corporate dress sense\n\tExcellent organisational and time management skills Attention to details and problem-solving skills\n\tProficiency in software applications such as Microsoft Office Ability to adapt to changing situations, priorities and deadlines.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: es@nse.org.ng and copy: bilenikhena@nse.org.ng using the Job Position as the subject of the mail.\nOr\nSend a written application, curriculum vitae and copies of cerificates to:\nThe Executive Secretary,\nThe Nigerian Society of Engineers (NSE),\nNational Engineering Centre,\nPlot 1035, Sani Abacha Way, Adjacent National Mosque,\nCentral Business District, Abuja.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Procurement Supervisor Job at Kinetic Electromechanic Nigeria Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/procurement-supervisor-job-at-kinetic-electromechanic-nigeria-limited",
    "pubDate": "Thu, 19 Jun 2025 09:41:54 GMT",
    "source": "JobGurus",
    "keyword": "kinetic electromechanic nigeria limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Kinetic Electromechanic Nigeria Limited - We are a renowned Building, Industrial, Engineering and Facility Management Company in Port Harcourt, Rivers State Nigeria. We offer Engineering solutions in Mechanical, Electrical, Instrumentation and Plumbing to our esteemed client.\n\nWe are recruiting to fill the position below:\n\nJob Position: Procurement Supervisor\n\nJob Location: Port Harcourt, Rivers\nEmployment Type: Full-time\nDepartment: Procurement & Supply Chain\nReports To: Operations Manager\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Procurement Supervisor will manage and coordinate all procurement activities for Mechanical, Electrical, Plumbing (MEP), Construction, and Fabrication projects.\n\tThis role ensures timely and cost-effective acquisition of materials, equipment, and services while maintaining quality and compliance with technical specifications and project timelines.\n\n\nKey Responsibilities\nProcurement Operations:\n\n\n\tSupervise the procurement of MEP systems and components (HVAC, plumbing, fire protection, electrical), structural materials, fabrication tools, and general construction items.\n\tEnsure timely issuance of purchase orders (POs) and delivery of materials to meet project schedules.\n\tReview material requisitions (MRs), vendor quotations, and ensure compliance with specifications and quality standards.\n\tCoordinate with Engineers and Project Managers to understand technical specifications and material requirements.\n\tMonitor market trends and conduct cost analysis to ensure competitive pricing.\n\n\nVendor and Contract Management:\n\n\n\tSource, evaluate, and develop reliable vendors and subcontractors.\n\tNegotiate contracts, prices, delivery schedules, and payment terms to achieve best value.\n\tEstablish and monitor vendor KPIs, including quality, delivery, and responsiveness.\n\tMaintain a qualified and approved vendor list for MEP, Construction, and Fabrication categories.\n\n\nCompliance and Reporting:\n\n\n\tEnsure procurement activities comply with internal controls, budgetary limits, and company policies.\n\tMaintain accurate procurement records including contracts, POs, material delivery status, and reports.\n\tGenerate weekly and monthly reports on procurement activities, vendor performance, and project material status.\n\n\nTeam Collaboration & Support:\n\n\n\tLiaise with Warehouse, Logistics, QA/QC, and Finance departments for seamless material flow.\n\tAssist in resolving supplier issues, delays, or non-conformance reports (NCRs).\n\tGuide and support procurement officers in daily activities.\n\n\nRequirements\n\n\n\tBachelor's Degree in Supply Chain Management, Engineering, Business Administration, or a related field.\n\tMember CIPS.\n\t5 –7 years of procurement experience, with at least 3 years in a supervisory role within MEP, Construction, or Fabrication industry.\n\n\nTechnical Skills:\n\n\n\tGood knowledge of MEP systems, fabrication materials (pipes, fittings, plates, welding materials), and construction goods.\n\tProficient in ERP software (Navision, SAP, Oracle, Sage, etc.) and Microsoft Office tools.\n\tStrong negotiation, communication, and interpersonal skills.\n\tSound understanding of procurement policies, inventory control, and contract law.\n\n\nMethod of Application\nInterested and qualified candidates should send their CVs to: vacanciesmyway@gmail.com using the Job Position as the subject of the mail.\n\nNote: Only qualified candidates will be contacted.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Business Development Manager Job at Aiderr Project Services",
    "link": "https://www.jobgurus.com.ng/jobs/view/business-development-manager-job-at-aiderr-project-services",
    "pubDate": "Thu, 19 Jun 2025 09:41:54 GMT",
    "source": "JobGurus",
    "keyword": "aiderr project services",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Aiderr Project Services is a global provider of industrial goods and equipment, serving the energy and industrial markets. As one of the world’s leading supply chain solutions companies, we help businesses boost their productivity through integrated supply chain management. Operating from our U.S. headquarters in Texas, we provide high-quality sourcing for clients around the world. Our customers look to us for the operations and maintenance (O&M) products that help their businesses run smoothly.\n\nWe are recruiting to fill the position below:\n\nJob Position: Business Development Manager\n\nJob Location: Nigeria\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tResponsible for lead generation and conversion.\n\tNurturing client relationships, and ensuring revenue growth.\n\tPlanning, monitoring and report status of BD initiatives.\n\tIncreasing brand awareness & ensuring customer satisfaction.\n\n\nDuites\nOutreaches- 40%\n\n\n\tIdentify and pursue new business opportunities in target sectors (oil & gas, EPCs, IOCs etc.) that fit into company’s competencies.\n\tPresent company capabilities to potential customers and partners.\n\tTrack and report monthly progress on sales targets, pipelines, and conversion ratios.\n\tDevelop and Implement Business Development/Marketing Plan.\n\tCreate detailed plans for reaching BD goals and objectives.\n\tProspect and negotiate partner agreements.\n\tLead the registration and prequalification of the company with major industry platforms (e.g. NIPEX, NCDMB, IOC vendor portals).\n\n\nBid Administration 40%\n\n\n\tIdentify bid opportunities through various channels and track tender portals for opportunities that align with Aiderr business.\n\tCoordinate bid/no bid meeting & manage bid log.\n\tCoordinate, collate and prepare responses to EOIs and tenders.\n\tClarify bid queries with vendors.\n\n\nMarket Intelligence 20%\n\n\n\tIdentify and map customer needs.\n\tResearch new opportunities / service and viable streams of income.\n\tConduct market research to establish trends, competitor and customer analysis to determine strategy for market penetration.\n\n\nKRAs/KPIs (subject to periodic review)\n\n\n\t% of new client acquisition per month.\n\tBid win/lose ration 35%+ success rate.\n\tClient retention - 90% active contract renewal.\n\tRevenue growth - 10-15% quarterly increase.\n\tMarket penetration - entry into at least 1 new segment/year.\n\n\nRequirements\nQualification\n\n\n\tBachelor’s Degree in Business Administration, Engineering, Marketing, or related field.\n\t5 - 7 years of progressive Business Development experience.\n\tAn MBA or Postgraduate Degree is an added advantage.\n\tRelevant Oil & Gas Industry experience.\n\tProven track record in winning contracts, closing deals, and client account growth.\n\tFamiliarity with tendering processes of IOCs, EPCs.\n\n\nCertifications (Preferred but not mandatory)\n\n\n\tCertified Scrum Product Owner (CSPO) or Project Management (PMP, PRINCE2).\n\tSales or BD Certifications (e.g. HubSpot etc).\n\tNIPEX/NCDMB Vendor Engagement Training.\n\n\nAttributes\n\n\n\tDriven\n\tAnalytical\n\tHungry-Humble-Smart\n\tExcellent negotiation skill\n\n\nSkills\n\n\n\tGood presentation and pitch delivery skills\n\tStrong networking and interpersonal influence\n\tExcellent verbal and written communication skills\n\tProficient in Microsoft Office applications\n\tOrganizational & analytical skill\n\tAbility to lead self, multi- task and manage time effectively\n\n\nKey Competencies\n\n\n\tBusiness Acumen – Understand market trends, financial implications, and commercial strategies.\n\tInfluencer – relationship building, managing, as well as negotiation.\n\tResults seeker – driven by goals and deadlines.\n\tInnovator – thinks ahead, anticipates change, and respond to it.\n\tAdaptor – handles pressure and criticism well, stays calm and collected.\n\tCompiler – follows protocol and encourages others to follow suit\n\n\nDesirable Competencies\n\n\n\tThorough knowledge of regulations governing the industry\n\n\nConditions of Employment\n\n\n\tSubject to Aiderr Project Services condition of Employment.\n\tApproximately 40 hours per week (minimum 8 hours per day Mon-Fri).\n\t4 weeks’ notice must be provided for the termination of the contract.\n\tEmployee shall regard all information/data provided by Aiderr and its client as confidential and shall not disclose such details and information to a third party without the written approval of Aiderr.\n\n\nMethod of Application\nInterested and qualified candidates should send their CVs and Applications to: HEA.careers@outlook.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]