[
  {
    "title": "CEC Recruitment & Admin Officer Job at Chelis Bookazine Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/cec-recruitment-admin-officer-job-at-chelis-bookazine-limited",
    "pubDate": "Thu, 05 Jun 2025 16:19:44 GMT",
    "source": "JobGurus",
    "keyword": "chelis bookazine limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Chelis Bookazine Limited is Nigeria’s leading educational supplier, supplying top quality international educational books, resources and services to Nigeria’s education industry. Chelis has completely revolutionized the school supply industry in Nigeria because of the passion, creativity, total commitment and dedication we bring into our business to achieve our vision of contributing significantly to the provision of top quality, world class education in Nigeria.\n\nWe are recruiting to fill the position below:\n\nJob Position: CEC Recruitment & Admin Officer\n\nJob Location: Surulere, Lagos\nEmployment Type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking for dynamic and proactive Recruitment & Admin Officers to join our team in Lagos.\n\tThe ideal candidate will be a graduate with exceptional communication skill in English and proficient computer skill.\n\tAs a Recruitment & Admin Officer, you will play a crucial role in delivering high-quality administrative services and maintaining excellent customer relations within our overseas education placement unit.\n\n\nResponsibility\n\n\n\tProvide administrative support to the overseas education placement unit, including handling inquiries, scheduling appointments, and maintaining records.\n\tAssist in the recruitment process for prospective students interested in studying abroad, including conducting interviews, assessing qualifications, and providing guidance on application procedures.\n\tEnsure timely and efficient communication with students, parents, educational institutions, and other stakeholders via email, phone, and in-person meetings.\n\tAssist in organizing and participating in recruitment events, workshops, and seminars to promote international education opportunities.\n\tCoordinate with educational institutions and partner agencies to facilitate the admission and enrollment process for students.\n\tMaintain accurate and up-to-date records of student information, application status, and relevant documentation.\n\tContribute to the development and implementation of marketing strategies to attract prospective students and enhance the units visibility.\n\tCollaborate with team members to achieve organizational goals and targets, working independently with minimal supervision when required.\n\n\nRequirement\n\n\n\tBachelor's Degree in any field.\n\tA male candidate is most preferable for this role.\n\tPrior work experience in recruitment and admissions for foreign universities.\n\tExcellent command of English language, both written and verbal.\n\tStrong interpersonal skills and customer service orientation.\n\tProficiency in computer applications, including Microsoft Office suite.\n\tAbility to work effectively in a team environment and independently under minimal supervision.\n\tKnowledge of overseas education systems and procedures is desirable.\n\n\nSalary\nN110,000 - N140,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their application and detailed CV to: chelisrecruitment@gmail.com using “CEC Admin and Recruitment Officer - Surulere\" as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Internal Control Officer Job at HabariPay Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/internal-control-officer-job-at-habaripay-limited",
    "pubDate": "Thu, 05 Jun 2025 16:19:44 GMT",
    "source": "JobGurus",
    "keyword": "habaripay limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "HabariPay Limited is a Fin-tech on the path to building a truly pan-African payments unicorn with it's unique product called SQUAD. At Squad, you will have access to best in class tools and resources to enable you to solve truly complex problems, developing game changing payments solutions.\n\nWe are recruiting to fill the position below:\n\nJob Position: Internal Control Officer\n\nJob Location: Victoria Island, Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Internal Control Officer is responsible for evaluating and improving the effectiveness of internal controls, risk management, and governance processes.\n\tThis role ensures that the company operates in compliance with internal policies, regulatory standards, and industry best practices, with a focus on minimizing risk and preventing fraud.\n\n\nJob Duties and Responsibilities\n\n\n\tDesign, implement, and monitor internal control systems across business processes.\n\tConduct periodic risk assessments to identify control weaknesses and suggest improvements.\n\tPerform routine and ad-hoc audits to ensure compliance with policies, procedures, and regulatory requirements.\n\tEnsure timely documentation and maintenance of control procedures and audit trails.\n\tCollaborate with other departments to promote a culture of control awareness and ethical behavior.\n\tReview financial and operational transactions to detect errors, inconsistencies, or unusual activity.\n\tMonitor key business activities and control indicators to ensure continuous improvement.\n\tPrepare detailed audit reports and follow up on agreed corrective actions.\n\tProvide guidance on process improvement and risk mitigation strategies.\n\tAssist in investigations of suspected fraud, breaches, or irregularities.\n\tEnsure compliance with external regulatory requirements and internal corporate policies.\n\n\nRequirements\n\n\n\tBachelor’s Degree, preferably in IT, Finance, Accounting, Business Administration\n\tApproximately total 3-5 years of internal control/assurance experience in a Financial Institution\n\tProfessional Certifications such as ICAN, ACCA, preferred\n\tExperience in risk-based audit, internal financial control processes, governance frameworks, enterprise-wide risk management, prefer in banking industries\n\tInternal Investigation experience preferred\n\tSolid understanding of Internal Auditing concepts, international auditing standards and internal control frameworks Strong Analytical Skills\n\tKnowledge of the banking or other financial sector and Core Banking System will be an added advantage\n\tDisplays high levels of integrity, objectivity and impartiality and commit to high professional ethical standards.\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Project Manager Job at U Connect Human Resources Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/project-manager-job-at-u-connect-human-resources-limited",
    "pubDate": "Thu, 05 Jun 2025 16:19:44 GMT",
    "source": "JobGurus",
    "keyword": "u connect human resources limited",
    "duplicate": false,
    "classifications": [],
    "content": "U Connect Human Resources Limited is recruiting suitable candidates to fill the position below:\n\nJob Position: Project Manager\nJob Location: Lagos\nEmployment Type: Full-time\n\nResponsibilities\nPlanning and Execution:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tManaging project resources: Assigning and coordinating human, financial, and material resources.\n\tMonitoring project progress: Tracking milestones, identifying potential delays, and making adjustments as needed.\n\tEnsuring quality standards: Maintaining the quality of project deliverables and ensuring they meet stakeholder expectations.\n\tDefining project scope and objectives: Clearly outlining what the project aims to achieve and its boundaries.\n\tDeveloping a project plan: Creating a roadmap that includes timelines, tasks, resource allocation, and potential risks.\n\n\nCommunication and Collaboration:\n\n\n\tCommunicating with stakeholders: Keeping all stakeholders informed about project status, issues, and changes.\n\tLeading and motivating the project team: Fostering a positive and collaborative work environment.\n\tManaging stakeholder expectations: Addressing concerns and ensuring stakeholder satisfaction.\n\n\nRisk Management and Issue Resolution:\n\n\n\tIdentifying and assessing project risks: Analyzing potential risks and developing mitigation strategies.\n\tResolving project issues: Addressing problems that arise and taking corrective actions.\n\tManaging changes to the project scope: Handling changes to project requirements and ensuring they are implemented effectively.\n\n\nOther Important Duties:\n\n\n\tBudget management: Controlling project costs and ensuring the project stays within budget.\n\tProject documentation: Maintaining accurate and up-to-date project records.\n\tReporting project progress: Providing regular reports to stakeholders on project status.\n\tEnsuring project compliance: Adhering to relevant regulations and industry standards.\n\n\nRequirements\n\n\n\tInterested candidates should possess a Bachelor's Degree qualification with 3 - 5 years of work experience. \n\n\nSalary\nN200,000 - N250,000 per month.\n\nMethod of Application\nInterested and qualified candidates should send detailed CV to: u.connecthr@u-connect-ng.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Procurement Manager Job at Carogas Energy",
    "link": "https://www.jobgurus.com.ng/jobs/view/procurement-manager-job-at-carogas-energy",
    "pubDate": "Thu, 05 Jun 2025 16:19:44 GMT",
    "source": "JobGurus",
    "keyword": "carogas energy",
    "duplicate": false,
    "classifications": [],
    "content": "Carogas Energy is an independent oil and gas company focused on developing and producing energy resources in Africa and beyond. We acquire and operate onshore and shallow offshore fields, ensuring efficient and responsible production.\n\nOur work includes oilfield services, procurement, and asset management, supporting Africa’s energy sector with practical, cost-effective solutions. With a growing operational presence in Africa and across key energy markets, we continue to expand our footprint through strategic industry partnerships and operational excellence to maximize value and long-term sustainability.\n\nWe are recruiting to fill the position below:\n\nJob Position: Procurement Manager - Oil & Gas\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Location: Lagos\nEmployment Type: Full-Time (Hybrid)\nReports To: Managing Director / Head of Commercial\nDepartment: Supply Chain & Commercial Operations\n\nJob Summary\n\n\n\tThe Procurement Manager – Oil & Gas is responsible for strategically managing procurement and vendor relations across upstream operations and services, with a focus on cost-effective sourcing, compliance, and strategic positioning in the African and Middle Eastern markets.\n\tThe role includes overseeing sourcing, contract bidding, vendor onboarding, and registration processes with national and international oil companies (NOCs & IOCs) and oilfield service providers.\n\tThe ideal candidate is commercially astute, technically sound, and experienced in oil & gas procurement and vendor registration protocols.\n\n\nKey Responsibilities\nStrategic Sourcing & Procurement:\n\n\n\tSource, evaluate, and manage vendors for oilfield equipment, chemicals, drilling services, engineering support, and project supplies.\n\tLead strategic sourcing initiatives aligned with technical and project requirements in exploration, drilling, and production operations.\n\tEnsure procurement meets technical specifications, delivery timelines, and cost targets.\n\n\nVendor & Partner Onboarding:\n\n\n\tIdentify, evaluate, and onboard qualified vendors and strategic partners relevant to upstream oil & gas services.\n\tDevelop vendor prequalification packages, manage documentation, and conduct due diligence.\n\tMaintain and expand a preferred vendor and partner database focused on operations in Africa and the Middle East.\n\n\nMarket Development & Bid Management:\n\n\n\tActively identify business opportunities and contracts in the African and Middle Eastern oil & gas sectors.\n\tLead proposal and bid submissions for tenders and RFPs issued by oil companies and oil service companies.\n\tCoordinate with technical, legal, and commercial teams to ensure bid compliance and competitiveness.\n\n\nRegistration & Compliance:\n\n\n\tLead the process of vendor registration and prequalification with NOCs, IOCs, and EPC contractors (e.g., ADNOC, NNPC, Sonangol, ENI, Schlumberger, Halliburton, etc.).\n\tEnsure compliance with local content requirements and registration protocols in key markets.\n\tLiaise with regulatory bodies, JV partners, and local content boards where necessary.\n\n\nCommercial Presentations & Stakeholder Engagement:\n\n\n\tCreate high-quality capability presentations and bid documents tailored to client requirements.\n\tRepresent the company at vendor presentations, pre-bid meetings, and technical evaluations with oil companies.\n\tBuild relationships with key procurement and project teams in operating companies and oil service majors.\n\n\nCost Control & Risk Mitigation:\n\n\n\tDevelop procurement strategies to optimize costs, quality, and supply reliability.\n\tMonitor supply chain risks and build contingency plans.\n\tBenchmark market prices and trends for major procurement categories.\n\n\nReporting & System Management:\n\n\n\tImplement and maintain procurement tracking systems (ERP/SAP or similar).\n\tAnalyze spend data, procurement cycle times, and supplier performance KPIs.\n\tProvide regular procurement reports and dashboards to senior leadership.\n\n\nQualifications\n\n\n\tBachelor's Degree in Engineering, Supply Chain Management, Business Administration, or related field. (MBA or certifications such as CIPS, PMP, or NACE are highly desirable)\n\tMinimum 7–10 years of procurement experience in the Chemicals or upstream oil & gas sector, with exposure to Africa and/or the Middle East.\n\tIn-depth knowledge of oil & gas procurement standards, logistics, HSSE, and local content regulations.\n\tProven experience in vendor onboarding, bid management, and contract registration processes with IOCs/NOCs.\n\tStrong negotiation, analytical, and project coordination skills.\n\tExcellent presentation skills with the ability to engage technical and commercial stakeholders at high levels.\n\tProficiency in MS Office, PowerPoint, ERP systems (e.g., SAP, Oracle), and tender portals.\n\n\nKey Competencies:\n\n\n\tOil & Gas Procurement Expertise\n\tContract & Bid Management\n\tCross-border Regulatory Compliance\n\tTechnical-Commercial Presentation Skills\n\tNegotiation & Influence\n\tVendor Relations & Strategic Partnerships\n\tMarket Intelligence (Africa & Middle East)\n\tAttention to Detail & Risk Awareness\n\tInterdepartmental Coordination\n\n\nSalary\nN750,000 / Month.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Social Media Manager Job at Baker Industries Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/social-media-manager-job-at-baker-industries-limited",
    "pubDate": "Thu, 05 Jun 2025 16:19:44 GMT",
    "source": "JobGurus",
    "keyword": "baker industries limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Baker Industries Limited is a city of Industries providing solutions to the Nigerian market and looking to expand our reach to other countries across the globe. We do all things Real Estate, Technology, Hospitality and Agriculture.\n\nWe are recruiting to fill the position below:\n\nJob Position: Social Media Manager\nJob Location: Lagos\nEmployment Type: Full Time\n\nRole Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThis is a full-time hybrid role for a Social Media Manager located in Lagos, with some work-from-home flexibility.\n\tThe Social Media Manager will be responsible for managing and optimizing social media platforms, developing and executing content strategies, creating engaging content, and monitoring social media trends.\n\tThe Social Media Manager will collaborate with various departments to enhance communication and online presence.\n\n\nQualifications\n\n\n\tBachelor's Degree in Marketing, Communications, or a related field\n\tProficiency in Social Media Marketing and Social Media Optimization (SMO)\n\tAbility to analyze social media trends and metrics\n\tExcellent organizational and multitasking skills\n\tStrong Communication and Writing skills\n\tExperience in developing and implementing Content Strategies\n\tAbility to work in a hybrid environment\n\tFamiliarity with the real estate, technology, hospitality, or agriculture industries is a plus.\n\n\nMethod of Application\nInterested and qualified candidates should send their resume to: kenny.adelakun@bakerindustries.io using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]