[
  {
    "title": "Facility Manager Job at Elvaridah",
    "link": "https://www.jobgurus.com.ng/jobs/view/facility-manager-job-at-elvaridah",
    "pubDate": "Fri, 13 Jun 2025 11:37:37 GMT",
    "source": "JobGurus",
    "keyword": "elvaridah",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "At Elvaridah, we emphasize on the critical matters and prospects of organizations such as business growth, strategy, planning, marketing, structure, and people management across different industries. We help companies focus on the growth of their businesses while aligning costs with strategy. With our all-inclusive approach and expertise, we capture values across the boundaries of any organization. Elvaridah focuses on optimizing all the different parts of a business as a unit.\n\nWe are recruiting to fill the position below:\n\nJob Position: Facility Manager\nJob Location: Lekki Phase 1, Lagos\nEmployment Type: Full-time\nIndustry: Construction\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a proactive and detail-oriented Facility Officer with 3–5 years of experience in managing facilities within construction or engineering environments.\n\tThe ideal candidate will oversee daily facility operations, ensure safety compliance, and maintain all building systems and infrastructure for optimum performance.\n\n\nKey Responsibilities\n\n\n\tOversee the maintenance, repair, and general upkeep of facilities, equipment, and utilities across construction sites and administrative buildings.\n\tSupervise facility support services including security, janitorial services, and waste management.\n\tConduct routine inspections to identify issues and ensure compliance with health, safety, and building regulations.\n\tLiaise with service vendors, contractors, and utility companies to ensure timely service delivery.\n\tMaintain records of repairs, maintenance, and inspections.\n\tAssist with space planning and office/workspace organization.\n\tMonitor and maintain critical infrastructure (HVAC, plumbing, electrical, etc.).\n\tTrack facility expenses, budgets, and ensure cost-effective facility management.\n\tImplement energy-saving and sustainability initiatives where applicable.\n\tSupport emergency response planning, including evacuation procedures and safety drills.\n\n\nRequirements\n\n\n\tBachelor's degree or HND in Facility Management, Building Technology, Engineering, or a related field.\n\t3–5 years of relevant experience in facility management, preferably within a construction or engineering firm.\n\tSolid knowledge of building systems, maintenance protocols, and health & safety regulations.\n\tExcellent problem-solving, multitasking, and communication skills.\n\tProficiency in facility management software/tools is an advantage.\n\tAbility to manage contractors and vendors effectively.\n\tStrong organizational and reporting skills.\n\n\nPreferred Qualities:\n\n\n\tCalm and organized personality with attention to detail.\n\tProactive, takes ownership, and works well under pressure.\n\n\nMethod of Application\nInterested and qualified candidates should send their CVs to: careers@elvaridah.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Customer Support Engineer Job at Netcom Africa",
    "link": "https://www.jobgurus.com.ng/jobs/view/customer-support-engineer-job-at-netcom-africa",
    "pubDate": "Fri, 13 Jun 2025 11:37:37 GMT",
    "source": "JobGurus",
    "keyword": "netcom africa",
    "duplicate": false,
    "classifications": [],
    "content": "Netcom has been Nigeria’s leading Internet Service Provider since 2004, staying ahead of the competition with cutting edge platforms in VSAT, WIMAX, Radio, and Fiber technology. Now, a pioneer in Business Transformation Solutions, we empower organizations to lead their market space by keeping pace with the rapid changes in IT innovations, ensuring relevance to specific business initiatives required to maximize revenue generation.\n\nWe are recruiting to fill the position below:\n\nJob Position: Customer Support Engineer\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tYour primary responsibility will be to provide technical assistance and support to our customers, ensuring their satisfaction and successful use of our products or services.\n\tYou will serve as a bridge between our customers and our technical teams, helping to troubleshoot and resolve technical issues while maintaining excellent customer relationships.\n\tYour role will be critical in ensuring a positive customer experience and driving customer loyalty.\n\n\nKey Duties & Responsibilities\n\n\n\tRespond promptly and professionally to customer inquiries via phone, email, or chat regarding internet service issues, billing inquiries, and general support questions.\n\tProvide technical assistance to customers in troubleshooting and resolving internet connectivity problems, including router configurations, network setups, and basic hardware or software issues.\n\tOffer comprehensive explanations of services, pricing plans, and features to potential and existing customers, ensuring they have a clear understanding of our offerings.\n\tAccurately log customer interactions, inquiries, and resolutions in the ticketing system to maintain a comprehensive customer support database.\n\tCollaborate with internal teams, such as Core Network Support, Access Network and System support, to escalate and resolve complex technical issues that require specialized expertise.\n\tIdentify and escalate potential service disruptions or network-related problems to the appropriate department for swift resolution.\n\tProactively identify opportunities to improve customer satisfaction and service efficiency, suggesting process enhancements or product improvements when necessary.\n\tStay up to date with industry trends, new technologies, and ISP service offerings to provide informed assistance and advice to customers.\n\n\nRequirements\n\n\n\tBachelor's Degree in a relevant technical field (e.g., Computer Science, Engineering, Information Technology) or equivalent practical experience.\n\tProven experience in technical support, customer service, or a related role.\n\tStrong problem-solving skills and the ability to diagnose and troubleshoot technical issues.\n\tExcellent communication skills, both written and verbal, with the ability to convey technical information to non-technical audiences.\n\tProficiency in using help desk software, customer support tools, and remote support technologies.\n\tFamiliarity with a range of operating systems, software applications, and networking concepts.\n\tPatience, empathy, and a customer-centric attitude.\n\tAbility to work independently and collaboratively in a fast-paced environment.\n\tCertifications in relevant technologies or platforms may be a plus.\n\n\nBenefits\n\n\n\tHealthcare Insurance (HMO)\n\tPaid Leave\n\tGroup Life Insurance\n\tProfessional Development Reimbursement.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Operations Manager Job at Camelot Ballrooms",
    "link": "https://www.jobgurus.com.ng/jobs/view/operations-manager-job-at-camelot-ballrooms",
    "pubDate": "Fri, 13 Jun 2025 11:37:37 GMT",
    "source": "JobGurus",
    "keyword": "camelot ballrooms",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "At the Camelot Ballrooms we know how to create the perfect atmosphere for that memorable special event in your life. No matter what your preferences or special requests might be, we can make it happen. We are Iconic and legendary in hosting countless celebrations in our grandeur Royal and Regency Ballrooms. \n\nWe are recruiting to fill the position below:\n\nJob Position: Operations Manager\nJob Location: Ilisan Remo, Ogun\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe're seeking an ambitious and results-driven Operations Manager to oversee all aspects of our venue's operation, ensuring smooth events, maximizing revenue, and maintaining a positive customer experience.\n\n\nRequirements\n\n\n\tBachelor’s degree in Business Administration, Marketing, Hospitality Management, or related field with excellent and exceptional performance dimensions\n\tMinimum 5 years of experience in business development, sales, marketing, and hospitality management.\n\n\nResponsibilities\n\n\n\tOperations Management: Oversee daily operations, maintain cleanliness, and manage equipment.\n\tStaff Management: Recruit, train, supervise, and manage all staff. Team Members.\n\tEvent Planning and Execution: Plan and execute events, ensuring they meet client expectations.\n\tClient Relations: Develop and maintain strong relationships with clients.\n\tSales and Marketing: Promote the Camelot brand and attract new clients.\n\tCompliance and Safety: Ensure compliance with regulations and safety protocols.\n\tInventory Management: Manage inventory of supplies, equipment, and furniture.\n\tPerformance Improvement: Identify areas for improvement and implement strategies.\n\n\nRequired Skills & Qualifications:\n\n\n\tLeadership and Management: Strong leadership skills.\n\tCommunication and Interpersonal Skills: Excellent communication skills.\n\tEvent Planning and Management: Experience in planning and executing events.\n\tFinancial Acumen: Ability to manage budgets and track expenses.\n\tProblem-Solving and Decision-Making: Ability to identify problems and make sound decisions.\n\n\nMethod of Application\nInterested and qualified candidates should send their Application, including their Resume and Cover Letter to: info@camelotballrooms.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Accounts Officer Job at Ziya Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/accounts-officer-job-at-ziya-limited",
    "pubDate": "Fri, 13 Jun 2025 11:37:37 GMT",
    "source": "JobGurus",
    "keyword": "ziya limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Ziya Limited - We are a growing company in the hospitality industry, committed to providing exceptional guest experiences and high-quality service. Our team is passionate about creating welcoming environments across our locations, with a focus on professionalism, comfort, and customer satisfaction. We value teamwork, reliability, and a positive attitude in everything we do.\n\nWe are recruiting to fill the position below:\n\nJob Position: Accounts Officer\nJob Location: Victoria Island, Lagos\nEmployment Type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a dependable and detail-oriented Account Officer to support the finance and accounts department.\n\tThe ideal candidate will assist with maintaining accurate financial records, reconciling accounts, and supporting financial reporting and audit processes.\n\tThis role is critical to ensuring the integrity and accuracy of financial data within the organization.\n\n\nKey Responsibilities\n\n\n\tMaintain accurate and up-to-date financial records and ledgers\n\tReconcile bank statements with general ledger accounts regularly\n\tAssist in the preparation of monthly, quarterly, and annual financial reports\n\tProvide support in vendor and customer account reconciliations\n\tSupport internal and external audit processes by preparing required documentation\n\tEnsure compliance with financial regulations and internal accounting policies\n\tOrganize and maintain proper filing of accounting documents\n\tTrack financial transactions to ensure accuracy and completeness\n\n\nRequirements\n\n\n\tOND, HND, or BSc qualification in Accounting, Finance, or a relevant discipline\n\t1–2 years of experience in a similar role\n\tStrong attention to detail and good analytical skills\n\tGood understanding of accounting principles and practices\n\tAbility to handle confidential information with discretion\n\tProficient in Microsoft Excel and basic accounting software.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: accounts@ziyadelicacy.com using “Account Officer Application” as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]