[
  {
    "title": "Sales / Business Development Manager Job at RSIN Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/sales-business-development-manager-job-at-rsin-group",
    "pubDate": "Thu, 26 Jun 2025 15:17:09 GMT",
    "source": "JobGurus",
    "keyword": "rsin group",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "RSIN was founded in 2003 and is headquartered in Fuzhou, Fujian Province. We mainly conduct business in Nigeria and other Western African countries. Over the past 20 years of development, we have become a multinational corporation with diversified industrial clusters of iron and steel, textile, fiber, chemical and lead-acid battery manufacturing based on the construction of a circular economy industrial park.\n\nWe are recruiting to fill the position below:\n\nJob Position: Sales / Business Development Manager\n\nJob Locations: Abuja (FCT), Abia, Kano, Kogi, Lagos and Rivers\nEmployment Type: Full-time\n\nJob Responsibilities\nSales:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tResponsible for market development and achieving sales targets;\n\tResponsible for market research and demand analysis of the products\n\tResponsible for maintaining daily relationships with new and old customers;\n\tComplete other tasks assigned by the leader.\n\n\nBusiness Development Manager (BDM):\nPartnership Development:\n\n\n\tIdentify and approach manufacturers and dealers who align with our e-commerce platform’s product categories and target market.\n\tNegotiate terms, pricing, and agreements with potential partners to ensure mutually beneficial outcomes.\n\tBuild and maintain long-term relationships with manufacturers and dealers to ensure ongoing partnerships.\n\n\nMarket Research:\n\n\n\tConduct thorough market research to identify potential suppliers in different industries.\n\tStay up-to-date with trends in manufacturing, product demand, and market shifts to target the right partners.\n\n\nOnboarding & Integration:\n\n\n\tFacilitate the seamless onboarding of manufacturers and dealers onto the e-commerce platform.\n\tCollaborate with internal teams to integrate supplier products, ensuring they are accurately listed, categorized, and promoted.\n\n\nSales Growth:\n\n\n\tDrive sales by expanding the product range and ensuring a steady supply of high-quality products from various manufacturers.\n\tWork closely with the marketing and operations teams to maximize exposure and sales for new partners.\n\n\nPerformance Monitoring:\n\n\n\tTrack and analyze the performance of onboarded manufacturers and dealers to ensure they meet sales targets and customer satisfaction.\n\tProvide feedback and support to partners to help them optimize their product listings and sales performance.\n\n\nCompliance & Quality Control:\n\n\n\tEnsure that all products from partnered manufacturers and dealers meet quality, safety, and legal standards required for the platform.\n\n\nJob Requirements\n\n\n\tBachelor's Degree in Marketing or its equivalent.\n\tMore than 3 years of sales experience in Mattress, Pillow, Nail, Iron and cost knowledge;\n\tStrong market development skills and good interpersonal communication skills.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: rsingrouphr@gmail.com and microtrust@gmail.com using the Job Position and Location as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "IT Support Officer Job at Cen Global Services Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/it-support-officer-job-at-cen-global-services-limited",
    "pubDate": "Thu, 26 Jun 2025 15:17:09 GMT",
    "source": "JobGurus",
    "keyword": "cen global services limited",
    "duplicate": false,
    "classifications": [],
    "content": "Cen Global Services Limited (“Cen Global”) is proudly a Nigerian registered company with broad specialization in Shipping & Marine, Recruitment & Manpower Supply, Procurement & Engineering Services, and Consultancy Services. Cen Global was incorporated in March, 2010.\n\nOur business sustainable approach is to understand the needs of our clients and subsequently create a uniquely structured service process tailored towards meeting or exceeding expectations.\nOur Corporate Head office is located in Port Harcourt, Rivers State, Nigeria but we have developed a robust network around the country to effectively deliver products and services across Nigeria at a very short notice\n\nWe are recruiting to fill the position below:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Position: IT Support Officer\n\nJob Location: Port Harcourt, Rivers\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tSeeking a competent and knowledgeable IT Support Officer to provide technical assistance and support to users in our client’s office.\n\tThe successful candidate will be responsible for identifying and resolving hardware, software, and network issues, ensuring the smooth and efficient operation of all IT systems, and providing support to meet the company's operational needs.\n\n\nKey Responsibilities\n\n\n\tProvide support to staff for hardware, software, and networking issues.\n\tEnsure timely response to service requests\n\tPerform routine maintenance and updates on systems and software\n\tEnsure compliance with company IT policies and security protocols.\n\tProvide support for IT projects and system upgrades as assigned.\n\n\nRequirements\n\n\n\tBachelor’s Degree in Computer Science, or a related field.\n\t2-5 years of experience in IT support.\n\tSound knowledge in IT Support, Software and hardware installation and maintenances.\n\n\nMethod of Application\nInterested and qualified candidates should forward their resumes to: careers@cenglobalservices.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Operations Manager Job at Mercy Corps",
    "link": "https://www.jobgurus.com.ng/jobs/view/operations-manager-job-at-mercy-corps",
    "pubDate": "Thu, 26 Jun 2025 15:17:09 GMT",
    "source": "JobGurus",
    "keyword": "mercy corps",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Mercy Corps is a leading global organization powered by the belief that a better world is possible. In disaster, in hardship, in more than 40 countries around the world, we partner to put bold solutions into action — helping people triumph over adversity and build stronger communities from within. Operating in Nigeria since 2008, Mercy Corps has been providing critical relief aid, empowering communities to prevent and respond to violence, inclusive economic development, recovery from crisis, building better lives and transforming their communities for good.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nMercy Corps has been present in Nigeria since 2012, focusing its interventions on humanitarian assistance, economic development, and conflict mitigation. With the ongoing insurgency in Northeast Nigeria causing the displacement of millions of individuals, Mercy Corps started its humanitarian response in 2014 to address the rising humanitarian needs. As the crisis has persisted, Mercy Corps’ strategy has also expanded to address the root causes of the conflict and seek to build the long term resilience of communities with integrated programs focusing on governance, the recovery of markets and livelihoods, social cohesion and social protection, youth empowerment, and local conflict management.\n\nWe are recruiting to fill the position below:\n\nJob Position: Operations Manager\nJob Location: Abuja (FCT) \nReports Directly To: Director of Operations\nEmployment Type: Full-time\n\nGeneral Position Summary\n\n\n\tThe Operations Manager provides general management and Coordination for all program support functions including procurement, logistics, asset, warehousing, admin, property management and information technology.\n\tThe Operations Manager proactively and informatively communicates and coordinates the program support functions with Mercy Corps staff in East, North Central, Northwest and West states and other field locations (as and when required).\n\tThe Operations Manager is a key person within the country program, who ensures the resources are planned and utilized towards effective program support.\n\tThe Operations Manager plays a key role in the field operations management of the country program and shares the responsibility for the direction and under the guidance of the Operations Director.\n\n\nEssential Responsibilities\n\n\n\tManage reliable and cost-effective operations and effective implementation of the strategies of Mercy Corps towards the right direction, including supervision of facilities & office management, information technology, procurement, asset management, fleet management and warehouse\n\tEstablish systems to ensure smooth flow of goods into the country through different channels\n\tIdentify different vendor categories in order to respond to the program needs\n\tOversee facility management, including housing, office leases and warehouses; ensure that security standards are maintained at all premises.\n\tWork closely with program management to facilitate program planning and upcoming procurement resources needs.\n\tWork closely with program and finance teams to deliver successful programs while demonstrating excellent stewardship of donor funds and compliance with MC and donor regulations.\n\tAct as a focal point for all internal and external coordination\n\tProvide overall operational support to programs and facilitate coordination, supervision and monitoring of support activities designed to assist in fulfilling program objectives.\n\tEstablish and maintain pipeline of supplies, overseeing the logistical aspects of the operation; oversee all commodity storage and movements as needed.\n\tResponsible for the management of all project procurement functions compliance and control as described in Mercy Corps FP3.\n\tSupports the program team on timely provision of operations support at a higher level of standards.\n\tEnsures compliance requirements of Mercy Corps and rules and regulations specified by the donors and sometimes host governments.\n\tProvides management information for decision making as required.\n\tSupport developing budgets for operations activities of country programs as an integral part of program proposal development and country level budgeting.\n\tRepresents Mercy Corps as required in coordination with country management.\n\tThe Operations Manager-Roving will have certain representation at the discretion of the Operations Director.\n\tThe level of representation may vary depend on the country context (i.e., Local Logistics Cluster, NGO Working Groups, etc.).\n\n\nResponsibilities:\n\n\n\tAs a member of the Operations team, the Operations Manager- is responsible for but not limited to key responsibilities of management oversight, development and implementation of policies and procedures and resource management.\n\n\nImplementation of Policies and Procedures:\nImplementation of appropriate operations policies and procedures that comply with Mercy Corps policies and procedures and with donor rules and regulations focusing on the achievement of the following results:\n\n\n\tFull compliance of operations with Mercy Corps Global Procurement and Logistics policies, procedures, and processes.\n\tProvide technical and managerial leadership in implementation of Procurement and Logistics in the Northeast program.\n\tEnsure ongoing full compliance of Mercy Corps finance policies and procedure and others (i.e. Program Management Manual, National Staff Handbook and etc.).\n\tProvide expert advice on Mercy Corps policies regarding resource management, tools, etc.\n\n\nResource Management:\nEffective and efficient resources management in administration, procurement, logistics and IT on the achievement of the following results:\n\n\n\tEnsure effective management of administrative / logistics resources and reporting in a systematic, transparent and efficient manner to country management.\n\tResponsible for provision of high quality and timely procurement and other program support.\n\tExercising management over procurement processes and logistics ensuring compliance with Mercy Corps procurement policies and procedures as well donor rules and regulations.\n\tOversee provision of transport and travel support (international and domestic).\n\tOversight on maintenance of proper custody of Mercy Corps assets, warehouse inventory and general inventory.\n\n\nTeam Management:\n\n\n\tDevelop the capacity of the team, deepen understanding of their roles and assist with career development.\n\tAssist team members with information, tools and resources to improve performance & reach objectives.\n\tPromote accountability, communicate expectations, and provide constructive feedback informally and formally via regular one on ones and performance reviews.\n\tCreate and sustain a work environment of mutual respect where team members strive to achieve excellence.\n\tHire, orient and lead team members as necessary.\n\tWork with all Mercy Corps staff to ensure smooth introduction and adoption of operational systems.\n\n\nSecurity:\n\n\n\tEnsure compliance with security procedures and policies as determined by country leadership.\n\tProactively ensure that team members operate in a secure environment and are aware of policies.\n\tSupervisory Responsibility: Senior Administration officer, Senior Operations officers\n\n\nAccountability to Participants and Stakeholders:\n\n\n\tMercy Corps team members are expected to support all efforts toward accountability, specifically to our program participants, community partners, other stakeholders, and to international standards guiding international relief and development work.\n\tWe are committed to actively engaging communities as equal partners in the design, monitoring and evaluation of our field projects.\n\n\nMinimum Qualification & Transferable Skills\n\n\n\tBA/BS degree in a relevant field.\n\tMinimum of 3 years of management experience in a corporate or an INGO sector, including experience in operational support.\n\tSound knowledge of administrative and logistics procedures is highly desired.\n\tProven supervisory ability and/or technical skills combined with leadership.\n\tStrong interpersonal skills and ability to establish and maintain effective working relationships with colleagues in a diversified multi-cultural and multi-ethnic working environment.\n\tSkills in managing, organizing, planning and implementing assigned tasks under pressure of frequent and tight schedules.\n\tStrong ability to apply good judgment and decision making skills in difficult and complex working environments.\n\tDemonstrated analytical and problem solving skills in handling management and coordination issues at country program level.\n\tEffective verbal and written communication, organizational, prioritization and Microsoft Office applications.\n\tExcellent oral and written English skills required.\n\tAbility to work effectively with an ethnically diverse team in a sensitive environment.\n\n\nSuccess Factors:\n\n\n\tThe successful Operations Manager- will be good at problem solving and have the ability to work out methods to deliver successful programs while demonstrating excellent stewardship of donor funds and compliance with Mercy Corps and donor regulations.\n\tThey will maintain strong cooperative relationships with other departments and interact effectively with international and national personnel both in a managerial as well as training capacity, while demonstrating the ability to multi-task, meet deadlines and process information in support of changing program activities.\n\tThey will be able to live and work closely with a diverse team of individuals in a highly intense and fluid work and security environment and be willing to travel regularly to Mercy Corps field offices and project sites.\n\tThe most successful Mercy Corps staff members have a strong commitment to teamwork and accountability, thrive in evolving and changing environments and make effective written and verbal communication a priority in all situations.\n\tMercy Corps team members represent the agency both during and outside work hours when deployed in a field posting or on a visit/TDY to a field posting. Team members are expected to conduct themselves in a professional manner and respect local laws, customs and MC's policies, procedures, and values at all times and in all in-country venues.\n\tFostering a diverse and open workplace is an important part of Mercy Corps’ vision. Mercy Corps is an Equal Opportunity Employer regardless of background. We are committed to creating an inclusive environment.\n\n\nOngoing Learning:\n\n\n\tIn support of our belief that learning organizations are more effective, efficient and relevant to the communities we serve, we empower all team members to dedicate 5% of their time to learning activities that further their personal and/or professional growth and development\n\n\nDiversity, Equity & Inclusion:\n\n\n\tAchieving our mission begins with how we build our team and work together.\n\tThrough our commitment to enriching our organization with people of different origins, beliefs, backgrounds, and ways of thinking, we are better able to leverage the collective power of our teams and solve the world's most complex challenges.\n\tWe strive for a culture of trust and respect, where everyone contributes their perspectives and authentic selves, reaches their potential as individuals and teams, and collaborates to do the best work of their lives.\n\tWe recognize that diversity and inclusion is a journey, and we are committed to learning, listening and evolving to become more diverse, equitable and inclusive than we are today.\n\n\nEqual Employment Opportunity:\n\n\n\tMercy Corps is an equal opportunity employer that does not tolerate discrimination on any basis.\n\tWe actively seek out diverse backgrounds, perspectives, and skills so that we can be collectively stronger and have sustained global impact.\n\tWe are committed to providing an environment of respect and psychological safety where equal employment opportunities are available to all.\n\tWe do not engage in or tolerate discrimination on the basis of race, color, gender identity, gender expression, religion, age, sexual orientation, national or ethnic origin, disability (including HIV/AIDS status), marital status, military veteran status or any other protected group in the locations where we work.\n\n\nNote\nSafeguarding & Ethics:\n\n\n\tMercy Corps is committed to ensuring that all individuals we come into contact with through our work, whether team members, community members, program participants or others, are treated with respect and dignity.\n\tWe are committed to the core principles regarding prevention of sexual exploitation and abuse laid out by the UN Secretary General and IASCand have signed on to the Interagency Misconduct Disclosure Scheme.\n\tWe will not tolerate child abuse, sexual exploitation, abuse, or harassment by or of our team members.\n\tAs part of our commitment to a safe and inclusive work environment, team members are expected to conduct themselves in a professional manner, respect local laws and customs, and to adhere to Mercy Corps Code of Conduct Policiesand values at all times.\n\tTeam members are required to complete mandatory Code of Conduct elearning courses upon hire and on an annual basis.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Business Development Manager (Hospitality) Job at Elvaridah Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/business-development-manager-hospitality-job-at-elvaridah-limited",
    "pubDate": "Thu, 26 Jun 2025 15:17:09 GMT",
    "source": "JobGurus",
    "keyword": "elvaridah limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Elvaridah Limited - Our client in the hospitality industry known for delivering exceptional service and customer experience. They are a premium hospitality brand committed to delivering unforgettable guest experiences through exceptional service, comfort, and attention to detail. Located in a prime destination, our hotel offers luxury accommodation, world-class dining, and a personalized touch that keeps guests coming back.\n\nThey are recruiting to fill the position below:\n\nJob Position: Business Development Manager (Hospitality)\n\nJob Location: Victoria Island, Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a proactive and results-driven Business Development Manager to lead growth initiatives in our hospitality business across Ikeja and Marina.\n\tThe ideal candidate will possess strong marketing and client acquisition skills, along with hospitality experience to identify opportunities, forge partnerships, and drive revenue growth.\n\n\nKey Responsibilities\n\n\n\tDevelop and implement effective marketing strategies and plans tailored to the assigned locations.\n\tPrepare and deliver compelling proposals to both internal teams and external stakeholders.\n\tGenerate comprehensive monthly marketing reports and consistently meet set targets.\n\tBuild and maintain strong relationships with internal teams and external stakeholders.\n\tDeliver persuasive business proposals and pitch presentations to potential clients.\n\tDevelop and execute strategic business development and marketing plans tailored to each location.\n\tIdentify and pursue new business opportunities, including corporate partnerships and client acquisition.\n\tMonitor market trends and competitor activities to inform strategy.\n\tGenerate detailed monthly performance reports and ensure KPIs are consistently met.\n\n\nRequirements\n\n\n\tBachelor's degree in Business, Marketing, or related field.\n\tProven experience in business development or marketing within the hospitality sector is highly preferred.\n\tStrong communication, negotiation, and presentation skills.\n\tAbility to work independently and manage multiple priorities across locations.\n\tGoal-oriented with a track record of meeting or exceeding targets.\n\n\nBenefits\n\n\n\tMonthly Salary: N250,000 / Month plus commission\n\tOpportunities for career growth\n\tPerformance-based bonuses\n\n\nMethod of Application\nInterested and qualified candidates should forward their CVs to: careers@elvaridah.com using “Business Development Manager (Hospitality)\". as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Sales Assistant and Cleaner Job at Chelis Bookazine Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/sales-assistant-and-cleaner-job-at-chelis-bookazine-limited",
    "pubDate": "Thu, 26 Jun 2025 15:17:09 GMT",
    "source": "JobGurus",
    "keyword": "chelis bookazine limited",
    "duplicate": false,
    "classifications": [],
    "content": "Chelis Bookazine Limited is Nigeria’s leading educational supplier, supplying top quality international educational books, resources and services to Nigeria’s education industry. Chelis has completely revolutionized the school supply industry in Nigeria because of the passion, creativity, total commitment and dedication we bring into our business to achieve our vision of contributing significantly to the provision of top quality, world class education in Nigeria.\n\nWe are recruiting to fill the position below:\n\nJob Position: Sales Assistant and Cleaner\nJob Location: Lekki, Lagos\nEmployment Type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tChelis Bookazine Limited, Nigeria's leading supplier of educational materials, is seeking dedicated individuals to join our team as Sales Assistant & Cleaner at our esteemed Lekki branch in Lagos.\n\tIn this combined role, you will be responsible for assisting with sales activities while also maintaining cleanliness and hygiene standards within the store.\n\n\nRequirement\n\n\n\tEducation: Minimum of SSCE\n\tPrevious experience in retail sales or customer service is a plus\n\tExcellent verbal and written communication skills\n\tPhysical stamina to perform cleaning tasks\n\tAbility to multitask and work efficiently in a fast-paced environment\n\tAttention to detail and ability to maintain cleanliness standards\n\tClose proximity or within reasonable commuting distance to Lekki Phase 1 Admiralty Road Lagos is a plus\n\tThe position entails working alternate Saturdays per month.\n\n\nSalary\nN70,000 - N75,000 Monthly. \n\nMethod of Application\nInterested and qualified candidates should send their Application and detailed CV to: chelisrecruitment@gmail.com using \"Sales Assistant & Cleaner - Lekki\" as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]