[
  {
    "title": "Key Account Manager - Cooperate Sales Job at GHI Assets Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/key-account-manager-cooperate-sales-job-at-ghi-assets-limited",
    "pubDate": "Wed, 02 Jul 2025 14:44:04 GMT",
    "source": "JobGurus",
    "keyword": "ghi assets limited",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "GHI Assets Limited is an investment company holding varying interests in different companies and has been in operation for over 21 years. It specializes in Airline Representation & Management, Business & Leisure Travel Management, Training, and Travel Technology Solutions.\n\nWe are recruiting to fill the position below:\n\nJob Position: Key Account Manager - Cooperate Sales\n\nJob Location: Lagos, Ikeja GRA, Lagos\nEmployment Type: Full-time\n\nRequirements\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tMinimum of a Bachelor’s degree in Business Administration, Marketing, Travel, Tourism, or a related field.\n\tA minimum of 3 years of proven experience in sales within the airline and travel industry is compulsory.\n\tProfessional certification in Airline and IATA (International Air Transport Association) is mandatory.\n\tStrong understanding of airline distribution channels, ticketing, and fare structures.\n\tExcellent communication, negotiation, and interpersonal skills.\n\tProficiency in CRM software and Microsoft Office Suite particularly power point and excel.\n\tAbility to work independently and as part of a team in a fast-paced environment.\n\tMust have concluded National Youth Service Corps (NYSC)\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: careers@ghiassets.com with the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Procurement Category Manager Job at Berger Paints Nigeria Plc",
    "link": "https://www.jobgurus.com.ng/jobs/view/procurement-category-manager-job-at-berger-paints-nigeria-plc",
    "pubDate": "Wed, 02 Jul 2025 14:44:04 GMT",
    "source": "JobGurus",
    "keyword": "berger paints nigeria plc",
    "duplicate": false,
    "classifications": [],
    "content": "Berger Paints Nigeria Plc is a leading paint manufacturing company with over six decades of industry excellence. With a presence in more than 10 states across Nigeria—including Lagos and Abuja—we have established a solid footprint in the nation's paints and coatings market.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nOur commitment to quality is reflected in the use of cutting-edge technology, state-of-the-art equipment, premium materials, and skilled expertise to produce an exceptional range of paints and coatings. These products are known not only for their superior performance but also for their innovative and functional features that set us apart in the market. At Berger Paints Nigeria, we are driven by a clear vision, and at the heart of that vision is our people. We recognise that every employee plays a vital role in the realisation of our strategic goals and objectives. This is why we place a strong emphasis on human capacity development, viewing it as a critical driver of sustainable organisational growth. Together, we are shaping a brighter, more colourful future—one coat at a time.\n\nWe are recruiting to fill the position below:\n\nJob Position: Procurement Category Manager\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tDesigns and develops procurement plans and strategies to identify cost-effective deals.\n\tDevelops strategies for cost reduction and decreases procurement expenses to achieve financial goals.\n\tAnalyses market trends and makes recommendations to improve procurement effectiveness to drive performance.\n\n\nKey Responsibilities\n\n\n\tSupervises the coordination and evaluation of the procurement process for the organisation.\n\tOversees the end-to-end of various procurement projects.\n\tApproves all requisitions and purchase orders before purchase.\n\tApproves the ordering of necessary raw materials and goods.\n\tDesigns and develops, and ensures implementation of procurement strategies to maintain security of supply and optimum value for money.\n\tApproves and reviews procurement policies and procedures.\n\tTracks and reports key functional metrics to reduce expenses and improve effectiveness.\n\tAnalyses market trends and makes recommendations to improve procurement effectiveness to drive performance.\n\tForesees alterations with negotiations with suppliers and clients and comes to a compromise while maintaining quality standards.\n\tSets policy and guidelines for delivering a cost-effective procurement process for the business.\n\tBuilds and develops key relationships with business stakeholders and strategic supply partners to improve business.\n\tDevelops and implements changes with newly developed processes to better procure goods and services.\n\tDiscovers profitable suppliers and initiates business and organisation partnerships.\n\tPerforms risk management for supply contracts and agreements.\n\tControls spending and builds a culture of long-term saving on procurement costs.\n\tPerforms other duties as assigned by the supply chain manager.\n\n\nKey Requirements\n\n\n\tBachelor's Degree in Economics, Supply Chain Management, Accounting or any related field.\n\tAt least 3 years of experience in a similar role.\n\tProficiency in Microsoft Office tools, like Excel and ERP Software.\n\tGood knowledge of Vendor Management and third-party management software.\n\tAptitude for working with numbers.\n\tGood knowledge of Inventory Management and planning, demand and planning principles.\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Internal Auditor Job at Paykobo.com",
    "link": "https://www.jobgurus.com.ng/jobs/view/internal-auditor-job-at-paykobocom",
    "pubDate": "Wed, 02 Jul 2025 14:44:04 GMT",
    "source": "JobGurus",
    "keyword": "paykobo.com",
    "duplicate": false,
    "classifications": [],
    "content": "Paykobo.com is a leading e-commerce platform specializing in IT products in Nigeria. We are a B2B e-commerce company that retail technology solutions to companies.\n\nWe are recruiting to fill the position below:\n\nJob Position: Internal Auditor\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are looking for a reliable and detail-oriented Internal Accounting Auditor to join our team.\n\tIn this role, you will be responsible for reviewing the company’s financial records and internal processes to make sure everything is accurate, efficient, and in line with company policies and regulations.\n\tThe right person for this role should have a good understanding of accounting principles, be able to work independently, and handle sensitive information with care.\n\n\nRequirements\n\n\n\tA Degree in Accounting or a relevant professional qualification like ICAN is required.\n\tAge: 18 - 25 years old.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: Careers@Paykobo.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Electrical Engineer Job at Resource Intermediaries Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/electrical-engineer-job-at-resource-intermediaries-limited",
    "pubDate": "Wed, 02 Jul 2025 14:44:04 GMT",
    "source": "JobGurus",
    "keyword": "resource intermediaries limited",
    "duplicate": false,
    "classifications": [],
    "content": "Resource Intermediaries Limited is a distinguished HR Outsourcing and Consulting firm, specializing in customized recruitment solutions tailored to meet the unique needs of companies. Our proficiency extends across a wide spectrum of positions, ranging from top-tier executives to entry-level positions, covering technical, contractual, semi-skilled, and unskilled roles. Additionally, we are recognized experts in providing a range of services including Fumigation Services, Janitorial Services, Payroll Administration, Expatriate Management, Manpower Planning, Executive Training, and more.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Electrical Engineer\nJob Location: Sanyo - Ibadan, Oyo\nEmployment Type: Full-time\n\nJob brief\n\n\n\tWe are looking for an electrical engineer who will help us advance our electrical products, systems, and applications.\n\tOn a daily basis, you’ll carry out various engineering tasks, such as performing calculations to ensure our systems meet the global safety standards and collaborating with technicians and computer programmers to solve emerging issues. You’ll also research on manufacturing processes and analyze data and trends to create new products.\n\tUltimately, you will improve our company’s products and processes and contribute to its growth.\n\n\nResponsibilities\n\n\n\tDesign, control, and implement electrical systems and products\n\tDevelop manufacturing processes according to global engineering codes and standards\n\tManage engineering projects and deliver them on time\n\tDefine customer needs and requirements\n\tSummarize data and report on test results\n\tExamine needs on new equipment, calculate costs and help prepare budgets\n\tEnsure that installations and applications are in line with customer needs and safety standards\n\tCollaborate with engineers and technicians to design and apply new system processes\n\tPerform quality and performance analysis on new and legacy IT systems\n\tMonitor maintenance and inspection plans\n\n\nRequirements and skills\n\n\n\tA degree in Electrical Engineering; MSc is a plus.\n\tProven expertise as an electrical engineer\n\tHands-on experience using design and calculation software\n\tDeep knowledge of electrical manufacturing processes\n\tUnderstanding of electrical engineering codes and safety standards\n\tProblem-solving abilities\n\tAttention to detail\n\tStrong organizational and communication skills\n\n\nSalary\nN100,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV and cover letter to: vadisa@resourceintermediaries.org using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "HR Training Manager Job at RSIN Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/hr-training-manager-job-at-rsin-group",
    "pubDate": "Wed, 02 Jul 2025 14:44:04 GMT",
    "source": "JobGurus",
    "keyword": "rsin group",
    "duplicate": false,
    "classifications": [],
    "content": "RSIN was founded in 2003 and is headquartered in Fuzhou, Fujian Province . we mainly conduct business in Nigeria and other western African countries. over the past 20 years of development, we have become a multinational corporation with diversified industrial clusters of iron and steel, textile, fiber chemical and lead-acid battery manufacturing based on the construction of circular economy industrial park.\n\nWe are recruiting to fill the position below:\n\nJob Position: HR Training Manager\n\nJob Locations: Abuja (FCT) and Lagos\n\nJob Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tBased on the company's business objectives and employee needs, develop a training plan and ensure its implementation.\n\tDesign and develop various training programs, including new employee onboarding training, skill enhancement training, leadership development training, etc.\n\tRegularly communicate with various departments to understand their training needs and analyze and organize them.\n\tComplete other tasks assigned by the leader.\n\n\nJob Requirements\n\n\n\tCandidates should possess a Bachelor's Degree or above, with priority given to majors related to human resource management, enterprise management, etc.\n\tMust have at least 5 years of training work experience, and at least 3 years of training manager/supervisor or related position experience.\n\tFamiliar with training processes and methods, possessing good course design, evaluation, and implementation abilities; Good communication and coordination skills and teamwork spirit; Proficient in using office software and training-related software.\n\t25-35 years old, in good health and without any bad habits.\n\n\nMethod of Application\nInterested and qualified candidates should send their Applications to: rsingrouphr@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]