[
  {
    "title": "Digital Marketer Job at Zibac Consulting",
    "link": "https://www.jobgurus.com.ng/jobs/view/digital-marketer-job-at-zibac-consulting",
    "pubDate": "Wed, 09 Jul 2025 09:43:45 GMT",
    "source": "JobGurus",
    "keyword": "zibac consulting",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Zibac Consulting - Our client is a luxury Real Estate company and their mission is to redefine luxury real estates through exceptional service, exclusive properties, and tailored experiences that delight and satisfy discerning clients. With integrity, innovation, and personalized attention as our core values, we ensure every interaction and campaign reflects our brand’s elegance and excellence.\n\nThey are recruiting to fill the position below:\n\nJob Position: Digital Marketer\nJob Location: Abuja (FCT)\n\nJob Overview\n     \n\n            \n    \n\n\n\n\n\tWe are looking for a creative and analytical Digital Marketer with 3–6 years of experience to drive the company’s digital presence, lead generation efforts, and brand visibility.\n\tThe ideal candidate understands both strategy and execution, and is passionate about reaching affluent audiences through data-driven, high-end digital campaigns.\n\n\nKey Responsibilities\nDigital Strategy & Planning:\n\n\n\tDevelop and execute digital marketing strategies to drive qualified leads and promote luxury property listings.\n\tDesign and implement digital campaigns aligned with sales goals and seasonal trends in the real estate market.\n\tPlan, create, and manage content calendars for multiple platforms including Instagram, LinkedIn, Facebook, and YouTube.\n\n\nContent Creation & Brand Management:\n\n\n\tCraft compelling content (copy, video scripts, ads) that speaks to high-net-worth individuals and corporate clients.\n\tOversee visual storytelling, property showcases, and virtual tours to maintain a polished and aspirational brand image.\n\tEnsure all digital content reflects the sophistication and exclusivity of the company’s brand.\n\n\nPerformance Marketing & Analytics:\n\n\n\tPlan and manage paid ad campaigns (Google Ads, Facebook/Instagram Ads) for lead generation and retargeting.\n\tMonitor campaign KPIs (CTR, CPC, conversions) and optimize accordingly.\n\tGenerate performance reports and insights using Google Analytics, Meta Business Suite, and CRM platforms.\n\tConduct SEO/SEM audits and implement on-page/off-page improvements.\n\n\nMarketing Automation & CRM:\n\n\n\tUtilize CRM tools to track lead behavior and create targeted email campaigns and sales funnels.\n\tSegment customer databases and implement personalized campaigns to nurture leads and increase conversion.\n\tSupport the sales team with timely insights and engagement strategies from digital interactions.\n\n\nCollaboration & Events:\n\n\n\tWork with the sales, creative, and operations teams to align campaigns with current listings, launches, or events.\n\tPromote company presence at real estate expos, open houses, and premium networking events online.\n\n\nRequirements\n\n\n\tBachelor’s degree in Marketing, Mass Communication, Digital Media, or related field.\n\t3–6 years of proven experience in digital marketing, preferably in luxury, real estate, hospitality, or lifestyle brands.\n\tDeep understanding of Abuja’s digital audience and real estate buyer behavior.\n\tHands-on experience with Google Ads, Meta Ads, SEO tools (e.g., SEMrush, Ahrefs), and email marketing platforms.\n\tProficiency in content creation tools (Canva, Adobe Suite, or similar).\n\tStrong analytical skills and ability to turn data into actionable insights.\n\tExcellent communication, storytelling, and visual branding abilities\n\n\nPreferred Attributes:\n\n\n\tFamiliarity with the luxury market and HNI engagement.\n\tExperience in short-form video content and influencer outreach.\n\tCertification in Google Ads, HubSpot, or Digital Marketing is a plus.\n\n\nPerks & Benefits\n\n\n\tCompetitive salary: N260,000 – N350,000 Monthly.\n\tWork in a high-performing and elegant brand environment\n\tGrowth and professional development opportunities\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Office Admin / Marketer Job at Forthfloor Partners",
    "link": "https://www.jobgurus.com.ng/jobs/view/office-admin-marketer-job-at-forthfloor-partners",
    "pubDate": "Wed, 09 Jul 2025 09:43:45 GMT",
    "source": "JobGurus",
    "keyword": "forthfloor partners",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Forthfloor Partners is an established and registered company under cooperate affairs commission CAC. And it is diversification in business of Human resource HR, Marketer, Public RelationsPR, Advertising, General contractor.\n\nWe are recruiting to fill the position below:\n\nJob Position: Office Admin / Marketer\n\nJob Location: Central Business District, Abuja (FCT) \nEmployment Type: Full-time\n\nSummary\n     \n\n            \n    \n\n\n\n\n\tThe successful candidate will be in office to attend to clients and coordinate the delivery to make sure it get to destination\n\tTaking stocks of items in the office and cordinate the movement of the goods, remuneration to be discuss during interview.\n\n\nRequirements\n\n\n\tThe person must be at least secondary school graduate and have experience in computer like Microsoft word, excel and internet surfing and must be good in marketing.\n\tWe only need male for this position.\n\n\nMethod of Application\nInterested and qualified candidates should send their Resume / application to: forthfloorpartners@gmail.com using \"Office Admin / Marketer\" as the subject of the email.\n\nNote\n\n\n\tFor more inquiries, WhatsApp line: 08034860810.\n\tWe don't accommodate call because this will disqualify you as an applicant.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]