[
  {
    "title": "Senior Account Manager Job at Glovo Nigeria",
    "link": "https://www.jobgurus.com.ng/jobs/view/senior-account-manager-job-at-glovo-nigeria",
    "pubDate": "Mon, 30 Jun 2025 10:45:41 GMT",
    "source": "JobGurus",
    "keyword": "glovo nigeria",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "Glovo - We’re a Barcelona-based startup and the fastest-growing delivery player in Europe, Hispanic America and Africa. With food at the core of the business, Glovo delivers any product within your city at any time of day. Our vision and ambition are not only to make everything immediately available in your city but it is also to offer our employees the job of their lives. A job where you'll be challenged and have the most fun working in through tech-enabled experiences.\n\nWe are recruiting to fill the position below:\n\nJob Position: Senior Account Manager, Top Accounts Nigeria\nJob Location: Lagos\n\nYour Mission\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAs a Senior Account Manager you will be responsible for building and developing the most relevant partnership with the biggest accounts in Nigeria!\n\tThis is a unique role which requires a blend of business data analytics skills along with a strong sense of relationship management to drive long term growth & profitability strategy for your both partners & Glovo.\n\n\nThe Journey\n\n\n\tHave full responsibility and own 360º view of the business of Top Partners & Glovo in Nigeria;\n\tGrasp the objectives and hurdles of Partners to offer insightful advice and assistance\n\tWork with data to enhance growth and profitability for both Partners and Glovo\n\tDefine and pursue the long-term strategy for the country in terms of Growth, Promotions, Advertisement and Operations\n\tImprove Glovo’s revenue through commission renegotiation and selling assets\n\tWork alongside various internal departments to create and apply tailored solutions that address the needs of Partners, including Operations, Marketing, Corporate, Customer service\n\tEstablish and maintain a very close relationship with Top Partners converting partners to preferred partners\n\n\nWhat you will bring to the ride\n\n\n\t4+ years in Account Management and core business development (experienced in startup, top consulting firms or top tech companies will be an advantage)\n\tAdvanced Proficiency in Excel is mandatory, knowledge in other data analysis tools will be beneficial\n\tYou're persuasive in the most pleasant possible way and have no trouble selling anything that brings value to Customers/Partners and the Glovo platform\n\tYou're persuasive in the most pleasant possible way and have no trouble selling anything that brings value to Customers/Partners and the Glovo platform\n\tYou find smart and elegant solutions to complex and multi-disciplinary challenges with a great critical-thinking\n\tThe skills to manage the big picture and the smallest details. You're always on top of your deadlines and you demonstrate to be an organization freak!\n\tYou've got a good judgment and assertiveness and own up to your mistakes facing any situation with an optimistic approach\n\tYou’re an owner, you have a natural bias for action, always pushing for things to happen, objective and deadline oriented with a hands-on spirit\n\tAbility to comfortably work in a high growth and high-performance company with a fast pace.\n\tProblem solver, data-driven with an analytical approach\n\tStrong Commercial, Communication, Interpersonal, and Project management skills\n\tIndividuals representing diverse profiles, and abilities, encompassing various genders, ethnicities, and backgrounds, are less likely to apply for this role if they do not possess solid experience in 100% of these areas.\n\tEven if it seems you don't meet our musts don't let it stop you, we are all about finding the best talent out there! Skills can be learned, and embracing diversity is invaluable.\n\n\nWe believe driven talent deserves:\n\n\n\tAn enticing equity plan that lets you own a piece of the action.\n\tTop-notch private health insurance to keep you at your peak.\n\tMonthly Glovo credit to satisfy your cravings!\n\tDiscounts on transportation, food, and even kindergarten expenses.\n\tDiscounted gym memberships to keep you energized.\n\tExtra time off, the freedom to work from home two days a week, and the opportunity to work from anywhere for up to three weeks a year!\n\tEnhanced parental leave, and office-based nursery.\n\tOnline therapy and wellbeing benefits to ensure your mental well-being.\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Finance and Admin Executive Job at Domeo Resources International",
    "link": "https://www.jobgurus.com.ng/jobs/view/finance-and-admin-executive-job-at-domeo-resources-international",
    "pubDate": "Mon, 30 Jun 2025 10:45:41 GMT",
    "source": "JobGurus",
    "keyword": "domeo resources international",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Domeo Resources International (DRI) is a prolific organisation which proffers HR and Management Consultancy solutions premised on excellence and innovation. DRI analyses various organisational problems, develops improvement plans, deploys those plans and monitors the plans to ensure improved organisational performance.\n\nWe are recruiting to fill the position below:\n\nJob Position: Finance and Admin Executive\n\nJob Location: Abuja (FCT) \nDirect Reports: Administrative Support Staff\nReports to: Chief Financial Officer / MD\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Finance & Admin Executive is responsible for overseeing the financial and administrative functions of the organization.\n\tThis includes financial planning, funding operations, investor relations, budgeting, and ensuring administrative efficiency.\n\tThe ideal candidate will have a minimum of 5 years of experience and a strong understanding of Public-Private Partnership (PPP) arrangements, funding structures, and financial compliance within the energy or infrastructure sector.\n\n\nResponsibilities\nFinancial Planning and Reporting:\n\n\n\tPrepare and monitor budgets, forecasts, and periodic financial reports to support business strategy and transparency.\n\n\nFunding and Investment Oversight:\n\n\n\tManage PPP financial structures, investor relations, and fundraising activities to ensure alignment with business goals.\n\n\nCash Flow and Compliance Management:\n\n\n\tOversee day-to-day financial operations, including bank relations, compliance with tax regulations, and audit readiness.\n\n\nFinancial Modeling and Analysis:\n\n\n\tDevelop robust financial models and conduct variance and sensitivity analyses for investment decisions and project evaluation.\n\n\nAdministrative Operations:\n\n\n\tSupervise office administration, procurement processes, vendor contracts, and HR documentation including payroll coordination.\n\n\nStakeholder and Team Coordination:\n\n\n\tAct as the finance liaison for auditors, legal advisors, and funding partners, while supervising the admin team for operational excellence.\n\n\nRequirements\nEducation and Certifications\n\n\n\tA university Degree in Accounting, Finance, Business Administration, or a related field.\n\tA Master’s Degree (MBA or MFIN) is an advantage.\n\tProfessional certifications such as ICAN, ACCA, or CFA are highly preferred.\n\n\nExperience\n\n\n\tMinimum of 5 years of experience in finance and administration.\n\tProven track record managing PPPs, investors, and funding relationships.\n\tPrevious experience in the energy, infrastructure, or development sectors is an asset.\n\n\nSkills:\nFinancial Expertise:\n\n\n\tStrong command of financial analysis, budgeting, forecasting, and financial reporting.\n\tProficiency in accounting systems (e.g., Sage, QuickBooks) and Excel modeling.\n\n\nRegulatory and Compliance Knowledge:\n\n\n\tSolid understanding of financial laws, tax regulations, and corporate governance.\n\tExperience with financial audits and investor due diligence processes.\n\n\nStrategic and Operational Insight:\n\n\n\tAbility to link financial strategies to business objectives and provide informed recommendations.\n\n\nAdministrative Leadership:\n\n\n\tCapable of organizing administrative systems, supervising support staff, and improving operational efficiency.\n\n\nCommunication and Stakeholder Engagement:\n\n\n\tExcellent written and verbal communication skills for investor presentations and internal reporting.\n\tAbility to engage with funders, legal teams, government bodies, and other key partners.\n\n\nOrganization and Time Management:\n\n\n\tExceptional multitasking, organization, and deadline-management abilities in a dynamic work environment.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and cover letters to: recruitment@domeoresources.org using Finance & Admin Executive as the subject of the mail. \n\nNote: Only shortlisted candidates will be contacted.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Real Estate Consultant Job at Boing Pinnacle Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/real-estate-consultant-job-at-boing-pinnacle-limited",
    "pubDate": "Mon, 30 Jun 2025 10:45:41 GMT",
    "source": "JobGurus",
    "keyword": "boing pinnacle limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Boing Pinnacle Limited - For over 10 years, we have been providing housing and Real Estate investment solutions to Individuals, Groups and Corporate bodies, with over 5000 subscribers who have keyed into our fully-gated lifestyle master-planned estates in Abuja, Port Harcourt, Lagos, and Akure. We are poised to deliver living environments that guarantee comfort, security, and rest of mind. Get the Boing.\n\nWe are recruiting to fill the position below:\n\nJob Position: Real Estate Consultant\n\nJob Location: Port Harcourt, Rivers\nEmployment Type: Full-time\n\nSummary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe ideal candidate for this position, Real Estate Consultant must be a smart and highly intelligent person, he or she will be responsible for selling all company Real Estate to prospective customers.\n\tHe and she will have to explain investment plans and product to potential client, guide and advise client in selecting real estate plans to best meet their needs\n\tRigorously prospecting in all multinationals ( submission of proposals) within the state, and with the purpose of selling the company's investmentsproducts.\n\tEstablishing good and long- lasting relationships on behalf of the company for the purpose of continuous sales.\n\tPropagating the benefits of investing in Real estates to prospective customers inprivate, federal, and state organizations within Rivers state and developing new strategies that will bring about the creation of new business\n\n\nRequirements\n\n\n\tCandidates should possess OND / NCE / HND / Bachelor's / Master's Degrees with relevant work experience.\n\tA risk taker and a person with a teachable and resilience spirit, that have good negotiating and persuading power\n\tHe/she must have good communication skills and be able to work under pressure and with other team members under minimal or no supervision.\n\n\nMethod of Application\nInterested and qualified candidates should forward their CV to: olayemibakare498@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]