[
  {
    "title": "Logistics Analyst Job at Olamide Recruiting",
    "link": "https://www.jobgurus.com.ng/jobs/view/logistics-analyst-job-at-olamide-recruiting",
    "pubDate": "Wed, 25 Jun 2025 15:17:31 GMT",
    "source": "JobGurus",
    "keyword": "olamide recruiting",
    "duplicate": false,
    "classifications": [],
    "content": "Olamide Recruiting is a multinational consulting company in Victoria Island, Lagos, Nigeria.\n\nWe are recruiting to fill the position below:\n\nJob Position: Logistics Analyst\n\nJob Location: Victoria Island, Lagos\nEmployment Type: Full-time (Fully Onsite)\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a detail-oriented and proactive Logistics Analyst to join our team.\n\tThe ideal candidate will be responsible for coordinating the recovery of IT equipment from current and former employees, managing asset tracking, and providing accurate reporting and analysis.\n\tThis role requires strong communication skills, attention to detail, and the ability to work collaboratively across various teams.\n\n\nJob Requirements\n\n\n\tMinimum of a Bachelor’s Degree or equivalent, including proficiency in English and Math.\n\tMinimum of 2-4 years of experience as a logistics analyst in the IT industry or related fields.\n\tC2-level English speaker with strong communication skills and the confidence to engage with U.K. residents and other English-speaking audiences.\n\tAbility to communicate persuasively and handle differing viewpoints effectively.\n\tProven teamwork experience and ability to follow procedures.\n\tStrong data entry and administrative skills (preferred).\n\tAbility to meet deadlines and productivity targets.\n\tExperience in a contact center environment.\n\tExcellent comprehension and adherence to instructions.\n\tKeen attention to detail and accuracy.\n\tProficiency in MS Office, especially advanced Excel, PowerPoint, and Word.\n\n\nSalary\nN300,000 - N400,000 Monthly.\n\n \n\nNote: If you are organized, results-driven, and excel in managing logistics and administrative tasks, we encourage you to apply.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Operations  Project Officer Job at Ibadan Business School",
    "link": "https://www.jobgurus.com.ng/jobs/view/operations-project-officer-job-at-ibadan-business-school",
    "pubDate": "Wed, 25 Jun 2025 15:17:31 GMT",
    "source": "JobGurus",
    "keyword": "ibadan business school",
    "duplicate": false,
    "classifications": [],
    "content": "Ibadan Business School (RC: 972642) was incorporated on the 17th day of August, 2011 under the Company and Allied Matters Act 1990 of the Federal Republic of Nigeria with the primary objective of promoting the growth and advancement of business education within and outside Africa. The School is also licensed by the Centre for Management Development (CMD) of Nigeria- the operational arm of the Nigerian Council for Management Development (NCMD) which is the statutory body charged with the responsibility of regulating the standards of Training and Development Institutions in Nigeria.\n\nWe are recruiting to fill the position below:\n\nJob Position: Operations  Project Officer\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Locations: Ibadan - Oyo and Ilesa - Osun\nEmployment Type: Full-time\n\nRequirements\n\n\n\tHND / BSc Degree in any discipline\n\tMinimum of 3 years of post qualification experience in a similar role\n\tExcellent written and oral communication skills.\n\tProficiency in the use and deployment of relevant ICT applications.\n\tRelevant experience in community based development projects is an added advantage.\n\n\nMethod of Application\nInterested and qualified candidates should forward their applications and CVs to: jobs.evergreenrecruitment@gmail.com using the Job Position as the subject of the mail. \n\nNote\n\n\n\tCandidates must indicate boldly the position applied for as the subjectof their emails\n\tOnly shortlisted candidates will be contacted.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Restaurant Manager Job at Jobvet Services",
    "link": "https://www.jobgurus.com.ng/jobs/view/restaurant-manager-job-at-jobvet-services-6",
    "pubDate": "Wed, 25 Jun 2025 15:17:31 GMT",
    "source": "JobGurus",
    "keyword": "jobvet services",
    "duplicate": false,
    "classifications": [],
    "content": "Jobvet Services - Our client, a Reputable Restaurant, is recruiting to fill the position below:\n\nJob Position: Restaurant Manager\n\nJob Location: Wuse Zone 4, Abuja (FCT) \nEmployment Type: Full-time\n\nResponsibilities\n\n\n\tOversee daily restaurant operations and ensure smooth service delivery\n\tManage staff, schedules, and inventory to meet business goals\n\tEnsure high-quality customer service and satisfaction\n\tMaintain compliance with health, safety, and hygiene standards\n\n\nRequirements\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tCandidates should possess a Bachelor's Degree / HND / NCE or OND qualification\n\tMinimum of 2 years of experience in restaurant management and operations.\n\tAge Range (27-35)\n\tStrong leadership and communication skills\n\tAbility to work in a fast-paced environment\n\tProven track record in team management and customer service\n\n\nSalary\nN150,000 - N200,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their Applications to: jobvet24@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Procurement Specialist I Job at Medbury Medical Services",
    "link": "https://www.jobgurus.com.ng/jobs/view/procurement-specialist-i-job-at-medbury-medical-services",
    "pubDate": "Wed, 25 Jun 2025 15:17:31 GMT",
    "source": "JobGurus",
    "keyword": "medbury medical services",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Medbury Pharmaceuticals is a division under the larger Medbury Healthcare group. They specialize in manufacturing globally?standard medications such as: Artemether?Lumefantrine, Ciprofloxacin, Metronidazole, Paracetamol, and condoms (Safex), and distributing these pharmaceuticals and medical supplies to healthcare providers, hospitals, clinics, and pharmacies across Nigeria. Their production facilities hold CE, ISO, and TVU certifications, and all products are NAFDAC-registered.\n\nWe are recruiting to fill the position below:\n\nJob Position: Procurement Specialist I\nJob Location: Ajah, Lagos\n\nAbout the Role\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are hiring a skilled and proactive Procurement Specialist to support our supply chain operations at our pharmaceutical facility in Ajah, Lagos.\n\tThis role requires someone with a solid understanding of pharmaceutical purchasing processes, vendor relations, and compliance with both internal and regulatory standards.\n\tThe ideal candidate will ensure the continuous availability of high-quality materials, equipment, and services essential for smooth operations and regulatory compliance.\n\n\nKey Responsibilities\n\n\n\tDevelop and implement procurement plans aligned with production schedules and business needs.\n\tSource, negotiate, and procure pharmaceutical raw materials, APIs, excipients, packaging materials, lab equipment, and services.\n\tIdentify reliable suppliers and maintain long-term vendor relationships based on trust, quality, and performance.\n\tPrepare purchase orders, track deliveries, and ensure timely supply to avoid production downtime.\n\tResolve supply chain issues, track performance of vendors, and implement corrective actions as necessary.\n\tConduct market research and cost analysis to support strategic sourcing and cost-saving initiatives.\n\tCollaborate with Quality Assurance, Regulatory, Finance, Production, and Warehouse teams to align procurement activities with operational and compliance standards.\n\tEnsure all purchases meet applicable regulatory standards including NAFDAC, PCN, and GMP requirements.\n\tMonitor inventory levels and manage reorder cycles using consumption trends and minimum stock thresholds.\n\tMaintain comprehensive procurement records and support audit and compliance reporting requirements.\n\tWork closely with clearing agents and logistics partners to manage timely importation and clearance of goods.\n\n\nRequirements\n\n\n\tBachelor’s degree in Pharmacy, Business Administration, Supply Chain Management, or any relevant field.\n\t2–5 years of proven experience in procurement or supply chain, preferably in a pharmaceutical or healthcare organization.\n\tFamiliarity with pharmaceutical materials, suppliers, GMP standards, and regulatory procedures.\n\tProficiency in Microsoft Excel and ERP platforms (e.g., SAP, Sage, Zoho).\n\tStrong negotiation, organizational, and communication skills.\n\tMust reside in Lagos, preferably in Ajah or surrounding areas.\n\tHigh attention to detail, accountability, and ability to work independently.\n\tCertifications such as CIPS, CPSM, or PMP are an added advantage.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: medpharmacareers@gmail.com using the Job Position and Location as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Sales Executive Job at HRHub.ng Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/sales-executive-job-at-hrhubng-limited",
    "pubDate": "Wed, 25 Jun 2025 15:17:31 GMT",
    "source": "JobGurus",
    "keyword": "hrhub.ng limited",
    "duplicate": false,
    "classifications": [],
    "content": "HRHub.ng Limited is a Human Resource Development & Management Consulting practice firm located in Lagos.\nSince its founding, HRHub.ng Ltd has grown to become a leader in the provision of high value human resources, business advisory as well as learning & development solutions to multinationals, local corporate organizations, governments and multilateral organizations. Our depth of our expertise, defined by carefully selected pool of multi-disciplinary consultants, ensures that we continue to be the firm of choice to our growing list of discerning clienteles.\n\nWe are recruiting to fill the position below:\n\nJob Position: Sales Executive\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Location: Victoria Island, Lagos\nEmployment Type: Full-time\n\nRequirements\n\n\n\tMust have 2-3 years of experience\n\tMust be very conversant in sales.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: recruitment@hrhub.ng using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]