[
  {
    "title": "General Manager Job at Davidorlah Farms",
    "link": "https://www.jobgurus.com.ng/jobs/view/general-manager-job-at-davidorlah-farms",
    "pubDate": "Tue, 10 Jun 2025 14:43:54 GMT",
    "source": "JobGurus",
    "keyword": "davidorlah farms",
    "duplicate": false,
    "classifications": [
      "Software Engineering"
    ],
    "content": "Davidorlah Farms is a pineapple farm estate developer and management service company that specialises in pineapple farming and distribution of all kinds of fresh fruits/healthy fruits and vegetables in Nigeria.\n\nWe are recruiting to fill the position below:\n\nJob Position: General Manager\n\nJob Location: Lekki, Lagos\nEmployment Type: Full-time\n\nRole Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThis is a full-time on-site role as a General Manager at Davidorlah Farms located in Lekki.\n\tThe General Manager will be responsible for overseeing the daily operations of the farm, managing staff, implementing strategic plans, and ensuring the effective running of all farm activities to meet production goals.\n\n\nQualifications\n\n\n\tBachelor's or Master's Degree in Agriculture, Agribusiness, or related field\n\tExperience in agribusiness management and operations\n\tLeadership and team management skills\n\tKnowledge of modern agricultural techniques and practices\n\tExcellent communication and interpersonal skills\n\tFinancial management and budgeting skills\n\tExperience working.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to:  faith@davidorlahfarms.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Female Receptionist Job at Idyllic Technologies Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/female-receptionist-job-at-idyllic-technologies-limited",
    "pubDate": "Tue, 10 Jun 2025 14:43:54 GMT",
    "source": "JobGurus",
    "keyword": "idyllic technologies limited",
    "duplicate": false,
    "classifications": [],
    "content": "Idyllic Technologies is Nigeria's Leading renewable energy company that is focused on the distribution of high quality renewable products from OEM.\n\nWe are recruiting to fill the position below:\n\nJob Position: Female Receptionist\n\nJob Location: Oregun / Olusosun Bus Stop, Lagos\nEmployment Type: Full-time\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tGreet and welcome visitors in a professional manner\n\tAnswer, screen, and forward incoming phone calls\n\tMaintain office security by following safety procedures and controlling access via the reception desk\n\tSchedule appointments and manage meeting room bookings\n\tProvide basic and accurate information in person and via phone/email\n\tReceive, sort, and distribute daily mail and deliveries\n\tMaintain a tidy and presentable reception area\n\tPerform other clerical receptionist duties such as filing, photocopying, and data entry\n\tAssist with administrative tasks as needed by other departments.\n\n\nSalary\nN100,000 - N150,000 / Month.\n\nMethod of Application\nInterested and qualified candidates should send their applications to: support@idyllictechnologies.com using the Job Position  as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Field Collection Officer / Recovery Officer Job at Pennylender",
    "link": "https://www.jobgurus.com.ng/jobs/view/field-collection-officer-recovery-officer-job-at-pennylender",
    "pubDate": "Tue, 10 Jun 2025 14:43:54 GMT",
    "source": "JobGurus",
    "keyword": "pennylender",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Pennylender is a credit finance house typically provides a range of financial services, including credit facilities, and We specialize in evaluating credit risk, managing loan portfolios, and offering financial solutions tailored to our clients' needs. With a focus on assessing creditworthiness and providing access to capital,we play a crucial role in facilitating economic growth and supporting financial stability within the community\n\nWe are recruiting to fill the position below:\n\nJob Position: Field Collection Officer / Recovery Officer\n\nJob Location: On The Field\nContract Type: Full-Time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tCollection Officers are responsible for recovering loan payments from clients.\n\tThis involves regular field visits, negotiation, and follow-up to ensure timely loan repayments and minimize portfolio at risk.\n\n\nKey Responsibilities\nDebt Recovery:\n\n\n\tVisit defaulted clients at their addresses.\n\tCommunicate tactfully to negotiate repayment plans.\n\tIssue reminders and warning notices as needed.\n\n\nMonitoring & Reporting:\n\n\n\tTrack repayments and report defaults or risks.\n\tProvide daily updates on recovery activities and field challenges.\n\n\nClient Engagement:\n\n\n\tEducate clients on the consequences of defaulting.\n\tSupport restructuring of loans where applicable (with approval).\n\n\nDocumentation:\n\n\n\tMaintain records of recovery efforts and signed agreements.\n\tEnsure all visits and conversations are logged professionally.\n\n\nRequirements\nQualifications:\n\n\n\tHND / BSc in any discipline.\n\n\nExperience:\n\n\n\t2 - 3 years of experience in a similar role, preferably in microfinance, fintech, or banking.\n\n\nSkills:\n\n\n\tMust be persistent, disciplined, and confident.\n\tMust have strong communication and negotiation skills.\n\tKnowledge of local terrain and native languages is a plus.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and Cover Letter to: career@pennylender.com using “Application for Field Collection Officer / Recovery Officer\" as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Customer Service Representative Job at TeamAce Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/customer-service-representative-job-at-teamace-limited-1",
    "pubDate": "Tue, 10 Jun 2025 14:43:54 GMT",
    "source": "JobGurus",
    "keyword": "teamace limited",
    "duplicate": false,
    "classifications": [],
    "content": "TeamAce Limited - Our client, an IT Infrastructure company, is recruiting suitable candidates to fill the position below:\n\nJob Position: Customer Service Representative\n\nJob Location: Magodo, Lagos\n\nJob Summary\n\n\n\tAs our Customer Service Representative, you will be responsible for providing exceptional service by responding to inquiries, resolving complaints, and ensuring customer satisfaction.\n\tThis role involves dealing with customers through phone, email, chat, teams, Zoom, and the use of an Incident management tool.\n\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDrive repeat purchases and long-term satisfaction by best-in-class responsiveness and professionalism in all customer interactions\n\tEffectively and efficiently supports customers on a variety of products by providing advice and guidance on the use of products and resolving issues\n\tBuilds strong working relationships internally to collaborate on solving customer issues\n\tProvide accurate information regarding the company’s products and services.\n\n\nRequirements\n\n\n\tCandidates should possess a Bachelor’s Degree in Business, Computer Science, or a related field is a plus.\n\tA minimum of 2-3 years of relevant experience in a customer service role.\n\tProficiency in CRM software, Microsoft Office suite, and other customer service tools.\n\n\nSalary\nN250,000 - N300,000 / Month.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Assistant Hotel Manager Job at Vista Lux Hospitality & Resorts",
    "link": "https://www.jobgurus.com.ng/jobs/view/assistant-hotel-manager-job-at-vista-lux-hospitality-resorts",
    "pubDate": "Tue, 10 Jun 2025 14:43:54 GMT",
    "source": "JobGurus",
    "keyword": "vista lux hospitality & resorts",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Vista Lux Hospitality & Resorts is a modern and elegant hospitality brand built with the purpose of delivering unforgettable experiences to both local and international guests. We specialize in creating a peaceful and luxurious environment where relaxation meets comfort. Whether it's a weekend getaway, a business trip, or a family vacation, we provide well-designed spaces, top-class customer service, and a warm atmosphere that makes every guest feel special.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nOur services include high-end hotel accommodation, resort-style experiences, event hosting, tour packages, and travel support. Every branch of VistaLux is carefully planned to reflect beauty, class, and comfort. From our stylish rooms and delicious cuisine to our friendly staff and clean environment, we always put our guests first. At VistaLux, we don’t just offer hospitality, we create a lifestyle of ease, peace, and luxury. Our goal is to become one of the leading hospitality names that people trust, love, and look forward to. Whether you’re a traveler, tourist, or partner, VistaLux is where comfort meets elegance.\n\nWe are recruiting to fill the position below:\n\nJob Position: Assistant Hotel Manager\n\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\n\nJob Brief\n\n\n\tWe are looking for an experienced Hotel Manager to oversee the daily operations of our hotel as well as provide strategic direction.\n\tYou will plan and supervise the activities of an extensive and diverse workforce to ensure the smooth and profitable running of business.\n\tIt is important for the hotel manager to be involved in all aspects of the hotel operations. You will be just as responsible for dealing with complaints as for strategizing and preparing reports. You will be a key person of reference for employees and clients as well as external vendors.\n\tThe hotel manager must be able to guide the employees to work as a well-functioning team. Therefore, the ideal candidate will be a team player and an effective leader, able to set examples and foster a climate of cooperation.\n\tThe goal is to enhance customer dedication and expand our clientele by strengthening our hotel’s reputation.\n\n\nResponsibilities\n\n\n\tSupervise work at all levels (receptionists, kitchen staff, maids, office employees etc.) and set clear objectives\n\tPlan activities and allocate responsibilities to achieve the most efficient operating model\n\tManage budgets/expenses, analyze and interpret financial information and monitor sales and profits\n\tDevelop and implement an intuitive and efficient marketing strategy to promote the hotel’s services\n\tCommunicate with customers when appropriate (welcome them in the facilities, address their complaints, find solutions to problems, offer information etc.)\n\tDeal with maintenance issues, shortages in staff or equipment, renovations etc.\n\tCollaborate with external parties such as suppliers, travel agencies, event/conference planners etc.\n\tInspect facilities regularly and enforce strict compliance with health and safety standards\n\n\nRequirements and Skills\n\n\n\tDegree in Business Administration, Hotel / Hospitality Management or a relevant field is a plus.\n\tFluency in English; knowledge of other languages is a plus\n\tUnderstanding of all hotel management best practices and relevant laws and guidelines\n\tWorking knowledge of MS Office.\n\tExcellent customer service skills as well as a business mindset\n\tDemonstrable aptitude in decision-making and problem-solving\n\tReliable with an ability to multitask and work well under pressure\n\tOutstanding leadership skills and a great attention to detail.\n\n\nSalary\nN200,000 - N250,000 / month.\n\nMethod of Application\nInterested and qualified candidates should send their CVs to: vistaluxhr@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]