[
  {
    "title": "Mechanical Engineer Job at Shomas Supply & Logistics Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/mechanical-engineer-job-at-shomas-supply-logistics-limited",
    "pubDate": "Fri, 06 Jun 2025 15:14:02 GMT",
    "source": "JobGurus",
    "keyword": "shomas supply & logistics limited",
    "duplicate": false,
    "classifications": [],
    "content": "Shomas Supply and Logistics Limited (formerly Shomas Supply and Logistics Nigeria Limited, is a fully integrated company registered with the Corporate Affairs Commission (CAC) of the Federal Republic of Nigeria under the Companies and Allied Matters Act of 1990. Since our establishment in 2009 as a general contractor, Shomas Supply and Logistics Limited has provided a wide range of services, including Procurement,Logistics,Marine services,Consultancy services (Security support, Manpower supply), Fabrication, Pipeline construction and maintenance, Environmental services (Reverse Osmosis, WasteManagement, Oil spill remediation).\n\nWe are recruiting to fill the position below:\n\nJob Position: Mechanical Engineer\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Location: Warri, Delta\nJob Type: Full Time (Onsite)\n\nJob Summary\n\n\n\tWe are seeking a skilled Mechanical and Process Engineer to join our dynamic team in Warri, Delta State.\n\tIn this role, you will design, develop, oversee, and maintain various construction and engineering projects within the oil and gas sector.\n\tYou will collaborate with multidisciplinary teams to ensure safety, sustainability, and timely completion of projects.\n\n\nRequirements\n\n\n\tCandidates should possess a B.Sc. or HND in Mechanical Engineering with 5-10 years of Technical and Mechanical Engineering experience.\n\tStrong proficiency in mechanical design, analysis, and maintenance of industrial machinery.\n\tHands-on experience in upstream and downstream oil & gas production processes.\n\tSkilled in maintenance and repair of compressors, pumps, turbines, and wellhead equipment.\n\tInvolved in design and implementation of facility modifications and mechanical systems.\n\tCertified in safety procedures (minimum Level 3) with a strong commitment to HSE standards.\n\tExperienced in equipment installation, servicing, and pipeline integrity management.\n\tCompetent in project management including planning, scheduling, budgeting, and cost estimation.\n\tKnowledge of contract management, risk assessment, and thorough reporting/documentation.\n\tProficient in AutoCAD, SolidWorks, and other CAD software.\n\tExperienced in Finite Element Analysis (FEA) and Computational Fluid Dynamics (CFD) tools.\n\n\nSalary and Benefits\n\n\n\tN250,000 - N400,000 / Month\n\tHMO\n\tPerformance bonuses, etc.\n\n\nNote: At Shomas, we are an equal opportunity employer, who offers a dynamic work environment that fosters collaboration, innovation, and professional growth.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Business TV Reporter Job at BusinessDay Media Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/business-tv-reporter-job-at-businessday-media-limited",
    "pubDate": "Fri, 06 Jun 2025 15:14:02 GMT",
    "source": "JobGurus",
    "keyword": "businessday media limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "BusinessDay is West Africa’s leading provider of business intelligence and market-moving news, delivering accurate information about the continent’s business and finance environment. Established in 2001, we have consistently helped millions stay ahead with the latest trends, opportunities, and challenges. Our platform spans web and digital media, print, BusinessDay Conferences and Events, and the BusinessDay Research and Intelligence Unit. Join us in shaping the future of finance in West Africa and beyond with comprehensive business news and analysis.\n\nWe are recruiting to fill the position below:\n\nJob Position: Business TV Reporter\n\nJob Location: Lagos\n\nRole Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThis is a full-time on-site role for a Business TV Reporter located in Lagos. The Business TV Reporter will be responsible for covering business news and events, reporting on market trends, conducting interviews, writing and preparing scripts, and delivering live broadcasts.\n\tThe role also includes generating content for press releases and collaborating with team members to ensure accurate and insightful reporting.\n\n\nQualifications\n\n\n\tBachelor's degree in Journalism, Communications, or related field\n\tExperience in the finance or business sector is a plus\n\tReporting and Journalism skills\n\tWriting and Broadcasting skills\n\tExcellent verbal and communication skills\n\tAbility to work in a fast-paced environment and meet tight deadlines.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: ifeoma.williams@businessday.ng using Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Senior Contracts Engineer / Senior Buyer Job at Amaiden Energy Nigeria Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/senior-contracts-engineer-senior-buyer-job-at-amaiden-energy-nigeria-limited",
    "pubDate": "Fri, 06 Jun 2025 15:14:02 GMT",
    "source": "JobGurus",
    "keyword": "amaiden energy nigeria limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Amaiden Energy Nigeria Limited (formerly Moody International Nigeria Limited) was established in 1996 as a partnership between Moody International Group and Nigerian investors. Since commencing operations in March 1997 the company continues to grow and exerts its presence in numerous Projects in the Nigeria Oil and Gas Industry.\n\nWe are recruiting to fill the position below:\n\nJob Position: Senior Contracts Engineer / Senior Buyer\n\nJob Location: Lagos\nJob type: Contract\n\nDescription\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Service holder ensures compliance - Ensure that all local contracts personnel under his/her supervision is in line with the company’s standardized norms and codes of conduct\n\tEnsure compliance of the purchasing process with all internal Company rules (including guide to\n\tconduct) and all applicable laws and regulation (JV rules, Country laws...)\n\tEnsure the application of COMPANY and/or affiliate General Terms and Conditions for purchase of equipment\n\tEnsure the good administration and filing of all the purchasing documents and ensure that all approvals, justifications, circulation forms etc... are filed in line with the applicable procedures.\n\tEnsure that all purchasing activities meet audit requirements in order to minimize any potential partner/audit claims or court actions.\n\tThe Service holder liaises with other teams and participates to the processes and communication of the contracts entity by performing the following tasks Work closely with the DUET counterpart to create the contracts dossier, maintain a clear definition of contractual responsibilities and discuss the agenda including:\n\t\n\t\tPreparation of contracts strategy\n\t\tNegotiation and analysis of commercial bids\n\t\tPreparation of recommendations to award in all Call for Tenders - Participate in the TGP CATMAN network\n\t\tEnsure that all insurance issues of company assets and personnel are dealt with\n\t\tSupervise and train contract engineers and Graduate contracts engineers\n\t\tDefine the workload of his/her team\n\t\tEnsure the update of the contracts management tool\n\t\tKeep informed of best practices in contracts procedures in other entities and affiliates for improvement of contracts practices in his/her affiliate - Use frame agreements FALTC signed by headquarters.\n\t\n\t\n\n\nThe Service holder executes the following contracts activities:\n\n\n\tPrepare and maintain an up-to-date list of qualified contractors / suppliers / potential tenders/contracts with updated information in order to perform market studies; analyze and assess all possible answers from the market\n\n\nParticipate to the validation of the contracts strategy through:\n\n\n\tArranging and attending Contracts Committee Meetings\n\tPre-qualifying bidders\n\tContributes and ensures criteria for evaluation are apt\n\tCreation of CFT commercial documents\n\tPreparation and issuance of call for tender to contractors and suppliers on the bidders list\n\tEnsure the preparation and send out the dossiers of pre-consultation and Standard or Complex invitations to bid\n\tVerify the alignment with HSE clauses, Company rules, Procedures, Instructions and applicable legislation when issuing all technical contracts and when drafting contractual and commercial terms and conditions\n\tVerify the Terms & Conditions (standard, general and financial)\n\tParticipate in the establishment of the technical, contractual and commercial agreements of complex contracts\n\tConduct the Terms & Conditions bid analysis and negotiation\n\tConduct the commercial bid analysis and negotiation thereby creating a clear definition of responsibilities and documents together with the DUET\n\tParticipate in Recommendation to award (RTA) through contract committee/DOA and award validation where he/she evaluates RTAs\n\tHandle the approval from authorities and partners, clarification of rights and obligation of signing parties and the signature process of formal documents\n\tEnsures that own contracts are created and managed in UNISUP and AGORA, ensure effective use of tools and systems (Ariba, NIPEX, REX+, AGORA) for optimum productivity.\n\tEnsure the handover of contracts to the Métier Partner\n\tAssist the head of contracts in the settlement of claims and lawsuits, in relation with the Juridical, Insurance, Finance and TGP Directors by proposing strategies and actions and participating to the negotiations\n\tMonitor contractor’s performance with Duet, promoting and attending service quality meetings, claims, amendments and contract renewal discussions with contractor and manage and maintain a network with Stakeholders such as NAPIMS, NCD, Department of Petroleum Resources, etc.\n\n\nThe Service holder executes the following purchasing activities:\n\n\n\tHandles Purchases in the Lab Office designated to him through PR assignment\n\tAnalysis all Purchase Requisitions for adequate material specification, budget authorizations and cost centres to which the purchases are being charged\n\tReviews all PRs assigned, Group requisitions to reduce process costs, compile tender packages and organize call for tender / request for quotation, ensure the use of e- sourcing tools - Answer to tenderers requests for clarification\n\tStudy, compare and evaluate offers in order to have the most economical and contractual advantageous conditions\n\tTo optimize by all means possible by bringing his professional experience to bear, Purchases with emphasis on making Savings for the Company\n\tPay attention to TUCN General Conditions and terms of purchase to ensure the Company is not exposed to legal liabilities.\n\tOrganize and lead negotiations with suppliers associated with award and performance of POs Issue RTAs in Duet with Métier Partners\n\tWhere applicable to clearly state in purchase orders QA/QC requirements (in the form of Mill/Test\n\tCertificates, MSDS, other certificates).\n\tEnsure the follow-up of purchase orders until complete reception and payment\n\tEnsure rapid and correct validation of PO’s\n\tEnsure reception of acknowledgement of receipt for PO’s from suppliers\n\tEnsure Suppliers’ deliveries on time\n\tFollow-up of goods receipt until affiliate’s central warehouse.\n\tNegotiate and solve all changes leading to amendment from Métier Partners or suppliers/contractors\n\tClarify discrepancies between material received and orders, if any with suppliers\n\tInput all purchase data in SAP.\n\n\nAccountabilities\n\n\n\tEnsure 100% compliance to COMPANY rules, SOX and local rules\n\tEnsures the establishment of suitable lists of potential bidders in accordance with vendor management policies and procedures to obtain good value for money.\n\tEnsures contracts are drafted in accordance with approved model which reflect to company’s ethic policy, procedure thereby minimizing company’s exposure to risk.\n\tContributes during negotiation either for dispute resolution and claim settlement or for generation of saving.\n\tMentors Contracts Engineers, Buyers, Contracts Administrators\n\n\nJob Requirements\n\n\n\tA degree in Engineering, Management or Social Sciences (preferably Supply Chain)\n\t7 years of work experience (preferably in Oil and Gas Industry) of which 3 should be in contract administration.\n\tMembership of relevant professional bodies in the Supply Chain and in Operational functions will be an added advantage.\n\tDemonstrable general knowledge and understanding of commercial, legal and insurance issues affecting the company in general.\n\tGood command of English language and excellent communication skills.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Facility Maintenance Manager Job at Warri Wetland Hotel",
    "link": "https://www.jobgurus.com.ng/jobs/view/facility-maintenance-manager-job-at-warri-wetland-hotel",
    "pubDate": "Fri, 06 Jun 2025 15:14:02 GMT",
    "source": "JobGurus",
    "keyword": "warri wetland hotel",
    "duplicate": false,
    "classifications": [],
    "content": "Warri Wetland Hotel is a 3-Star hotel popular for its stimulating grandeur. The hotel is located in the oil-rich city of Warri, precisely at Mofor Junction, DSC Express Udu-Warri, Delta State, Nigeria. It boasts lavishly furnished rooms in categories ranging from Deluxe, Executive, Executive Deluxe, Executive Suites and Presidential Suites. All rooms have comfortable king size beds, air conditioners, LCD TV, refrigerators, work desks and en-suite bathrooms decked in marble. Guests in the Executive Deluxe rooms can have a view of the pool and the city from the rooms. Deluxe, Executive and Presidential Suites have private balconies. Some rooms also offer complimentary breakfast. The Company has been in operations for over 9 years.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Facility Maintenance Manager\nJob Location: Delta\nEmployment Type: Full-time\n\nJob Description\n\n\n\tThe Facilities Manager is responsible for overseeing the maintenance and functionality of our hotel's physical assets and infrastructure.\n\tThis role involves managing maintenance teams, coordinating repair and maintenance projects, and ensuring a safe, comfortable environment for both guests and staff.\n\n\nResponsibilities\n\n\n\tCoordinate maintenance tasks and repairs to ensure the proper functioning of the hotel's facilities.\n\tManage a team of maintenance staff and external vendors to execute maintenance projects.\n\tEnsure compliance with safety regulations, conduct regular safety inspections, and address potential hazards promptly.\n\tIdentify and implement energy-saving initiatives to reduce utility costs and promote sustainability.\n\tCollaborate with external contractors and suppliers to ensure timely and quality service delivery.\n\tDevelop and maintain emergency response plans for various scenarios.\n\tAssist in budget planning and management related to facilities maintenance and repair.\n\tObtain quotes and proposals from contractors for maintenance projects.\n\tAddress guest concerns related to facilities promptly and professionally.\n\tManage vendor relationships and contracts effectively.\n\n\nRequirements\n\n\n\tDegree in Facilities Management, Engineering, or a related field is preferred.\n\tProven experience in facilities management or a similar role, preferably in the hospitality industry.\n\tStrong leadership and team management skills.\n\tKnowledge of building systems, equipment, and maintenance practices.\n\tExcellent organizational and multitasking abilities.\n\tStrong communication and interpersonal skills.\n\tProficiency in using computerized maintenance management systems (CMMS) is a plus.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: gm.warriwetlandhotel@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]