[
  {
    "title": "Cashier / Reconciliation Officer Job at Guaranty Business Solutions",
    "link": "https://www.jobgurus.com.ng/jobs/view/cashier-reconciliation-officer-job-at-guaranty-business-solutions",
    "pubDate": "Fri, 20 Jun 2025 13:27:51 GMT",
    "source": "JobGurus",
    "keyword": "guaranty business solutions",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Guaranty Business Solutions - Our client, a reputable Bar and Restaurant, is recruiting suitable candidates to fill the position below:\n\nJob Position: Cashier / Reconciliation Officer\nJob Location: Surulere, Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tOur client is seeking a diligent and trustworthy Cashier/Reconciliation Officer to manage daily cash handling, maintain accurate records of financial transactions, and reconcile inventory and sales reports for our bar and restaurant.\n\tThe ideal candidate will be responsible for ensuring transparency, accountability, and consistency across all cash and stock operations.\n\n\nKey Responsibilities\n\n\n\tReceive and process all payments (cash, POS, transfers) from customers.\n\tMaintain accurate and up-to-date records of all transactions.\n\tReport any inconsistencies or discrepancies in inventory or cash records.\n\tPrepare daily and weekly reconciliation reports for management.\n\tReconcile daily sales against inventory consumption for both the bar and restaurant.\n\tWork closely with kitchen and bar staff to verify stock usage and sales.\n\tMonitor stock movement and flag potential losses, breakages, or misuse.\n\tEnsure the cash register is balanced at the beginning and end of shifts.\n\tAssist in periodic stock counts and audits.\n\tAdhere strictly to internal controls and accounting standards.\n\tEnsure receipts and invoices are properly filed and organized.\n\n\nRequirements\n\n\n\tMinimum of SSCE with strong numeracy and record-keeping skills.\n\tProven experience in cash handling or bookkeeping in a bar/restaurant or similar environment.\n\tProficient in basic Excel or accounting software is an added advantage.\n\tMust reside in or close to Surulere, Lagos.\n\tHigh level of integrity and attention to detail.\n\tAbility to work with minimal supervision.\n\tGood communication and interpersonal skills.\n\n\nSalary\nN50,000 per month. \n\nMethod of Application\nInterested and qualified candidates should send their CV and Cover Letter to: grpmesg@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Openings at Filmhouse Cinemas Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-filmhouse-cinemas-limited-1",
    "pubDate": "Fri, 20 Jun 2025 13:27:51 GMT",
    "source": "JobGurus",
    "keyword": "filmhouse cinemas limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Filmhouse Cinemas Limited is a dynamic film exhibition company. Our expertise are in the areas of: Cinema operations, management of sites, Ownership of sites, Consultancy for cinema development, Design Fit-out; Cinema project management, Film Distribution: Rights Acquisition, Booking into cinemas, and content development.\n\nWe are recruiting to fill the following positions below:\n\n1.) Site Auditor\n\nJob Locations: Victoria Island, Lagos\nEmployment Type: Full-time\n\nJob Description\nEssential Duties and Key Responsibilities include the following and other duties as may be assigned:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDetect signs of fraud, irregularities, or unauthorized activities within the site and escalate accordingly.\n\tReal time monitoring of sales and general operational activities.\n\tDrive revenue & cost efficiency; and ensure processes & procedures are followed in the day-to-day operations, escalating all exceptions to Internal Audit appropriately.\n\tConduct independent verification, audit and reconciliation of Daily Sales with all relevant reports (Cash, POS, Bank transfers and other Online Payments), add notes on observed variances in the daily CASH & POS report to Finance.\n\tReconciliation of all POS merchant copies by bank and report accordingly. Follow up with Support Office (SO) on resolution of charge back with the banks and report eventual settlement.\n\tVerification and sighting of all inventory items that are supplied to the site and signing appropriate document.\n\tResponsible for validating the cash evacuation process. This includes verification with the BM before the drop off and reconciling the accuracy of the figures. This also includes examining and verifying with the cash book and receipt book and reporting to Finance on banking days, and escalating exceptions to Internal Audit promptly.\n\tVerify, and document all cube bookings, all forms of rentals/hires and escalate all unethical and fraudulent practices suspected or observed at the Cinema to Internal Audit Department.\n\tConduct daily stock counts and independent weekly stock counts and reconciliations.\n\tConduct daily spontaneous cash drops for team members and complete cash till reconciliation.\n\tComplete cash count report/certificate to be sent monthly to Finance.\n\tManagement and authorization of petty cash expenses, and preparation of Petty Cash Report to be sent to Internal Audit for approval.\n\tDaily count of all cash items in both safes with the BM/CM, vouching it against the Cash Count Certificate, Close Out Sheet and Daily Sales Report from Sales Ticketing System and signing off the Safe Reconciliation Sheet and Bank Logs, reporting all exceptions noted promptly to Internal Audit.\n\tDaily reconciliation of vouchers in safe, emergency tickets and all redemptions, confirming validity and accuracy of transaction.\n\tResponsible for site POS activity in conjunction with the Support Office Revenue Assurance Team, by ensuring they are in good working conditions, with the right POS bank mix. And ensuring availability of printing papers always.\n\tEnsure the financial information and assets of the company are well protected, preserved with confidentiality and available to the right people in the right format and time.\n\n\nOther Duties:\n\n\n\tSupport the finance department with monthly financial reconciliation process\n\tSupport filling of statutory remittances and Internal Audit processes in conjunction with SO.\n\tRelate with Audit/Finance on Fixed Asset replacement/movement by reporting asset movements.\n\tCollaborating with security agencies to facilitate arrest of fraudsters, upon instruction from the support office.\n\n\nQualifications\n\n\n\tMinimum of HND / B.Sc Degree with at least 2 years of relevant experience.\n\tKnowledge of accounting theories, principles, methods, practices, and terminology in a multidisciplinary and multi-functional environment.\n\tGood Microsoft Office, excel and power point usage.\n\n\nAdditional Information\nKey Skills & Competencies Requirements:\n\n\n\tJob knowledge – In-depth knowledge about financial accounting principles and processes.\n\tPlanning and Organizational Skills - Ability to marshal resources (people, funding, material, support) to get things done; multi-task and use resources effectively and efficiently.\n\tTime management & organisation- Ability to meet deadlines and prioritise\n\tCommunication Skills - Excellent written and oral communication skills. Will need to be able to communicate complex information in a clear and understandable way.\n\tAnalytical skills - demonstrates the ability to picture, articulate, and solve multiple problems and concepts and make decisions that are reasonable and based on available information.\n\tExcellent report writing and presentation skills\n\tDaily count of all cash items in both safes with the BM/CM, vouching it against the Cash Count Certificate, Close Out Sheet and Daily Sales Report from Sales Ticketing System and signing off the Safe Reconciliation Sheet and Bank Logs, reporting all exceptions noted promptly to Internal Audit.\n\tDaily reconciliation of vouchers in safe, emergency tickets and all redemptions, confirming validity and accuracy of transaction.\n\tResponsible for site POS activity in conjunction with the Support Office Revenue Assurance Team, by ensuring they are in good working conditions, with the right POS bank mix. And ensuring availability of printing papers always.\n\tEnsure the financial information and assets of the company are well protected, preserved with confidentiality and available to the right people in the right format and time.\n\n\nClick here to apply online\n\n \n\n2.) HSE Officer\n\nJob Locations: Victoria Island, Lagos\nEmployment Type: Full-time\n\nJob Description\n\n\n\tDevelop HSE Processes and Procedures and drives implementation and standards across the Filmhouse group operations.\n\tReview and maintain internal Documentation Process.\n\tProvide HSE Leadership and coordinate HSE related training programs and operational support to all levels where required.\n\tResponsible for all aspects of incident investigation including verifying root cause and recommendations for implementation and preventing a reoccurrence.\n\tWorks closely with the Facility/development team on special projects involving construction, equipment design, hazardous assessments and maintenance. 6. Maintains current working knowledge of all applicable HSE regulations.\n\tResponsible for Audit and Inspection Process for all areas of operations to ensure compliance.\n\tReport writing for board quarterly risk review.\n\tDevelops Monthly Mock drill scenarios and reviews feedbacks from drill report for all locations.\n\tEnsures emergency response systems, policies and procedures are in place to manage emergency situations and is maintained.\n\n\nQualifications\n\n\n\tMinimum of BSc Degree in any Science or Social Science related Course.\n\tMinimum experience (number of years) required to perform on the role\n\tMinimum of 5 years+ experience in health and safety (e.g in the hospitality and/or construction industry).\n\tCertifications in Health and Safety Courses (such as NEBOSH IGC 1 and 2, First Aid, etc.\n\n\nClick here to apply online\n\n \n\n \n\n3.) Driver\n\nJob Location: Island, Lagos\n\nJob Description\n\n\n\tDriving staff daily to their desired destinations\n\tMaintaining the vehicle safe and clean\n\tUsing navigation apps to determine the best route.\n\n\nQualifications\n\n\n\tProven experience as a Driver\n\tA valid driver’s license\n\tA clean driving record\n\tFamiliarity with GPS devices\n\tKnowledge of area roads and neighborhoods\n\tAvailability to occasionally take weekend and night shifts\n\tA polite and professional disposition\n\tMust reside in Lekki Phase 1.\n\n\nClick here to apply online    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Customer Service Representative (Ticketing) Job at GUO Transport Company Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/customer-service-representative-ticketing-job-at-guo-transport-company-limited",
    "pubDate": "Fri, 20 Jun 2025 13:27:51 GMT",
    "source": "JobGurus",
    "keyword": "guo transport company limited",
    "duplicate": false,
    "classifications": [],
    "content": "GUO Transport Company Limited - Founded in 1980, GUO Transport Company Limited is a division of G. U. Okeke & Sons Ltd. A household name in the transportation industry and one of the largest provider of intercity and interstate transportation, serving more than 200 destinations across Nigeria and West Africa with a modern, environmentally friendly fleet. The company has become an icon in the transportation industry, providing safe, enjoyable and affordable travel to millions of passengers annually. While GUO transport Co. is well known for its regularly scheduled passenger service, nationwide logistics solutions.\n\nWe are recruiting to fill the position below:\n\nJob Position: Customer Service Representative (Ticketing)\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Location: Awka, Anambra\nEmployment Type: Contract\n\nKey Responsibilties\n\n\n\tGreet and attend to walk-in customers in a courteous and professional manner.\n\tSell travel tickets using the company’s booking system and issue receipts.\n\tAssist with rescheduling, cancellations, or ticket upgrades in line with company policy.\n\tMaintain updated knowledge of company policies, travel routes, peak periods, and promotional offers.\n\tReconcile and account for daily ticket sales and submit sales reports to theAccounts Team\n\tProvide information on travel schedules, seat availability, destinations, and ticket fares.\n\tRespond to customer inquiries, complaints, or concerns at the terminal promptly and appropriately.\n\tEnsure proper documentation and accurate entry of customer and travel details in the system.\n\tSupport boarding processes and guide passengers when necessary.\n\tMaintain a clean and organized front desk area and ensure signage and information are up to date.\n\n\nRequirements\n\n\n\tOND / HND / BSc Degree in any discipline (preferably in Business Administration, Social Sciences, or related fields.\n\t1 - 2 years of experience in customer service, preferably in a transport, hospitality, or retail environment.\n\tGood knowledge of Nigerian geography and intercity transport services is an advantage.\n\tExcellent verbal communication and interpersonal skills.\n\tProficiency in using basic computer applications and booking/ticketing software.\n\tStrong attention to detail and a customer-centric mindset.\n\tAbility to work under pressure and in a fast-paced terminal environment.\n\tWillingness to work weekends, holidays, and on shift rotations as required.\n\n\nPreferred Qualities:\n\n\n\tNeat appearance and a friendly, helpful attitude.\n\tDependable, honest, and punctual.\n\tGood problem-solving skills and ability to de-escalate tense situations.\n\n\nWork schedule for this job role is as stated below:\n\n\n\t5:30am-1:30pm (morning shift)\n\t1:00pm-8:00pm (Afternoon shift)\n\tMondays to Sundays with one day off every week.\n\n\nSalary\nN70,000 - N75,000 monthly. \n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Social Media and Content Creator Job at Home Bargains Nigeria Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/social-media-and-content-creator-job-at-home-bargains-nigeria-limited-1",
    "pubDate": "Fri, 20 Jun 2025 13:27:51 GMT",
    "source": "JobGurus",
    "keyword": "home bargains nigeria limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Home Bargains Nigeria Limited is a gift and decor store situated in Abuja, Nigeria.\n\nWe are recruiting to fill the position below:\n\nJob Position: Social Media and Content Creator\n\nJob Location: Abuja (FCT)\nEmployment Type: Full-time\nWorking Schedule: Four times a week\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tIn this role, you will create engaging content to showcase our unique gift products and enhance our brand presence.\n\tYou'll be responsible for producing content for social media and promotional materials that connect with customers.\n\tIf you’re passionate about gifts and content creation, we’d love to have you on board!\n\n\nResponsibilities\n\n\n\tCreate engaging video contentfor social media platforms (Instagram, TikTok, Facebook, etc.) that showcases products, store promotions, and seasonal offerings.\n\tProduce high-quality product videos, including unboxings, demonstrations, tutorials, and customer testimonials, to highlight the unique features of gift items.\n\tDesign promotional videos and adsto support sales campaigns, new arrivals, and special events, ensuring videos are aligned with the brand’s aesthetic and goals.\n\tCollaborate with the marketing teamto develop content strategies that increase online visibility and drive traffic to the store.\n\tEdit and optimize videosfor each platform, ensuring content is tailored to platform-specific formats and engagement trends.\n\tCreate attention-grabbing video contentthat showcases store events, product launches, or exclusive offers to entice customers.\n\tDesign eye-catching promotional materials(such as banners, flyers, and social media posts) to support video content and store promotions.\n\tMonitor performance of video contentacross platforms, analyzing metrics to improve future content and drive higher sales conversions.\n\tKeep up with trendsin video marketing and social media to continuously evolve content and stay relevant to the target audience\n\tMore tasks as may be required.\n\n\nRequirements\n\n\n\tMinimum of HND qualification\n\t3 years of experience.\n\n\nSalary\nN100,000 monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV and Cover letter to: ad.homebargains@gmail.com using the Job Positionas the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Customer Service Representative Job at RevenStrat Consulting",
    "link": "https://www.jobgurus.com.ng/jobs/view/customer-service-representative-job-at-revenstrat-consulting",
    "pubDate": "Fri, 20 Jun 2025 13:27:51 GMT",
    "source": "JobGurus",
    "keyword": "revenstrat consulting",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "RevenStrat is a consultancy and advisory firm focused on helping both startups and established enterprises address their most challenging strategic issues. Our team is committed to guiding clients through disruptive market changes, helping them steer clear of pivotal business errors that could jeopardize their success.\n\nWe are recruiting to fill the position below:\n\nJob Position: Customer Service Representative\nJob Location: Ajah, Lagos\nEmployment Type: Full-time\n\nPosition Overview\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tProvide exceptional customer support and assistance to users of the company's e-commerce real estate platform.\n\tThis role focuses on resolving customer inquiries, facilitating smooth user experiences, and ensuring customer satisfaction throughout their property journey.\n\n\nKey Responsibilities\n\n\n\tRespond to customer inquiries through multiple channels including phone, email, live chat, and social media\n\tAssist customers with platform navigation, property searches, and transaction-related questions\n\tTroubleshoot technical issues and coordinate with IT team for complex platform problems\n\tProcess customer requests, account updates, and service modifications in a timely manner\n\tCollect and document customer feedback to inform product improvements and service enhancements\n\tSupport customers through the property buying/selling process by coordinating with sales and operations teams\n\tParticipate in customer service training and stay updated on product features and company policies\n\tMonitor customer satisfaction metrics and contribute to continuous improvement initiatives\n\tMaintain detailed records of customer interactions and follow up on outstanding issues\n\tProvide product information, pricing details, and guidance on platform features\n\tEscalate complex issues to appropriate departments and ensure timely resolution\n\tAssist with onboarding new customers and providing platform tutorials\n\n\nRequired Qualifications\n\n\n\tHigh school diploma or equivalent; Bachelor's degree preferred\n\t1-2 years of customer service experience, preferably in real estate, e-commerce, or technology sectors\n\tExcellent verbal and written communication skills\n\tStrong problem-solving abilities and patience in handling customer concerns\n\tProficiency in customer service software, CRM systems, and basic computer applications\n\tAbility to multitask and manage multiple customer interactions simultaneously\n\tPositive attitude and commitment to providing exceptional customer experiences\n\tBasic understanding of real estate terminology and processes preferred\n\tFlexibility to work various shifts including evenings and weekends as needed\n\tBilingual capabilities (English and local language) preferred\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: humanresources@revenstrat.com using the Job Position as the subject of the email.\n\nNote: We appreciate all applications; however, only shortlisted candidates will be contacted.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]