[
  {
    "title": "Human Resource Business Partner Job at U Connect Human Resources Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/human-resource-business-partner-job-at-u-connect-human-resources-limited",
    "pubDate": "Fri, 20 Jun 2025 12:32:19 GMT",
    "source": "JobGurus",
    "keyword": "u connect human resources limited",
    "duplicate": false,
    "classifications": [],
    "content": "U Connect Human Resources Limited is recruiting suitable candidates to fill the position below:\n\nJob Position: Human Resource Business Partner (HRBP)\nJob Location: Island, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tIn a consulting firm, the HRBP's role is not just about managing administrative tasks; it's about being a strategic partner who drives business success through effective people management.\n\tThey need to be proactive, strategic thinkers with strong communication and interpersonal skills.\n\n\nResponsibilities\nStrategic Business Partnering:\nAligning HR with Business Goals:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tHRBPs work closely with consulting teams and leadership to understand the firm's strategic objectives and develop HR strategies that support those goals.\n\n\nStrategic Consulting:\n\n\n\tThey provide expert advice to leaders on people-related matters, including talent acquisition, performance management, employee relations, and organizational development.\n\n\nBusiness Acumen:\n\n\n\tHRBPs need a strong understanding of the consulting industry, the firm's business model, and the challenges faced by consulting teams.\n\n\nTalent Management:\nRecruitment and Onboarding:\n\n\n\tThey play a key role in attracting and recruiting top talent, as well as ensuring a smooth onboarding process for new consultants.\n\n\nPerformance Management:\n\n\n\tHRBPs facilitate performance reviews, provide coaching to managers on performance management, and help develop performance improvement plans.\n\n\nTraining and Development:\n\n\n\tThey identify training needs, design and implement development programs, and support consultants' career progression within the firm.\n\n\nSuccession Planning:\n\n\n\tHRBPs work with leadership to identify and develop high-potential consultants for future leadership roles.\n\n\nEmployee Relations:\nConflict Resolution:\n\n\n\tThey mediate and resolve employee relations issues, ensuring a fair and respectful work environment.\n\n\nEmployee Engagement:\n\n\n\tHRBPs develop and implement strategies to enhance employee engagement and satisfaction, creating a positive and productive work culture.\n\n\nPolicy and Compliance:\n\n\n\tThey ensure compliance with employment laws and regulations, and advise on HR policies and procedures.\n\n\nOrganizational Development:\nChange Management:\n\n\n\tHRBPs play a crucial role in supporting organizational changes, such as mergers, acquisitions, or restructuring, by managing the people-related aspects of these changes.\n\n\nOrganizational Design:\n\n\n\tThey help optimize the firm's organizational structure and work processes to improve efficiency and effectiveness.\n\n\nTeam Building:\n\n\n\tHRBPs facilitate team building activities and initiatives to foster collaboration and improve team performance.\n\n\nData Analysis and Reporting:\nHR Metrics:\n\n\n\tHRBPs track and analyze key HR metrics to identify trends, measure the effectiveness of HR initiatives, and inform decision-making.\n\n\nReporting:\n\n\n\tThey prepare reports on HR activities and performance for leadership and other stakeholders.\n\n\nCollaboration and Communication:\nStakeholder Management:\n\n\n\tHRBPs build strong relationships with key stakeholders, including consultants, managers, and other HR professionals.\n\n\nCommunication:\n\n\n\tThey communicate HR policies, initiatives, and information to employees and managers in a clear and concise manner.\n\n\nRequirements\n\n\n\tCandidate should possess a B.Sc Degree with 2 - 5 years of work experience.\n\n\nSalary\nN200,000 - N250,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: u.connecthr@u-connect-ng.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Loan Collection Specialist Job at Comatrix Collection Service",
    "link": "https://www.jobgurus.com.ng/jobs/view/loan-collection-specialist-job-at-comatrix-collection-service",
    "pubDate": "Fri, 20 Jun 2025 12:32:19 GMT",
    "source": "JobGurus",
    "keyword": "comatrix collection service",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Comatrix Collection Service - We are a professional collection service provider that deals with helping various loan agencies in retrieving back their bad-loans as fast and effectively as possible. We make calls to customers to pay their outstanding debts, Send messages to customers, Guide customers through the payment process, Persuade reluctant customers to make payment promptly, Meet weekly and monthly targets, Give proper and correct report of work. We build a professional team with experienced collectors for every loan agency, using SMS, calls, emails, various social media platforms to remind and encourage overdue customers to make repayments. Co-matrix provides financial solutions by helping loan companies recover back bad debts.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Loan Collection Specialist\n\nJob Location: Abule-Egba, Lagos \nEmployment Type: Full-time\n\nResponsibilities\n\n\n\tMake calls to customers to pay their outstanding debt.\n\tSend messages to customers.\n\tGuide customers through the payment process.\n\tPersuade reluctant customers to make payments promptly.\n\tMeet weekly and monthly targets.\n\tGive proper and correct report of work.\n\n\nRequirements\n\n\n\tCandidates should possess relevant qualifications with 0 - 1 year of experience, with Andriod smart phone [minimum 2GB RAM].\n\tThe Ideal candidate should understand how to manage clients.\n\n\nSalary\nN50,000 - N100,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hr@comatrix-collection.com using \"Recovery Officer\" as the subject of the email.\n\nNote: For enquiries, reach us on WhatsApp via: 08085129453.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Electrical Electrician / Electrical Engineer Job at Jaykay Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/electrical-electrician-electrical-engineer-job-at-jaykay-group",
    "pubDate": "Fri, 20 Jun 2025 12:32:19 GMT",
    "source": "JobGurus",
    "keyword": "jaykay group",
    "duplicate": false,
    "classifications": [],
    "content": "Jaykay Group is a good and well known company that specializes in producing all kinds of carpets, rugs, brazil wool and other products.\n\nWe are recruiting to fill the position below:\n\nJob Position: Electrical Electrician / Electrical Engineer\n\nJob Location: Sharada, Kano\n\nRequirements\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tCandidates should possess an HND / B.Sc Degree with a lot of experience.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hrjobs@jyakaycarpets.com using the Job Position as the subject of the mail.\n\nNote: For enquiries, call: 09074700449.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Logistics Manager Job at Solidarites International (SI)",
    "link": "https://www.jobgurus.com.ng/jobs/view/logistics-manager-job-at-solidarites-international-si-1",
    "pubDate": "Fri, 20 Jun 2025 12:32:19 GMT",
    "source": "JobGurus",
    "keyword": "solidarites international (si)",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "Solidarites International (SI) is an international humanitarian NGO which, for more than 40 years, has been providing assistance to populations affected by armed conflicts and natural disasters by meeting their vital needs for food, water and shelter. Particularly involved in the fight against diseases linked to unsafe water, the first cause of death in the world, SI's interventions provide expertise in the field of access to drinking water, sanitation and hygiene promotion, but also in the essential area of food security and livelihoods. Present in around twenty countries, SI's teams - 2000 people in total made up of expatriates, national staff, permanent staff at headquarters, and a few volunteers - work with professionalism and commitment while respecting cultures.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Logistics Manager\nJob Location: Gusau, Zamfara\nEmployment Type: Full-time\n\nResponsibilities\nSupply Management:\n\n\n\tCarry out a purchasing environment analysis at the local level\n\tSupervise the update of price lists and supplier files\n\tManage the Solidarités International purchasing procedures and those from donors funding the programs.\n\tEnsure that budgetary lines related to logistics are monitored and observed\n\tSupervise the preparation of purchasing documents and draft the contracts\n\tParticipate in the drafting the call for tenders\n\tEstablish and update purchasing timelines, taking into consideration procurement tables, operation timelines and contextual and procedural logistical constraints\n\tReceive, approve and process requests for quotes and internal order forms\n\tSupervise purchasing, ensuring that approval rules and procedures are observed\n\tSelect suppliers and negotiate prices, deadlines and delivery methods\n\tEnsure that purchasing documents are complete and archived in keeping with Solidarités International procedures\n\tEnsure that dealings with suppliers are monitored\n\n\nVehicle Fleet Management:\n\n\n\tNegotiate vehicle rental contracts\n\tSupervise the planning and execution of maintenance and repair work on mission vehicles\n\tEstablish vehicle movement schedules\n\tEnsure that a complete breakdown kit is available on board all vehicles\n\tPermanently ensure that all drivers have received general training and carry out regular testing\n\tEnsure that drivers are aware of their obligation to adhere to Solidarités International safety rules and procedures\n\tCheck that vehicle log books are in place and are used correctly\n\tEnsure that fuel consumption and vehicle mileage are monitored, consolidated, analyzed and recorded\n\tPrevent the misappropriation of fuel and spare parts\n\tEnsure that all vehicles have accompanying administrative documents and that these are correctly filed and monitored\n\n\nEquipment / Telecommunications Management:\n\n\n\tUpdate inventory in real time\n\tOptimize distribution of materials according to task needs\n\tOrganize the installation, safe-guarding and monitoring of materials\n\tInstall communication means and ensure that they are regularly maintained\n\tTrain teams in the use of these communication means\n\n\nManagement and Monitoring of IT Equipment:\n\n\n\tUpdate antivirus software\n\tImplement backup and data-protection procedures\n\tEnsure the maintenance and correct use of IT equipment\n\tProvide technical assistance to teams and organize training sessions\n\n\nSupplies Management:\n\n\n\tSelect storage locations and create a plan for the development and security of these sites\n\tEnsure material is stored under suitable conditions and monitor expiration dates\n\tEnsure procedures are followed as stock is checked in and out\n\tSee that all documentation linked to stock is complete and correct\n\tSupervise monthly physical stock inventory\n\n\nHuman Resource Management:\n\n\n\tAnalyse and quantify logistics personnel needs\n\tRecruit, train and supervise the logistics team\n\tConduct performance reviews for members of the logistics team\n\tOrganize formal team meetings at regular intervals\n\n\nSecurity:\n\n\n\tImplement team safety measures as determined by the coordination team\n\tTrain teams in safety rules and procedures\n\tPass on any security-related information to his/her line manager\n\n\nReporting / Capitalisation:\n\n\n\tEnsure the compilation of price and supplier lists, as well as information in use (import-export, exemption, taxes)\n\tEnsure that internal order forms are monitored, and that the status of each order is given to the person waiting\n\tConsolidate logistics packs monthly and pass on to the logistics coordinator\n\tProvide the logistics coordinator with all information needed to draft intermediary and final reports\n\tPass on purchasing reports for closed programs to the coordinators at the established frequency\n\n\nRequirements\n\n\n\tStudies: M.Sc./B.Sc. in Logistics, Warehouse Management, Purchasing or Supply Chain Management or any related field.\n\tExperience: 3 years of relevant experience in a similar position with other INGO and at least 5 years’ experience in the humanitarian sector.\n\tLanguage: English is mandatory, working knowledge of the local dialects is an asset.\n\tIT: Good knowledge of MS Office Word, PowerPoint and advance MS Office Excel Knowledge\n\tTechnical Skills: Procurement and sourcing strategies, Inventory management, Asset management, Fleet and Transportation management, Documentation and Reporting and Premise management.\n\tTransversal Skills: Problem solving skills, Effective Communication skills, Negotiation skills, Safety and Security, Ability to work autonomously, Excellent organizational skills, Flexibility to meet deadlines and Leadership skills.\n\n\nNote\n\n\n\tSelect Logistics Manager, fill the form and attach your CV and motivation letter.\n\tThe CV attached must be named with your first name and surname.\n\tQualified female candidates are strongly encouraged to apply.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Executive Secretary Job at Farms Katsina Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/executive-secretary-job-at-farms-katsina-limited",
    "pubDate": "Fri, 20 Jun 2025 12:32:19 GMT",
    "source": "JobGurus",
    "keyword": "farms katsina limited",
    "duplicate": false,
    "classifications": [],
    "content": "The Farms Katsina Limited (RC-1481675) is a fully established agricultural entity with focus on maize flour milling, commercial farming, livestock production, etc.\n\nWe are recruiting to fill the position below:\n\nJob Position: Executive Secretary\n\nJob Location: Katsina \nEmployment Type: Full-time\n\nSummary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a competent Executive Secretary to provide essential support to our high-ranking officials.\n\tYou will play a crucial role in organizing and maintaining the executive’s schedule, as well as performing various administrative tasks.\n\tAs an Executive Secretary, you must possess exceptional time-management and multitasking skills to handle multiple responsibilities efficiently.\n\n\nResponsibilities\n\n\n\tMaintain executive’s agenda and assist in planning appointments, board meetings, conferences etc.\n\tAttend meetings and keep minutes\n\tReceive phone calls\n\tHandle and prioritize all outgoing or incoming correspondence (e-mail, letters, packages etc.)\n\tMake travel arrangements for executives.\n\tHandle confidential documents ensuring they remain secure\n\tMaintain electronic and paper records ensuring information is organized and easily accessible\n\tPrepare presentations or reports as assigned.\n\n\nRequirements and Skills\n\n\n\tFirst Degree in Business Administration or relative field\n\tAt least 5 years of proven experience as executive secretary or similar administrative role.\n\tProficient in MS Office especially word, excel and powerpoint.\n\tIn depth knowledge of office management and filing systems.\n\tExcellent organizational and time-management skills\n\tOutstanding communication and negotiation abilities\n\tIntegrity and confidentiality.\n\n\nMethod of Application\nInterested and qualified candidates should forward their CV and application letter to: thefarmsjob@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]