[
  {
    "title": "Hotel Manager Job at Efezi Southsea Nigeria Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/hotel-manager-job-at-efezi-southsea-nigeria-limited",
    "pubDate": "Mon, 07 Jul 2025 14:16:22 GMT",
    "source": "JobGurus",
    "keyword": "efezi southsea nigeria limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Established in 2009, Efezi Southsea Nigeria Limited is a hospitality consultancy firm specializing in providing expert services to small and medium-sized hotels.\n\nWe are recruiting to fill the position below:\n\nJob Position: Hotel Manager\n\nJob Location: Ijiya - Ijokoro, Lagos\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Hotel Manager is responsible for overseeing the day-to-day operations of the hotel, ensuring exceptional guest experiences, managing staff performance, maintaining profitability, and upholding the brand’s standards.\n\tThe role requires leadership, financial acumen, and operational expertise to manage all departments and drive continuous improvement.\n\n\nKey Responsibilities\nOperations Management:\n\n\n\tSupervise and coordinate activities across all departments, including front office, housekeeping, food and beverage, maintenance, and security.\n\tEnsure smooth daily operations and promptly address operational challenges.\n\n\nGuest Experience:\n\n\n\tMaintain high standards of service quality to ensure guest satisfaction.\n\tResolve customer complaints and handle special requests promptly and professionally.\n\n\nStaff Management:\n\n\n\tRecruit, train, supervise, and evaluate hotel staff.\n\tPromote teamwork, discipline, and staff motivation.\n\tSchedule staff shifts and ensure adequate coverage across all departments.\n\n\nFinancial Oversight:\n\n\n\tPrepare and manage budgets, control costs, and monitor revenues and expenses.\n\tAnalyze financial performance and implement strategies to meet profitability targets.\n\tApprove purchases, monitor inventory, and manage supplier relationships.\n\n\nSales and Marketing Support:\n\n\n\tCollaborate with the sales/marketing team to promote the hotel, boost occupancy, and increase revenue.\n\tImplement guest loyalty programs and promotional campaigns.\n\n\nCompliance and Standards:\n\n\n\tEnsure compliance with health, safety, labor laws, and hospitality regulations.\n\tUphold and enforce hotel policies, standard operating procedures (SOPs), and brand guidelines.\n\n\nFacility Management:\n\n\n\tOversee the upkeep of the hotel premises, including cleanliness, maintenance, and aesthetics.\n\tCoordinate with maintenance teams for prompt repairs and upgrades.\n\n\nReporting and Communication:\n\n\n\tProvide regular reports to owners or the board on operational, financial, and staffing matters.\n\tMaintain effective internal communication with department heads and senior management.\n\n\nRequired Qualifications & Skills:\n\n\n\tEducation: Degree or diploma in Hospitality Management, Business Administration, or related fields.\n\tExperience: 3–5+ years of experience in hotel operations or hospitality leadership roles.\n\tSkills:\n\t\n\t\tStrong leadership and decision-making abilities.\n\t\tExcellent communication and interpersonal skills.\n\t\tFinancial and analytical skills.\n\t\tCustomer service orientation.\n\t\tAbility to manage pressure and multitask.\n\t\n\t\n\n\nApplicants must reside in or around the following locations:\n\n\n\tAgbado-Crossing\n\tAbule-Egba\n\tMeiran\n\tAgbado-Ijaiye\n\tJankara\n\tAgege\n\tOgba\n\tIyana Ipaja\n\tKola\n\tTollgate\n\tOko-Aba axis.\n\n\nMethod of Application\nInterested and qualified candidates should send their Applications to: efezisouthsea2000@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Restaurant Manager Job at Marriott International",
    "link": "https://www.jobgurus.com.ng/jobs/view/restaurant-manager-job-at-marriott-international-1",
    "pubDate": "Mon, 07 Jul 2025 14:16:22 GMT",
    "source": "JobGurus",
    "keyword": "marriott international",
    "duplicate": false,
    "classifications": [],
    "content": "Marriott International is a leading global Lodging company based in Bethesda, Maryland, USA, with more than 4,100 properties in 79 countries and reported revenues of nearly $14 billion in fiscal year 2014. Its heritage can be traced to a root beer stand opened in Washington, D.C., in 1927 by J. Willard and Alice S. Marriott.\n\nMarriott has more than 361,000 people working worldwide at managed or franchised properties and corporate offices. Marriott has been consistently recognized as a top employer and for its superior business ethics. The company also manages the award-winning guest loyalty program, Marriott Rewards® and The Ritz-Carlton Rewards® program, which together surpass 49M members.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Restaurant Manager\n\nJob Location: Lagos\n\nJob Summary\n\n\n\tAreas of responsibility include Restaurants/Bars and Room Service, if applicable.\n\tSupervises daily restaurant operations and assists with menu planning, maintains sanitation standards and assists servers and hosts on the floor during peak meal periods.\n\tStrives to continually improve guest and employee satisfaction and maximize the financial performance in areas of responsibility.\n\tDetermines training needed to accomplish goals, then implements plan.\n\n\nCore Work Activities\nManaging Day-to-Day Operations:\n\n\n\tSupervises and manages employees. Manages all day-to-day operations. Understands employee positions well enough to perform duties in employees' absence.\n\tMaintains service and sanitation standards in restaurant, bar/lounge and room service areas.\n\tReviews staffing levels to ensure that guest service, operational needs and financial objectives are met.\n\n\nLeading Food and Beverage Team:\n\n\n\tUtilizes interpersonal and communication skills to lead, influence, and encourage others; advocates sound financial/business decision making; demonstrates honesty/integrity; leads by example.\n\tEncourages and builds mutual trust, respect, and cooperation among team members.\n\tServes as a role model to demonstrate appropriate behaviors.\n\tIdentifies the developmental needs of others and coaches, mentors, or otherwise helps others to improve their knowledge or skills.\n\tDevelops specific goals and plans to prioritize, organize, and accomplish your work.\n\tEnsures and maintains the productivity level of employees.\n\tProvides the leadership, vision and direction to bring together and prioritize the departmental goals in a way that will be efficient and effective.\n\tEnsures compliance with all food & beverage policies, standards and procedures by training, supervising, follow-up and hands on management.\n\tEnsures compliance with all applicable laws and regulations.\n\tEnsures compliance with food handling and sanitation standards.\n\tEnsures staff understands local, state and Federal liquor laws.\n\tEstablishes and maintains open, collaborative relationships with employees and ensures employees do the same within the team.\n\tEstablishes guidelines so employees understand expectations and parameters.\n\tMonitors alcohol beverage service in compliance with local laws.\n\n\nEnsuring Exceptional Customer Service:\n\n\n\tProvides services that are above and beyond for customer satisfaction and retention.\n\tImproves service by communicating and assisting individuals to understand guest needs, providing guidance, feedback, and individual coaching when needed.\n\tManages day-to-day operations, ensures the quality, standards and meets the expectations of the customers on a daily basis.\n\tDisplays leadership in guest hospitality, exemplifies excellent customer service and creates a positive atmosphere for guest relations.\n\tEmpowers employees to provide excellent customer service.\n\tActs as the guest service role model for the restaurants, sets a good example of excellent customer service and creates a positive atmosphere for guest relations.\n\n\nHandles guest problems and complaints:\n\n\n\tMeets with guests on an informal basis during meals or upon departure to obtain feedback on quality of food and beverage, service levels and overall satisfaction.\n\tEnsures corrective action is taken to continuously improve service results.\n\tIncorporates guest satisfaction as a component of departmental meetings with a focus on continuous improvement.\n\tManages service delivery in outlets to ensure excellent service from point of entry to departure (e.g., greeting from hostess, speed of order taking and food and beverage delivery, fulfillment of special requests, collection of payment & invitation to return).\n\n\nManaging and Conducting Human Resource Activities:\n\n\n\tProvides guidance and direction to subordinates, including setting performance standards and monitoring performance.\n\tIdentifies the educational needs of others, develops formal educational or training programs or classes, and teaches or instructs others.\n\tEnsures employees are treated fairly and equitably. Strives to improve employee retention.\n\tEnsures employees receive on-going training to understand guest expectations.\n\tSolicits employee feedback, utilizes an \"open door\" policy and reviews employee satisfaction results to identify and address employee problems or concerns.\n\tStrives to improve service performance.\n\tEnsures recognition is taking place across areas of responsibility.\n\n\nAdditional Responsibilities:\n\n\n\tProvides information to supervisors, co-workers, and subordinates by telephone, in written form, e-mail, or in person.\n\tAnalyzes information and evaluating results to choose the best solution and solve problems.\n\tAssists servers and hosts on the floor during meal periods and high demand times.\n\tRecognizes good quality products and presentations.\n\tSupervises daily shift operations in absence of Assistant Restaurant Manager.\n\tOversees the financial aspects of the department including purchasing and payment of invoices.\n\n\nCandidates Profile\nEducation and Experience:\n\n\n\tHigh school diploma or GED; 4 years experience in the food and beverage, culinary, or related professional area.\n\n\nOR\n\n\n\t2-year degree from an accredited university in Food Service Management, Hotel and Restaurant Management, Hospitality, Business Administration, or related major; 2 years of experience in the food and beverage, culinary, or related professional area.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Data Entry Officer Job at G-Shoppers",
    "link": "https://www.jobgurus.com.ng/jobs/view/data-entry-officer-job-at-g-shoppers-1",
    "pubDate": "Mon, 07 Jul 2025 14:16:22 GMT",
    "source": "JobGurus",
    "keyword": "g-shoppers",
    "duplicate": false,
    "classifications": [],
    "content": "G-Shoppers provide easy food shopping support to homes, career men, and women and business people who are faced with the challenge of being constantly away from home and have less or no time to shop as well as cook. We execute orders to supply food stuff and items such as fresh meat, sea foods, frozen, dry foods, vegetables, fruits, and prepped ready to cook food ingredients. We are based in portharcourt.\n\nWe are recruiting to fill the position below:\n\nJob Position: Data Entry Officer\nJob Location: Eliozu, Port Harcourt - Rivers\nEmployment Type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking to hire a detail-oriented and organized Data Entry Executive to join our team.\n\tThe ideal candidate will be responsible for accurately entering, updating, and maintaining data in our systems.\n\n\nResponsibilities\n\n\n\tEnter data accurately and efficiently into the company's database or information management system.\n\tEnsure all data entries are done accurately and closed out daily.\n\tReview and verify data for accuracy and completeness before submission.\n\tMaintain confidentiality of sensitive information and adhere to data protection regulations.\n\tIdentify and correct errors in data entry processes to improve efficiency.\n\tCollaborate with other team members to ensure timely completion of data-related tasks.\n\tUpdate existing records as necessary and ensure that all information is current.\n\tGenerate reports based on entered data and assist in data analysis when required.\n\tAssist in training new employees on data entry processes and best practices.\n\tPerform other administrative tasks as assigned by the supervisor.\n\n\nRequirements\n\n\n\tCandidates should possess minimum of Bachelor's Degrees with 1+ years of relevant work experience\n\tMust reside in or around Eliozu.\n\tStrong communication, memorization, and teamwork skills.\n\tCapacity to perform your duties diligently, particularly during stressful situations.\n\tShould be willing to work 25days a month\n\tShould be willing to work with the company long term.\n\n\nSalary\nN70,000 - N80,000 per month. \n\nMethod of Application\nInterested and qualified candidates should send their Applications and CV to: gshoppersinventory@gmail.com using the Job Position as the subject of the mail.\n\nNote: Candidates should indicate their location in Port Harcourt.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Senior Human Resource Manager Job at Patrisan Jozzy Recruitment",
    "link": "https://www.jobgurus.com.ng/jobs/view/senior-human-resource-manager-job-at-patrisan-jozzy-recruitment",
    "pubDate": "Mon, 07 Jul 2025 14:16:22 GMT",
    "source": "JobGurus",
    "keyword": "patrisan jozzy recruitment",
    "duplicate": false,
    "classifications": [],
    "content": "Patrisan Jozzy Recruitment - Our client, a leading Company in the Logistics industry, is recruiting to fill the position below:\n\nJob Position: Senior Human Resource Manager \n\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\n\nSummary\n\n\n\tOur client is seeking for an experienced Senior Human Resource manager with industry experience.\n\n\nResponsibilties\nThe HR manager will be responsible for:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tStrategic HR Leadership: Develop and implement HR policies, programs, and initiatives that support the company's strategic goals within the unique context of the logistics industry.\n\tTalent Acquisition & Management: Oversee the full recruitment lifecycle, with a particular focus on attracting, hiring, and onboarding qualified personnel for logistics roles, ensuring timely fulfillment of staffing needs.\n\tEmployee Relations: Manage and resolve complex employee relations issues, fostering a fair, consistent, and positive working environment. Provide guidance to management and employees on disciplinary actions, grievances, and conflict resolution.\n\tPerformance Management: Implement and manage performance appraisal systems, ensuring fair and effective evaluation, feedback, and development plans for all staff, including performance metrics relevant to logistics operations.\n\tCompensation & Benefits: Administer compensation and benefits programs, ensuring competitiveness and compliance with labor laws, including specific considerations for various logistics roles.\n\tTraining & Development: Identify training needs specific to the logistics sector and coordinate professional development programs.\n\tCompliance & Safety: Ensure compliance with all national and local labor laws and industry-specific regulations. Collaborate with operations to reinforce a strong safety culture and manage HR aspects of workplace safety in a logistics environment.\n\tHR Operations: Manage HR administrative functions, maintain accurate employee records, and leverage HR technology for efficiency.\n\n\nRequirements\n\n\n\tBachelor's Degree in Human Resources Management, Business Administration, or a related field.\n\tMinimum of 5 years of progressive experience in Human Resources, with at least 3 years specifically as an HR Manager within the logistics, transportation, or warehousing industry.This industry-specific experience is essential.\n\tA Master's degree or professional HR certification (e.g., CIPM, SHRM-CP/SCP) is a strong plus.\n\tDemonstrable knowledge of labor laws and HR best practices in Nigeria\n\tProven ability to manage the recruitment, training, and retention challenges unique to the logistics sector.\n\tStrong leadership, interpersonal, and communication skills (written and verbal).\n\tAbility to work effectively in a fast-paced, demanding operational environment.\n\tProficiency in HRIS and Microsoft Office Suite.\n\n\nSalary\nN400,000 monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: susaneze5@gmail.com using the Job Position as the subject of the email.\n\nNote: Logistics Industry experience is a must.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Cashier Job at Chilis Restaurant",
    "link": "https://www.jobgurus.com.ng/jobs/view/cashier-job-at-chilis-restaurant-15",
    "pubDate": "Mon, 07 Jul 2025 14:16:22 GMT",
    "source": "JobGurus",
    "keyword": "chilis restaurant",
    "duplicate": false,
    "classifications": [],
    "content": "Chilis Restaurant is a 24-hours restaurant with good quality of food and good services that runs morning, afternoon and night shifts.\n\nWe are recruiting to fill the position below:\n\nJob Position: Cashier\n\nJob Location: Bodija, Ibadan - Oyo\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tManage transactions with customers using cash register\n\tPunch goods and ensure pricing is accurate\n\tCollect payments whether in cash or credit\n\tIssue receipts, refunds, change or tickets\n\tResolve customer complaints, guide them and provide relevant information\n\tGreet customers when entering or leaving the restaurant\n\tMaintain, clean and tidy check out areas.\n\n\nRequirement\n\n\n\tInterested candidates should possess a relevant qualification. \n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: chilisrestaurant.ibadan@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]