[
  {
    "title": "Customer Care / Sales Officer Job at Zenith Carex International Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/customer-care-sales-officer-job-at-zenith-carex-international-limited-4",
    "pubDate": "Thu, 05 Jun 2025 12:32:21 GMT",
    "source": "JobGurus",
    "keyword": "zenith carex international limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Zenith Carex International Limited was incorporated on 1st November 2002,under the 1968 Companies Acts of the Federal Republic of Nigeria, under registration RC 465705. We have, in line with our vision, already taken a front-line position in the air express industry in less than a decade since our commencement of operations. We have cut a niche as the air express company that can depend upon not only to keep with the terms of our services but more often to exceed customers expectations. Zenith Carex International was established to offer unique air express mail and freight delivery services to our clients in new and innovative ways that would mark a clear departure from existing methods.\n\nWe are recruiting to fill the position below:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Position: Customer Care / Sales Officer\n\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\n\nJob Responsibilities\n\n\n\tProvide client support and handle client communications effectively.\n\tDiscuss business contracts and cost with clients.\n\tBuild connections on behalf of the company.\n\tAbility to market by opening and closing deals.\n\tMaintain existing clients and generate new clients to achieve revenue goals.\n\tIdentifying new business markets and recording daily customer transactions.\n\tHandle clients complaints, provide appropriate solutions and alternatives within the time limits.\n\tMust-have flare for sales.\n\tAbility to work with less supervision.\n\tMaintain up-to-date knowledge about company products and services.\n\tKeep records of clients interactions, process clients account and file documents.\n\tProvide accurate, valid and complete information by using the right methods/tools.\n\tCreate frequent reviews and reports with sales and financial data.\n\tAbility to make presentations on products and services\n\tInitiate deals.\n\tIdentify target markets.\n\n\nRequirements\n\n\n\tB.Sc / HND in Marketing / Business Administration / Sales or a relevant field.\n\tMust have at least 3 years of work experience as sales / client relationships with track record.\n\tFemale Candidates\n\tExperience in logistics is an added advantage.\n\tExperience in marketing will be an advantage.\n\tMust be living in Ikejaor it's environs\n\tMust pay attention to details.\n\tGood record-keeping skills.\n\tExcellent customer service skill.\n\tMust have integrity.\n\tMust be courteous and presentable.\n\tShould be able to work with less supervision.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: recruitment@zenithcarex.com using \"Customer Care / Sales Officer - Ikeja\" as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Vacancies at Zenith Carex International Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancies-at-zenith-carex-international-limited",
    "pubDate": "Thu, 05 Jun 2025 12:32:21 GMT",
    "source": "JobGurus",
    "keyword": "zenith carex international limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Zenith Carex International Limited was incorporated on 1st November 2002,under the 1968 Companies Acts of the Federal Republic of Nigeria, under registration RC 465705. We have, in line with our vision, already taken a front-line position in the air express industry in less than a decade since our commencement of operations. We have cut a niche as the air express company that can depend upon not only to keep with the terms of our services but more often to exceed customers expectations. Zenith Carex International was established to offer unique air express mail and freight delivery services to our clients in new and innovative ways that would mark a clear departure from existing methods.\n\nWe are recruiting to fill the following positions below:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n1.) Dispatch Rider\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nResponsibilities\n\n\n\tCommunicate with clients in a respectful manner.\n\tLoading, transporting, and delivering items to clients/suppliers.\n\tAbiding by all transportation laws and maintaining a safe riding record.\n\tEnsure the correct quantity and types of products are delivered to the correct location and customers.\n\tSend or post out letters and documents to designated locations.\n\tPickup and delivery of parcels.\n\tDeliver items by examining items, accuracy of it's destination, route, rate, and delivery time.\n\tVerify items issued and delivered by submitting acknowledgment copies; note discrepancies and making sure the acknowledgment copies are returned to the office.\n\tKeep the Operations Manager informed of any issue that might have been encountered when pickup or delivery of a shipment.\n\tSafe handling of all shipments.\n\n\nRequirements\n\n\n\tCandidates should possess at least a First Degree qualification.\n\tMust have at least 3 years of disptach rider experience.\n\tMust know how to ride a bike efficiently and carefully.\n\tMust be courteous and have integrity.\n\tThe Dispatch Rider must have good hygiene\n\tExcellent knowledge of Lagos and its environs.\n\tThe dispatch rider must have a valid Rider's card/Permit.\n\tMust be able to work with less supervision.\n\tAbility to exercise proactiveness.\n\n\nSalary\nN90,000 Monthly.\n\nApplication Closing Date: 12th June, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: recruitment@zenithcarex.com using \"Dispatch Rider - Lagos\" as the subject of the mail.\n\n \n\n \n\n2.) Customer Care / Sales Officer\n\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\n\nJob Responsibilities\n\n\n\tProvide client support and handle client communications effectively.\n\tDiscuss business contracts and cost with clients.\n\tBuild connections on behalf of the company.\n\tAbility to market by opening and closing deals.\n\tMaintain existing clients and generate new clients to achieve revenue goals.\n\tIdentifying new business markets and recording daily customer transactions.\n\tHandle clients complaints, provide appropriate solutions and alternatives within the time limits.\n\tMust-have flare for sales.\n\tAbility to work with less supervision.\n\tMaintain up-to-date knowledge about company products and services.\n\tKeep records of clients interactions, process clients account and file documents.\n\tProvide accurate, valid and complete information by using the right methods/tools.\n\tCreate frequent reviews and reports with sales and financial data.\n\tAbility to make presentations on products and services\n\tInitiate deals.\n\tIdentify target markets.\n\n\nRequirements\n\n\n\tB.Sc / HND in Marketing / Business Administration / Sales or a relevant field.\n\tMust have at least 3 years of work experience as sales / client relationships with track record.\n\tFemale Candidates\n\tExperience in logistics is an added advantage.\n\tExperience in marketing will be an advantage.\n\tMust be living in Ikejaor it's environs\n\tMust pay attention to details.\n\tGood record-keeping skills.\n\tExcellent customer service skill.\n\tMust have integrity.\n\tMust be courteous and presentable.\n\tShould be able to work with less supervision.\n\n\nApplication Closing Date: 6th June, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: recruitment@zenithcarex.com using \"Customer Care / Sales Officer - Ikeja\" as the subject of the mail.\n\n \n\n3.) Operations Manager\n\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\n\nDescription \n\n\n\tEnsure all operations are carried out in the most efficient and cost-effective way.\n\tPurchase materials, plan inventory and oversee operation team's efficiency.\n\tFormulate strategic and operational objective.\n\tIdentify and address problems and opportunities for the company.\n\tBuild alliances and partnerships with other organizations.\n\tSupport worker communication with the management team.\n\tManage inventory as well as warehouse, transportation, and other logistics processes.\n\tDevelop new strategies to streamline processes and reduce cost.\n\tEnsure that quality, quantity, customer satisfaction, and financial commitments are met.\n\tPerform metrics reporting and data analysis tasks to identify issues and opportunities for process improvements.\n\tPartner and communicate with manufacturers, suppliers, and customers.\n\tManage and develop logistics staff.\n\tSelect carriers for transportation and negotiate rates and contracts with carriers.\n\tRespond to and resolve complaints and problems.\n\n\nRequirements\n\n\n\tA Degree in Logistics, Supply Chain Management, Business Management or its related field.\n\tAt least 5 years of good working knowledge as an operations manager or in logistics field\n\tCreative thinking skills.\n\tExcellent written and verbal communication skills.\n\tExcellent leadership skills.\n\tAbility to drive.\n\tGood time management skills and problem-solving skills.\n\tAbility to work under pressure and manage multiple priorities in a fast-paced environment\n\tGood knowledge of Lagos and its roads.\n\n\nApplication Closing Date: 20th June, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: recruitment@zenithcarex.com using \"Operations Manager (Lagos)\" as the subject of the email\n\n \n\n4.) Bus Driver\n\nJob Location: Abuja (FCT)\nEmployment Type: Full-time\n\nJob Description\n\n\n\tDrive company buses across various states in Nigeria for logistics and transportation assignments.\n\tEnsure timely pickup and delivery of goods and/or passengers according to the assigned schedule.\n\tConduct pre-trip and post-trip inspections to ensure the vehicle is in good working condition.\n\tFollow all traffic laws, company safety procedures, and regulatory requirements at all times.\n\tMaintain accurate records of travel, fuel usage, mileage, and delivery logs.\n\tReport any delays, road incidents, or vehicle issues to the supervisor promptly.\n\tKeep the vehicle clean, fueled, and well-maintained at all times.\n\tAssist in loading and offloading goods when required.\n\n\nRequirements\n\n\n\tMinimum of an SSCE/WAEC certificate.\n\t3–5 years of experience driving buses or heavy-duty vehicles across Nigerian states.\n\tGood knowledge of major highways and routes across Nigeria.\n\tValid Nigerian driver’s license (Class D or higher)\n\tStrong understanding of vehicle safety and maintenance practices.\n\tExcellent driving skills and a clean driving record.\n\tAbility to work long hours, including overnight trips, weekends, and public holidays as required.\n\tBasic communication skills in English and/or local languages.\n\n\nApplication Closing Date: 6th June, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: recruitment@zenithcarex.com using \"Bus Driver - Abuja\" as the subject of the mail.\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Linux Cryptography and Security Engineer Job at Canonical Nigeria",
    "link": "https://www.jobgurus.com.ng/jobs/view/linux-cryptography-and-security-engineer-job-at-canonical-nigeria-1",
    "pubDate": "Thu, 05 Jun 2025 12:32:21 GMT",
    "source": "JobGurus",
    "keyword": "canonical nigeria",
    "duplicate": false,
    "classifications": [
      "Software Engineering"
    ],
    "content": "Canonical has been a remote-first company since its inception in 2004. Work at Canonical is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game. Canonical provides a unique window into the world of 21st-century digital business.\n\nWe are recruiting to fill the position below:\n\nJob Position: Linux Cryptography and Security Engineer\n\nJob Location: Lagos, Nigeria\n\nDescription\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThis is a unique opportunity to use your software engineering and cryptography skills to build and maintain the security foundation that enables Ubuntu and its users to operate securely and remain compliant to international information security standards such as FIPS 140-3 and Common Criteria.  \n\tYou will use your applied cryptography, Linux Security, and coding skills to enhance the Ubuntu distribution and work with organizations such as DISA and CIS to draft and implement security hardening benchmarks for Ubuntu.\n\tAs a member of the Security Hardening team you will work with and develop automation tooling to audit deployed systems for DISA-STIG and CIS benchmark compliance.\n\tYou will interact with internal and external stakeholders to identify gaps in our frameworks, and develop new solutions to address these challenges.\n\tIn this role you will have the opportunity to influence team and security culture, facilitate technical delivery, and help drive team direction and execution.\n\tYou’ll collaborate closely with Canonical’s kernel team as well as the wider engineering organization to drive features impacting all Ubuntu users.\n\n\nResponsibilities\nDay-to-day responsibilities:\n\n\n\tCollaborate with other engineers in the Security Hardening team to achieve and retain various Security certifications\n\tExtend and enhance Linux cryptographic components (OpenSSL, Libgcrypt, GnuTLS, and others) with the features and functionality required for FIPS and CC certification\n\tCollaborate with external security consultants to test and validate kernel and crypto module components\n\tWork with external partners to develop security hardening benchmarks and  audit + remediation automation for Ubuntu\n\tContribute to Ubuntu mainline and upstream projects to land solutions and benefit the community\n\tCommunication and collaboration within and outside Canonical to identify opportunities to improve our security posture, rapidly resolve issues, and deliver high-quality solutions on schedule\n\n\nRequirements\nWhat we are looking for in you:\n\n\n\tHands-on experience with low-level Linux cryptography APIs and debugging\n\tExcellent software engineering fundamentals, including prior experience with C development, and the ability to demonstrate such\n\tHands-on experience with Linux system administration and shell scripting\n\tDemonstrated knowledge of security and cryptography fundamentals + direct experience writing secure code and implementing best practices\n\tSignificant development experience working with open source libraries\n\tExcellent verbal and written communications to enable efficient collaboration with internal and external partners in a remote-first environment\n\n\nAdditional skills that you might also bring:\n\n\n\tPrior experience working on FIPS/Common Criteria certified products and in-depth knowledge of the underlying standards\n\tPrior experience working directly with DISA-STIG or CIS benchmarks, including related audit + remediation tooling (e.g. Compliance as Code)\n\tExperience working directly with Linux Kernel\n\tPrior experience with Python, OVAL (Open Vulnerability Assessment Language), and Ansible\n\tHistory of contributions to open source projects\n\n\nWhat We Offer You\n\n\n\tWe consider geographical location, experience, and performance in shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognise outstanding performance.\n\tIn addition to base pay, we offer a performance-driven annual bonus. We provide all team members with additional benefits, which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.\n\tDistributed work environment with twice-yearly team sprints in person - we’ve been working remotely since 2004!\n\tPersonal learning and development budget of USD 2,000 per year\n\tAnnual holiday leave\n\tMaternity and paternity leave\n\tAnnual compensation review\n\tRecognition rewards\n\tEmployee Assistance Programme\n\tOpportunity to travel to new locations to meet colleagues from your team and others\n\tPriority Pass for travel and travel upgrades for long-haul company events.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Human Resource Assistant Job at Beebeejump International Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/human-resource-assistant-job-at-beebeejump-international-limited",
    "pubDate": "Thu, 05 Jun 2025 12:32:21 GMT",
    "source": "JobGurus",
    "keyword": "beebeejump international limited",
    "duplicate": false,
    "classifications": [],
    "content": "Beebeejump International Limited is into the sales of solar batteries, panel, inverters and other accessories.\n\nWe are recruiting to fill the position below:\n\nJob Position: Human Resource Assistant\n\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAssist with ensuring the smooth onboarding of staff.\n\tAssist in the coordination of staff\n\tManage junior staff.\n\tHelp implement new policies, procedures, methods, and systems\n\tHelp in recruitment of new staffs\n\tCoordinate and schedule meetings and conferences\n\tEnsure compliance with labour laws·\n\n\nRequirements \n\n\n\tBachelor's Degree or equivalent experience\n\tMinimum 1 year of solid experience as an Human Resource Assistant\n\tProven experience as a Human Resources Assistant\n\tKnowledge of Labour laws\n\tProficiency in MS Office (MS Excel and MS PowerPoint, in particular)\n\tExcellent time management skills and the ability to prioritize work\n\tAttention to detail and problem-solving skills\n\tExcellent written and verbal communication skills\n\tStrong organizational skills with the ability to multi-task\n\tStrong interpersonal, customer service, and communication skills\n\tAbility to multitask.\n\n\nMethod of Application\nInterested and qualified candidates should send their detailed CV to: hr@beebeejump.com using Human Resources Assiatantas the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Administrative Executive Job at Elizabeth Maddeux",
    "link": "https://www.jobgurus.com.ng/jobs/view/administrative-executive-job-at-elizabeth-maddeux",
    "pubDate": "Thu, 05 Jun 2025 12:32:21 GMT",
    "source": "JobGurus",
    "keyword": "elizabeth maddeux",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Elizabeth Maddeux provides a range of human resources solutions designed to empower your workforce, enhance technical proficiency, refine soft skills, and accelerate organizational growth for better impacts by enhancing organizational dynamics through a well-rounded and robust human resource intervention.\n\nWe are recruiting to fill the position below:\n\nJob Position: Administrative Executive\n\nJob Location: Lagos\nEmployment Type: Full-time (Hybrid)\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a reliable and resourceful Administrative Executive to support the day-to-day operational and logistical needs of our office. \n\tThis role is especially focused on managing tools, equipment, vendor coordination, office supplies, and general facility upkeep.\n\tThe ideal candidate will be proactive, organized, and capable of managing multiple administrative functions that ensure a well-run and efficient work environment.\n\n\nKey Responsibilities\n\n\n\tMaintain and monitor all office tools and equipment, ensuring they are properly assigned, functional, and well-maintained, including coordinating servicing or repairs when needed.\n\tTrack the usage, location, and condition of assets such as laptops, printers, projectors, and communication tools, updating logs and asset registers accordingly.\n\tOversee inventory of office supplies and consumables, conduct regular stock checks, forecast needs, and initiate timely reordering to avoid shortages or overstocking.\n\tServe as the primary point of contact for all vendors and service providers including equipment suppliers, courier services, utility companies, janitorial teams, and maintenance contractors.\n\tSupport facility management by ensuring that the workplace remains clean, safe, and well-organized at all times, including monitoring cleanliness of shared spaces, and following up on repairs or safety concerns.\n\tMaintain accurate and up-to-date records of vendor agreements, service level terms, contract expiration dates, and payment schedules, and alert management when renewals or reviews are due.\n\tHandle procurement processes by sourcing vendors, obtaining quotations, negotiating prices, raising purchase orders, and following up on deliveries and invoices.\n\tCoordinate and schedule routine servicing or maintenance for office equipment and infrastructure (eg, air conditioning, lighting, plumbing) and ensure minimal disruption to office operations.\n\tAssist with workstation setups, internal office moves, equipment tagging, and ensuring new hires have the necessary tools and supplies upon arrival.\n\tParticipate in emergency readiness, safety compliance, and basic first-aid or equipment safety initiatives within the office, ensuring supplies like fire extinguishers or first-aid kits are regularly checked and restocked.\n\tProvide general support as needed, including filing, documentation, supporting administrative audits, handling minor office errors, and assisting in the preparation of reports or presentations related to office operations.\n\tMaintain a responsive and professional relationship with all internal teams and external partners to ensure smooth and uninterrupted business support functions.\n\n\nRequirements\n\n\n\tHND, or BSc in Administration, Secretarial Studies, or a related field.\n\tMinimum 2 - 3 years of relevant experience in administrative support, office coordination, or facilities operations.\n\tStrong organizational skills and the ability to manage multiple priorities effectively.\n\tProficiency in Microsoft Office (Word, Excel, Outlook); familiarity with inventory or asset tracking systems is a plus.\n\tGood understanding of office tools, basic troubleshooting, and the ability to follow up on technical or maintenance issues.\n\tStrong communication and interpersonal skills, especially in vendor negotiation and service coordination.\n\tAbility to work independently, exercise good judgment, and demonstrate a proactive approach to problem-solving.\n\n\nSalary\nN200,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV and Cover Letter to: careers@elizabethmaddeux.com using \"Administrative Executive\" as the subject of the email.\n\nNote: Only qualified candidates will be contacted.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]