[
  {
    "title": "Creative Officer Job at the Centre for Communication and Social Impact",
    "link": "https://www.jobgurus.com.ng/jobs/view/creative-officer-job-at-the-centre-for-communication-and-social-impact",
    "pubDate": "Fri, 27 Jun 2025 17:13:41 GMT",
    "source": "JobGurus",
    "keyword": "the centre for communication and social impact",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "The Centre for Communication and Social Impact (CCSI), formerly known as Centre for Communication Programs Nigeria (CCPN) was registered in 2001 as a Non-Governmental Organization with the Corporate Affairs Commission of Nigeria.\n\nBirthed in Nigeria by the Johns Hopkins Center for Communication Programs (JHCCP), Baltimore, USA, CCPN transitioned its operations under the new name CCSI after an exciting 10 years of growth and operations in Nigeria and other African countries.\n\nWe are recruiting to fill the position below:\n\nJob Position: Creative Officer\n\nJob Location: Abuja\nEmployment Type: Full-time\n\nPosition Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Creative Officer will be responsible for producing authentic and impactful designs tailored to diverse audiences.\n\tReporting to the HOD, Creative, your role will involve creating both print and digital materials, such as reports, presentations, communication campaigns, brand assets, and more.\n\tYou will collaborate with various teams across the organization to craft engaging design experiences.\n\tAs part of the Creative team, you will ensure that all designs effectively convey the organization’s mission and vision.\n\n\nResponsibilities\n\n\n\tDevelop and present media-neutral design concepts aligned with project briefs, covering a diverse range of deliverables such as social digital content, press materials, brand identity, communication campaigns, and internal communications.\n\tCollaborate closely with the creative team, digital content producers, and the HOD, Creative to ensure cohesive execution.\n\tGenerate original conceptual ideas while showcasing strong technical expertise in Adobe Creative Suite.\n\tCreate animations for title sequences, social media content, and presentations using After Effects or Final Cut Pro.\n\tFoster a culture of innovation, creative excellence, and accountability within the team.\n\tExecute all work in alignment with the organization’s principles and policies.\n\n\nQualification\nEssential Skills, Knowledge, and Experience:\n\n\n\tBachelor’s Degree in any related field.\n\t3 - 6 years of experience in graphic design.\n\tStrong knowledge of Adobe Creative Suite.\n\tExcellent interpersonal communication skills, with the ability to interact effectively with employees at all levels.\n\n\nDesirable Skills, Knowledge, and Experience:\n\n\n\tA portfolio that demonstrates a strong understanding of layout and Typography.\n\tSolid experience working in similar roles either in-house or in design agencies.\n\tAbility to take initiative, to set priorities, work independently, and manage multiple tasks.\n\tAbility to operate under time constraints and pressure.\n\tAbility and willingness to adapt to a variety of duties and priorities.\n\tExcellent knowledge of the design industry, both print and motion experience essential to ensure an understanding of reasonable timescales.\n\tAdvanced skills with all elements of Adobe Creative Suite (InDesign, Illustrator, and Photoshop etc) including designing PowerPoint presentations and technical reports.\n\tExcellent interpersonal skills\n\tBeing agile, flexible and logical thinking.\n\tAble to develop effective, collaborative working relationships and work well in a team to achieve results.\n\tFluency in both written and spoken English.\n\tA passion for learning and exploring new ideas\n\tGoes beyond the parameters of a brief to deliver better than requested.\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Cashier Job at Eric Kayser Nigeria",
    "link": "https://www.jobgurus.com.ng/jobs/view/cashier-job-at-eric-kayser-nigeria",
    "pubDate": "Fri, 27 Jun 2025 17:13:41 GMT",
    "source": "JobGurus",
    "keyword": "eric kayser nigeria",
    "duplicate": false,
    "classifications": [],
    "content": "Eric Kayser Nigeria is part of the globally renowned Maison Kayser brand, founded by master baker Eric Kayser in Paris, France. Established in Nigeria to bring authentic French bakery excellence to the local market, Eric Kayser Nigeria is known for its commitment to artisanal craftsmanship, high-quality ingredients, and exceptional customer experience.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWith locations in key parts of Lagos—including Victoria Island, Ikoyi, and the Murtala Muhammed Airport—Eric Kayser Nigeria offers a wide range of freshly baked breads, viennoiseries, pastries, and gourmet meals, all made with the finest techniques and natural sourdough. At the heart of Eric Kayser Nigeria is a dedication to excellence, innovation, and hospitality, making it a preferred destination for both everyday indulgence and premium café experiences. We are proud to uphold the global Kayser tradition while infusing it with local relevance and exceptional service tailored to the Nigerian market.\n\nWe are recruiting to fill the position below:\n\nJob Position: Cashier\n\nJob Locations: Lekki and Chevron - Lagos\nEmployment Type: Full-time\nDepartment: Floor & Front-of-House\n\nDetails\n\n\n\tAre you passionate about hospitality, food service, or customer experience?\n\tWe are expanding with two exciting new branches opening soon in Lekki and Chevron.\n\tWe’re looking for energetic, professional, and service-driven individuals to join our team!\n\n\nRequirements\n\n\n\tMinimum of OND / HND\n\tHospitality or food service experience is an added advantage\n\tMust be punctual, respectful, hardworking, and a team player\n\tWillingness to work shifts, weekends, and public holidays\n\tGood personal hygiene and grooming are essential.\n\n\nWhy Work With Us?\n\n\n\tCompetitive salary\n\tStructured training and growth opportunities\n\tMonthly staff recognition and rewards\n\tA supportive team culture and professional work environment\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: careers@erickayserng.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Social Media Officer Job at the Centre for Communication and Social Impact",
    "link": "https://www.jobgurus.com.ng/jobs/view/social-media-officer-job-at-the-centre-for-communication-and-social-impact",
    "pubDate": "Fri, 27 Jun 2025 17:13:41 GMT",
    "source": "JobGurus",
    "keyword": "the centre for communication and social impact",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "The Centre for Communication and Social Impact (CCSI), formerly known as Centre for Communication Programs Nigeria (CCPN) was registered in 2001 as a Non-Governmental Organization with the Corporate Affairs Commission of Nigeria.\n\nBirthed in Nigeria by the Johns Hopkins Center for Communication Programs (JHCCP), Baltimore, USA, CCPN transitioned its operations under the new name CCSI after an exciting 10 years of growth and operations in Nigeria and other African countries.\n\nWe are recruiting to fill the position below:\n\nJob Position: Social Media Officer\n\nJob Location: Abuja\nEmployment Type: Full-time\n\nPosition Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe SM Officer will manage all of CCSI’s social media platforms, including Facebook, Instagram, Twitter, YouTube, LinkedIn, and the website.\n\tThis role involves working closely with the creative team to develop and harvest content in form of photographs, videos, blogs, stories and package this content for timely upload on respective platforms.\n\tThe SM Officer will be responsible for documenting all published content analytics and creating quarterly social media reports.\n\tUnder the direct leadership of the HOD, Creative, the SM Officer will work closely with programs and media teams within the organization to plan and organize events such as international days, workshops, etc.\n\tThe SM Officer will spearhead the creation and dissemination of digital content, through a social media strategy developed in conjunction with CCSI’s clients.\n\tThe SM Officer will be expected to uphold the organization’s values and work collaboratively with colleagues to achieve shared goals.\n\n\nResponsibilities\nSocial Media Management:\n\n\n\tManage all CCSI’s social media platforms ensuring regular and timely content updates and scheduling posts strategically.\n\tAssist in developing and sharing content across CCSI’s platform.\n\tImplement a coherent digital media campaign for CCSI’s client portfolios.\n\tDevelop and calendarize content for CCSI’s clients\n\tEnsure all materials, including pictures and videos, maintain high standard of simplicity, consistency, accuracy and relevance.\n\tStrengthen and enhance CCSI’s and client’s platform visibility and exposure using strategies, increasing social media followers and reaching key audiences.\n\tSupport programs unit and state teams to retrieve program information for official use.\n\tProvide evidence-based information for internal digital team of CCSI’s clients to expand their digital reach\n\n\nDigital Media and Promotion and Analysis:\n\n\n\tMonitor and analyze current digital trends, social media best practices and emerging technologies to enhance digital engagement\n\tAnalyze the performance and impact of digital media by monitoring content performance, engagement metrics and analytics to guide planning.\n\tDesign, create and manage promotions, digital media and campaigns for CCSI and clients.\n\n\nInfluencer Management, Liaison and Collaboration:\n\n\n\tManage contents from CCSI’s and clients and engage social media influencers for the various project’s digital media platforms.\n\n\nQualification\nEssential Skills, Knowledge, and Experience:\n\n\n\tBachelor’s Degree in Mass Communication, Journalism, or a related field.\n\t4 years of work experience managing digital media.\n\tStrong organizational skills and attention to detail, with the ability to manage multiple tasks and priorities.\n\tExcellent writing skills and proficiency in English Language.\n\n\nDesirable Skills, Knowledge, and Experience:\n\n\n\tPrevious media support/experience and being technology savvy are mandatory requirements\n\tExperience in supporting media for development work\n\tAbility to work effectively in a fast-paced program environment and familiarity with local culture across regions in Nigeria\n\tExcellent written and spoken English language skills with attention to detail and accuracy\n\tAbility to work with a wide range of people, good interpersonal skills, including public officials, the media, and consultants to deliver program objectives\n\tWillingness to be flexible and prepared to contribute to the program and other duties as required.\n\tEnjoys a working knowledge of the blogging ecosystem relevant to the organization’s area of interest.\n\tDisplays in-depth knowledge and understanding of social media platforms, their respective participants (Facebook, Twitter, Instagram, YouTube, Pinterest etc.) and how each platform can be deployed in different scenarios.\n\tWillingness to travel as might be required\n\tExperience in gathering content in form of photographs, videos and stories\n\tExperience in curating this gathered content to developed finished content that can be uploaded to social media and shared with partners.\n\tKnowledge of photography and video editing using professional editing suites will be an added advantage.\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Customer Service Representative Job at Eric Kayser Nigeria",
    "link": "https://www.jobgurus.com.ng/jobs/view/customer-service-representative-job-at-eric-kayser-nigeria",
    "pubDate": "Fri, 27 Jun 2025 17:13:41 GMT",
    "source": "JobGurus",
    "keyword": "eric kayser nigeria",
    "duplicate": false,
    "classifications": [],
    "content": "Eric Kayser Nigeria is part of the globally renowned Maison Kayser brand, founded by master baker Eric Kayser in Paris, France. Established in Nigeria to bring authentic French bakery excellence to the local market, Eric Kayser Nigeria is known for its commitment to artisanal craftsmanship, high-quality ingredients, and exceptional customer experience. With locations in key parts of Lagos—including Victoria Island, Ikoyi, and the Murtala Muhammed Airport—Eric Kayser Nigeria offers a wide range of freshly baked breads, viennoiseries, pastries, and gourmet meals, all made with the finest techniques and natural sourdough.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nAt the heart of Eric Kayser Nigeria is a dedication to excellence, innovation, and hospitality, making it a preferred destination for both everyday indulgence and premium café experiences. We are proud to uphold the global Kayser tradition while infusing it with local relevance and exceptional service tailored to the Nigerian market.\n\nWe are recruiting to fill the position below:\n\nJob Position: Customer Service Representative\nJob Locations: Lekki and Chevron - Lagos\nEmployment Type: Full-time\nDepartment: Floor & Front-of-House\n\nDetails\n\n\n\tAre you passionate about hospitality, food service, or customer experience?\n\tWe are expanding with two exciting new branches opening soon in Lekki and Chevron we’re looking for energetic, professional, and service-driven individuals to join our team!\n\n\nRequirements\n\n\n\tMinimum of OND/HND\n\tHospitality or food service experience is an added advantage\n\tMust be punctual, respectful, hardworking, and a team player\n\tWillingness to work shifts, weekends, and public holidays\n\tGood personal hygiene and grooming is essential.\n\n\nWhy Work With Us?\n\n\n\tCompetitive salary\n\tStructured training and growth opportunities\n\tMonthly staff recognition and rewards\n\tA supportive team culture and professional work environment.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: careers@erickayserng.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Administrative / Office Clerk Female Job at Virgin Beauty industries Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/administrative-office-clerk-female-job-at-virgin-beauty-industries-limited-2",
    "pubDate": "Fri, 27 Jun 2025 17:13:41 GMT",
    "source": "JobGurus",
    "keyword": "virgin beauty industries limited",
    "duplicate": false,
    "classifications": [],
    "content": "Virgin Beauty industries Limited, is a leading company in the beauty industry in Nigeria. We offer exceptional products for hair and skin solutions. Our goal is to meet customers beauty needs and keep their hair nourished with our organically sourced materials.\n\nWe are recruiting to fill the position below:\n\nJob Position: Administrative / Office Clerk Female\n\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\n\nResponsibilities\n\n\n\tTo manage inventry and admin related matters.\n\n\nRequirements\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tCandidates should have a B.Sc Degree\n\tMinimum of 1- 3 years of experience.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: virginbeauty359@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]