[
  {
    "title": "Finance / Account Manager Job at Laboria Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/finance-account-manager-job-at-laboria-limited",
    "pubDate": "Fri, 06 Jun 2025 15:39:22 GMT",
    "source": "JobGurus",
    "keyword": "laboria limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Laboria Limited, a Hospital and Laboratory Equipment Solutions Provider, is recruiting suitable candidates to fill the position below:\n\nJob Position: Finance / Account Manager\n\nJob Location: Ojodu-Berger, Lagos\nEmployment Type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a highly skilled and detail-oriented Finance/Account Manager with a minimum of 5 years of relevant experience to join our team.\n\tThe ideal candidate will be responsible for overseeing financial operations, managing receivables, preparing daily sales reports, and generating monthly management reports.\n\n\nKey Responsibilities\nAccounts Receivables Management:\n\n\n\tMonitor and manage customer accounts to ensure timely invoicing and collections.\n\tReview outstanding receivables and actively follow up with customers to minimize overdue payments.\n\tEnsure effective compliance with credit control processes / policy to reduce bad debts and improve cash flow.\n\tPrepare and analyze receivables aging reports and provide regular updates to management.\n\tLiaise with customers to resolve any billing discrepancies or disputes promptly.\n\n\nFinancial Management:\n\n\n\tOversee and maintain accurate financial records, ensuring compliance with accounting standards.\n\tManage accounts payable and ensure timely payments to vendors.\n\tConduct bank reconciliations and monitor cash flow for operational efficiency.\n\n\nReporting:\n\n\n\tPrepare and review Daily Sales Reports (DSRs) for accuracy and completeness.\n\tGenerate and present Monthly Management Reports, including income statements, balance sheets, and cash flow statements.\n\tProvide financial insights and recommendations to support strategic decision-making.\n\n\nBudgeting and Forecasting:\n\n\n\tAssist in preparing budgets, forecasts, and variance analysis.\n\tMonitor expenditures to ensure alignment with the budget.\n\n\nCompliance and Audit:\n\n\n\tEnsure compliance with financial regulations, tax laws, and company policies.\n\tSupport internal and external audits by providing necessary documentation and reports.\n\n\nSystem and Process Management:\n\n\n\tUse QuickBooks to manage financial transactions and reports efficiently.\n\tImplement and maintain effective financial controls and processes.\n\n\nTeam Collaboration:\n\n\n\t\n\tWork closely with other departments to align financial objectives with organizational goals.\n\t\n\n\nKey Performance Indicators (KPIs)\n\n\n\tEffective management of accounts receivables, ensuring minimal overdue payments and achieving target collection rates.\n\tTimely and accurate preparation of Daily Sales Reports (DSRs).\n\tSubmission of Monthly Management Reports by agreed deadlines.\n\tMaintenance of 100% compliance with financial regulations and tax obligations.\n\tEfficient use of QuickBooks for all financial operations and reporting.\n\n\nRequirements\n\n\n\tMinimum of 5 years of relevant experience in finance or accounting roles.\n\tProficiency in QuickBooks is mandatory.\n\tProfessional certification (e.g., ICAN, ACA, ACCA, CPA) will be an added advantage.\n\tStrong knowledge of accounting principles, financial reporting, and regulatory requirements.\n\tDemonstrated experience in managing accounts receivables, including credit control and debt recovery.\n\tExcellent analytical, organizational, and problem-solving skills.\n\tProficiency in MS Office Suite, especially Excel.\n\tAbility to work independently and collaboratively in a fast-paced environment.\n\n\nWhy Join Us\n\n\n\tOpportunity to work with a dynamic and forward-thinking team.\n\tCompetitive salary and benefits package.\n\tProfessional growth and development opportunities.\n\n\nMethod of Application\nInterested and qualified candidates should send their Resume and Cover Letter to: laboriahr@gmail.com using “Application for Finance/Account Manager.” as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Vacancies at SOW Real Estate Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancies-at-sow-real-estate-limited",
    "pubDate": "Fri, 06 Jun 2025 15:39:22 GMT",
    "source": "JobGurus",
    "keyword": "sow real estate limited",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "Sow Real Estate Nig. Ltd. is a real estate company that is focused ondelivering quality and affordable housing in Nigeria and beyond.\n\nWe are recruiting to fill the following positions below:\n\n1.) Head of Engineering\n\nJob Location: Abuja (FCT)\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAs we scale our operations, we are seeking a seasoned and strategic Head of Engineering to lead our engineering and project execution functions.\n\tThe Head of Engineering will oversee the entire engineering and technical operations of the company.\n\tThis role involves leading a multidisciplinary team of engineers, ensuring projects are delivered on time, within budget, and to the highest quality standards.\n\tThe ideal candidate must have extensive experience in construction engineering, project management, and real estate development.\n\n\nKey Responsibilities\n\n\n\tLead and manage the engineering department, including civil, structural, electrical, and mechanical engineers.\n\tOversee the planning, design, and execution of all engineering projects.\n\tDevelop and enforce engineering policies, standards, and procedures.\n\tEvaluate and implement new technologies and innovations in construction methods.\n\tManage budgets, project schedules, and resource allocation.\n\tConduct site inspections to ensure compliance with designs, safety, and quality standards.\n\tCollaborate with architects, contractors, and consultants to ensure seamless project execution.\n\tProvide technical guidance and mentorship to engineering teams.\n\tEnsure all engineering activities comply with local and international building codes, health and safety regulations.\n\tPrepare technical reports, risk assessments, and performance metrics for executive leadership.\n\n\nQualifications & Requirements\n\n\n\tBachelor’s Degree in Civil Engineering, Structural Engineering, Building Technology, or a related field (Master’s degree preferred).\n\tMinimum of 5 - 8 years of engineering experience, with at least 3 years in a senior or leadership role within the real estate or construction sector.\n\tCOREN certification is an advantage; other professional certifications (e.g., PMP, MNSE) are also added advantage.\n\tProven experience in leading large-scale residential and commercial real estate projects.\n\tStrong knowledge of construction standards, materials, methodologies, and project lifecycle management.\n\tExcellent leadership, communication, and organizational skills.\n\tProficiency in engineering and project management software (e.g., AutoCAD, Revit, MS Project, Primavera).\n\tDemonstrated ability to lead cross-functional teams and drive engineering excellence.\n\tDeep understanding of Nigerian regulatory standards and approval processes for real estate developments.\n\n\nWhat We Offer\n\n\n\tCompetitive salary and performance-based bonuses\n\tHealth and wellness benefits\n\tA dynamic and collaborative work environment\n\tOpportunity to work on innovative and landmark real estate projects\n\tCareer development and continuous learning opportunities.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and a cover letter to: osezzbank@gmail.com using  “Head of Engineering - SOW Real Estates” as the subject.\n\n \n\n \n\n2.) Investment Advisor\n\nJob Location: Abuja (FCT)\n\nJob Description\n\n\n\tWe are seeking passionate and driven Investment Advisors (Marketers) to join our dynamic team in Abuja. Ideal candidates should have 1 - 3 years of experience in sales, preferably within the real estate sector (though this is not compulsory).\n\tIf you have a strong network of buyers and are looking to grow in a supportive and professional environment, we want to hear from you!\n\n\nKey Responsibilities\n\n\n\tIdentify and engage prospective investors and buyers\n\tPromote investment opportunities and guide clients through decision-making\n\tBuild and maintain long-term client relationships\n\tMeet and exceed sales targets\n\tAttend team coaching and mentorship sessions.\n\n\nRequirements\n\n\n\t1 - 3 years of sales experience (real estate experience is an added advantage)\n\tProven network or contacts of potential buyers\n\tExcellent communication and interpersonal skills\n\tSelf-motivated, proactive, and eager to learn\n\tMust be based in Abuja or willing to relocate.\n\n\nWhat We Offer\n\n\n\tCompetitive Monthly Salary, attractive commissions and performance-based incentives\n\tA supportive, high-performance work environment\n\tMentorship and hands-on coaching to boost your career\n\tOpportunities for professional growth and leadership development.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: osezzbank@gmail.com using the Job Position as the subject of the email.\n\n \n\n \n\n3.) Sales Manager\n\nJob Location:  Abuja (FCT) \n\nJob Description\n\n\n\tWe are seeking an experienced and results-driven Sales Manager to lead a dynamic real estate sales team in Abuja.\n\tThe ideal candidate must have a proven track record in property sales, with a strong network of high-net-worth clients and decision-makers capable of investing in premium real estate within the Abuja market.\n\n\nKey Responsibilities\n\n\n\tLead, motivate, and manage a team of sales executives to achieve and exceed sales targets.\n\tDevelop and execute strategic plans to drive property sales, with a particular focus on high-end residential and commercial developments.\n\tLeverage an existing network of qualified clients to generate leads and close high-value deals.\n\tProvide market insights and customer feedback to guide marketing and business development strategies.\n\tCoordinate property viewings, client meetings, and contract negotiations.\n\tEnsure a high level of customer satisfaction throughout the sales process.\n\n\nKey Requirements\n\n\n\tMinimum of 3 - 5 years of experience in real estate sales, preferably in Abuja.\n\tDemonstrated success in selling luxury or high-value properties.\n\tExtensive client base and strong network of prospective property buyers and investors in Abuja.\n\tProven ability to lead and develop a high-performing sales team.\n\tExcellent negotiation, communication, and presentation skills.\n\tStrong understanding of the Abuja real estate market, pricing trends, and buyer behavior.\n\n\nIncentives\n\n\n\tCompetitive salary and performance-based commissions.\n\tAvailability of team vehicle\n\tFuel Allowance\n\tOpportunities for career growth and continuous professional development.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and a brief Cover Letter to: osezzbank@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Contracts Engineer / Buyer Job at Amaiden Energy Nigeria Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/contracts-engineer-buyer-job-at-amaiden-energy-nigeria-limited",
    "pubDate": "Fri, 06 Jun 2025 15:39:22 GMT",
    "source": "JobGurus",
    "keyword": "amaiden energy nigeria limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Amaiden Energy Nigeria Limited (formerly Moody International Nigeria Limited) was established in 1996 as a partnership between Moody International Group and Nigerian investors. Since commencing operations in March 1997 the company continues to grow and exerts its presence in numerous Projects in the Nigeria Oil and Gas Industry.\n\nWe are recruiting to fill the position below:\n\nJob Position: Contracts Engineer / Buyer\n\nJob Location: Lagos\nJob type: Contract\n\nResponsibilities \n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe post holder is responsible for pre-award preparation, negotiation, award and monitoring the administration of Contracts for works/goods/services in such a manner as to ensure the Company’s best commercial interests are both served and protected, while monitoring relevant markets and supporting contractor performance management.\n\tOrganize and control all process-based activities relating to offshore service contracts in assigned portfolio including strategies, pre-qualifications, tender list development, issues of ITT, analysis of tenders, contract negotiations and the preparation of contractual documentation.\n\tProactively work with the métier partners (Technical Duets) to build and maintain relationships with contractors / suppliers and monitor their performance by participating in contract performance management activities.\n\tLiaise closely with the relevant Global Category Manager to locally deploy TGP strategy and comply with TGP governance.\n\tActively pursue contracting synergy opportunities for all business requirements.\n\tActively contribute to the 3C program by delivery of costs savings without compromising safety or quality.\n\tEnsure that contractor / supplier selection is carried out in accordance with Company requirements and Compliance\n\tProgram and that safety and environmental assessments are part of the selection process.\n\tMitigate project risk through pro-active management and negotiation of contractual disputes.\n\tProvide proactive and timely advice and support to internal and external stakeholders in all matters relating to Contracts & Procurement, including operating as a ‘Duet’ with the technical counterpart to promote effective contract planning, management and performance.\n\tUtilize approved standard contract documentation and ensure compliance with standard contracting principles during negotiations.\n\tComply with all applicable Supply Chain rules, governance, and process.\n\tSupport settlement of claims, in conjunction with senior management and Legal, by proposing strategies and actions and by participating in negotiations.\n\tContribute to the process of continuous improvement, including participation in and promotion of Lean initiatives and adoption and sharing of best practice.\n\tPrepare and Present (where required) Contracts Committee presentations.\n\tDemonstrate personal commitment to the HSEQ Policy and actively participate in Company safety awareness and initiative schemes.\n\tMaintain awareness of and ensure compliance with all relevant Statutory and Company HSEQ standards.\n\tEffectively and efficiently use all Supply Chain Tools (SAP, E-Sourcing, AGORA, Etc.) to ensure all required information is available in a timely manner and fully auditable.\n\tEnsure information of portfolio is systematically updated in the Master Procurement Plan while maintaining an up-to date contract portfolio status.\n\tEnsure 100% compliance to COMPANY rules, SOX and local rules.\n\tEnsures the establishment of suitable lists of potential bidders in accordance with vendor management policies and procedures to obtain good value for money.\n\tEnsures contracts are drafted in accordance with approved model which reflect to company’s ethic policy, procedure thereby minimizing company’s exposure to risk.\n\tContributes during negotiation either for dispute resolution and claim settlement or for generation of saving.\n\tMentors Contracts Engineers, Buyers, Contracts Administrators\n\n\nJob Requirements\n\n\n\tFluent in English Language\n\t3 to 5 years of experience in oil and gas industry of which 2 years should be as a contract Engineer.\n\tA degree in Engineering, Management or Social Sciences (preferably Supply Chain)\n\tMembership of relevant professional bodies in the Supply Chain and in Operational functions will be an added advantage.\n\tProficiency in MS Office Suites (Word, Excel, PowerPoint)\n\tDemonstrable general knowledge and understanding of commercial, legal and insurance issues affecting the company in general.\n\tExcellent communication skills.\n\tExcellent presentation skills\n\tVery good organizational skills\n\t Reasonable knowledge of SAP tool.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]