[
  {
    "title": "Employee Service Officer Job at Lheon Consulting Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/employee-service-officer-job-at-lheon-consulting-limited",
    "pubDate": "Tue, 24 Jun 2025 15:17:41 GMT",
    "source": "JobGurus",
    "keyword": "lheon consulting limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Lheon Consulting Limited is a strategy development and talent consultancy company, devoted exclusively to career shaping and personal development activities.We work globally with professionals and experts in the financial sectors to offer resourceful training, assessment and recruitment services to financial and non-bank financial institutions through use of innovative technologies to achieve a perfect workplace.\n\nWe are recruiting to fill the position below:\n\nJob Position: Employee Service Officer\nJob Location: Lagos\nEmployment Type: Full-time\n\nResponsibilities\nOnboarding:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tEnsure all employee profiles are created, and fully onboarded on the company’s Employee Management Software. Also, ensure that all correct documents are fully uploaded.\n\tEnsure that appropriate offer letters are generated in line with the SLA with respective client\n\n\nEmployee Relationship Management:\n\n\n\tMaintain an up to date database of all employees\n\tAttend to all employees’ enquiries, calls, mails on loans, vacations, offer letters.\n\tManage employees’ relations bothering on deployment, compensation, disciplinary action, conflict resolution and interpretation/application of policies and procedures.\n\tPlan and facilitate periodic village meetings with employees.\n\tManage the official WhatsApp groups with proper engagement of staff.\n\tConduct periodic feedback survey on the quality of the company’s service to outsourced employees.\n\n\nClient Relationship Management:\n\n\n\tManage clients’ audit enquiry, query, and periodic assessment.\n\tPrepare monthly/quarterly activity report of activities.\n\n\nPerformance Management:\n\n\n\tConduct performance appraisals exercise for outsourced staff.\n\tNegotiate with clients on appraisal outcomes and rewards.\n\tPrepare training needs and schedule training for outsourced employees.\n\n\nPayroll Processing:\n\n\n\tEnsure submission of accurate salary variations promptly every month\n\tEnsure reconciliation of monthly invoice information with payroll variation information and submit to Finance for invoicing to client.\n\n\nRequirements\n\n\n\tCandidates should possess a Bachelor's Degree with 3 - 7 years of work experience.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: talentspool@phillipsoutsourcing.net using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Assistant Secretary Job at TopHire Africa",
    "link": "https://www.jobgurus.com.ng/jobs/view/assistant-secretary-job-at-tophire-africa",
    "pubDate": "Tue, 24 Jun 2025 15:17:41 GMT",
    "source": "JobGurus",
    "keyword": "tophire africa",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "TopHire Africa is a timeless and innovative HR-Consulting Service provider that's geared towards delivering recruitment and training of qualitatively verified talent.\n\nWe are recruiting to fill the position below:\n\nJob Position: Assistant Secretary\n\nJob Location: Lagos \nEmployment Type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAssistant Company Secretarywith 10 - 12 years relevant experience to assist the Group Company Secretary in ensuring the efficient administration, legal framework of the Company and maintenance of best-in-class governance.\n\tProven experience in at least one of our investment sectors: power, hospitality, oil and gas, or energy is an added advantage.\n\n\nResponsibilities\n\n\n\tSupport the Group Company Secretary in ensuring effective corporate\n\tgovernance practices and compliance with statutory and regulatory obligations across the Group and its subsidiaries.\n\tCoordinate and document Board, Board Committee, and General\n\tMeetings, including preparing meeting notices, collating and distributing board packs, attending meetings, recording high-quality minutes, and tracking follow-up actions.\n\tMaintain and routinely update statutory registers and the corporate compliance calendar, ensuring timely filings and alerts for key governance activities.\n\tPrepare and file statutory returns and disclosures with regulatory\n\tbodies such as the Corporate Affairs Commission (CAC), Securities and\n\tExchange Commission (SEC), and Nigerian Exchange Group (NGX) in line with regulatory timelines.\n\tAssist in the end-to-end planning and execution of the Annual General\n\tMeeting (AGM), including preparation of the notice of meetingshareholder communications, and engagement with registrars andservice providers.\n\tProvide governance and administrative support in relation to Board and\n\tCommittee evaluations, policy reviews, and implementation of Boarddecisions.\n\tSupport the onboarding, induction, and continuous education odirectors, including the preparation of induction materials and trainingschedules.\n\tConduct preliminary legal and regulatory research to supportsecretariat operations and advisory governance.\n\tLiaise with external counsel, registrars, and other service providers oncorporate governance and regulatory compliance matters.\n\tSupport the management of governance documentation including\n\tBoard resolutions, policy archives, charters, and corporate filings.\n\tAssist in the coordination and oversight of secretarial functions forsubsidiaries within the Transcorp Group to ensure standardization andalignment with group governance requirements.\n\tSupervise junior members of the Company Secretariat team andsupport\n\n\nCompetencies:\n\n\n\tStrong legal acumen with the ability to interpret and apply complex legislation, regulatory guidance\n\tDemonstrated ability to manage Board and Committee operations with discretion, professionalism, and high attention to detail.\n\tExcellent drafting, proofing, and communication skills, with a mastery of minute-taking, Board reports, and regulatory submissions.\n\tProficient in the use of Board management software (e.g., Diligent,\n\tBoard Effect) and document collaboration tools.\n\tTrack record of engaging effectively with senior stakeholders including regulators, institutional shareholders, and Board members.\n\tCapable of designing, implementing, and monitoring governance frameworks and internal controls across a multi-subsidiary group.\n\tStrong project management skills with the ability to manage multiple high-stakes deliverables concurrently.\n\tAdept at risk identification and mitigation from a governance, reputational, and compliance perspective.\n\n\nSalary\nN700,000 Monthly.\n\nMethod of Application\nInterested and qualifed candidate should send their CV to: tophireafrica@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Senior Human Resources Manager Job at SAO Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/senior-human-resources-manager-job-at-sao-group-1",
    "pubDate": "Tue, 24 Jun 2025 15:17:41 GMT",
    "source": "JobGurus",
    "keyword": "sao group",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "SAO Group is one of Africa’s leading Social Impact Investment and Advisory firm operating exclusively in the agriculture sector across Africa, particularly in Nigeria. We are seeking to create positive economic impact and long-term value for private investors from the project planning to commissioning stage executed by carefully selected experts specific to each project and business unit within the Group.\n\nWe are a firm with a national and global outlook that focuses on the strategic development of transformational projects that create a sustainable economic impact for our investors, the companies we invest in, and the communities in which we work.\n\nWe are recruiting to fill the position below:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Position: Senior Human Resources Manager\n\nJob Location: Abuja\nType of job: Full time\n\nDescription\n\n\n\tAre you ready to work with multi-disciplinary teams? Do you thrive in complex environments, leading high-performing teams to achieve ambitious goals?\n\tSAO Group is seeking a well experienced Head of Human Resources who will be a member of the Senior Management Team, and will be responsible for developing, defining coordinating all human resource functions within the organization.\n\tYou will be responsible for developing policies and procedures pertinent to organizational culture and processes as well as supporting all members of staff in order to ensure they reach their potential within the group.\n\n\nWhat You’ll Do\n\n\n\tProvide managerial and leadership responsibility to staff in alignment with the company’s business plan and overall strategic vision.\n\tDevelop standard operating procedures and policy documents and ensure that all members of staff understand and adhere to these documents.\n\tChampion the development of a strong company culture.\n\tProvide advice and coaching to all members of staff on all employee-related concerns like performance management, employee development, policies etc.\n\tContinuously seek to enhance an engaging culture with the organization to improve employee experience.\n\tDevelop a companywide performance review structure and feedback mechanism.\n\tOversee all HR functions from recruitment up till retirement.\n\tProvide advisory services to the executive management on issues related to but not limited to members of staff.\n\tAnalyze trends and data related to employees to proffer solutions, advise, training programs and increase retention.\n\tOther responsibilities that may be added based on business requirements.\n\n\nRequirements\n\n\n\tBachelor’s Degree in Human Resources, Personnel Management, or any other related field\n\tMaster’s Degree in Management, Administration or related other fields.\n\tRelevant 8 years of experience in human resource management, of which 5 years should be managerial.\n\tYou have a strong ability to independently make well-informed decisions and maintain the highest level of confidentiality.\n\tPreferred professional certification in SPHR, CIPD, CIPM, SHRM-CP CORE SKILLS.\n\n\nWhy Join Us?\n\n\n\tAt SAO Group, you’ll be at the forefront of influencing the future of impactful businesses across Africa.\n\tWe offer a competitive salary and benefits package, a fast-paced and dynamic work environment, and the opportunity to make a real difference.\n\n\nMethod of Application\nInterested and qualified candidates should send their Resume and Cover Letter to: info@saocap.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Motion / Asset Designer Job at Roqqu Nigeria Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/motion-asset-designer-job-at-roqqu-nigeria-limited-1",
    "pubDate": "Tue, 24 Jun 2025 15:17:41 GMT",
    "source": "JobGurus",
    "keyword": "roqqu nigeria limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Roqqu Nigeria Limited is recruiting qualified candidates to fill the position below:\n\nJob Position: Motion / Asset Designer\n\nJob Location: Ikota Villa, Lagos\nEmployment Type: Full-time\n\nAbout the Role\n\n\n\tWe are looking for a Motion/Asset Designer to join our development team and bring our digital experiences to life through engaging animations and motion graphics.\n\tYour work will enhance UI interactions, marketing content, and product visuals, making them more dynamic, intuitive, and impactful.\n\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDesign and create high-quality motion graphics, animations, and transitions for web and mobile interfaces.\n\tCollaborate with designers, developers, and product teams to integrate motion seamlessly into our digital experiences.\n\tWork on micro-interactions, loading animations, explainer videos, and other motion-based assets.\n\tOptimize animations for performance across various platforms and devices.\n\tMaintain consistency with brand guidelines while pushing creative boundaries.\n\tExperiment with new motion trends and bring fresh ideas to the team.\n\n\nRequirements\n\n\n\t3+ years of experience in motion design, animation, or a similar role.\n\tProficiency in tools like After Effects, Lottie, Figma, Cinema 4D or Blender\n\tStrong understanding of UI animations, motion principles, and user interaction patterns.\n\tAbility to work with developers to implement animations using tools like Lottie or GIF\n\tA portfolio showcasing creative motion work and its impact on user experience.\n\tStrong communication skills and ability to work in a collaborative, fast-paced environment.\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]