[
  {
    "title": "Entry-Level HR Assistant Job at Avatar New Energy Materials Company Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/entry-level-hr-assistant-job-at-avatar-new-energy-materials-company-limited",
    "pubDate": "Sat, 21 Jun 2025 11:13:23 GMT",
    "source": "JobGurus",
    "keyword": "avatar new energy materials company limited",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "Avatar New Energy Materials Co. Limited is a pioneering Chinese Company in Nigeria's mining sector, specializing in the exploration, mining, and processing of lithium. We arej committed to sustainable practices, innovative technologies, and community development. Our mission is to become a leading supplier of high-quality lithium products, driving the global transition to renewable energy. The company's business scope includes mining investment, project operations, mining, spodumene acquisition/processing/sales, geological exploration drilling, Technical consultation, metal (non-metal) laboratory analysis, etc.we are located in Nasarawa State.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Entry-Level HR Assistant\n\nJob Location: Kama-Otto, Nasarawa (10km away from Federal Polytechnic Nasarawa, Loko Road)\nEmployment Type: Full-time\n\nKey Responsibilities\n\n\n\tAssist with recruitment processes, including posting job ads and scheduling interviews\n\tMaintain employee records and update HR databases\n\tSupport onboarding and offboarding processes\n\tHelp coordinate training sessions and HR events\n\tProvide general administrative support to the HR department.\n\n\nRequirements\n\n\n\tA Degree in Human Resources, Business Administration, or a related field is preferred.\n\t1 - 2 years of experience in an HR or administrative role\n\tStrong organizational and communication skills\n\tProficiency in Microsoft Office Suite.\n\n\nWhat We Offer\n\n\n\tCompetitive salary (N120,000 - N150,000 monthly)\n\tOpportunities for professional development\n\tA collaborative and supportive work environment.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and a brief cover letter to: hr@avtne.com using “HR Assistant\" as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Accounts Receivable Officer Job at Sahara Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/accounts-receivable-officer-job-at-sahara-group-1",
    "pubDate": "Sat, 21 Jun 2025 11:13:23 GMT",
    "source": "JobGurus",
    "keyword": "sahara group",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Sahara Group is a leading international energy and infrastructure conglomerate with operations in over 38 countries across Africa, Middle East, Europe and Asia. Spanning three decades, we have broken ground and challenged stereotypes across the global business landscape. The women and men who make up our organization are our strongest levers for growth.\n\nWe are recruiting to fill the position below:\n\nJob Position: Accounts Receivable Officer\n\nJob Identification: 373\nJob Location: Ijora, Lagos\nEmployment Type: Full Time\n\nRole Accountabilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tSupport the corporate strategy of the business with the view to ensuring its consistent profitability and continued daily posting of sales into the financial system\n\tPrompt confirmation of customer payment to the Sales and Marketing Team\n\tPrompt preparation of customer sales invoice\n\tPosting of customer receipt and matching with the appropriate invoice\n\tPreparation of weekly sales and customer balances report \n\tFiling of waybills, invoices, cashbook receipts and other relevant document\n\tMaintain and update the customer receivable worksheet\n\tFollow up on customer unpaid balances \n\tCheck and ensure the correctness of statutory deductions made on customer invoices.\n\tOther responsibilities as assigned.\n\n\nRequirements\n\n\n\tMust possess very sound knowledge of basic accounting\n\tBasic knowledge of taxes and statutory deductions in Nigeria\n\tMust be able to do simple analysis and interpretation of financial transactions.\n\tDemonstrate ability to meet deadlines, determine priorities and organize work to meet objectives and identify and deal with problems\n\tOutstanding attention to detail with an ability to reconcile complex accounts\n\tAbility to maintain strong relationships with external parties and internal colleagues\n\tKnowledgeable in IFRS.\n\n\nRequirements\n\n\n\tBachelor’s Degree in Accounting, Economics or relevant field\n\tAt least 1 - 2 years of post NYSC work experience in a similar role.\n\tMust have commenced ICAN examination with Intermediate level passed at a minimum\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Sales Executive - Machine Job at Mantrac",
    "link": "https://www.jobgurus.com.ng/jobs/view/sales-executive-machine-job-at-mantrac",
    "pubDate": "Sat, 21 Jun 2025 11:13:23 GMT",
    "source": "JobGurus",
    "keyword": "mantrac",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Mantrac is the sole distributor for Caterpillar products in Nigeria, distributing and supporting machinery, power systems and material-handling equipment. The company provides customers with comprehensive solutions, backed by technical know-how, experience and in-depth knowledge of their local markets.\n\nWe are recruiting to fill the position below:\n\nJob Position: Sales Executive - Machine\n\nJob Location: Lagos\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tResponsible for achieving or exceeding agreed sales targets for the Company’s range of EPG (Electric Power Generation) products within the assigned geographical territory and market sector.\n\n\nMain Function\n\n\n\tObtain order that meet or exceed agreed targets and negotiate equipment sales into high valued projects.\n\tEnsure that full payments are received for all units sold while all necessary sales documents are adequately prepared.\n\tProvide product related technical assistance and advise to customers and prospects\n\tObtain and communicate information relating to the market and competition as appropriate.\n\tArrange visits to existing and prospective customers to ensure maximum coverage of the territory.\n\tAggressively promote the company’s product within the catchment area and win more prospects there from.\n\tMaintain good corporate reputation and effective communication between our clients/customers and MNL Management.\n\n\nRequirements\n\n\n\tCandidates should possess a B.Sc./ HND in Engineering or equivalent. \n\tAt least 2 years of experience in the industry (sales, marketing & technical experience). \n\tGood written and spoken English. \n\tInterpersonal and communication skills with leadership skills and ability to take the initiative. \n\tGood analytical and computer skills. \n\tHaving good selling skills is an advantage.\n\n\nMethod of Application\nInterested and qualified candidates should forward their CV to: recruitment@mantracnigeria.com using the Job Position as subject of email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Maintenance Officer Job at Sahara Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/maintenance-officer-job-at-sahara-group-1",
    "pubDate": "Sat, 21 Jun 2025 11:13:23 GMT",
    "source": "JobGurus",
    "keyword": "sahara group",
    "duplicate": false,
    "classifications": [],
    "content": "Sahara Group is a leading international energy and infrastructure conglomerate with operations in over 38 countries across Africa, Middle East, Europe and Asia. Spanning three decades, we have broken ground and challenged stereotypes across the global business landscape. The women and men who make up our organization are our strongest levers for growth.\n\nWe are recruiting to fill the position below:\n\nJob Position: Maintenance Officer\n\nJob Identification: 374\nJob Location: Ijora, Lagos\nEmployment Type: Full Time\n\nRole Accountabilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tEnsure daily, weekly and monthly checks on all depot equipment to ensure smooth running of operations.\n\tEnsure all facility equipment is working optimally.\n\tMaintain equipment service records.\n\tEnsure availability of equipment spare parts.\n\tEnsure compliance with company HSE policy in the execution of all maintenance activities.\n\tEnsure timely and precise reports on all maintenance activities to the line manager.\n\tPrompt response to reports on faults of equipment and tools.\n\tEffective negotiation to reduce the cost of equipment maintenance.\n\tPlan and prioritize facility maintenance to ensure no disruption/downtime to loading and discharging activities.\n\tEnsure the cost of maintenance is within the approved budget.\n\tProvide support during quality audits from regulatory bodies.\n\tOther assigned responsibilities.\n\n\nRequirements\n\n\n\tOND in Electrical Engineering or relevant field\n\tRelevant professional training and certification is highly desirable\n\tAt least 2 years of work experience in a similar role.\n\tExperienced in installation, servicing and maintenance of Power generators and valves.\n\tGood working knowledge of process line fittings installation, and maintenance.\n\tGood working knowledge of Pumps and Motors.\n\tGood working knowledge of project management.\n\tGood working experience in engine assembly in accordance with engineering drawings.\n\tGood working experience in HSE management.\n\tGood working knowledge of maintenance management.\n\tGood working knowledge of Air conditioning servicing.\n\tDiesel Generator installations and maintenance.\n\tExperience in piping pipeline and process control.\n\n\nWorking Relationship:\n\n\n\tTerminal Manager\n\tMaintenance Dept\n\tFacility Manager\n\tOther Departments\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Accountant Job at Skipper Eye-Q Super Specialty Eye Hospital",
    "link": "https://www.jobgurus.com.ng/jobs/view/accountant-job-at-skipper-eye-q-super-specialty-eye-hospital",
    "pubDate": "Sat, 21 Jun 2025 11:13:23 GMT",
    "source": "JobGurus",
    "keyword": "skipper eye-q super specialty eye hospital",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Skipper Eye-Q Super Speciality Eye hospital is an International Eye Hospital chain with the presence of 30 in India and 4 in Nigeria handling all types of Eye Surgeries such as Cataract, Retina, Glaucoma, Presbyopia, Cornea, Squint, Refractive error and other vision problems, having treated 10+ Million patients.\n\nWe are recruiting to fill the position below:\n\nJob Position: Accountant\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tManage all accounting transactions.\n\tPrepare budget forecasts.\n\tPublish financial statements in time.\n\tHandle monthly, quarterly and annual closings.\n\tManage balance sheets and profit/loss statements.\n\tReport on the company’s financial health and liquidity.\n\tAudit financial transactions and documents.\n\tReconcile accounts payable and receivable.\n\tEnsure timely bank payments.\n\tCompute taxes and prepare tax returns.\n\tReinforce financial data confidentiality and conduct database backups when necessary.\n\tCompiling, analyzing, and reporting financial data.\n\tPresenting data to managers, investors, and other entities.\n\tComply with financial policies and regulations.\n\tComplying with all company, local, state, and federal accounting and financial regulations.\n\tKeeping informed about current legislation relating to finance and accounting.\n\tAssisting management in the decision-making process by preparing budgets and financial forecasts.\n\n\nRequirements and skills\n\n\n\tB.Sc in Accounting, Finance or relevant Degree.\n\tMinimum of 6 - 7 years of work experience as an Accountant is required.\n\tExcellent knowledge of accounting regulations and procedures, including the Generally Accepted Accounting Principles (GAAP).\n\tHands-on experience with accounting softwares such as SAP and others.\n\tAdvanced MS Excel skills including Vlookups and pivot tables.\n\tExperience with general ledger functions.\n\tStrong attention to detail and good analytical skills.\n\n\nMethod of Application\nInterested and Qualified candidates should send CV to skippereyeqhospitals@gmail.com using the Job Position as the subject of the mail    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]