[
  {
    "title": "Job Openings at Estrada International Staffing Solutions",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-estrada-international-staffing-solutions-1",
    "pubDate": "Mon, 04 Aug 2025 11:15:46 GMT",
    "source": "JobGurus",
    "keyword": "estrada international staffing solutions",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Estrada International Staffing Solutions is a strategic boutique specialist recruitment consulting firm, serving clients with expertise recruitment services across all sectors ranging from Banking, Insurance, Oil and Gas, Telecommunications, FMCGs and Construction, with the aim of satisfying their recruitment needs.\n\nWe pride ourselves in the finesse we adopt in our recruitment service delivery. We match our clients’ expectations to pool unique talents and enable them effect positive change management which delivers organizational objectives. We also drive positive career growths for our talents.\n\nWe are recruiting to fill the following positions below:\n\n1.) Business Development Manager (Asset Management)\n     \n\n            \n    \n\n\n\nJob Location: Lekki, Lagos\nEmployment Type: Full-time\n\nAbout the Role\n\n\n\tThe Business Development Manager will be responsible for driving the growth of the firm’s deposit and loan portfolio by leveraging existing networks, building new strategic partnerships, and strengthening the firm’s visibility within the financial ecosystem.\n\tThe ideal candidate must have a strong background in financial services (especially banking or asset management) and a deep understanding of loan structuring and fixed deposit mobilization.\n\n\nKey Responsibilities\n\n\n\tSource and mobilize fixed deposits from individuals and institutions.\n\tMarket and originate structured loan products for qualified clients.\n\tManage client relationships to drive product adoption and client retention.\n\tIdentify and close new business opportunities across corporate and individual clients.\n\tConduct regular market intelligence and competitor benchmarking.\n\tEnsure compliance with regulatory and internal risk management standards.\n\tWork closely with internal teams to ensure seamless service delivery.\n\n\nRequirements\n\n\n\tA First Degree in Business Administration, Finance, or related fields\n\tMinimum of 5 years of experience in business development within asset management, commercial banking, or finance houses.\n\tProven experience in deposit mobilization and loans structuring.\n\tProfessional certifications will be an added advantage.\n\tStrong client network in the Lagos financial market.\n\tExcellent communication, interpersonal and negotiation skills.\n\n\nSalary\nN500,000 - N800,000 Net Monthly Pay (depending on experience).\n\nApplication Closing Date: 4th September, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: au.okpaire@estradaintl.com using \"BDM – Asset Management Application\" as the subject of the email.\n\n \n\n \n\n2.) Welder\n\nJob Location: Lagos\nEmployment Type: Contract\n\nJob Summary\n\n\n\tThey are seeking an experienced Welder with at least 4 years’ experience in maintenance and metal works for hospitality facilities.\n\tCandidate must be skilled in welding and general fabrication.\n\n\nKey Duties\n\n\n\tWeld and repair gates, frames, kitchen fittings, etc.\n\tInterpret technical drawings and carry out fabrication.\n\tPerform routine maintenance and emergency repairs.\n\tEnsure all work meets safety and quality standards.\n\n\nRequirements\n\n\n\tCandidates should possess an SSCE / GCE / NECO.\n\tMinimum 4 years in welding.\n\n\nSalary\nN80,000 / month.\n\nApplication Closing Date: 5th September, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: m.okhipo@estradaintl.com using the Job Position as the subject of the email.\n\n \n\n \n\n3.) Sales Coordinator\n\nJob Location: Surulere, Lagos\nEmployment Type: Full-time\n\nResponsibilities\n\n\n\tSupervise and guide field agents responsible for scouting and onboarding neighborhood distributors.\n\tSet sales targets and monitor agent performance.\n\tIdentify and engage potential distributors, retailers, and bulk buyers.\n\tBuild community-level partnerships to expand market reach.\n\tMaintain a database of leads and onboarded partners.\n\tProvide regular performance updates and support field execution.\n\n\nRequirements\n\n\n\tCandidates should possess relevant qualifications with 1 - 2 years of experience.\n\n\nSalary\nN100,000 Monthly.\n\nApplication Closing Date: 29th August, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: i.ayorinde@estradaintl.com using the Job Position as the subject of the email.\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Vacancies at Laprenge staffings Solutions",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancies-at-laprenge-staffings-solutions",
    "pubDate": "Mon, 04 Aug 2025 11:15:46 GMT",
    "source": "JobGurus",
    "keyword": "laprenge staffings solutions",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Laprenge staffings Solutions is a leading provider of Human Resources and HR solutions, dedicated to empowering businesses and individuals through cutting-edge products and services. Our mission is to drive growth, efficiency, and success in a rapidly evolving digital space.\n\nWe are recruiting to fill the following positions below:\n\n1.) Personal Assistant\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nRequirements\n\n\n\tInterested candidates should possess an HND / B.Sc Degree with 2 - 3 years of work experience. \n\n\nApplication Closing Date: 10th August, 2025.\n     \n\n            \n    \n\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: laprengecandidate@gmail.com using the Job Position as the subject of the email.\n\n \n\n2.) Content Creator\n\nJob Location: Lagos Mainland, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe're seeking a talented Content Creator to join our team. The successful candidate will be responsible for developing high-quality, engaging content across various platforms, including social media, blogs, and websites.\n\n\nKey Responsibilities\n\n\n\tCreate compelling content (text, images, videos) that resonates with our target audience.\n\tDevelop and implement content strategies to drive engagement and conversions.\n\tConduct research to stay up-to-date on industry trends and best practices.\n\tCollaborate with cross-functional teams to ensure brand consistency.\n\tOptimise content for SEO and analytics.\n\n\nRequirements\n\n\n\tStrong writing, editing, and visual creation skills.\n\tExperience with content management systems (CMS).\n\tAbility to work independently and meet deadlines. \n\n\nWhat We Offer\n\n\n\tOpportunity to work with a dynamic team.\n\tProfessional development and growth opportunities.\n\tFlexible work\n\n\nApplication Closing Date: 10th August, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: laprengecandidate@gmail.com using the Job Position as the subject of the email.\n\n \n\n \n\n3.) Human Resources Manager\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe're seeking an experienced HR professional to join our team.\n\tThe successful candidate will be responsible for managing and implementing HR initiatives, policies, and procedures to support the organization's growth and success.\n\n\nKey Responsibilities\n\n\n\tRecruitment and Talent Acquisition: Manage job postings, interviews, and hiring processes.\n\tEmployee Relations: Handle employee conflicts, grievances, and performance issues.\n\tBenefits and Compensation: Administer employee benefits, compensation, and payroll.\n\tTraining and Development: Design and deliver training programs to enhance employee skills.\n\tPolicy Development: Develop, implement, and communicate HR policies and procedures.\n\tCompliance: Ensure compliance with labor laws, regulations, and company policies.\n\n\nQualifications\n\n\n\tInterested candidates should possess relevant qualifications with 3 - 5 years of work experience.\n\n\nApplication Closing Date: 14th August, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: laprengecandidate@gmail.com using the Job Position as the subject of the mail.\n\nNote: For more enquiries, contact 08146153631, WhatsApp only.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Vacancies at RA Trading and Investment",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancies-at-ra-trading-and-investment",
    "pubDate": "Mon, 04 Aug 2025 11:15:46 GMT",
    "source": "JobGurus",
    "keyword": "ra trading and investment",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "RA Trading and Investment - Our Think Design is Nigeria's foremost manufacturer of custom interior designs. R.A. Think Design is an Israeli-Nigerian Interior Design and Custom-made Furniture company that caters to commercial and residential projects.\n\nWe are recruiting to fill the following positions below:\n\n1.) Sprayer\n\nJob Location: Ketu Ikosi, Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n            \n    \n\n\n\n\n\tWe are currently seeking a skilled and detail-oriented Sprayer to join our production team.\n\tThe Sprayer will be responsible for applying finishes, stains, and protective coatings to furniture components and products using various spraying equipment and techniques.\n\n\nJob Descriptions\n\n\n\tPrepare furniture surfaces for finishing by sanding, cleaning, and applying appropriate primers or sealers as needed.\n\tOperate spraying equipment, including airless sprayers, HVLP (High Volume Low Pressure) sprayers, and electrostatic sprayers, to apply stains, paints, lacquers, and other finishes to furniture components and products.\n\tMix and prepare finishing materials according to specified formulas, ensuring proper viscosity, color matching, and consistency.\n\tApply finishes to furniture surfaces in accordance with production schedules and quality standards, achieving desired color, sheen, and coverage.\n\tMonitor spraying equipment for proper functioning and perform routine maintenance tasks such as cleaning, calibrating, and replacing worn parts.\n\tInspect finished products for defects, runs, or imperfections, and make necessary adjustments to spraying equipment or techniques to ensure quality results.\n\n\nRequirements\n\n\n\tHigh school diploma or equivalent required; additional training or certification in finishing techniques or woodworking preferred.\n\tProven experience (5 years) working as a sprayer in a furniture manufacturing or woodworking environment.\n\tProficiency in operating various types of spraying equipment and familiarity with different types of finishes, stains, and coatings.\n\tStrong attention to detail and ability to achieve consistent, high-quality finishes on furniture surfaces.\n\tAbility to interpret technical drawings, specifications, and finishing instructions.\n\n\nSalary\nN80,000 - N120,000 Monthly. \n\nMethod of Application\nInterested and qualified candidates should send their CV to: admin@ra-nigeria.com using the Job Position as the subject of the mail.\n\n \n\n2.) Factory Assistant / Labourer\n\nJob Location: Ketu Ikosi, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe are looking for Factory Assistants to provides essential support and ensure the production process runs smoothly.\n\tRole includes material handling, assisting machine operators, assisting in assembling furniture parts, maintaining cleanliness of company environment and the work area, and performing quality checks.\n\n\nResponsibilities\n\n\n\tAssist in the assembly and production of furniture pieces according to specifications.\n\tOperate or assist with machinery under supervision, including saws, drills, and sanders.\n\tMove and organize raw materials, semi-finished goods, and finished products in the production area.\n\tFollow health, safety, and quality standards and comply with company policies.\n\tMaintain a clean, safe, and organized work area.\n\tPack and prepare products for shipping, ensuring correct labeling and packaging.\n\tReport any equipment malfunctions or safety hazards to the supervisor.\n\n\nRequirements\n\n\n\tTechnical school certificate / vocational training woodworking or manufacturing is a plus\n\tMinimum of a year experience in a factory or manufacturing environment, preferably in furniture or woodworking, is an advantage\n\tPhysical stamina to perform repetitive tasks and lift materials up to a specified weight limit.\n\tStrong attention to detail and commitment to quality.\n\tAbility to follow instructions and work well in a team environment.\n\tReliability and punctuality.\n\tGood communication skills for effective collaboration.\n\tA proactive attitude toward learning new tasks and improving efficiency.\n\n\nSalary\nN70,000 Monthly. \n\nMethod of Application\nInterested and qualified candidates should send their CV to: admin@ra-nigeria.com using the Job Position as the subject of the mail.\n\n \n\n3.) Furniture Maker\n\nJob Location: Ketu Ikosi Road, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe are looking for a qualified Carpenter to cut, fabricate and install wooden and other structures according to specifications. Your job will entail working in the factory to produce quality and functional furniture products\n\n\nResponsibilities\n\n\n\tRead and understand blueprints, sketches, and design specifications.\n\tChoose appropriate materials (wood, metal, fabric, etc.) based on design and functionality.\n\tInspect materials for quality and suitability.\n\tEnsure joints are secure and pieces fit together correctly.\n\tInspect completed pieces for accuracy, quality, and adherence to design specifications.\n\tMake necessary adjustments or repairs.\n\tMaintain and repair tools and equipment.\n\tKeep the work area clean and organized.\n\tWork closely with other team members, including designers, carpenters, and finishers.\n\tMeasure and mark materials according to specifications.\n\tUse hand tools, power tools, and machinery to cut, shape, and form parts.\n\tAssemble parts using nails, screws, adhesives, and other fasteners.\n\tProvide input on design improvements and production processes.\n\tUse protective equipment and ensure a safe working environment.\n\tMaintain detailed logs of work processes and completed tasks.\n\n\nQualifications\n\n\n\tMinimum of SSCE and Completion of a recognized apprenticeship or a minimum of 5 years of experience as a carpenter.\n\tAdditional certification like a trade test may be required\n\tAn analytical mind for problem-solving\n\tThe ability to work alone or as part of a small team\n\tAbility to follow instructions closely\n\tAttention to detail.\n\n\nSalary\nN100,000 - N120,000 per month. \n\nMethod of Application\nInterested and qualified candidates should send their CV to: admin@ra-nigeria.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Front Desk Customer Service / Billing Officer Job at Falcon Peak Solutions Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/front-desk-customer-service-billing-officer-job-at-falcon-peak-solutions-limited",
    "pubDate": "Mon, 04 Aug 2025 11:15:46 GMT",
    "source": "JobGurus",
    "keyword": "falcon peak solutions limited",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "(function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){\n        (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),\n        m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)\n    })(window,document,'script','//www.google-analytics.com/analytics.js','ga');\n\n    ga('create', 'UA-43112273-1', 'jobgurus.com.ng');\n    ga('send', 'pageview');\n\n\n\n\n    \n        \n    Home\n    Jobs\n    Free Aptitude Test Practice\n    Employer? Post a Job\n            Register\n        Sign in\n        Contact us\n    \n\n    \n\n        \n    \n        \n\n            \n\n                \n\n                    \n                        Toggle navigation\n                        \n                        \n                        \n                    \n\n                    \n                \n            \n\n            \n                \n\n\tJobs\n\tJob Seekers\n\tAptitude Test\n\tScholarships\n\n            \n\n            \n                \n\n                                            Register\n                        Sign in\n                    \n                    Employer? Post a Job\n                \n            \n\n        \n\n    \n\n        \n        \n            \n            \n                 \n    \n                    \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n        \n     \n\n\n                            \n                    \n        \n                        CLICK HERE TO JOIN OUR WHATSAPP CHANNEL \n                    \n    \n\n    \n                                \n                    \n\n                        \n                            \n                        \n\n                        \n                            \n                                Any Specialization\n                                                                    Accounting / Audit / Finance\n                                                                    Administration/ Office/ Operations\n                                                                    Advertising/ Social Media/ Marketing/ PR\n                                                                    Agriculture / Agro Allied\n                                                                    Analyst/ Quality Control\n                                                                    Automotive/ Car Services\n                                                                    Aviation / Airline\n                                                                    Banking / Insurance\n                                                                    Building Design / Architecture\n                                                                    Construction / Mining\n                                                                    Consulting / Business Strategy/ Planning\n                                                                    Craftsmen / Artisans\n                                                                    Creatives (Arts, Design, Fashion)\n                                                                    Customer Service\n                                                                    Domestic / Janitorial Services\n                                                                    Driving / Haulage\n                                                                    Education / Teaching / Training\n                                                                    Engineering / Technical\n                                                                    Executive / Management\n                                                                    Freelance / Data Entry\n                                                                    Government Agencies / Public Sector\n                                                                    Graduates / Freshers\n                                                                    Grants /  Scholarships\n                                                                    Hospitality / Food Services\n                                                                    HSE / Safety Management\n                                                                    Human Resources / Recruitment\n                                                                    Information Technology / ICT\n                                                                    Internship/ Industrial Training\n                                                                    Legal / Law\n                                                                    Logistics / Transportation/ Supply\n                                                                    Manufacturing / Production\n                                                                    Maritime Services / Shipping\n                                                                    Media / Art / Entertainment\n                                                                    Medical/ Healthcare / Pharmaceutical\n                                                                    Military / Para-Military\n                                                                    NGO / Community Services\n                                                                    Oil & Gas / Energy\n                                                                    Procurement/ Purchasing\n                                                                    Project Management\n                                                                    Real Estate / Property / Surveying\n                                                                    Research / Survey\n                                                                    Risk Management / Compliance\n                                                                    Sales / Business Development\n                                                                    Secretarial / PA\n                                                                    Security / Intelligence\n                                                                    Software/ Programming / Web development\n                                                                    Sports / Fitness\n                                                                    Supply Chain/ Store\n                                                                    Technicians\n                                                                    Telecommunications\n                                                                    Tourism / Travels\n                                                                    Vocational Trade and Services\n                                                            \n                        \n\n                        \n                            \n                                Any Work Level\n                                                                    Entry Level (Trainee)\n                                                                    Executive (Director, Head of Dept)\n                                                                    Experienced (Non-Manager)\n                                                                    Internship\n                                                                    Manager (Staff Supervisor)\n                                                                    Senior Executive (MD, CEO, COO)\n                                                                    Vocational (Skilled/Unskilled Labour)\n                                                            \n                        \n\n                        \n                            \n                                 Search\n                            \n                        \n                    \n                \n                            \n            \n\n\n\n\n\n\n            \n\n                \n                                        \n                    \n                                        \n                    \n                    \n\n                    \n                        \n                        \n\n{\n  \"@context\": \"https://schema.org\",\n  \"@type\": \"JobPosting\",\n  \"title\": \"Front Desk Customer Service / Billing Officer\",\n  \"description\": \"Falcon Peak Solutions Limited is a recruiting firm that efficiently and effectively provides recruitment and other HR solutions. We are recruiting for a reputable specialist hospital in Lagos.\n\nWe are recruiting to fill the position below:\n\nJob Position: Front Desk Customer Service / Billing Officer\n\nJob Location:&amp;nbsp;Egbeda, Lagos\nEmployment Type: Full-time\nWorking Hours:&amp;nbsp;Night shift.\n\nJob Summary\n\n\n\tThe Front Desk Customer Service / Billing Officer serves as the first point of contact for patients and visitors at the hospital.\n\tThe role is responsible for welcoming clients, responding to inquiries, registering patients, and accurately managing billing processes.\n\tThe officer ensures seamless coordination between the front desk and other departments to enhance the overall patient experience and maintain accurate financial records.\n\n\nJob Responsibilities\nCustomer Service / Front Desk Duties:\n\n\n\tWelcome and attend to all patients, clients, and visitors in a friendly and professional manner.\n\tAnswer phone calls and direct them appropriately.\n\tProvide accurate information about hospital services, schedules, and processes.\n\tManage patient registration, update client records, and ensure proper documentation.\n\tCoordinate appointments and follow-up schedules with medical staff.\n\tHandle customer complaints, escalate complex issues, and ensure timely resolution.\n\tMaintain the front desk area in a clean and organised manner.\n\n\nBilling and Payment Processing:\n\n\n\tGenerate bills/invoices for consultations, investigations, procedures, and other services.\n\tVerify and process patients&amp;#39; insurance details or retainership information.\n\tReceive and record cash, card, or bank transfers from patients using the hospital&amp;rsquo;s billing software.\n\tIssue official receipts and maintain accurate financial records of daily transactions.\n\tReconcile daily payments and submit reports to the accounts or finance department.\n\tCollaborate with the clinical and accounts departments to ensure proper service costing and billing.\n\n\nQualifications and Experience\n\n\n\tMinimum of HND / BSc in Business Administration, Accounting, or related field.\n\tAt least 1 - 2 years of post-NYSC experience in customer service, billing, or front desk role.\n\tFamiliarity with hospital billing software or electronic medical record systems is an advantage.\n\tBasic accounting knowledge and proficiency in Microsoft Office Suite (Word, Excel, Outlook).\n\n\nSkills and Competencies:\n\n\n\tExcellent interpersonal and communication skills.\n\tStrong customer orientation and conflict resolution abilities.\n\tHigh level of integrity, attention to detail, and numerical accuracy.\n\tAbility to multitask and manage time effectively in a fast-paced environment.\n\tProfessional appearance and demeanour.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to:&amp;nbsp;hr@falconpeaksolutions.com&amp;nbsp;using the Job Position as the subject of the email.\",\n  \"datePosted\": \"2025-08-04\",\n  \"validThrough\": \"2025-08-30\",\n  \"employmentType\": \"Full-Time\",\n  \"hiringOrganization\": {\n    \"@type\": \"Organization\",\n    \"name\": \"Falcon Peak Solutions Limited\"\n    \n  },\n  \"jobLocation\": {\n    \"@type\": \"Place\",\n    \"address\": {\n      \"@type\": \"PostalAddress\",\n       \"postalCode\": \". \",\n       \"addressRegion\": \". \",\n       \"streetAddress\": \". \",\n      \"addressLocality\": \"Lagos\",\n      \"addressCountry\": \"NG\"\n     \n      \n    }\n  },\n  \"identifier\": {\n    \"@type\": \"PropertyValue\",\n    \"name\": \"\",\n    \"value\": \"185303\"\n  },\n  \"baseSalary\": {\n    \"@type\": \"MonetaryAmount\",\n    \"currency\": \"NGN\",\n    \"value\": {\n      \"@type\": \"QuantitativeValue\",\n      \"minValue\": 0,\n      \"maxValue\": 0,\n      \"unitText\": \"MONTH\"\n    }\n  }\n}\n\n\n\nFront Desk Customer Service / Billing Officer Job at Falcon Peak Solutions Limited\n\n\n\n\n        \n    \n\n        \n        Falcon Peak Solutions Limited is a recruiting firm that efficiently and effectively provides recruitment and other HR solutions. We are recruiting for a reputable specialist hospital in Lagos.\n\nWe are recruiting to fill the position below:\n\nJob Position: Front Desk Customer Service / Billing Officer\n\nJob Location: Egbeda, Lagos\nEmployment Type: Full-time\nWorking Hours: Night shift.\n\nJob Summary\n     \n\n            \n    \n\n\n\n\n\tThe Front Desk Customer Service / Billing Officer serves as the first point of contact for patients and visitors at the hospital.\n\tThe role is responsible for welcoming clients, responding to inquiries, registering patients, and accurately managing billing processes.\n\tThe officer ensures seamless coordination between the front desk and other departments to enhance the overall patient experience and maintain accurate financial records.\n\n\nJob Responsibilities\nCustomer Service / Front Desk Duties:\n\n\n\tWelcome and attend to all patients, clients, and visitors in a friendly and professional manner.\n\tAnswer phone calls and direct them appropriately.\n\tProvide accurate information about hospital services, schedules, and processes.\n\tManage patient registration, update client records, and ensure proper documentation.\n\tCoordinate appointments and follow-up schedules with medical staff.\n\tHandle customer complaints, escalate complex issues, and ensure timely resolution.\n\tMaintain the front desk area in a clean and organised manner.\n\n\nBilling and Payment Processing:\n\n\n\tGenerate bills/invoices for consultations, investigations, procedures, and other services.\n\tVerify and process patients' insurance details or retainership information.\n\tReceive and record cash, card, or bank transfers from patients using the hospital’s billing software.\n\tIssue official receipts and maintain accurate financial records of daily transactions.\n\tReconcile daily payments and submit reports to the accounts or finance department.\n\tCollaborate with the clinical and accounts departments to ensure proper service costing and billing.\n\n\nQualifications and Experience\n\n\n\tMinimum of HND / BSc in Business Administration, Accounting, or related field.\n\tAt least 1 - 2 years of post-NYSC experience in customer service, billing, or front desk role.\n\tFamiliarity with hospital billing software or electronic medical record systems is an advantage.\n\tBasic accounting knowledge and proficiency in Microsoft Office Suite (Word, Excel, Outlook).\n\n\nSkills and Competencies:\n\n\n\tExcellent interpersonal and communication skills.\n\tStrong customer orientation and conflict resolution abilities.\n\tHigh level of integrity, attention to detail, and numerical accuracy.\n\tAbility to multitask and manage time effectively in a fast-paced environment.\n\tProfessional appearance and demeanour.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hr@falconpeaksolutions.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n\n    \n    \n\n\n\n\n        \n        \n\n\n\n\n   \n\n\n    \n        Similar Jobs\n    \n\n    \n        \n                        Executive Assistant Job at Motomedia\n                        Receptionist Job at 95 Slide\n                        Admin Officer Job at African Foundries Limited (AFL)\n                        Office Assistant Job at Extramileage Consults Limited\n                        Senior Accountant Job at Toasties Limited\n                        Administration and Human Resources Assistant Job at Life At Best Development Initiative (LABDI)\n                        Internal Control / Compliance Officer Job at White Soul Group\n                        HR / Admin Assistant Job at Neveah Limited\n                        Finance / Administrative Manager Job at FirstExcelsia Professional Services\n                        Account Manager - B2B (Business-to-Business) Job at Career and Consult\n                    \n    \n\n\n\n                        \n                    \n\n                    \n                        \n\n\n\n    \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n\n\n\n\n\n          \n\n\n    \n\n        Hottest Jobs\n\n        \n        \n            \n\n                Job Openings at Nestoil Plc\n\n               \n            \n        \n            \n\n                Job Vacancies at British Council\n\n               \n            \n        \n            \n\n                Job Vacancies at GTI Investment\n\n               \n            \n        \n            \n\n                Customer Service Officer Job at Titan Trust Bank\n\n               \n            \n        \n            \n\n                Job Openings at Dreams by DV8 Hotel\n\n               \n            \n        \n            \n\n                Job Vacancies at TotalEnergies\n\n               \n            \n        \n            \n\n                Customer Support Specialist Job at Bumpa\n\n               \n            \n        \n            \n\n                Executive Assistant to the CEO Job at Bumpa\n\n               \n            \n        \n            \n\n                Business Operations and Projects Associate\n\n               \n            \n        \n            \n\n                Job Vacancies at Cen Global Services Limited\n\n               \n            \n        \n        \n\n    \n\n\n\n\n        \n        \n   \n\n\n                    \n                            \n            \n        \n        \n        \n\n        \n\n    \n\n        \n\n            \n\n                \n\n                    Job Seekers\n\n                    \n\n                        Search for Jobs\n                         Featured Jobs\n                         Jobs by Specialization\n                         Jobs by Industry\n                         Jobs by Location\n                         \n                        Companies Currently Hiring\n\n                        Upload CV\n\n                        Free Aptitude Test Practice\n                        \n                        Scholarships and Financial Aid\n\n                        Testimonies\n                    \n\n                \n\n                \n\n                    Employers\n\n                    \n\n                        Post A Job\n\n                        Search Resumes/Profiles\n\n                        Create Employer Account\n\n                        Advertise\n\n                        Pricing\n\n                    \n\n                \n\n                \n\n                    Tools & Resources\n\n                    \n\n                        Contact us\n                        \n                        Our Blog\n\n                        Job XML/RSS Feeds\n \n                        Free Aptitude Test Practice\n\n                        Bank Details\n\n                        FAQ & Support\n\n                    \n\n                \n\n                \n\n                    Connect with us\n\n                    \n\n                        \n\n                            \n\n                            \n\n                        \n\n                        \n\n                            \n\n                            \n\n                        \n\n                \n\n                        \n\n                            \n\n                            \n\n                        \n\n                    \n\n\n\n                    \n\n                        Customer Care\n\n                        09134259221 \n\n                        (9am - 5pm) weekdays\n\n                         info [at] jobgurus.com.ng\n\n                    \n\n\n\n                \n\n            \n\n        \n\n    \n\n\n\n    \n\n        \n\n\n\n            \n\n                Privacy Policy\n\n                Terms & Conditions\n\n                Sitemap\n                \n                About us\n\n            \n\n\n\n            Copyright © 2025 Jobgurus.com.ng - Latest Jobs in Nigeria 2025. All right reserved.",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Executive Assistant Job at Motomedia",
    "link": "https://www.jobgurus.com.ng/jobs/view/executive-assistant-job-at-motomedia",
    "pubDate": "Mon, 04 Aug 2025 11:15:46 GMT",
    "source": "JobGurus",
    "keyword": "motomedia",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "(function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){\n        (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),\n        m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)\n    })(window,document,'script','//www.google-analytics.com/analytics.js','ga');\n\n    ga('create', 'UA-43112273-1', 'jobgurus.com.ng');\n    ga('send', 'pageview');\n\n\n\n\n    \n        \n    Home\n    Jobs\n    Free Aptitude Test Practice\n    Employer? Post a Job\n            Register\n        Sign in\n        Contact us\n    \n\n    \n\n        \n    \n        \n\n            \n\n                \n\n                    \n                        Toggle navigation\n                        \n                        \n                        \n                    \n\n                    \n                \n            \n\n            \n                \n\n\tJobs\n\tJob Seekers\n\tAptitude Test\n\tScholarships\n\n            \n\n            \n                \n\n                                            Register\n                        Sign in\n                    \n                    Employer? Post a Job\n                \n            \n\n        \n\n    \n\n        \n        \n            \n            \n                 \n    \n                    \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n        \n     \n\n\n                            \n                    \n        \n                        CLICK HERE TO JOIN OUR WHATSAPP CHANNEL \n                    \n    \n\n    \n                                \n                    \n\n                        \n                            \n                        \n\n                        \n                            \n                                Any Specialization\n                                                                    Accounting / Audit / Finance\n                                                                    Administration/ Office/ Operations\n                                                                    Advertising/ Social Media/ Marketing/ PR\n                                                                    Agriculture / Agro Allied\n                                                                    Analyst/ Quality Control\n                                                                    Automotive/ Car Services\n                                                                    Aviation / Airline\n                                                                    Banking / Insurance\n                                                                    Building Design / Architecture\n                                                                    Construction / Mining\n                                                                    Consulting / Business Strategy/ Planning\n                                                                    Craftsmen / Artisans\n                                                                    Creatives (Arts, Design, Fashion)\n                                                                    Customer Service\n                                                                    Domestic / Janitorial Services\n                                                                    Driving / Haulage\n                                                                    Education / Teaching / Training\n                                                                    Engineering / Technical\n                                                                    Executive / Management\n                                                                    Freelance / Data Entry\n                                                                    Government Agencies / Public Sector\n                                                                    Graduates / Freshers\n                                                                    Grants /  Scholarships\n                                                                    Hospitality / Food Services\n                                                                    HSE / Safety Management\n                                                                    Human Resources / Recruitment\n                                                                    Information Technology / ICT\n                                                                    Internship/ Industrial Training\n                                                                    Legal / Law\n                                                                    Logistics / Transportation/ Supply\n                                                                    Manufacturing / Production\n                                                                    Maritime Services / Shipping\n                                                                    Media / Art / Entertainment\n                                                                    Medical/ Healthcare / Pharmaceutical\n                                                                    Military / Para-Military\n                                                                    NGO / Community Services\n                                                                    Oil & Gas / Energy\n                                                                    Procurement/ Purchasing\n                                                                    Project Management\n                                                                    Real Estate / Property / Surveying\n                                                                    Research / Survey\n                                                                    Risk Management / Compliance\n                                                                    Sales / Business Development\n                                                                    Secretarial / PA\n                                                                    Security / Intelligence\n                                                                    Software/ Programming / Web development\n                                                                    Sports / Fitness\n                                                                    Supply Chain/ Store\n                                                                    Technicians\n                                                                    Telecommunications\n                                                                    Tourism / Travels\n                                                                    Vocational Trade and Services\n                                                            \n                        \n\n                        \n                            \n                                Any Work Level\n                                                                    Entry Level (Trainee)\n                                                                    Executive (Director, Head of Dept)\n                                                                    Experienced (Non-Manager)\n                                                                    Internship\n                                                                    Manager (Staff Supervisor)\n                                                                    Senior Executive (MD, CEO, COO)\n                                                                    Vocational (Skilled/Unskilled Labour)\n                                                            \n                        \n\n                        \n                            \n                                 Search\n                            \n                        \n                    \n                \n                            \n            \n\n\n\n\n\n\n            \n\n                \n                                        \n                    \n                                        \n                    \n                    \n\n                    \n                        \n                        \n\n{\n  \"@context\": \"https://schema.org\",\n  \"@type\": \"JobPosting\",\n  \"title\": \"Executive Assistant\",\n  \"description\": \"Motomedia is an innovative outdoor advertising company with a proven track record in developing and delivering successful OOH campaigns across Africa by infusing Data-driven technology in whatever we do from planning to execution and reporting. We are Africa&amp;rsquo;s number 1 fastest-growing outdoor agency because we understand one thing only -bridging the gap between audiences and brands.\n\nWe are recruiting to fill the position below:\n\nJob Position: Executive Assistant\nJob Locations:&amp;nbsp;Maryland &amp;amp; Ikeja, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe are seeking a highly organized and proactive Executive Assistant to support the CEO/MD.\n\tThe ideal candidate will manage complex calendars, coordinate meetings and travel, handle confidential documents, and provide high-level administrative support to ensure efficiency and effectiveness in daily operations.\n\n\nResponsibilities\n\n\n\tProvide administrative assistance to the MD\n\tRepresent the MD physically or virtually within and outside the country.\n\tEnsure accessibility and availability at all times.\n\tEnsure adherence to and delivery on key deadlines/deliverables by applying project management principles\n\tCo-ordinating activities with/for the Management team\n\tDiary management of the CEO\n\tCoordinate and arrange meetings/conferences, both internally and externally.\n\tPreparation of agendas, reservations and preparation of facilities.\n\tOversee the document management and electronic filing system of the CEO&amp;#39;s office.\n\tManage travel logistics for the CEO &amp;amp; MD, including the booking of flights and accommodation and managing visa requirements.\n\tProvide external and internal public relations functions to the Company and the office of the CEO.\n\tTake minutes of meeting at every meeting attended by the MD, process and present accurately.\n\tExtension of CEO Office regarding quality, image and housekeeping standards.\n\tProtect the security and confidentiality of the information that is privileged to the office of the CEO.\n\tDevelop and/or maintain an office filing system as well as a reporting system\n\tFilter and Prioritize guest visits\n\tMake sure staff and colleagues have all the necessary tools needed to achieve their task\n\tAct as a funnel for information between the MD and staff\n\tProvide Advice to improve productivity when required.\n\tUnderstand projects and timelines\n\tFollow up with projects and timeline\n\tGet approvals for payments\n\tYou are required to be available to travel out of the state or country when necessary.\n\tAdditionally, you are to carry out all relevant tasks as assigned.\n\n\nRequirements\n\n\n\tBachelor&amp;rsquo;s degree in Business Administration, Secretarial Studies, or a related field.\n\tMinimum of 5+ years of proven experience as an Executive Assistant, Personal Assistant, or similar role.\n\tProficiency in Microsoft Office Suite (Word, Excel, PowerPoint) and Google Workspace (Docs, Sheets, Calendar).\n\tExcellent organizational, time management, and multitasking abilities.\n\tStrong written and verbal communication skills.\n\tHigh level of discretion, integrity, and professionalism.\n\tAbility to work under pressure and manage competing priorities.\n\tStrong attention to detail and problem-solving skills.\n\n\nSalary\nN300,000 - N350,000 Monthly.\",\n  \"datePosted\": \"2025-08-04\",\n  \"validThrough\": \"2025-09-01\",\n  \"employmentType\": \"Full-Time\",\n  \"hiringOrganization\": {\n    \"@type\": \"Organization\",\n    \"name\": \"Motomedia\"\n    \n  },\n  \"jobLocation\": {\n    \"@type\": \"Place\",\n    \"address\": {\n      \"@type\": \"PostalAddress\",\n       \"postalCode\": \". \",\n       \"addressRegion\": \". \",\n       \"streetAddress\": \". \",\n      \"addressLocality\": \"Lagos\",\n      \"addressCountry\": \"NG\"\n     \n      \n    }\n  },\n  \"identifier\": {\n    \"@type\": \"PropertyValue\",\n    \"name\": \"\",\n    \"value\": \"185297\"\n  },\n  \"baseSalary\": {\n    \"@type\": \"MonetaryAmount\",\n    \"currency\": \"NGN\",\n    \"value\": {\n      \"@type\": \"QuantitativeValue\",\n      \"minValue\": 250000,\n      \"maxValue\": 400000,\n      \"unitText\": \"MONTH\"\n    }\n  }\n}\n\n\n\nExecutive Assistant Job at Motomedia\n\n\n\n\n        \n    \n\n        \n        Motomedia is an innovative outdoor advertising company with a proven track record in developing and delivering successful OOH campaigns across Africa by infusing Data-driven technology in whatever we do from planning to execution and reporting. We are Africa’s number 1 fastest-growing outdoor agency because we understand one thing only -bridging the gap between audiences and brands.\n\nWe are recruiting to fill the position below:\n\nJob Position: Executive Assistant\nJob Locations: Maryland & Ikeja, Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n            \n    \n\n\n\n\n\tWe are seeking a highly organized and proactive Executive Assistant to support the CEO/MD.\n\tThe ideal candidate will manage complex calendars, coordinate meetings and travel, handle confidential documents, and provide high-level administrative support to ensure efficiency and effectiveness in daily operations.\n\n\nResponsibilities\n\n\n\tProvide administrative assistance to the MD\n\tRepresent the MD physically or virtually within and outside the country.\n\tEnsure accessibility and availability at all times.\n\tEnsure adherence to and delivery on key deadlines/deliverables by applying project management principles\n\tCo-ordinating activities with/for the Management team\n\tDiary management of the CEO\n\tCoordinate and arrange meetings/conferences, both internally and externally.\n\tPreparation of agendas, reservations and preparation of facilities.\n\tOversee the document management and electronic filing system of the CEO's office.\n\tManage travel logistics for the CEO & MD, including the booking of flights and accommodation and managing visa requirements.\n\tProvide external and internal public relations functions to the Company and the office of the CEO.\n\tTake minutes of meeting at every meeting attended by the MD, process and present accurately.\n\tExtension of CEO Office regarding quality, image and housekeeping standards.\n\tProtect the security and confidentiality of the information that is privileged to the office of the CEO.\n\tDevelop and/or maintain an office filing system as well as a reporting system\n\tFilter and Prioritize guest visits\n\tMake sure staff and colleagues have all the necessary tools needed to achieve their task\n\tAct as a funnel for information between the MD and staff\n\tProvide Advice to improve productivity when required.\n\tUnderstand projects and timelines\n\tFollow up with projects and timeline\n\tGet approvals for payments\n\tYou are required to be available to travel out of the state or country when necessary.\n\tAdditionally, you are to carry out all relevant tasks as assigned.\n\n\nRequirements\n\n\n\tBachelor’s degree in Business Administration, Secretarial Studies, or a related field.\n\tMinimum of 5+ years of proven experience as an Executive Assistant, Personal Assistant, or similar role.\n\tProficiency in Microsoft Office Suite (Word, Excel, PowerPoint) and Google Workspace (Docs, Sheets, Calendar).\n\tExcellent organizational, time management, and multitasking abilities.\n\tStrong written and verbal communication skills.\n\tHigh level of discretion, integrity, and professionalism.\n\tAbility to work under pressure and manage competing priorities.\n\tStrong attention to detail and problem-solving skills.\n\n\nSalary\nN300,000 - N350,000 Monthly.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n\n    \n    \n\n\n\n\n        \n        \n\n\n\n\n   \n\n\n    \n        Similar Jobs\n    \n\n    \n        \n                        Front Desk Customer Service / Billing Officer Job at Falcon Peak Solutions Limited\n                        Office Assistant Job at Extramileage Consults Limited\n                        Admin Officer Job at African Foundries Limited (AFL)\n                        Receptionist Job at 95 Slide\n                        Administration and Human Resources Assistant Job at Life At Best Development Initiative (LABDI)\n                        HR / Admin Assistant Job at Neveah Limited\n                        Finance / Administrative Manager Job at FirstExcelsia Professional Services\n                        Front Desk Officer (Receptionist) Job at Allied Food and Confectionery Services\n                        General Manager (GM) Job at Seflam SGL Limited\n                        Human Resource and Admin Coordinator Job at Allied Food and Confectionery Services\n                    \n    \n\n\n\n                        \n                    \n\n                    \n                        \n\n\n\n    \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n\n\n\n\n\n          \n\n\n    \n\n        Hottest Jobs\n\n        \n        \n            \n\n                Job Openings at Nestoil Plc\n\n               \n            \n        \n            \n\n                Job Vacancies at British Council\n\n               \n            \n        \n            \n\n                Job Vacancies at GTI Investment\n\n               \n            \n        \n            \n\n                Customer Service Officer Job at Titan Trust Bank\n\n               \n            \n        \n            \n\n                Job Openings at Dreams by DV8 Hotel\n\n               \n            \n        \n            \n\n                Job Vacancies at TotalEnergies\n\n               \n            \n        \n            \n\n                Customer Support Specialist Job at Bumpa\n\n               \n            \n        \n            \n\n                Executive Assistant to the CEO Job at Bumpa\n\n               \n            \n        \n            \n\n                Business Operations and Projects Associate\n\n               \n            \n        \n            \n\n                Job Vacancies at Cen Global Services Limited\n\n               \n            \n        \n        \n\n    \n\n\n\n\n        \n        \n   \n\n\n                    \n                            \n            \n        \n        \n        \n\n        \n\n    \n\n        \n\n            \n\n                \n\n                    Job Seekers\n\n                    \n\n                        Search for Jobs\n                         Featured Jobs\n                         Jobs by Specialization\n                         Jobs by Industry\n                         Jobs by Location\n                         \n                        Companies Currently Hiring\n\n                        Upload CV\n\n                        Free Aptitude Test Practice\n                        \n                        Scholarships and Financial Aid\n\n                        Testimonies\n                    \n\n                \n\n                \n\n                    Employers\n\n                    \n\n                        Post A Job\n\n                        Search Resumes/Profiles\n\n                        Create Employer Account\n\n                        Advertise\n\n                        Pricing\n\n                    \n\n                \n\n                \n\n                    Tools & Resources\n\n                    \n\n                        Contact us\n                        \n                        Our Blog\n\n                        Job XML/RSS Feeds\n \n                        Free Aptitude Test Practice\n\n                        Bank Details\n\n                        FAQ & Support\n\n                    \n\n                \n\n                \n\n                    Connect with us\n\n                    \n\n                        \n\n                            \n\n                            \n\n                        \n\n                        \n\n                            \n\n                            \n\n                        \n\n                \n\n                        \n\n                            \n\n                            \n\n                        \n\n                    \n\n\n\n                    \n\n                        Customer Care\n\n                        09134259221 \n\n                        (9am - 5pm) weekdays\n\n                         info [at] jobgurus.com.ng\n\n                    \n\n\n\n                \n\n            \n\n        \n\n    \n\n\n\n    \n\n        \n\n\n\n            \n\n                Privacy Policy\n\n                Terms & Conditions\n\n                Sitemap\n                \n                About us\n\n            \n\n\n\n            Copyright © 2025 Jobgurus.com.ng - Latest Jobs in Nigeria 2025. All right reserved.",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]