[
  {
    "title": "PR / Media Director Job at Choice Talents NG",
    "link": "https://www.jobgurus.com.ng/jobs/view/pr-media-director-job-at-choice-talents-ng-3",
    "pubDate": "Mon, 23 Jun 2025 10:45:42 GMT",
    "source": "JobGurus",
    "keyword": "choice talents ng",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Choice Talents NG is Nigeria’s preferred talents management company. Our goal is to help build successful businesses through effective talent, resource and process management.\n\nWe are recruiting to fill the position below:\n\nJob Position: PR / Media Director\n\nJob Location: Abuja (FCT)\nEmployment Type: Full-time\n\nAbout the Job\n\n\n\tWe are looking for a very senior editor well experienced with print, radio and TV media, to manage the public relations responsibilities of an international NGO.\n\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDevelop and maintain strong relationships with key media outlets, journalists, and influencers to secure positive press coverage.\n\tDraft and distribute press releases, media advisories, and pitch materials.\n\tRespond to media inquiries and coordinate media interviews with company spokespeople.\n\tWork with senior leadership to develop and execute PR strategies that align with the company’s goals and objectives.\n\tAct as the company’s spokesperson during a crisis, providing clear, timely, and accurate information to the media.\n\tWrite press releases, articles, speeches, blog posts, op-eds, articles, and other communication materials as needed.\n\tOversee the creation of compelling, media-friendly content, ensuring alignment with objectives.\n\tEstablish and maintain a clear and consistent voice for the brand across all communication channels.\n\tProvide strategic counsel to executives on media interactions and public appearances.\n\tDevelop and implement crisis communication plans and manage communication during sensitive or critical situations.\n\tPlan and coordinate press events, conferences, and other public relations activities.\n\tRepresent the organization at industry events, media interviews, and public speaking engagements.\n\tTrack media coverage and report on the effectiveness of PR campaigns and media outreach.\n\tAnalyze trends in media coverage and public opinion to adapt strategies and improve outcomes.\n\tLead and mentor junior PR team members, providing guidance and support in their professional development.\n\tCollaborate with marketing, social media, and other internal teams to ensure cohesive and effective communication strategies.\n\n\nRequirements\n\n\n\tBachelor’s Degree in Public Relations, Communications, Journalism, or a related field (Master’s degree preferred).\n\t15+ years of experience in public relations, with a focus on media relations and corporate communications.\n\tProven track record of developing and executing successful PR campaigns and securing positive media coverage.\n\tExceptional written and verbal communication skills, with the ability to craft compelling narratives.\n\tStrong media relationships with local, national, and trade press.\n\tExperience in crisis communication and handling sensitive issues.\n\n\nMethod of Application\nInterested and qualified candidates should send their Applications to: jobs@choicetalents.com.ng using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Virtual Assistant Job at Design Synchrony",
    "link": "https://www.jobgurus.com.ng/jobs/view/virtual-assistant-job-at-design-synchrony",
    "pubDate": "Mon, 23 Jun 2025 10:45:42 GMT",
    "source": "JobGurus",
    "keyword": "design synchrony",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Design Synchrony is a dynamic software development, graphic design, and printing company. We offer top-notch services in website design, mobile app development, printing, and branding, and we are on a mission to expand our online presence and grow our business. We're looking for a talented Social Media & Digital Marketing Manager to join our team and drive our marketing efforts across social media, freelancing platforms, SEO, influencer collaborations, and WhatsApp engagement.\n\nWe are recruiting to fill the position below:\n\nJob Position: Virtual Assistant\n\nJob Location: Nigeria\nEmployment Type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDesign Synchrony is seeking a detail-oriented, proactive, and organized Office Assistant to join our dynamic team.\n\tThis is a hybrid role, requiring both in-office and remote work.\n\tThe ideal candidate will support the day-to-day administrative operations, assist with office management, and ensure smooth functioning of office processes while collaborating with our team.\n\n\nKey Responsibilities\n\n\n\tManage office supplies and inventory, ensuring a well-stocked and organized office.\n\tAssist in scheduling meetings, coordinating travel arrangements, and managing calendars.\n\tAssist with organizing and preparing documents, presentations, and reports.\n\tProvide general administrative support to the team as required.\n\tHandle incoming calls, emails, and other communications in a professional manner.\n\tPerform data entry and maintain accurate office records.\n\tEnsure the office environment is clean, safe, and conducive to productivity.\n\n\nRequirements\n\n\n\tInterested candidates should possess a relevant qualification\n\tProven experience as an office assistant, administrative assistant, or in a similar role.\n\tStrong organizational skills with the ability to prioritize tasks effectively.\n\tExcellent communication skills, both written and verbal.\n\tProficiency in MS Office Suite (Word, Excel, PowerPoint).\n\tAbility to work both independently and collaboratively in a hybrid work environment.\n\tA proactive attitude and strong attention to detail.\n\tPrior experience in managing office supplies and administrative tasks is a plus.\n\tApplicant must reside in Shomolu or be within a walkable distance of Shomolu, Lagos.\n\n\nSalary\nN50,000 monthly.\n\nMethod of Application\nInterested and qualified candidates should send their Resume and a Cover Letter to: recruitment@designsynchrony.com.ng using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "CNG Instrument Engineer Job at Dangote Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/cng-instrument-engineer-job-at-dangote-group",
    "pubDate": "Mon, 23 Jun 2025 10:45:42 GMT",
    "source": "JobGurus",
    "keyword": "dangote group",
    "duplicate": false,
    "classifications": [],
    "content": "Dangote Group is one of Nigeria’s most diversified business conglomerates with a hard – earned reputation for excellent business practices and products’ quality with its operational headquarters in the bustling metropolis of Lagos, Nigeria in West Africa.\n\nWe are recruiting to fill the position below:\n\nJob Position: CNG Instrument Engineer\nJob Location: Zaria, Kaduna / Port-Harcourt, Rivers / Obajana, Kogi\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are  seeking for skilled CNG Instrument Engineer to join our dynamic team. The position will require an in-depth understanding of instrumentation within the construction industry, particularly related to compressed natural gas (CNG) systems.\n\n\nResponsibilities\n\n\n\tDesign, develop and implement instrumentation systems for CNG utilization.\n\tConduct regular maintenance and calibration of instrumentation equipment.\n\tCollaborate with engineering teams to ensure seamless integration of CNG systems into ongoing projects.\n\tPrepare technical documentation and reports for instrumentation systems.\n\tMonitor and troubleshoot instrumentation issues in real-time during operations.\n\tEnsure compliance with industry standards and safety regulations.\n\tProvide training and support to site staff on CNG instrumentation and controls.\n\n\n Requirements\n\n\n\tBachelors degree in Instrumentation Engineering, Electrical Engineering, or related field.\n\tMinimum of 3 years of experience in instrumentation engineering within the construction or manufacturing industry.\n\tProven experience in instrumentation design, calibration, installation, and Maintenance \n\tProficient in the use of instrumentation software and tools.\n\tExcellent problem-solving skills and attention to detail.\n\tAbility to work collaboratively in a fast-paced environment.\n\tStrong communication skills, both verbal and written.\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Logistics Coordinator Job at Dangote Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/logistics-coordinator-job-at-dangote-group-1",
    "pubDate": "Mon, 23 Jun 2025 10:45:42 GMT",
    "source": "JobGurus",
    "keyword": "dangote group",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Dangote Group is one of Nigeria’s most diversified business conglomerates with a hard – earned reputation for excellent business practices and products’ quality with its operational headquarters in the bustling metropolis of Lagos, Nigeria in West Africa.\n\nWe are recruiting to fill the position below:\n\nJob Position: Logistics Coordinator\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a detail-oriented and proactive Logistics Coordinator to oversee and manage the movement of polypropylene.\n\tThis role involves coordinating with shipping companies, port operators, internal teams, and service providers to ensure the efficient, compliant, and timely transportation of goods.\n\tThe ideal candidate will have a strong understanding of domestic logistics, container operations, customer documentation, and Nigerian import/export procedures.\n\n\nKey Duties & Responsibilities\n\n\n\tCoordinate inbound and outbound logistics for polypropylene containers to and from Dangote Refinery.\n\tLiaise with ports (Lekki Port, Apapa Port), clearing agents, and transport service providers to ensure timely container movements.\n\tTrack and monitor shipments to avoid demurrage or detention costs.\n\tPrepare, verify, and manage all shipping and delivery documentation including manifests, invoices, delivery notes, and customer-required paperwork.\n\tMaintain accurate records of logistics activities and submit regular reports to the Supply Chain Manager.\n\tCollaborate with internal teams (Production, Sales, Finance) to plan and forecast container dispatches and deliveries.\n\tEnsure compliance with Nigerian import/export regulations and company policies.\n\tTroubleshoot logistics issues and proactively manage any delays or disruptions.\n\tManage logistics KPIs and drive continuous improvement initiatives.\n\n\nKey Requirements\n\n\n\tBachelor’s degree in Logistics, Supply Chain Management, Business Administration, or a related field.\n\t3–5 years of relevant logistics or supply chain experience, preferably in petrochemicals, manufacturing, or containerized cargo.\n\tStrong knowledge of Nigerian port operations (Apapa, Lekki) and domestic transport networks.\n\tExperience coordinating container haulage from ports to industrial sites and vice versa.\n\tFamiliarity with customs procedures, import/export documentation, and shipping regulations.\n\tProficient in Microsoft Office Suite; ERP or logistics software knowledge is a plus.\n\tUnderstanding of HSE (Health, Safety, Environment) practices in logistics.\n\n\nKey attributes:\n\n\n\tExcellent coordination and organizational skills.\n\tStrong communication and negotiation abilities.\n\tProactive problem-solver with a high sense of accountability.\n\tAbility to work under pressure and manage multiple priorities.\n\tAttention to detail and commitment to compliance.\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]