[
  {
    "title": "Territory Manager Job at Kyosk Digital Services Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/territory-manager-job-at-kyosk-digital-services-limited-4",
    "pubDate": "Thu, 03 Jul 2025 11:38:03 GMT",
    "source": "JobGurus",
    "keyword": "kyosk digital services limited",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "Kyosk Digital Services Limited is a tech-led platform that connects informal retailers who retail in kiosks and other similar retail outlets directly to fast-moving consumer goods companies (FMCGs) by communicating demand from retail outlets directly to FMCGs and their distributors and managing the delivery of the goods to the kiosks.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nOur digital ordering and delivery platform – Kyosk – ensures that these retail outlets get access to stock at competitive prices and have them delivered directly to them. FMCGs find the traditional distribution chain to be inadequate as well, making it expensive for them to serve kiosk-type retail outlets, leading to high incidences of product stock-outs and lost sales opportunities. By providing FMCGs with good data visibility, we solve this major problem of theirs.\n\nWe are recruiting to fill the position below:\n\nJob Position: Territory Manager\n\nJob Location: Ajah, Lagos\nJob Type: Full-time\nAccountable to: Purchasing Manager\n\nRole Profile\n\n\n\tWe are looking to bring on board an ambitious and commercially aware candidate as a Territory Manager.\n\tThe individual will be tasked with the end-to-end management of a specific warehouse and market as a single business unit.\n\tHe/she will be responsible for the execution of the organization’s strategy in the market, including accountability of the P&L, budget, market, and business performance, operations, and people management.\n\n\nKey Responsibilities\n\n\n\tBusiness Unit Performance: Responsible for P&L management for the warehouse and market while driving profit maximization for the business unit. Oversee the business unit performance management and ensure the attainment of all organizational KPIs for the unit. Account for any performance decline and devise ways to improve the same.\n\tRevenue Generation: Work collaboratively with the commercial and purchasing teams to spearhead revenue generation in the market including advisory on product pricing to generate business margins. Liaise with the sales team to drive product penetration and uptake in the market including the formulation of effective sales and marketing strategies.\n\tStrategy Execution: Communication of the business strategy in the market and ensuring execution against the set KPIs as per the strategy. Ensure the team understands and buys into the strategy. Support the development of the pricing strategy and product pricing based on market understanding, competitor analysis, and customer feedback.\n\tOperations Optimization: Lead the coordination of business activities with the head office and collaborate with Functional Managers to guarantee operational efficiency. Proactively support the development and review of SOPs based on the gaps identified to maximize operations effectiveness.\n\tInventory Management: Work closely with the Warehouse Supervisor and Loss Control Supervisor to facilitate proper inventory management, stock control, and loss prevention. Collaboratively formulate and implement measures to safeguard the inventory in the warehouse.\n\tCompliance: Drive compliance to the laid down SOPs for the warehouse, operations, and HR whilst ensuring proper team training and appreciation. Ensure legislative and regulatory compliance of the business unit including Health and safety compliance of the business unit. Undertake frequent operations audits to evaluate the level of compliance, operational gaps, and hindrances for immediate action.\n\tBudget Management: Develop and present the annual budget for the specific business unit; Monitor and oversee its utilization including budget control, accounting as well as reconciliation.\n\tMarket Intelligence & Business Advisory: Undertake frequent market surveys and analyses to identify opportunities the business can capitalize on, understand competitor activities, and appreciate customer dynamics. Escalate customer feedback to the management to ensure course correction where necessary.\n\tPeople Management: Support staff recruiting for the business unit, training, supervision, and appraising of staff. Work closely with the HR team to execute key HR functions in the unit including policy implementation, performance management, disciplinary, evaluations, and training.\n\n\nMinimum Requirements & Key Skills\n\n\n\tA Diploma in Business Management or a related field. A Bachelor’s degree will be an added advantage;\n\tA minimum of 4-6 years in operations management and driving business performance in a retail or FMCG background.\n\tExperience handling end-to-end operations cutting across warehousing, logistics, sales, and business performance management is preferred;\n\tAppreciation of the business environment, key priorities, and a keen sense of what needs to be done for the business to succeed;\n\tProven ability to manage cross-functional teams with indirect reporting lines to drive the execution and achievement of business objectives and strategy.\n\n\nCompetencies & Skills:\n\n\n\tStrong Commercial Acumen\n\tOperational Excellence\n\tTeam Player\n\tPeople Management\n\tStakeholder Engagement\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Customer Service Coordinator Job at ZIM Integrated Shipping Services Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/customer-service-coordinator-job-at-zim-integrated-shipping-services-limited",
    "pubDate": "Thu, 03 Jul 2025 11:38:03 GMT",
    "source": "JobGurus",
    "keyword": "zim integrated shipping services limited",
    "duplicate": false,
    "classifications": [],
    "content": "ZIM Integrated Shipping Services Limited - In the fast-changing shipping world, ZIM Integrated Shipping Services has set itself apart as an independent carrier with a fresh, unique approach. ZIM’s strategy as a global niche carrier offers distinctive advantages to customers worldwide. We have created a smart, efficient network that ensures stable, reliable services; and we have made it our mission to focus on the needs of our customers, which stand at the heart of all our decisions.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nZIM operates in select trades, where it has a competitive advantage and where it can provide superior service. In these trades, ZIM is a significant player with a sizable market share. We maintain a flexible partnership approach with other major carriers, and our new line structure is a much-needed alternative to customers concerned about the current alliance-dominated market.\n\nWe are recruiting to fill the position below:\n\nJob Position: Customer Service Coordinator\n\nJob Ref.: 97.855\nJob Location: Lagos\nCategory: Customer Service\n\nDescription\nThe candidate will be responsible for the following duties:\n\nVIP Management:\n\n\n\tManage VIP Customers as key interface in customer service department, ensure proactive communication and optimal service delivery in line with VIP offerings: Proactive invoicing, Monthly SOA, Cargo Release Priority, Arrival notice. Expedited Releasing, etc..\n\n\nCustomer Service:\n\n\n\tSupport the Customer Service team by monitoring the shared email inbox as assigned, ensuring all customer emails are responded to promptly and accurately.\n\tConsistently meet SMART CS KPIs, including First Response Time and Service Request completion within SLA.\n\n\nIssue Resolution & escalation Management:\n\n\n\tAssist the Customer Service Team in troubleshooting and resolving transaction issues and exceptions efficiently.\n\tProvide timely follow-up on customer complaints and escalate unresolved matters as required.\n\n\nChange management and process improvement:\n\n\n\tSupport Agency & District change initiatives within the team.\n\tContinuously review processes to remove mundane steps and suggest areas of improvement to Customer Service Manager.\n\n\nStakeholder Management:\n\n\n\tCollaborate with internal stakeholders to provide high levels of customer service to customers.\n\n\nRequirements\n\n\n\tCandidates should possess a First Degree in Maritime, Shipping, or related disciplines \n\tBetween 3-5 years of prior experience in similar capacity. \n\tStrong relationship management, analytical and problem-solving skills. \n\tGood command of written and spoken English \n\tHigh level of proficiency in Microsoft office, including Excel, Word, Power Point, Web-based and email programs\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Purchase Manager Job at PG Consulting Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/purchase-manager-job-at-pg-consulting-limited",
    "pubDate": "Thu, 03 Jul 2025 11:38:03 GMT",
    "source": "JobGurus",
    "keyword": "pg consulting limited",
    "duplicate": false,
    "classifications": [],
    "content": "PG Consulting Limited - Our client, a leading player in the building materials and ceramics manufacturing sector, committed to excellence, innovation, and sustainability.\n\nThey are recruiting to fill the position below:\n\nJob Position: Purchase Manager\n\nJob Location: Ajaokuta, Kogi State\nIndustry: Building Materials / Manufacturing Setup / Ceramic\n\nJob Description\n\n\n\tWe are expanding our team and looking for a qualified and experienced Purchase Manager to lead procurement operations at our Ajaokuta Factory.\n\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tHaving Fair knowledge of the various inventory items used in the manufacturing process.\n\tExposure to OEM, and suppliers of relevant goods.\n\tHave played tecno commercial role, with the analytical ability to work on re-order levels.\n\tTo engage with cross functions and ensure agreed lead time and cycle time is maintained.\n\tCapability to look at alternatives and innovate to drive cost-efficiency solutions.\n\tEngage with suppliers to ensure commitment dates are met.\n\tEngage with internal customers to move PR to PO to receipt.\n\tEnsure technical specs and quality parameters are met.\n\tTo ensure supplier relationship is maintained.\n\tTo ensure supplier audits are done to maintain standards.\n\n\nRequirements\n\n\n\tDegree in Mechanical or Electrical Engineering\n\tMinimum of 5 years of relevant experience in a manufacturing/procurement environment\n\tStrong computer skills\n\tAnalytical mindset with a techno-commercial approach\n\tStrong numerical and analytical skills, with a proven track record of effective negotiation and cost-saving initiatives/strategic sourcing.\n\tStrong knowledge of procurement processes, sourcing strategies, contract negotiation, and vendor management.\n\tExperience in managing and developing procurement teams.\n\tStrong communication, negotiation, and relationship management skills.\n\n\nSalary\nVery Attractive.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: Jobs@pgconsultinguk.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Business Development Executive Job at Youverify",
    "link": "https://www.jobgurus.com.ng/jobs/view/business-development-executive-job-at-youverify-1",
    "pubDate": "Thu, 03 Jul 2025 11:38:03 GMT",
    "source": "JobGurus",
    "keyword": "youverify",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance"
    ],
    "content": "Youverify is a leading provider of digital identity verification, AML and fraud solutions, dedicated to helping businesses automate and streamline their customer onboarding processes while ensuring compliance with regulatory requirements. We leverage cutting-edge technologies like artificial intelligence and machine learning to offer accurate and efficient verification solutions that enhance customer trust and operational efficiency. We aim to reduce fraud and support businesses across various industries, including banking, fintech, telecommunications, and e-commerce.\n\nWe are recruiting to fill the position below:\n\nJob Position: Business Development Executive\n\nJob Location: Lagos\nEmployment Type: Full-time\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nResponsibilities\n\n\n\tPlanning and overseeing new marketing initiatives as well as developing and executing sales plans to meet and exceed monthly/quarterly revenue/sales goals.\n\tOversee the sales process to attract new clients.\n\tProcuring new clients through leads, direct contact, and collaboration with the marketing team.\n\tFollowing company guidelines and procedures for the acquisition of customers, submission of tenders, etc.\n\tMaintain fruitful relationships with clients (existing & potential) and address their needs effectively.\n\tSuggesting upgrades or added products and services that may be of interest to clients.\n\tResearch and identify new market opportunities and trends to ensure our offering remains relevant.\n\tPrepare and deliver pitches to potential customers.\n\tCollaborating with management on sales goals, planning, and forecasting; maintaining short- and long-term business development plans.\n\tDrafting business proposals and contracts to draw more revenue from clients.\n\tMaintain knowledge of all products and services offered by the company.\n\tWork with team members to identify and manage risks.\n\n\nRequirements\n\n\n\t3 years plus of experience working as an Enterprise Account Manager\n\tMaster’s Degree or MBA.\n\tStrong sales and business development acumen with a record of outstanding delivery.\n\tProven track record of success in managing large FinTech, Banks, and Telecommunications accounts.\n\tConversant with the use of data within business and Customer Experience concepts.\n\tExcellent negotiation, influencing and relationship-building skills.\n\tExcellent time management and business sales skills\n\tSelf-motivated and willing to work under pressure.\n\tExperience in working with a cross-culture team and a fast-paced environment\n\tAbility to understand business goals and recommend new approaches, policies\n\tand procedures to effect continual improvements in business objectives, and\n\tproductivity.\n\tBusiness-driven, people-focused, with exceptional influencing skills.\n\n\nMethod of Application\nInterested and qualified candidates should send their Resume and portfolio to: hr@youverify.co using \"Business Development Executive\" as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Marketing Officer Job at Bhel and Moore",
    "link": "https://www.jobgurus.com.ng/jobs/view/marketing-officer-job-at-bhel-and-moore",
    "pubDate": "Thu, 03 Jul 2025 11:38:03 GMT",
    "source": "JobGurus",
    "keyword": "bhel and moore",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Bhel and Moore is recruiting suitably qualified candidates to fill the position below:\n\nJob Position: Marketing Officer\nJob Location: Surulere, Lagos\nEmployment Type: Full-time\n\nDuties and Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tCreate and implement marketing plans to promote the company’s printing services.\n\tIdentify target markets and tailor marketing efforts to meet customer needs.\n\tGenerate leads and seek out potential clients through networking, cold calling, and attending industry events.\n\tMaintain relationships with existing clients and secure repeat business.\n\tMonitor sales performance and adjust strategies to achieve targets.\n\tWork on brand-building initiatives to improve the company’s visibility in the printing industry.\n\tOversee advertising campaigns and social media marketing activities.\n\tEnsure a high level of customer satisfaction by addressing inquiries and providing solutions that meet client needs.\n\tAct as a liaison between customers and the production team to ensure smooth execution of orders.\n\tPrepare regular reports on marketing activities, customer engagement, and sales outcomes.\n\tAnalyze the effectiveness of campaigns and suggest improvements.\n\n\nQualifications and Skills\n\n\n\tMinimum OND in Marketing, Business Administration, or related field.\n\t2+ years of proven experience in marketing, preferably in a printing or related industry.\n\tStrong communication, negotiation, and interpersonal skills.\n\tAbility to work under pressure and meet deadlines.\n\tProficiency in digital marketing and social media tools is a plus.\n\tPreference for applicants within Surulere and its environs.\n\tAbility to drive is a plus\n\n\nKey Competencies:\n\n\n\tCreativity and innovation in marketing approaches.\n\tResults-driven with a focus on the job done.\n\tStrong organizational skills with attention to detail.\n\tAbility to work independently and within a team.\n\n\nSalary\nN130,000 - N150,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their Resume to: bhelconsultancy@yahoo.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]