[
  {
    "title": "Secretary / Admin and Human Resources Personnel Job at D&M Data Solutions",
    "link": "https://www.jobgurus.com.ng/jobs/view/secretary-admin-and-human-resources-personnel-job-at-dm-data-solutions",
    "pubDate": "Wed, 18 Jun 2025 11:14:00 GMT",
    "source": "JobGurus",
    "keyword": "d&m data solutions",
    "duplicate": false,
    "classifications": [],
    "content": "D&M Data Solutions is a growing group of small businesses in Nigeria with a bold vision to become a key player across major industries. We are beginning our journey in the food processing and agricultural sectors, with plans to expand into other industries in the near future.\n\nWe are recruiting to fill the position below:\n\nJob Position: Secretary / Admin and Human Resources Personnel\n\nJob Location: Sango-Ota, Ogun\nEmployment Type: Full-time\nIndustry: Food Processing / Farming\n\nSummary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a dedicated and organized Secretary / Human Resource Officer to support our day-to-day operations.\n\tThis is a dual-role position ideal for someone who can manage administrative tasks and oversee basic HR functions in a small business setting.\n\n\nKey Responsibilities\nAdministrative & Secretarial Duties:\n\n\n\tManage office correspondence, calls, and visitor inquiries.\n\tSchedule meetings and maintain management calendars.\n\tPrepare letters, reports, memos, and other documents.\n\tOrganize and maintain filing systems (physical and digital).\n\tTrack office supplies and support general office logistics.\n\n\nHuman Resource Functions:\n\n\n\tAssist with staff recruitment, onboarding, and documentation.\n\tMaintain up-to-date employee records and HR files.\n\tMonitor staff attendance and leave records.\n\tAssist in payroll preparation and timesheet management.\n\tSupport staff performance tracking and basic conflict resolution.\n\tHelp enforce company policies and improve workplace discipline.\n\n\nRequirements\n\n\n\tOND, HND, or B.Sc Degree in Business Admin, HR, or related fields\n\tMinimum of 2 years of experience in a similar role.\n\tProficient in Microsoft Office (Excel, Word, Outlook).\n\tStrong communication and interpersonal skills.\n\tMust be organized, reliable, and able to work with minimal supervision.\n\tKnowledge of basic HR practices and Nigerian labor regulations is a plus.\n\tCandidate must reside in or around Sango-Ota, Ogun State, candidates in close proximity to Sango Ota shall be considered.\n\n\nWhy Join Us?\n\n\n\tRemuneration: N150,000 monthly.\n\tAt D&M Data Solutions, you’ll be part of a visionary and dynamic team with a passion for innovation and excellence. As we grow and diversify our operations, you’ll have the opportunity to grow with us, contribute meaningfully, and make your mark in a fast-evolving business environment.\n\n\nMethod of Application\nInterested and qualfiied candidates should send their CV and a brief cover letter to: d.m.datasolutions1@gmail.com or davidolupitan@yahoo.com using \"Secretary / Admin - Bakery / Sachet Water Operations\" as the subject of the mail.\n\nNote: Qualified candidates shall be interviewed immediately.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Store Supervisor Job at Kinz Global Consult",
    "link": "https://www.jobgurus.com.ng/jobs/view/store-supervisor-job-at-kinz-global-consult",
    "pubDate": "Wed, 18 Jun 2025 11:14:00 GMT",
    "source": "JobGurus",
    "keyword": "kinz global consult",
    "duplicate": false,
    "classifications": [],
    "content": "Kinz Global Consult is an HR Consulting agency that works in staffing and recruitment. We match the employers and employees after reviewing and scrutinizing their needs, nature of work, and cost-effectiveness. We provide professional and competent staff for companies, corporate or non-corporate. We also provide temporary or contractual services on certain conditions and provide permanent staff on demand.\n\nWe are recruiting to fill the position below:\n\nJob Position: Store Supervisor\n\nJob Location: Dopemu, Lagos\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tResponsible for driving the sales of the store and thereby achieving/surpassing the fixed store targets\n\tResponsible for operating the store in compliance with all legal requirements of the country's authorities.\n\tResponsible for inducting, training, developing, and promoting the staff working under you to various positions in the company\n\tMaintaining a catchment diary with updated details of his store catchment\n\tActively take part in reviewing the product assortments or category regularly and periodically. He must continuously recommend to the management on the improvements based on market trends and demands\n\tTaking on the onus, accountability and responsibility of all products, services and personnel of the assigned store.\n\tTo have a clear understanding of the brand value and all that the company stands for.\n\n\nRequirements\n\n\n\t2 - 4 years of managing retail / sales / showroom\n\tCommercially astute with strong marketplace knowledge\n\tA good eye for visual standards\n\tA proven track record of successful people management\n\tDemonstrate passion for the Boundary brand, whilst maintaining our integrity and values\n\tCommunicate effectively with all stakeholders\n\tActively seek opportunities to achieve efficiencies.\n\n\nSalary\nN150,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: career@kinzglobalconsult.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Vacancies at Cen Global Services Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancies-at-cen-global-services-limited",
    "pubDate": "Wed, 18 Jun 2025 11:14:00 GMT",
    "source": "JobGurus",
    "keyword": "cen global services limited",
    "duplicate": false,
    "classifications": [],
    "content": "Cen Global Services Limited (“Cen Global”) is proudly a Nigerian registered company with broad specialization in Shipping & Marine, Recruitment & Manpower Supply, Procurement & Engineering Services, and Consultancy Services. Cen Global was incorporated in March, 2010.\n\nOur business sustainable approach is to understand the needs of our clients and subsequently create a uniquely structured service process tailored towards meeting or exceeding expectations.\n\nWe are recruiting to fill the following positions below:\n\n1.) Learning and Development Coordinator\n\nJob Location: Port Harcourt - Rivers\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a proactive and resourceful Learning and Development Officer to support the design, coordination, and delivery of impactful training programs.\n\tThe ideal candidate will play a critical role in improving employee performance, enhancing client satisfaction, and promoting a culture of continuous learning within and outside the organization.\n\n\nKey Responsibilities\n\n\n\tSupport implementation of HR strategies and initiatives\n\tConduct training needs assessments in collaboration with clients and internal stakeholders.\n\tDesign, plan, and implement learning and development initiatives, including induction, soft skills, technical, compliance, and leadership training.\n\tLiaise with subject matter experts and external facilitators to ensure high-quality training delivery.\n\tEvaluate the effectiveness of training programs using feedback, assessments, and performance outcomes.\n\tMaintain training records, reports, and documentation in line with company standards.\n\tEnsure all training programs comply with relevant regulatory and quality assurance standards.\n\n\nRequirements and Qualifications\n\n\n\tA Bachelor’s Degree in Law, Engineering or a related field\n\tStrong interpersonal and communication skills\n\tKnowledge of Nigerian labour laws and HR best practices\n\tProfessional certification (e.g., CIPM) is an added advantage\n\tExcellent communication and interpersonal skills.\n\n\nApplication Closing Date: 2nd July, 2025. \n\nMethod of Application\nInterested and qualified candidates should forward their resumes to: careers@cenglobalservices.com using the Job Position as the subject of the mail.\n\n \n\n \n\n2.) Human Resources Officer\n\nJob Location: Port Harcourt, Rivers\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe are looking for a smart and resourceful Human Resources Officer to join our team. \n\tThe ideal candidate will be responsible for implementing HR strategies, managing employee relations, coordinating recruitment, and overseeing learning and development initiatives.\n\n\nKey Responsibilities\n\n\n\tDevelop and implement HR strategies, policies, and procedures\n\tManage end-to-end recruitment and selection processes\n\tMaintain employee records and HR documentation\n\tCoordinate and manage training and development programs\n\tEnsure compliance with the labour laws and internal HR policies\n\tConduct performance appraisals and support employee performance management systems\n\n\nQualifications and Requirements\n\n\n\tA good University degree.\n\tA Bachelor’s Degree in law or engineering is an added advantage\n\tStrong interpersonal and communication skills\n\tKnowledge of Nigerian labour laws and HR best practices\n\tProfessional certification (e.g., CIPM) is an added advantage.\n\n\nApplication Closing Date: 10th July, 2025.\n\nMethod of Application\nInterested and qualified candidates should forward their resumes to: careers@cenglobalservices.com using the Job Position as the subject of the mail.\n\n \n\n \n\n3.) Legal Secretary\n\nJob Location: Port Harcourt, Rivers\nEmployment Type: Full-time\n\nSummary\n\n\n\tWe are seeking a highly organized and detail-oriented Legal Secretary for our client in Port Harcourt.\n\tThe ideal candidate will provide efficient and confidential secretarial services, ensure timely document preparation, and maintain the smooth operation of legal procedures.\n\n\nKey Responsibilities\n\n\n\tDevelop legal documents including contracts, agreements, memos, letters, and court filings.\n\tManage meetings, and organize legal appointments.\n\tMaintain accurate and up-to-date filing systems for legal documents, case files, and correspondence.\n\tSupport the legal team in maintaining compliance with statutory and regulatory requirements.\n\tMonitor deadlines and ensure timely submissions and filings.\n\tLiaise with courts, regulatory agencies, clients, and external counsel as required.\n\tPrepare legal documents for notarization, authentication, or registration.\n\tMaintain confidentiality of sensitive information and protect privileged communications.\n\n\nRequirements\n\n\n\tMinimum of LL. B (Bachelor of Laws)\n\tMinimum of 2 years of experience as a legal secretary or in a similar administrative/legal support role.\n\tProficiency in Microsoft Office Suite\n\tExcellent written and verbal communication skills.\n\n\nApplication Closing Date: 18th June, 2025.\n\nMethod of Application\nInterested and qualified candidates should forward their resumes to: careers@cenglobalservices.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Openings at TechnoServe",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-technoserve",
    "pubDate": "Wed, 18 Jun 2025 11:14:00 GMT",
    "source": "JobGurus",
    "keyword": "technoserve",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "TechnoServe works with enterprising people in the developing world to build competitive farms, businesses, and industries. We are a non-profit organization that develops business solutions to poverty by linking people to information, capital, and markets. Our work is rooted in the idea that given the opportunity, hardworking men and women in even the poorest places can generate income, jobs, and wealth for their families and communities. With more than four decades of proven results, we believe in the power of private enterprise to transform lives.\n\nWe are recruiting to fill the following positions below:\n\n1.) Project Administrator, PReP & SAYWEE\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nRequisition Number: PROJE004904\nJob Location: Lagos\nJob Type: Full-Time / On-site\nJob Category: Operations\nProject: Plastics Recycling Program in Southern Nigeria (PReP) and Skilling Adolescents and Young Women for Entrepreneurship and Employability (SAY-WEE)\nReports to: Senior Project Manager\n\nJob Summary\n\n\n\tTechnoServe seeks a highly organized, detail-oriented professional to assist with administrative and logistics functions for the PReP & SAYWEE projects.\n\tThe role is a critical function of the state offices and ensures smooth office operations at all times. \n\n\nProgram/Practice/Department Overview\n\n\n\tThe Project Administrator will be part of the Operations department to support activities across Anambra and Lagos states for the project team through the following:. \n\n\nPrimary Functions & Responsibilities\nTravel and Logistics:\n\n\n\tAssist with international and domestic travel requests for all staff.\n\tAs assigned, process all visa and work permit requests for staff in compliance with host Country guidelines.\n\tGuide other office support staff, such as drivers and cleaners, to regularly comply with operational standards.\n\tWork with the Operations Specialists of the project to coordinate paperwork and physical maintenance of the fleet and logistics management.\n\tWork with Operations Specialists to check vehicle routes and speed limit applications.\n\n\nOffice Management:\n\n\n\tInspect and track usage of office consumables and its facilities, including utilities such as diesel, generator maintenance, electricity and other health and safety regulators.\n\tDrafting of reports relating to the state offices.\n\tCollection of fuel purchase invoices at the state offices for transmission to the finance department.\n\tExecutes daily purchases and manages office petty cash.\n\tProvide petty cash vouchers and payment of petty cash expenses.\n\tSubmit monthly Petty cash fund reconciliation with all related documents.\n\tDraft correspondence, including reports, processes, and other administrative documents.\n\tAssumes responsibility for document filing and applies initiative in developing office administrative procedures.\n\n\nProcurement:\n\n\n\tWork with the Operations Specialists of the project to coordinate the project's needs and make the requests in the system.\n\n\nBasic Qualifications\nThese are the requirements that any qualified candidate must meet. Typically includes:\n\n\n\tBachelor’s Degree or Tertiary studies in Business Administration, Public Administration, Sociology, Office Management, or other relevant social sciences-related fields\n\tProcurement certification or prior experience is an added advantage.\n\n\nPreferred Qualification:\n\n\n\tAlternatively, have at least 2 years of work experience in an administrative / office management role, with responsibilities related to procurement, preferably with an international NGO. \n\n\nTravel:\n\n\n\tAbility to travel on occasion.      \n\n\nLanguage Requirement:\n\n\n\tFluency in English, both in writing and speaking.\n\n\nKnowledge, Skills and Abilities:\n\n\n\tEffective oral and written communication skills, and the ability to work independently on multiple tasks simultaneously \n\tStrong interpersonal, organizational, and communication skills\n\tExperience with relevant software packages is useful for preparing relevant work documents.\n\tHigh Professional work ethic and integrity. \n\tAbility to reason objectively, clear, strong and strategic communication skills.\n\tGood interpersonal and public relations skills.\n\tStrong operational, analytical and management skills.\n\tAbility to multitask competing priorities with minimal supervision.\n\tAbility to work both as a team lead and a team member.\n\n\nClick here to apply online\n\n \n\n \n\n2.) Business Advisor (PRiFN)\n\nRequisition Number: BUSIN004952\nJob Location: Kano\nJob Type: Full-Time / On-site\nJob Category: Programs\nProject: Promoting Rice Fortification in Nigeria (PRiFN) Project\nReports to: Project Manager\n\nJob Summary\n\n\n\tThe Business Advisor will work under the supervision of the project manager to provide capacity-building for rice millers, relevant government agencies and other actors in the rice value chain as well as facilitate the linkage of fortified rice produced by the supported rice millers to the school feeding and other social intervention programmes.\n\tIn addition, S/he will gather market intelligence and monitor performance.\n\tIt should be understood that the tasks outlined below are the key responsibilities, but the employee will be expected to perform any tasks that are necessary within the context of the evolving needs of the project.\n\n\nProgram Overview\n\n\n\tTechnoServe, in collaboration with the United Nations World Food Programme (WFP), is implementing the Promoting Rice Fortification in Nigeria (PRiFN) project to pilot and promote the uptake of fortified rice as part of the national strategy to combat micronutrients malnutrition in Nigeria following the approval of the fortification of rice with iron, zinc, folic acid, B12 and other B vitamins by the Federal Government of Nigeria.\n\tThe project aims to support the production of and promote the consumption of fortified rice in Nigeria.\n\n\nPrimary Functions & Responsibilities\nProject Inception Phase:\n\n\n\tTake the lead on community sensitization, mobilization and enrollment of rice millers/processors.\n\tEnsure project targets (including gender) are met.\n\tAssist the project manager and MEL officer in developing the project work plan, MEAL package and tools.\n\tSupport assessments, baseline, midterm and endline evaluation activities.\n\tIdentify local community trainers in the assigned communities and support the operations team during the recruitment process.\n\n\nProject Implementation Phase:\n\n\n\tSupport the project manager in developing training materials for the production of fortified rice and related food safety and quality control measures.\n\tHandle the training of rice millers, regulatory agencies, religious and community leaders, as well as other stakeholders key to the implementation of the PRiFN project after development of a proper training design.\n\tSupport community sensitization drives and stakeholder engagement for the promotion of the health benefits of fortified rice.\n\tWork with the PM in identifying social intervention programs and the integration of fortified rice in them.\n\tTogether with the project manager, identify rice millers/processors and other actors in the rice value chains who would partner with the project.\n\tWork with the MEL specialist in monitoring and evaluation activities, surveys and reporting as well as developing success stories and lessons learnt.\n\tUnderstand, respect and promote Techno Serve’s values, vision, and strategy in the implementation of assigned duties.\n\tPerform other duties in line with the evolving needs of the program.\n\tPrepare with the project team for donor reports.\n\n\nBasic Qualifications\n\n\n\tA Bachelor’s Degree or equivalent in Agronomy, Economics, Human Nutrition, Food Science and Technology, Public Health with a minimum of 2 years’ experience working with rural communities supporting rice farmers. Alternatively, 4 years’ experience.\n\tDemonstrated understanding of the rice value chain in Nigeria.\n\n\n Preferred Qualifications:\n\n\n\tMust have strong interpersonal skills.\n\tProven skills with Microsoft Office software (Excel, Word, PowerPoint).\n\tExcellent communication skills.\n\n\nKnowledge, skills and abilities\n\n\n\tAbility to engage and advise a broad range of stakeholders, especially community leaders,\n\tDemonstrated experience in data collection and analyses.\n\tDemonstrated experience in report writing\n\tDemonstrated ability to communicate and train in Hausa or other language besides English is an added advantage.\n\n\nRequired Languages: \n\n\n\tFluency in English (written and spoken).\n\n\nTravel: \n\n\n\tLocal/Field Travel.\n\n\nClick here to apply online\n\n \n\n \n\n3.) Women and Youth Manager- PReP\n\nRequisition number: GENDE004999\nJob Location: Abuja, Nigeria\nEmployment Type: Full-Time\nJob category: Programs\nReporting Unit/Supervisor: Senior Program Manager\n\nJob Summary\n\n\n\tThe Women and Youth Manager will work closely with the PREP program team in Nigeria and in coordination with the Global Women and Youth Practice team to support the delivery of women and youth integration and empowerment activities of the project in the country office.\n\tThis will include technical support to program staff and partners, staff capacity development, direct management of Women and youth integration activities, support to monitoring, reporting, and knowledge management activities, participation in the Women and Youth Champions Network, and overall support to advance TechnoServe’s Women and Youth Equality Policy.\n\n\nPrimary Functions & Responsibilities\nKey responsibilities will include:\n\n\n\tWork with the Project staff, develop activities as part of the annual work planning process under each of the project's program areas that address women and youth and youth issues while ensuring that all work plan activities are youth-inclusive and women and youth-sensitive or transformative.\n\tCollaborate to improve the overall women and youth strategy for Nigeria.\n\tProvide technical oversight and technical assistance to a portfolio of activities across the project.\n\tSupport the development of women and youth Analysis for the PReP projects that will inform program design and implementation.\n\tIdentify, develop, and support deployment of women and youth- responsive activities to meet the needs of clients. \n\tBuild local capacity for women and youth integration, and facilitate women and youth-related training for TechnoServe Nigeria staff and partners.\n\tBe the focal lead in developing and adopting women and youth analysis tools including action plans which assist with the design and implementation of activities and continuously improve technical excellence. \n\tConduct assessments and facilitate meetings, as needed, with key stakeholders and clients to identify measures to improve inclusiveness, especially for women and youth within program interventions.\n\tProvide strategic guidance and counsel to program leadership and staff on women and youth integration approaches, priorities and compatibility with program aims and resource constraints. \n\tFacilitate monitoring of women and youth integration in activities and inclusion in program reports while contributing to reporting on women and youth-related topics.\n\tSupport the development of key knowledge products (e.g., case studies, lessons-learned documents, etc.) that facilitate program development, program implementation, internal knowledge sharing, and support the behavioral change required to achieve the program’s key performance indicators (KPIs).\n\tBe a major part of staff and consultants’ recruitment and hiring processes on women and youth related elements within various programs.\n\tWork with the women and youth Practice team to ensure all indicators on the PReP project are being met.\n\tParticipate in regular meetings with program leadership and staff as well as the Global women and youth Practice team. \n\tParticipate in the women and youth Champions Network.\n\tParticipate in Nigeria women and youth working group.\n\n\nBasic Qualifications\n\n\n\tA Bachelor’s Degree with at least 7 years’ experience or a Master’s degree with at least 5 years’ experience in Development economics, Sociology, Anthropology, women and youth or related relevant discipline.\n\tDemonstrable experience implementing practical approaches to advance women and youth and youth equality programs; experience working with donor-funded programs in Nigeria highly preferred.\n\tExperience and an established relevant network in Nigeria will be considered a plus.\n\tDemonstrated success in leading tasks, activities, or initiatives requiring a combination of strong analytical, writing, social and management skills.\n\tExperience implementing approaches to mitigate and reduce women and youth-based violence in economic growth programs will be considered a plus.\n\n\nKnowledge, Skills and Abilities:\n\n\n\tExperience in adult learning techniques, excellent in-person and virtual facilitation skills.\n\tMust be able to work across teams to influence behavior and build capacity.\n\tAbility to work both persuasively and diplomatically in a team-based environment with a high degree of complexity and ambiguity.\n\tAbility to communicate complex women and youth and youth issues with clarity and precision.\n\tA deep, demonstrable commitment to women and youth and youth equality and economic empowerment.\n\tHigh standards of personal integrity; a commitment to achieving sustainable impact, learning, and teamwork; and excellent sense of humor required.\n\n\nRequired Languages:\n\n\n\tEnglish\n\n\nTravel:\n\n\n\tIn-country travel up to 40%\n\n\nClick here to apply online\n\nNote\n\n\n\tWe encourage all qualified individuals who share TechnoServe's vision of improving the lives of others through proven business solutions to apply.\n\tWith our commitment to diversity, we are proud to be an equal opportunity employer and affirmative action employer and do not discriminate on the basis of women and youth, race, color, ethnicity, religion, sexual orientation, women and youth identity, age, HIV/AIDS status, protected veteran status, disability, and all other protected classes.\n\tWe are also proud of our commitment to protecting staff, partners, and beneficiaries from abuse and exploitation and thoroughly vet all final candidates through rigorous background and reference checks.\n\tIf you have a disability that affects your ability to use our online system to apply for a position at TechnoServe please contact the Human Resources at recruitment@tns.org or call +1 202 785 4515.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Openings at Wendernek Consulting Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-wendernek-consulting-limited",
    "pubDate": "Wed, 18 Jun 2025 11:14:00 GMT",
    "source": "JobGurus",
    "keyword": "wendernek consulting limited",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Software Engineering"
    ],
    "content": "The leading human resource outsourcing management solutions provider in Nigeria. Our purpose is to provide applied and bespoke solutions to our clients.\n\nWe are recruiting to fill the following positions below:\n\n1.) Administrative Officer\n\nJob Location: Port Harcourt, Rivers\nEmployment Type: Full-time\n\nPosition Decription\nOffice Reception & Administration:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tOversee and administer the day-to-day running of the office in accordance with policies, procedures, and systems to ensure productive and efficient office operations.\n\tMaintain office security by following safety procedures and controlling access via the reception desk.\n\tServe as the primary point of administrative contact and liaison with other offices, individuals, and institutions on operational matters of the company.\n\tInterface and coordinate suppliers and vendors, initiating procurement and ensuring prompt payment and delivery of goods and services.\n\tAssist with various administrative tasks, such as expense tracking, document preparation, filing, and data entry.\n\tCode and sort documents so they can be accurately processed or filed.\n\tRespond to, or redirect, routine inquiries from external or internal sources about the organization, its activities, or processes so callers/visitors are answered promptly and accurately.\n\tUpdate calendars and schedule meetings as required.\n\tMaintain a safe and clean reception area.\n\n\nAdministrative Support and Planning:\n\n\n\tSchedule, organize and coordinate meetings as directed, including meeting space, audio/visual equipment, food/beverage requirements, and administrative support to ensure a successful event.\n\tPrepare, circulate and maintain the attendance sheet for all meetings.\n\tSet up, facilitate and attend staff meetings, participate in staff discussions, as appropriate.\n\tArrange travel and accommodation, manage agendas, travel plans and appointments for field and other staff as may be required.\n\tProvide support to the office of the Director Operations in managing his schedule, meetings, official travels, and appointments.\n\tTake accurate minutes of meetings and distribute them accordingly.\n\tSet appointments and reminders for the department leadership team.\n\tMaintains continuity among work teams by documenting and communicating actions plans and/or irregularities.\n\tProvide secretarial support to the departments (scanning, printing, filing etc).\n\n\nAssets and Facility Management:\n\n\n\tAssist the Accountant in developing asset management plans for all assets, assessing the need for new purchases, or disposals.\n\tAssist the Accountant in asset management and disposition of inactive and obsolete assets by tracking inventory, costs, movement, and disposition.\n\tMaintain and keep asset register(s) of all Company’s Fixed Assets, to include the proper asset numbering, records of the location of assets and persons under whose control or possession each asset is.\n\tEnter asset data such as hardware serial numbers or identification tags into the Asset Database and ensure information is up-to-date, accurate, and auditable.\n\tPlan, prioritize, and manage maintenance activities and upgrades to equipment, facilities, and systems by scheduling ongoing routine maintenance and enforcing rules of occupancy (per location of each equipment) to minimize disruptions to business activities.\n\tMonitor and keep track of office supplies and consumables, maintain inventories of stock, placing order for replenishment when necessary.\n\tSelect and manage relationships with suppliers (e.g. vendors of photocopy, or printing machines, power generating set) to ensure satisfactory standards of service and oversee their maintenance activities.\n\n\nBookkeeping and Accounting:\n\n\n\tMaintain accurate records of all cash requisitions, including supporting documentation from the requestor and make proper returns of cash obtained.\n\tSupport bookkeeping and budgeting procedures for the company in respect of front office, office equipment and supplies expenditure.\n\tAssist in planning and monitoring office administration related expenditures.\n\tDevelop and coordinate budgets for the office operation and associated accounts as appropriate.\n\tMaintain a balanced petty cash register.\n\tReceive and review petty cash requests from staff, verify the request is for a valid business expense and supported by appropriate documentation.\n\tDisburse the requested amount in cash, after verification and management approval and obtain a signed petty cash voucher from the requestor.\n\tRecord each petty cash disbursement in a petty cash log, including the date, amount, purpose, and recipient of the funds with the supporting documentation, such as receipts or invoices, to the petty cash voucher.\n\tReconcile entries to balance the petty cash account.\n\tMonitor office expenses and costs and keep updated records of office expenses and costs.\n\tFollow up on bills and payments associated with the office (Utility, Security)\n\tComply with Company’s policies, review, and approval processes in making requests for reimbursement for petty cash and other major business expense cash requisitions (travels for staff etc).\n\n\nRecords Management:\n\n\n\tManage emails, letters, packages, and other forms of correspondence in accordance with the mail management procedure.\n\tCreate electronic copies and filing system for all physical incoming and outgoing correspondence by scanning and storing them in the appropriate folders on the Organization’s OneDrive folder, including tracking and locating missing documents.\n\tHandle and store surface mail securely to maintain the confidentiality of correspondence.\n\tKeep all records and files updated.\n\n\nOthers:\n\n\n\tPerform any other tasks as may be assigned.\n\n\nRequirements\n\n\n\tBachelor’s Degree in Business Administration, or a related field.\n\tAt least 2 years of proven experience as office assistant, office administrator or in relevant position.\n\tProficient in a variety of computer software applications including Microsoft Office Suite (Word, Excel, PowerPoint, Outlook, Teams and Access).\n\tFamiliarity with common procedures and basic bookkeeping and account principles used in the office.\n\tCustomer Service Orientation/Client Focus (Internal and External).\n\n\nRenumeration\nN150,000 - N200,000 net per month.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: recruitment@wendernek.com using the Job Position as the subject of the email. \n\n \n\n2.) Operations Manager\n\nJob Location: Port Harcourt, Rivers\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tTo lead and coordinate daily field and support operations across tank cleaning, inspection, and UWID operations, logistics, and back-office functions, ensuring maximum efficiency, safety, cost-effectiveness, and compliance with local and international regulations.\n\tThe Operations Manager is accountable for achieving performance targets and operational integrity in alignment with company goals and client expectations.\n\n\nKey Objectives:\n\n\n\tEnsure all field and support operations are executed efficiently, safely, and within budget.\n\tDrive process improvements across departments, including field service, logistics, QA/QC, and HSE.\n\tSupport business growth through reliable operational delivery and client satisfaction.\n\tBuild a strong organizational culture with a focus on performance, safety, and compliance.\n\n\nCore Responsibilities\nField Operations Oversight:\n\n\n\tManage field activities related to robotic tank cleaning, robotic tank inspection, ROV services, calibrations, ice blasting, and other service delivery.\n\tSupervise the execution of jobs, including equipment mobilization, personnel deployment, and project milestones.\n\tEnsure job readiness through pre-job checks, equipment testing, logistics coordination, and HSE risk assessments.\n\n\nWorkforce and Team Management:\n\n\n\tLead and mentor multidisciplinary teams across operations, workshops, logistics, and administration.\n\tSupervise recruitment, onboarding, training, and performance reviews of operational staff.\n\tDefine career paths and succession plans for key field and support roles.\n\n\nOperational Planning and Optimization:\n\n\n\tDevelop operational schedules, resource allocation plans, and project delivery strategies.\n\tMonitor performance KPIs such as job turnaround time, NPT (non-productive time), equipment utilization, and tool reliability.\n\tImplement lean and Six Sigma practices to eliminate inefficiencies and reduce operational waste.\n\n\nLogistics and Supply Chain Coordination:\n\n\n\tOversee base operations, equipment movement, inventory, and warehouse management.\n\tCoordinate material planning, vendor interaction, procurement schedules, and fleet utilization.\n\tMonitor spare parts availability, equipment downtime, and turnaround scheduling.\n\n\nFinancial Control and Budgeting:\n\n\n\tDevelop and control operational budgets, including job costing, asset maintenance, and contractor services.\n\tMonitor actual vs forecasted cost performance and report variances to upper management.\n\tReview vendor pricing, service contracts, and procurement agreements to ensure cost efficiency.\n\n\nHealth Safety and Environmental (HSE) Compliance:\n\n\n\tEnsure compliance with HSE regulations (ISO, API, IADC, OSHA, local laws).\n\tChampion safety culture through toolbox talks, HSE campaigns, and incident investigations.\n\tCoordinate permit-to-work systems, safety audits, risk assessments, and training drills.\n\n\nClient and Stakeholder Engagement:\n\n\n\tLiaise with client operations and project teams to align expectations and execution plans.\n\tAttend pre-job meetings, technical clarification sessions, and site inspections with clients.\n\tResolve client concerns, operational issues, or service non-conformities with urgency and professionalism.\n\n\nQuality and Reporting:\n\n\n\tEnsure QA/QC protocols are followed across equipment prep, inspection, and service delivery.\n\tApprove operational reports, daily field summaries, inventory logs, and incident logs.\n\tMaintain updated dashboards on operational metrics for leadership and client reporting.\n\n\nRequired Qualifications and Skills\nEducation:\n\n\n\tBachelor’s degree in Mechanical, Petroleum, Industrial Engineering, or a related field\n\tMBA or PMP certification is an added advantage\n\tMinimum 7–10 years of experience in oilfield services or upstream operations, including tank cleaning, inspection, and calibrations.\n\tMinimum 3–5 years in a supervisory or management role with multi-site responsibility\n\tStrong background in tank cleaning, particularly automated or robotic, is an advantage.\n\n\nKey Competencies:\nTechnical Competencies:\n\n\n\tKnowledge of tank cleaning, inspection, blasting, and calibration operations\n\tProficient in ERP tools (SAP, Oracle) and digital field operations platforms\n\tUnderstanding of oil and gas compliance standards and industry best practices\n\tStrong command of inventory control, asset tracking, and logistics planning\n\tHSE front-line and barrier management skills\n\n\nTools & Systems Used:\n\n\n\tERP systems (SAP, Oracle, or similar).\n\tProject management tools (Primavera, MS Project).\n\tBI tools (Power BI, Tableau).\n\tMS Office Suite (Excel, Word, Outlook).\n\n\nWork Environment:\n\n\n\tOffice-based with regular field visits to remote sites, bases, or client facilities\n\tMust be available for 24/7 operational escalation or emergency response when needed\n\tExposure to high-risk environments with strict adherence to HSE standards.\n\n\nRemuneration\nN1,200,000 - N1,500,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should their CV / Resume to: recruitment@wendernek.com using the Job Position as the subject of email.\n\n \n\n \n\n3.) Completion Sales Engineer\n\nJob Location: Port Harcourt, Rivers\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tTo drive the sales and adoption of completion technologies and services by combining in-depth technical expertise with strategic customer engagement.\n\tThe Completion Sales Engineer is a client-facing role responsible for identifying well completion requirements, developing customized solutions, preparing technical and commercial proposals, closing deals, and supporting project execution.\n\tThe role acts as a technical consultant and trusted advisor, bridging the gap between client needs and company capabilities.\n\n\nKey Role and  Responsibilities\nClient Relationship Management:\n\n\n\tDevelop and manage strong, long-term client relationships, understanding their operational challenges and project goals.\n\tConduct regular site visits, meetings, and technical discussions with clients, operators, drilling/completions engineers, and procurement.\n\tProvide consistent after-sales support and act as the first point of contact for client queries or issues.\n\tConduct regular client visits and follow-ups to ensure satisfaction and promote additional services.\n\n\nTechnical Sales and Consultation:\n\n\n\tApply in-depth understanding of the company's offered well completion technologies, methodologies, and applications.\n\tServe as a technical advisor during pre-sales consultations and post-sales support.\n\tRecommend appropriate technologies based on formation conditions, reservoir characteristics, and operational challenges.\n\tCollaborate with OEM engineering and R&D teams to adapt solutions to non-standard applications.\n\n\nProposal And Tender Management:\n\n\n\tPrepare detailed technical and commercial proposals, including tool specifications, case studies, cost estimates, and value propositions.\n\tPrepare and deliver technical presentations tailored to client requirements.\n\tHighlight the advantages of company products and technologies, aligning them with customer needs.\n\tLead bid responses and tender submissions in coordination with proposals, finance, legal, and operations departments.\n\tCustomize completion designs and present justifications for tool selection, anticipated performance, and risk mitigation strategies.\n\n\nTechnical Presentations and Demonstrations:\n\n\n\tDeliver persuasive presentations to client teams, using visual aids, real-world performance data, and technical documentation.\n\tSupport clients during and after the installation of completion tools and systems.\n\tTroubleshoot technical challenges, coordinate with engineering and operations for resolution, and provide client feedback.\n\tRepresent the company at industry conferences, exhibitions, and technical forums.\n\n\nMarket Intelligence and Business Development:\n\n\n\tAnalyse competitors’ offerings, service gaps, pricing, and client satisfaction.\n\tIdentify new accounts, inactive clients, and underserved markets.\n\tMonitor regional drilling activity, contract awards, and project announcements for lead generation.\n\tMonitor trends in the completions sector, competitive activity, and technological innovations.\n\tIdentify new markets and product development opportunities based on customer feedback and industry evolution.\n\n\nCommercial Strategy and Revenue Generation:\n\n\n\tOwn a sales target (monthly, quarterly, and annual) and track performance using CRM systems and reports.\n\tMonitor sales metrics such as opportunity conversion rate, average deal size, and customer acquisition cost.\n\tDevelop pricing strategies that balance competitiveness and profitability, factoring in tool availability, lead times, and service costs.\n\n\nNegotiation and Contract Management:\n\n\n\tLead negotiations on pricing, terms, and conditions in line with company policies.\n\tWork with legal and commercial teams to finalize contracts, service agreements, and delivery schedules.\n\n\nRequirements\nQualifications and Experience:\n\n\n\tBachelor’s Degree in Petroleum Engineering, Mechanical Engineering, or other relevant technical discipline.\n\tMinimum of 5–8 years of combined experience in completion engineering, well services, oil field equipment sales, and/or technical sales.\n\tMaster’s in Engineering, Business, or Technical Sales (desirable)\n\tSales, negotiation, or project management certifications are an added advantage.\n\tHands-on exposure to completion technologies (e.g., packers, valves, sand screens, swellables, multi-zone tools) in onshore or offshore environments.\n\tProven track record in developing business, closing technical sales, and meeting quotas.\n\n\nKey Competencies:\nTechnical:\n\n\n\tComprehensive understanding of drilling and completion operations and systems\n\tStrong technical foundation in completion technologies.\n\tAbility to interpret schematics and completion data.\n\tFamiliarity with industry standards: API, ISO, and local regulatory requirements\n\tProficient in preparing technical documentation and design basis memoranda\n\n\nCommercial:\n\n\n\tStrategic selling and solution development\n\tContract negotiation and bid management\n\tCRM (e.g., Salesforce, Zoho) and pipeline forecasting\n\tFinancial analysis of project margins and ROI.\n\n\nSalary\nN800,000 Gross (Eight hundred and eighty thousand naira per month)\n\nMethod of Application\nInterested and qualified candidates should their Resume / CV to: recruitment@wendernek.com using the Job Position as the subject of email.\n\n \n\n \n\n4.) Logistics-Based Manager\n\nJob Location: Port Harcourt, Rivers\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tThe Logistics Manager is responsible for planning, organizing, and executing the movement, tracking, and documentation of equipment, materials, and personnel in support of our operations in the upstream, mid, and downstream oil and gas.\n\tThe role ensures timely mobilization/demobilization of tools, compliance with regulatory requirements, and the coordination of land, sea, and air transport.\n\tThis position plays a crucial part in minimizing non-productive time (NPT) and ensuring smooth operational continuity by aligning supply chain and field service requirements with logistics execution.\n\n\nKey Responsibilities\nMaterial and Equipment movement:\n\n\n\tCoordinate inbound and outbound shipments of oilfield tools, spare parts, consumables, and heavy equipment.\n\tSchedule and monitor deliveries via road, sea freight, and air freight, ensuring alignment with project timelines.\n\tLiaise with freight forwarders, haulers, rig/base personnel, and service companies for logistics planning.\n\n\nLoadout and Backload Operations:\n\n\n\tPrepare loadout lists, packing lists, and cargo manifests for rig mobilization or job site support.\n\tSupervise backload returns, including inspection, documentation, and quarantine (if applicable).\n\tEnsure load compliance with lifting plans, weight limits, and HSE requirements.\n\n\nInventory and Material tracking:\n\n\n\tTrack real-time location and status of tools and equipment through ERP or logistics software.\n\tSupport inventory control teams with stock movements, bin transfers, and usage reporting.\n\tMaintain traceability of serialized equipment and rental assets.\n\n\nDocumentation and Customs Compliance:\n\n\n\tGenerate shipping documentation: delivery notes, waybills, material transfer notes, manifests, and commercial invoices.\n\tCoordinate with customs brokers for import/export clearance in line with local regulations.\n\tEnsure adherence to documentation standards for bonded, non-bonded, and client-owned materials.\n\n\nVendor and Transport Coordination:\n\n\n\tArrange trucking, vessel booking, and air cargo as per job urgency, tool availability, and route planning.\n\tVerify vendor compliance with HSE, transport, and documentation requirements.\n\tCoordinate return of rental tools and vendor-supplied equipment post-job.\n\n\nHSE and Regulatory Compliance:\n\n\n\tEnforce load securing, safe lifting, and hazardous goods handling procedures.\n\tEnsure that logistics processes meet local, international, and company HSE standards.\n\tParticipate in safety briefings, toolbox talks, and risk assessments related to transport or loading\n\n\nBase/Yard Support:\n\n\n\tCoordinate with base teams for cargo preparation, staging, and dispatch.\n\tEnsure physical inspection of goods before shipment to confirm readiness and condition.\n\tMonitor yard layout efficiency for ease of loading/unloading and HSE adherence.\n\n\nCommunication and Stakeholder Liasion:\n\n\n\tMaintain constant communication with field service teams, workshop supervisors, and clients.\n\tProvide regular updates to operations and project managers on shipment status and ETAs.\n\tAct as a single point of contact for urgent dispatches, job mobilizations, and material logistics support.\n\n\nEmergency and After-Hours Support:\n\n\n\tBe available for urgent call-outs, especially during operational downtime or high-priority jobs.\n\tArrange express dispatches and last-minute freight bookings under pressure.\n\n\nRequirements\n\n\n\tDiploma or Bachelor’s degree in Logistics, Supply Chain Management, Business Administration, or a related field.\n\t4–8 years of experience in logistics coordination, preferably in the oil and gas.\n\tStrong understanding of oilfield tools, consumables, and supply chain cycles.\n\tIATA/IMDG Certification for Dangerous Goods Handling\n\tLogistics/Supply Chain Certification (e.g., CILT, APICS, CSCMP)\n\tForklift, Crane, or Lifting Certification (as applicable)\n\tHSE Certifications (e.g., OSHA, NEBOSH awareness)\n\tExperience working with freight forwarders, customs agents, and bonded shipments.\n\n\nKey Competencies:\nTechnical:\n\n\n\tProficient in ERP/logistics software (e.g., SAP, Oracle, Tallyman, Maximo)\n\tKnowledge of Incoterms, freight booking, and trade documentation\n\tFamiliar with warehouse systems, asset tracking, and stock movement procedures\n\tAbility to interpret load charts, rig-up requirements, and lifting plans\n\n\nWorking Conditions:\n\n\n\tLogistics yard or base environment with field exposure.\n\tMay involve shift work, extended hours, or weekend availability.\n\tRequires PPE and compliance with safety regulations in warehouse/yard areas.\n\tMay include travel to port, customs office, or operational sites as needed.\n\n\nSalary\nN500,000 (Five Hundred Thousand Naira p/m)\n\nMethod of Application\nInterested and qualified candidates should their Resume / CV to: recruitment@wendernek.com using the Job Position as the subject of email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]