[
  {
    "title": "Pharmacologist Job at Kiyix Recruitment Hub",
    "link": "https://www.jobgurus.com.ng/jobs/view/pharmacologist-job-at-kiyix-recruitment-hub-1",
    "pubDate": "Thu, 20 Nov 2025 13:27:31 GMT",
    "source": "JobGurus",
    "keyword": "kiyix recruitment hub",
    "duplicate": false,
    "classifications": [],
    "content": "Kiyix Recruitment Hub is a recruitment/HR consulting firm and our goal is to to help create one million jobs in Nigeria by 2030. At Kiyix recruitment hub, we help make recruitment a stress-free experience for both the employer and the potential job seekers.\n\nWe are recruiting to fill the position below:\n\nJob Position: Pharmacologist\n\nJob Location: Surulere, Lagos\nEmployment Type: Full-time\nIndustry: Pharmaceutical / Retail Pharmacy\n\nJob Summary\n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Pharmacologist will support the pharmacy operations.\n\tThe ideal candidate must have hands-on experience working in a community or hospital pharmacy and solid knowledge of drug interactions, dispensing practices, and patient counseling.\n\n\nKey Responsibilties\n\n\n\tParticipate in pharmacy operations, including drug dispensing and patient counseling where needed.\n\tReview prescriptions for accuracy, dosage, and potential drug interactions.\n\tProvide professional guidance on drug usage, side effects, and contraindications.\n\tMaintain accurate records, inventory, and documentation.\n\tStay updated on new drug discoveries, pharmacy best practices, and regulatory changes.\n\n\nRequirements & Qualifications\n\n\n\tBSc Degree in Pharmacology, or related fields\n\tMinimum of 1- 3 years of experience working in a pharmacy (community or hospital).\n\tStrong understanding of pharmacology, drug mechanisms, and pharmacokinetics.\n\tPractical knowledge of drug dispensing, inventory management, and prescription handling.\n\tAbility to counsel patients professionally.\n\tExcellent analytical, communication, and problem-solving skills.\n\tHigh level of integrity and attention to detail.\n\tAbility to work independently and as part of a team.\n\n\nSalary\nN120,000 - N150,000 monthly (plus Accommodation).\n\nMethod of Application \nInterested and qualified candidates should send their CV to: kicvacancy@gmail.com using the Job Position as the subject of the email.\nOr\nWhatsApp to 09063916949, stating the job role as the subject.    \n\n    \n\n        Click here to Apply",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]