[
  {
    "title": "Social Media & Brand Engagement Officer Job at Abbfem Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/social-media-brand-engagement-officer-job-at-abbfem-group",
    "pubDate": "Tue, 03 Jun 2025 14:16:16 GMT",
    "source": "JobGurus",
    "keyword": "abbfem group",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Abbfem Group is a dynamic, multi-disciplinary company based in the United Kingdom, focused on delivering innovative solutions across technology, consultancy, and training. With a passion for empowering individuals and organizations.\n\nWe are recruiting to fill the position below:\n\nJob Position: Social Media & Brand Engagement Officer\n\nJob Location: Lagos\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe’re looking for a Social Media & Brand Engagement Officer to help grow our digital presence and expand our influence in real-world communities. If you can design flyers, edit videos, and create content that connects—we’d love to meet you!\n\n\nKey Responsibilities\n\n\n\tCreate and manage engaging, platform-specific content across Instagram, TikTok, LinkedIn, X (formerly Twitter), and Facebook\n\tDesign eye-catching flyers and edit compelling short-form videos for campaigns\n\tMonitor trends and keep content fresh, relevant, and audience-focused\n\tAnalyze metrics, report performance, and optimize strategy accordingly\n\tSupport offline activations, community events, and outreach initiatives\n\tEngage actively with our community—responding to comments, messages, and creating connections\n\tCollaborate with internal teams to align content with broader marketing and business goals\n\tBring bold ideas that elevate visibility, build brand loyalty, and drive engagement\n\n\nQualifications\n\n\n\tPassion for visual storytelling\n\tHave experience designing content (Canva, Adobe Suite, CapCut, etc.)\n\tLove being part of conversations and building meaningful communities\n\n\nMethod of Application\nInterested and qualified candiates should send their Applications to: hr@abbfem.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Customer Service Representative Job at EshopAfrica Logistics",
    "link": "https://www.jobgurus.com.ng/jobs/view/customer-service-representative-job-at-eshopafrica-logistics",
    "pubDate": "Tue, 03 Jun 2025 14:16:16 GMT",
    "source": "JobGurus",
    "keyword": "eshopafrica logistics",
    "duplicate": false,
    "classifications": [],
    "content": "EshopAfrica Logistics is a global logistics company with warehouses in the U.S., China, and Nigeria.\n\nWe are recruiting to fill the position below:\n\nJob Position: Customer Service Representative\n\nJob Location: Ojota, Lagos\nEmployment Type: Full-time\n\nJob Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tEstablish and maintain effective communication with clients through meetings, calls, and follow-ups.\n\tRespond to customer inquiries promptly, providing accurate and comprehensive information about our services.\n\tConduct inspections of items for defects and report issues as necessary.\n\tKeep detailed and organized records of all sales activities and customer interactions.\n\tEfficiently process, pack, and ship orders with accuracy.\n\tPrepare all required shipping documents, including bills of lading and customs paperwork, ensuring compliance and accuracy.\n\n\nRequirements\n\n\n\tOND / HND / B.Sc Degree in any discipline.\n\t1-3 years of work experience.\n\tStrong customer service and relationship-building skills.\n\tExcellent verbal and communication skills.\n\tProven customer support or experience as a customer service representative.\n\tAbility to work in a fast-paced environment.\n\n\nSalary\nN100,000 / Month.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hr@myafrimall.com using the Job Position as the Subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Debt Collections Manager Job at Renmoney",
    "link": "https://www.jobgurus.com.ng/jobs/view/debt-collections-manager-job-at-renmoney-1",
    "pubDate": "Tue, 03 Jun 2025 14:16:16 GMT",
    "source": "JobGurus",
    "keyword": "renmoney",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Renmoney - We are a passionate team determined to challenge the status quo and make financial inclusion count for the millions of under-banked individuals and small business owners in Nigeria. We provide loans, savings, and fixed deposit solutions to our customers. Our vision is to be the most convenient lending company, delivering outstanding service experiences.\n\nWe are recruiting to fill the position below:\n\nJob Position: Debt Collections Manager\n\nJob Location: Ikoyi, Lagos\nEmployment Type: Full-time (Hybrid).\n\nJob Description\nStrategy & Execution:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDevelop and implement efficient loan collection strategies tailored to a digital lending environment.\n\tSegment loan portfolios and prioritize collection actions based on risk exposure and customer behavior.\n\tDesign and monitor automated workflows and digital touchpoints (e.g., SMS, email, app notifications) for collections.\n\n\nTeam Management:\n\n\n\tSupervise and coach collections officers and agents to meet collections targets.\n\tMonitor team performance and provide regular feedback and training.\n\n\nProcess Optimization:\n\n\n\tLeverage technology, including CRM tools, AI, and analytics platforms to track loan delinquencies and optimize collection efficiency.\n\tCollaborate with product, tech, and data teams to continuously refine collections processes.\n\n\nCustomer Engagement:\n\n\n\tHandle escalated customer issues with professionalism and tact.\n\tDevelop user-friendly repayment plans and negotiate settlements where appropriate.\n\n\nReporting & Compliance:\n\n\n\tMaintain accurate records of interactions, payments, and commitments.\n\tEnsure compliance with regulatory requirements and internal policies.\n\tProvide regular reports and insights to management on portfolio performance, trends, and risks.\n\n\nRequirements\n\n\n\tBachelor’s Degree in Finance, Business Administration, Economics, or related field.\n\tMinimum 5 years of experience in collections or credit recovery, with at least 2 in a digital lending or fintech environment.\n\tStrong leadership and team management skills.\n\tProficient in the use of digital collection tools, CRMs, and Excel/data analytics platforms.\n\tExcellent communication, negotiation, and customer service skills.\n\tFamiliarity with local financial regulations and microfinance operations.\n\n\nPreferred Qualifications:\n\n\n\tExperience with loan management systems (LMS) and digital banking platforms.\n\tCertification in credit management or debt recovery.\n\tExcellent skills in Microsoft office\n\n\nBenefits\n\n\n\tYou’ll receive competitive compensation and work with amazing people. \n\tYou’ll work in a beautiful environment with a flat structure and solve complex, real-world challenges.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "SME Underwriter Job at Renmoney",
    "link": "https://www.jobgurus.com.ng/jobs/view/sme-underwriter-job-at-renmoney",
    "pubDate": "Tue, 03 Jun 2025 14:16:16 GMT",
    "source": "JobGurus",
    "keyword": "renmoney",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Renmoney - We are a passionate team determined to challenge the status quo and make financial inclusion count for the millions of under-banked individuals and small business owners in Nigeria. We provide loans, savings, and fixed deposit solutions to our customers. Our vision is to be the most convenient lending company, delivering outstanding service experiences.\n\nWe are recruiting to fill the position below:\n\nJob Position: SME Underwriter\nJob Location: Lagos\nEmployment Type: Full-time (Hybrid)\n\nDescription\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tEvaluate SME and corporate loan applications by analyzing financial statements, cash flow, business models, and creditworthiness.\n\tIdentify and assess key risks (financial, industry, management, collateral) and recommend appropriate mitigants.\n\tStructure credit facilities in line with the borrower's needs and the bank’s risk appetite, including terms, pricing, and security requirements.\n\tMonitor assigned portfolio performance, ensure covenant compliance, and flag early warning signs or deterioration in credit quality.\n\tEnsure all credit evaluations and decisions adhere to internal policies, regulatory guidelines, and credit approval frameworks.\n\tDraft detailed credit proposals or memos with clear justifications, risk analysis, and recommendations for approval.\n\tLiaise with relationship managers, legal, and risk teams to coordinate customer due diligence, site visits, and validation of submitted documents.\n\tAssess adequacy and enforceability of collateral, and work with legal to ensure proper documentation and perfection.\n\tCollaborate with Relationship Managers, Credit Committee, and other internal stakeholders to drive timely and sound credit decisions\n\n\nRequirements\n\n\n\tProven experience in SME underwriting and credit risk assessment, with at least [3] years of experience in SME/Corporate credit analysis.\n\tCommercial banking experience as a credit analyst would be a plus.\n\tStrong analytical skills with the ability to interpret financial statements, assess creditworthiness, and make data-driven lending decisions.\n\tIn-depth knowledge of lending regulations, risk management principles, and best practices in underwriting.\n\tExcellent interpersonal skills, effective communication skills, both verbal and written, with the ability to articulate complex financial concepts to non-financial stakeholders.\n\tA strategic mindset with a keen focus on portfolio performance and risk management.\n\n\nBenefits\n\n\n\tYou’ll receive competitive compensation and work with amazing people.\n\tYou’ll work in a beautiful environment with a flat structure and solve complex, real-world challenges.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]