[
  {
    "title": "Administrative / Personal Assistant Job at Zowdin Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/administrative-personal-assistant-job-at-zowdin-limited-2",
    "pubDate": "Fri, 20 Jun 2025 13:47:48 GMT",
    "source": "JobGurus",
    "keyword": "zowdin limited",
    "duplicate": false,
    "classifications": [],
    "content": "Zowdin Limited, a design, construction and real estate development company, is recruiting highly skilled and experienced candidates to join our team in the capacity below:\n\nJob Position: Administrative / Personal Assistant\nJob Location: Abuja\nEmployment Type: Full-time\n\nJob Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAnswer phone calls and emails and take messages\n\tTake accurate and comprehensive notes at meetings\n\tHelp with daily time management\n\tRun errands as requested\n\tMake travel arrangements including flights, accommodation and logistics\n\tScreen and direct phone calls and distribute correspondence\n\tHandle requests and queries appropriately\n\tManage diary and schedule meetings and appointments\n\tSource office supplies\n\tCoordinate events and other engagements\n\tDraft correspondence such as emails and letters\n\tAct as the point of contact between the director and internal/external clients\n\tProduce reports, presentations and briefs\n\tDevise and maintain office filing system\n\tOther tasks that may be assigned.\n\n\nRequirements\n\n\n\tCandidates should possess a HND / Bachelor's Degree in related fields with work experience\n\tProven work experience as a personal assistant\n\tStrong interpersonal skills\n\tTech-savvy and experience with word processing and email programs\n\tActive listening and good communication skills\n\tProactive approach to problem-solving\n\tStrong time-management and organizational skills\n\tKnowledge of office management systems and procedures\n\tMS Office and English proficiency\n\tUp-to-date with the latest office gadgets and applications\n\tAbility to multitask and prioritize daily workload\n\tExcellent verbal and written communications skills\n\tEthical and trustworthy, with the ability to handle sensitive information with discretion and confidentiality.\n\tResults-oriented mindset with a passion for developing to become better.\n\n\nSalary\nN80,000 - N100,000 per month.\n\nMethod of Application\nInterested and qualified candidates should send theirCV and a cover letter explaining their relevant experience and why they are the best fit for this position to: zowdin.ltd@gmail.com using \"Administrative / Personal Assistant\" as the subject of the email.\n\nNote: The ideal candidate must reside in Abuja.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Architect / 3D Visualizer Job at Zowdin Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/architect-3d-visualizer-job-at-zowdin-limited-1",
    "pubDate": "Fri, 20 Jun 2025 13:47:48 GMT",
    "source": "JobGurus",
    "keyword": "zowdin limited",
    "duplicate": false,
    "classifications": [],
    "content": "Zowdin Limited, a design, construction and real estate development company, is recruiting highly skilled and experienced candidates to join our team in the capacity below:\n\nJob Position: Architect / 3D Visualizer\n\nJob Location: Abuja (FCT)\nEmployment Type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are looking to hire a creative Architect / 3D visualizer who can create architectural designs for various projects and bring the architectural drawings to life through photo-realistic 3D images, animations and other illustrations of proposed interior and exterior spaces. \n\tOur ideal candidate should be able to conceptualize, design and implement timeless, beautiful, and functional spaces.\n\n\nResponsibilities\n\n\n\tDevelop concept plans and design solutions from an understanding of project objectives.\n\tCreate mood boards and colour schemes to illustrate concepts, ideas and proposals.\n\tProduce detailed architectural working drawings and specifications.\n\tBe capable of modelling projects from minimum sketches and coordinate independently with other professionals and third parties when required.\n\tCreating 3D models from architectural plans, rough sketches, or real-life objects using special rendering software.\n\tOutline project requirements and cost for completion of project.\n\tSupervise site activities to ensure all specifications are met.\n\tCreate an extremely photorealistic interior, landscape visuals, and animation using 3Dmax/V-Ray/Lumion, Corona Renderer.\n\tCreate 3D walkthrough & fly-through animation.\n\tOutline the timeline for the completion of projects.\n\tWork efficiently with design team, contractors, and other members of the team.\n\tRegularly follow trends in real estate, architecture, and interior design so that own work and ideas are of an international caliber and level of sophistication, and in order to incorporate the latest technology and operational needs.\n\n\nRequirements\n\n\n\tA Degree qualification in Architecture, Interior Design, Interior Architecture, or a related field of study. Masters degree in any of this fields is a plus.\n\tAt least 4 years of proven experience in Architecture Design\n\tMember of ARCON and NIA is an added advantage\n\tMust be proficient in the use of design software like AutoCAD, Revit, Sketch Up, ArchiCAD, Adobe Illustrator + Photoshop, Rendering + Visualization (3Dmax/V-Ray/Lumion, Corona Renderer), or similar to create detailed design layouts and 3D presentations.\n\tProven experience as an interior designer and or furniture designer is an added advantage\n\tExpert knowledge of building products, construction details and relevant rules, regulations, and quality standards.\n\tA very good understanding of space planning and design to generate the best value for projects.\n\tAbility to travel when required\n\tMust have good communication and presentation skills.\n\tWorking knowledge of financial and budgetary management.\n\n\nSalary\nN150,000 - N200,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: zowdin.ltd@gmail.com using the Job Position as the subject of the email.\n\nNote: Only CVs with Architectural Portfolios will be considered    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Junior Web Developer Job at GN128 Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/junior-web-developer-job-at-gn128-limited-1",
    "pubDate": "Fri, 20 Jun 2025 13:47:48 GMT",
    "source": "JobGurus",
    "keyword": "gn128 limited",
    "duplicate": false,
    "classifications": [
      "Software Engineering"
    ],
    "content": "GN128 Solutions an IT Solutions firm dedicated to helping clients leverage Information Technology to Increase profitability & efficiency.\n\nWe are recruiting to fill the position below:\n\nJob Position: Junior Web Developer\n\nJob Location: Ikeja, Lagos\n\nRole Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are currently looking to recruit a Junior Web Developer that is result oriented and self-motivated. You will be required to work from our office in Ikeja.\n\tThis is a full-time on-site role for a Junior Web Developer with both front-end and back-end skills to work from our offices in Ikeja. The post holder will be undergo a two month Intensive training program to get up to speed working with the development team to develop both front-end and back-end functionalities of our tech products and supporting our applications.\n\n\nCore Responsibilities and Duties\n\n\n\tConvert designs into HTML/PHP pages;\n\tDevelop web sites in LARAVEL;\n\tDesigning and creating databases for web pages;\n\tConvert designs into HTML/PHP pages;\n\tConnecting HTML/PHP pages to MYSQL Databases;\n\tDeploying websites into production\n\tCPanel Administration\n\tSSL Implementation & Website Security\n\tOptimizing developed features for maximum speed and scalability;\n\tWriting clean, readable, and testable code;\n\tUpdate and Fix existing issues with web pages\n\tMeet team deadlines;\n\n\nJob Requirements\n\n\n\tExcellent Understanding web development life cycle;\n\tExperience with UI/UX Design;\n\tExcellent knowledge of REACT, HTML, CSS, Java and web development tools;\n\tCore working knowledge of PHP and LARAVEL;\n\tDatabase Design & Development, MYSQL/MSSQL;\n\tSearch Engine Optimization;\n\tAbility to learn new concepts quickly.\n\tFlexible approach, self-motivated and organised;\n\n\nPerson Specification:\n\n\n\tGood interpersonal skills, able to communicate in a friendly, open and constructive manner;\n\tAble to work on own initiative with minimal supervision;\n\tAbility to work as a team player with the team;\n\tAbility to learn & understand new concepts quickly;\n\tAbility to pay attention to details & produce work of a high standard;\n\tFlexible approach, self-motivated and organised\n\n\nExperience:\n\n\n\tMinimum of 12 months professional experience\n\tFlexible work approach, self-motivated and organised.\n\n\nSalary\nN150,000.00 / month.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: recruit@gn128.com using the Job Position as the subject of the email.\n\nNote: Only candidates that live in Lagos and within 30mins commuting of Ikeja would be considered.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Social Media and Content Creator Job at Home Bargains Nigeria Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/social-media-and-content-creator-job-at-home-bargains-nigeria-limited-2",
    "pubDate": "Fri, 20 Jun 2025 13:47:48 GMT",
    "source": "JobGurus",
    "keyword": "home bargains nigeria limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Home Bargains Nigeria Limited is a gift and decor store situated in Abuja, Nigeria.\n\nWe are recruiting to fill the position below:\n\nJob Position: Social Media and Content Creator\n\nJob Location: Abuja (FCT)\nEmployment Type: Full-time\nWorking Schedule: Four times a week\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tIn this role, you will create engaging content to showcase our unique gift products and enhance our brand presence.\n\tYou'll be responsible for producing content for social media and promotional materials that connect with customers.\n\tIf you’re passionate about gifts and content creation, we’d love to have you on board!\n\n\nResponsibilities\n\n\n\tCreate engaging video contentfor social media platforms (Instagram, TikTok, Facebook, etc.) that showcases products, store promotions, and seasonal offerings.\n\tProduce high-quality product videos, including unboxings, demonstrations, tutorials, and customer testimonials, to highlight the unique features of gift items.\n\tDesign promotional videos and adsto support sales campaigns, new arrivals, and special events, ensuring videos are aligned with the brand’s aesthetic and goals.\n\tCollaborate with the marketing teamto develop content strategies that increase online visibility and drive traffic to the store.\n\tEdit and optimize videosfor each platform, ensuring content is tailored to platform-specific formats and engagement trends.\n\tCreate attention-grabbing video contentthat showcases store events, product launches, or exclusive offers to entice customers.\n\tDesign eye-catching promotional materials(such as banners, flyers, and social media posts) to support video content and store promotions.\n\tMonitor performance of video contentacross platforms, analyzing metrics to improve future content and drive higher sales conversions.\n\tKeep up with trendsin video marketing and social media to continuously evolve content and stay relevant to the target audience\n\tMore tasks as may be required.\n\n\nRequirements\n\n\n\tMinimum of HND qualification\n\t3 years of experience.\n\n\nSalary\nN100,000 monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV and Cover letter to: ad.homebargains@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Warehouse Coordinator Job at Future Moves Recruitment (FMR) Agency",
    "link": "https://www.jobgurus.com.ng/jobs/view/warehouse-coordinator-job-at-future-moves-recruitment-fmr-agency",
    "pubDate": "Fri, 20 Jun 2025 13:47:48 GMT",
    "source": "JobGurus",
    "keyword": "future moves recruitment (fmr) agency",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Future Moves Recruitment (FMR) Agency is a licensed full-fledged Human Resource firm with extensive expertise and experience in human Capital development and staffing. Future Moves has exceptional expertise in Talent Sourcing, learning & development, talent management, HR Outsourcing & Payrolling, HR planning & Consulting, Policy Drafting, Culture Change and Organisation Effectiveness by designing and implementing interventions which identify the core areas of development to enhance the overall growth and competitiveness of your organization.\n\nWe are recruiting to fill the position below:\n\nJob Position: Warehouse Coordinator\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Location: Satellite Town, Lagos\nEmployment Type: Full-Time\nIndustry: Pharmaceutical\nReports to: Warehouse Manager\n\nJob Summary\n\n\n\tThe Warehouse Coordinator oversees the day-to-day operations of the warehouse, ensuring accurate inventory management, timely order fulfillment, and adherence to safety standards. This role supports efficient receiving, storing, and dispatching of goods.\n\n\nKey Responsibilities\n\n\n\tCoordinate and monitor daily warehouse activities including receiving, storing, and dispatching of goods.\n\tSupervise warehouse staff and assign tasks to ensure smooth workflow.\n\tMaintain accurate records of inventory and ensure proper documentation.\n\tConduct regular inventory counts and reconcile discrepancies.\n\tLiaise with suppliers, logistics companies, and internal departments as needed.\n\tEnsure timely and correct fulfillment of orders and deliveries.\n\tMonitor warehouse equipment and report maintenance or repair needs.\n\tImplement and enforce safety and cleanliness standards within the warehouse.\n\tAssist in the development and improvement of warehouse procedures and policies.\n\tPrepare reports on warehouse performance, stock levels, and operations.\n\n\nRequirements\n\n\n\tCandidates should possess an OND / HND / Bachelor’s Degree in Logistics, Supply Chain Management, Business Administration, or related field.\n\tProven experience in warehouse operations or logistics coordination.\n\tStrong organizational and leadership skills.\n\tProficiency in inventory management software and Microsoft Office Suite.\n\tGood communication and interpersonal skills.\n\tAbility to multitask and work under pressure.\n\tKnowledge of warehouse health and safety standards.\n\n\nSalary\nN100,000 - N120,000 / Month.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: recruiter.j@fmragency.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]