[
  {
    "title": "Payments Operation Analyst Job at Citibank Nigeria Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/payments-operation-analyst-job-at-citibank-nigeria-limited",
    "pubDate": "Wed, 18 Jun 2025 09:42:29 GMT",
    "source": "JobGurus",
    "keyword": "citibank nigeria limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Citibank Nigeria Limited (CNL) was incorporated in Nigeria on May 2, 1984 and the oldest international bank in the country. It provides a wide range of financial products and services to corporate and commercial customers, financial institutions and public sector organizations. It offers deposit and loan products, global transaction services, cash management, sales and trading, corporate finance and investment banking products.\n\nWe are recruiting to fill the position below:\n\nJob Position: Payments Operation Analyst\n\nJob Req ID: 25871794\nJob Location: Kano, Nigeria\nJob type: Full-time\nWork mode: On-Site/Resident\nJob Category Transaction Services\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Payments Operation Analyst is an intermediate level role responsible for executing complex transactions and participating in complex processes in coordination with the Branch Services team.\n\tThe overall objective is to act as a subject matter expert while processing all regular payments.\n\n\nResponsibilities\n\n\n\tPerforming processing activities (processing local, cross border payments, other transactions e.g. expense tickets, Tax collections, counter cheques, check deposits, Vault Operations and Cash - In - Transit management) and managing supporting documentation related to payments\n\tProper handling of customers instruction brought to the branch and ensure correctness as well as managing various customer requests (in person and on phone) on daily basis\n\tConducting communication with all stakeholders including clients, internal partners, regulators particularly Central Bank of Nigeria, Nigeria Customs Service and Scanning & Risk Service Providers\n\tSolving current processing issues and taking action in order to optimize the process\n\tCompliance with applicable regulatory guidelines, laws of Nigeria and Citigroup corporate policy, local procedures, product programs and international conventions\n\tPreparation and sending of regulatory reports to the relevant regulatory Bodies\n\n\nQualifications\n\n\n\tCandidates should possess a Bachelor’s / University Degree with a minimum of 6 years of post qualification experience\n\tFundamental comprehension of financial industry regulations\n\tEffective communication in both written and spoken English\n\tWell-developed analytical skills including investigative mindset, independence in problem solving and a keen eye to detail\n\tRisk awareness\n\tGood knowledge of Microsoft Office preferred\n\n\nWhat We Can Offer You\n\n\n\tThis is a role that'll offer you the opportunity to build an in-depth knowledge of financial services operations. Every day there will be new business challenges that will help you develop new skills that can drive your career\n\tBy joining Citi Nigeria, you will not only be part of a business casual workplace, but also receive a competitive base salary (which is annually reviewed) and enjoy a whole host of additional benefits that support you (and your family) to be well, live well and save well.\n\tAlongside these benefits Citi is committed to ensuring our workplace is where everyone feels comfortable coming to work as their whole self every day.  We want the best talent around the world to be energized to join us, motivated to stay, and empowered to thrive. \n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Risk & Compliance (H&S) Manager Job at Atlas",
    "link": "https://www.jobgurus.com.ng/jobs/view/risk-compliance-hs-manager-job-at-atlas",
    "pubDate": "Wed, 18 Jun 2025 09:42:29 GMT",
    "source": "JobGurus",
    "keyword": "atlas",
    "duplicate": false,
    "classifications": [],
    "content": "Atlas - We believe in a world where growth thrives across borders and cultures. Our mission is to guide companies on their journey by providing services and technology that enables global talent management and delivers a human experience. As an Employer-of-Record (EOR) provider, we offer the HR and compliance infrastructure essential for companies to expand internationally. We take care of the complex, behind-the-scenes work, allowing companies to focus on the strategies that drive their success. We are For People, By People. The future of work is borderless, and so are we.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nOur people are located around the globe — in the U.S., the UK, India, Colombia, China, and beyond. Diversity and belonging are not just values, they are who we are. We are also committed to making a positive impact. Through our Environment, Social, and Governance (ESG) impact initiative, we are addressing our environmental footprint and promoting social responsibility. Our impact program is central to our vision and culture, focusing on employee wellness, diversity, charitable work, and ethical corporate governance.\n\nWe are recruiting to fill the position below:\n\nJob Position: Risk & Compliance (H&S) Manager\n\nJob Location: Nigeria\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tAs the Risk & Compliance Manager, you will play a pivotal role in advancing Atlas’ Health & Safety (H&S) program in 160+ Atlas countries.\n\tYou will work closely with the Risk & Compliance Senior Manager to help design and implement a global safety program from the ground up.\n\tAs a key member of the Risk & Compliance team, you will also be managing specific enterprise-wide risk mitigation projects and leading the development of H&S corporate policy and localizing them where required. \n\n\nKey Responsibilities\n\n\n\tEnsure Compliance & Risk Management – Monitor, interpret, and implement H&S policies to meet or exceed regulatory requirements worldwide.\n\tInforming and educating different departments on the requirements and building cross-functional relationships to ensure compliance with regulations \n\tResearch - Lead the research component of the H&S program by developing a database of H&S rules and regulations for different countries. \n\tCollaborate Across Functions – Work with internal HR/HRSD, Operations, Legal & Compliance, Data Privacy and other business areas globally and ensure they are aware of the H&S requirements to implement the program. \n\tIncident Management – Assist in the rollout of H&S incident management module in Atlas’ Governance, Risk & Compliance (GRC) tool. Train Operations team on how to utilize the module, and record incidents.  \n\tRisk Management - Assess potential H&S risks of existing entity/country operations and new business opportunities and coordinate mitigation efforts with the relevant departments. \n\tAnti-Harassment – Ensure H&S research includes local country’s anti-harassment requirements and help develop localized policies as required. \n\tPolicies and SOPs - Assist in updating policies, procedures and frameworks that align with industry standards and best practices. \n\tEnterprise Risk Projects - Manage enterprise-wide risk mitigation projects as assigned.  \n\n\nQualifications\n\n\n\tBachelor’s degree in environmental health & safety, occupational safety, human resources, employment law or a related field. \n\t5+ years of progressive experience in OHS, employment law or HR within a complex, fast-paced corporate environment. \n\tExcellent project management and organizational skills, with the ability to manage multiple priorities in a fast-paced environment \n\tStrong attention to detail in maintaining thorough policies, plans, and procedures. \n\tLeadership presence and capability to direct teams under pressure during an H&S incident. \n\n\nWhat We Offer \n\n\n\tThe opportunity to work with a purpose — simplifying global expansion across borders and cultures\n\tA diverse and inclusive environment\n\tCountry-specific benefits\n\tFlexible PTO\n\tYour birthday off and a day for you to volunteer and give back to the organization of your choice\n\tGenerous Parental Leave Program\n\tGrowth and development opportunities with access to a top learning content provider\n\tThe opportunity to challenge yourself in a high-performing organization and leave each day knowing you have made an impact.\n\n\nNote\n\n\n\tThis position description may not describe all duties, responsibilities, and skills associated with this position.\n\tIt is intended to portray the major aspects of the job. Other duties or skills may be required.\n\tAtlas Technology Solutions, Inc. is an Equal Opportunity Employer and Prohibits Discrimination and Harassment of Any Kind\n\tAtlas is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment.\n\tAll employment decisions at Atlas are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate.\n\tAtlas will not tolerate discrimination or harassment based on any of these characteristics. \n\tAtlas encourages applicants of all ages.\n\tAtlas will provide accommodation on request throughout the recruitment, selection and assessment process for applicants with disabilities.\n\tHiring decisions are based upon Atlas’s operating needs, and applicant merit including, but not limited to, qualifications, experience, ability, availability, and location.\n\tThis role will be subject to a background check under local law after an employment offer has been made.\n\tEmployment may be subject to results. In addition, references may be requested at the final stage of the process.\n\tAtlas will only email candidates from an “@atlashxm.com” email address.\n\tCandidates should ignore communication that pretends to be from Atlas from any other email address.\n\tAtlas will never ask candidates or employees to purchase gift cards or otherwise make payments in connection with applying for a job with Atlas.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "IT Support Technician Job at Cavista",
    "link": "https://www.jobgurus.com.ng/jobs/view/it-support-technician-job-at-cavista-1",
    "pubDate": "Wed, 18 Jun 2025 09:42:29 GMT",
    "source": "JobGurus",
    "keyword": "cavista",
    "duplicate": false,
    "classifications": [],
    "content": "Cavista is a global technology company creating cloud-based software solutions for clients. With operations around the world, we globalize, standardize and localize our processes, while at the same time remaining sensitive to specific needs in different regions. Our mission is to empower organizations with the world’s best technology solutions.\n\nWe are recruiting to fill the position below:\n\nJob Position: IT Support Technician\n\nJob Location: Ilupeju, Lagos\nEmployment Type: Full Time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a highly skilled Female IT Support Technician to provide technical assistance and support for hardware, software, and network related issues across the organization.\n\tThe ideal candidate will be responsible for troubleshooting IT problems, maintaining systems, and ensuring smooth day to day operations for end users.\n\tThis role requires expertise in Microsoft Azure, cloud infrastructure, and IT security best practices.\n\n\nResponsibilities\nWhat you will do:\n\n\n\tProvide first-line technical support to employees by diagnosing and resolving hardware, software, and network-related issues.\n\tInstall, configure, and maintain computers, printers, mobile devices, and other IT equipment to ensure optimal performance.\n\tRespond to IT service requests and incidents in a timely manner, ensuring minimal disruption to operations.\n\tPerform system updates, patches, and software installations to maintain security and efficiency.\n\tAssist in IT asset inventory management, tracking and documenting IT equipment and licenses.\n\tMonitor and maintain IT infrastructure, including servers, networks, and security systems, with a focus on Microsoft Azure cloud services.\n\tManage Azure Active Directory (Azure AD) for user account provisioning, access controls, and security policies.\n\tAssist with user account management, including password resets, access requests, and system configurations.\n\tSupport remote employees by troubleshooting VPN, cloud-based systems, and remote desktop environments.\n\tCollaborate with the IT team on projects, upgrades, and implementation of new technologies, particularly Azure-based solutions.\n\tImplement Azure security best practices, including role-based access control (RBAC), identity protection, and endpoint security.\n\tProvide user training and guidance on IT best practices, cloud-based collaboration tools, and security protocols.\n\n\nQualifications\n\n\n\tBachelor’s degree in Information Technology, Computer Science, or a related field (or equivalent work experience).\n\t1-3 years of experience in IT support, helpdesk, or technical support roles.\n\tProficiency in troubleshooting Windows, macOS, and Linux operating systems.\n\tHands-on experience with Microsoft Azure administration, including Azure AD, virtual machines, and cloud security.\n\tStrong knowledge of Active Directory, Office 365, networking protocols, and cloud-based services.\n\tFamiliarity with ticketing systems and IT service management frameworks (e.g., ITIL).\n\tKnowledge of cybersecurity best practices, firewalls, and endpoint security.\n\tAbility to work independently and collaboratively in a fast-paced environment.\n\tStrong problem-solving skills, customer service orientation, and excellent communication abilities.\n\n\nBenefits\n\n\n\tCompetitive Compensation \n\t5 - day workweek\n\tFlextime\n\tCompetitive Health Insurance (Employee + Spouse + 4 children)\n\tWellness Programs\n\tEmployee Training Programs\n\tGrowth and Development\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]