[
  {
    "title": "Job Openings at Lafarge Africa Plc",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-lafarge-africa-plc-4",
    "pubDate": "Tue, 08 Jul 2025 12:33:31 GMT",
    "source": "JobGurus",
    "keyword": "lafarge africa plc",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Lafarge Africa Plc is a member of the LafargeHolcim Group – the biggest building and concrete solutions company in the world. It is a publicly quoted company on the Nigerian Stock Exchange (NSE) and serves Nigeria with a wide range of building and construction solutions designed to meet housing and construction needs from small projects like individual home buildings to major construction and infrastructure projects.\n\nWe are recruiting to fill the following positions below:\n\n1.) Mechanical Planner\n\nRequisition ID: 13859\nJob Location: Ewekoro, Ogun\nJob type: Full-time\n\nAbout the Job\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tImprove the efficiency and productivity of own personnel and third party services through a good planning, follow up and optimization of all preventive/corrective maintenance tasks to reach the targets of equipment availability / reliability at the lowest sustainable maintenance cost, in collaboration with all involved departments or sub-departments, following the maintenance guide lines defined by the company.\n\n\nWhat you'll be doing \n\n\n\tThe Mechanical Planner is responsible to prepare all planned maintenance that have to be carried out by the Mechanical Execution team, service companies or contractors.\n\n\nResponsibilties\nIn that role, the Mechanical Planner will work closely with the inspectors and the execution team on the following tasks and responsibilities in order to reinforce the day-to-day job preparation & planning:\n\n\n\tPlanning and scheduling of all preventive maintenance routines in SAP/DMS together with the specific execution responsible.\n\tGeneration and optimization of the 48/96 weeks workload balancing sheet by department/specialty/technic targeting a good balance during the days of the year.\n\tGenerates the weekly and 13 weeks planning.\n\tPrioritizes the notifications coming from condition monitoring or others and generates corrective work orders in agreement with the requester\n\tLeads the preparation and consolidation of the shutdown planning (personal, third parties services, materials, spare parts, equipment, tools, time, critical path) with coordination meetings using MAC guidelines and tools.\n\tGenerates purchase orders as well as third party services contracts for mayor shutdown, assure that spares and services will be delivered on time.\n\tControl of expenses during planning as well during the execution vs budget and control the inventory level vs guide value\n\tAssure that special and repetitive jobs come with a standard work order. Lead the weekly KPI revision meeting as well as the work planning confirmation for the next week\n\tTakes care of his own development needs and train maintenance people on planning requirements\n\tAssure that all work orders have the required H&S information, and that all legal requirements (safety, environmental, maintenance) are in the yearly preventive maintenance plan and are executed.\n\tMonitor the realization of the plans.\n\tFollow-up tasks defined in mayor shut-downs in a daily frequency.\n\tLeads After Action Review for shutdown or mayor repairs\n\tThe Mechanical Planner will be utilized to supervise some jobs and contractors during annual plant\n\tThe list is not exhaustive as planners may be required to perform other functions as may be assigned by the manager.\n\n\nWhat we are looking for \n\n\n\tMechanical Engineering graduate\n\t3-5 years of experience in Mechanical Engineering, including rotating machines, equipment maintenance, condition monitoring, in cement manufacturing company, refinery, power or heavy process plan\n\tKnowledge of gearboxes, transmissions, hydraulic, pneumatic, welding techniques, lubrication, and mechanical non-destructive testing\n\tAdequate Knowledge related to equipment function & maintenance (Crusher, Stacker, Reclaimer, Raw mill, Belt Conveyors & Aux. Equipments)\n\tGood knowledge of Machinery condition Monitoring technologies and maintenance philosophies.\n\tAbility to trouble shoots the problem and proposed corrective actions.\n\tExcellent knowledge of vibration analysis, oil analysis, wear measurement, thermography, liquid penetrant, ultrasonic, magnetic particle, radiography, etc\n\tGood knowledge of RCA methodology and facilitating skills\n\tCMRP certification will be an added advantage.\n\n\nWho you'll be working with:\nList of direct reports:\n\n\n\tNone \n\n\nKey Interfaces, stakeholders and relatinships:\n\n\n\tInspector\n\tLubrication Foreman\n\tInventory\n\tArea Manager\n\tShift Leader\n\tWorkshop\n\tExternal contractors and suppliers\n\tProcurement,\n\tFinance.\n\n\nClick here to apply online\n\n \n\n2.) Drill Rig Operator\n\nRequisition ID: 14162\nJob Location: Mfamosing, Cross River\nJob type: Full-time\n\nAbout the Job \n\n\n\tThe role holder is primarily responsible for operating a drilling machine to create holes in rock at the quarry or for surface mining operations. \n\tHe/she would also be involved in setting up and maintaining the drilling equipment, ensuring safe working practices and potentially supervising junior operators. \n\tMonitor and keep an accurate record of drill accessories consumption to avoid wastage of bits.\n\n\nResponsibilities\n\n\n\tOperate the drilling machine to create blasting holes in rock, following safety protocols and operational procedures.\n\tConduct regular inspections and maintenance on the drilling equipment to ensure optimal performance and minimise downtime.\n\tEnsure a safe working environment by implementing safety measures, adhering to safety regulations, and reporting any unsafe conditions\n\tCollaborate with mining engineers and geologists to assess drilling sites and plan drilling operations in line with production demand.\n\tMaintain accurate records of drilling operations, including depth, pressure, and production rates.\n\tMonitor and keep a very accurate record of drilling accessories consumption, ascertain and eschew wastages of drill bits.\n\tMaybe responsible for supervising junior operators and support staff, providing training and guidance on drilling techniques and safety practices.\n\n\nWho you'll be working with:\n\n\n\tHuman dimension: Quarry Engineer.\n\tOrganisational dimension: The incumbent interacts regularly with all categories of Staff in the Plant and offers professional advice on best practice to operate mobile equipment.\n\tHe/she also interacts regularly with the plant operators on best operating practices.\n\n\nRequirements\n\n\n\tMinimum OND/ND Certificate \n\tMinimum of 3 years of post-qualification experience in machine main systems.\n\tFully understand the machine operation parameters (feed pressure, percussion pressure, flushing air pressure and temperature)\n\tGood knowledge of safety regulations and rules applicable in an industrial area\n\tEffectively coordinate the activities of the Mobile Plant department\n\tAbility to prioritise with excellent time management skills\n\tGood attention to detail and communication skills.\n\n\nClick here to apply online\n\n \n\n \n\n3.) Security Operative\n\nRequisition ID: 10385\nJob Location: Mfamosing, Cross River\nJob type: Full-time\n\nJob Summary\n\n\n\tThe Security Operative (SO) is responsible for keeping Lafarge Africa and suppliers’ staff, visitors, and similar safe & secure.\n\tBased on shift work rotation the SO will be in the plant between eight and twelve hours, also on weekends, and supervise all security related activities while in parallel supervise and support all company transport activities.\n\n\nWhat you'll be doing\n\n\n\tResponsible for the protection of the company’s PEARL (People, Environment, Assets, Reputation & Legal Exposure) in the South-East Region under the direction of the Security Manager South-East.\n\tSupport the supervision of the Private Security Provider, ensuring they fulfil their contractual obligations. Conduct supervisory checks on the 3rd party security provider and the services provided such as random checks at guard locations in Mfamosing Plant (MFA) and Calabar, joining vehicular patrols and ensuring all standards agreed are being fulfilled. To be conducted utilising various online tools that are available.\n\tEnsure Lafarge Health & Safety standards are adhered to.\n\tSupervise and direct the armed security incident response force.\n\tSupervise and direct security assets during crises periods and/or in case of direct assaults on company staff and/or assets.\n\tProvide reliable and concise incident data and write accurate reports via the various company online tools.\n\tInteract with the local PSF (Public Security Forces) in cases of (armed) attacks, intrusions, trespassing, fraud and theft.\n\tSafeguard that all Security & Resilience Policies of the company are adhered to.\n\tAct as a communicator between the Plant Management and Security Department when the Senior Security Operatives is not present.\n\tWork in shifts ensuring there is a 24/7 security supervision function on duty.\n\tSupport with investigations and detailed report writing. Validate reporting independent of the Private Security Provider’s report.\n\t Conduct independent assessments and identify gaps in baseline physical security and notify/ advise both the Security Manager and Senior Security Operative.\n\tGather local intelligence on all aspects and issues to support and protect the business.\n\tCreate and maintain intelligence networks.\n\tReporting of incidents on the Group Security SINT platform.\n\tMonitoring and supervision of CCTV operators, video evidence assessment and ongoing projects.\n\n\nWhat we are looking for\n\n\n\tOND minimum requirement \n\tA minimum of 4 years of experience in a security supervisory position\n\tSecurity incident supervisory experience (incl. following up on complex incidents such as shootings, armed attacks, theft, and similar)\n\tExperience of supervising teams and resources\n\tCapability to drive Lafarge security standards in all business activities.\n\tBe Microsoft Office proficient\n\tAbility to produce different kind of vetted and accurate incident reports.\n\n\nWho you'll be working with:\n\n\n\tSenior Security Operative\n\tContractors \n\tAll levels of staff.\n\n\nClick here to apply online    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Manager, Project Job at Stanbic IBTC Bank",
    "link": "https://www.jobgurus.com.ng/jobs/view/manager-project-job-at-stanbic-ibtc-bank",
    "pubDate": "Tue, 08 Jul 2025 12:33:31 GMT",
    "source": "JobGurus",
    "keyword": "stanbic ibtc bank",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Stanbic IBTC Bank is a leading African banking group focused on emerging markets globally. It has been a mainstay of South Africa's financial system for 150 years, and now spans 16 countries across the African continent.\n\nStandard Bank is a firm believer in technical innovation, to help us guarantee exceptional client service and leading edge financial solutions. Our growing global success reflects our commitment to the latest solutions, the best people, and a uniquely flexible and vibrant working culture. To help us drive our success into the future, we are looking for resourceful individuals to join our dedicated team at our offices.\n\nWe are recruiting to fill the position below:\n\nJob Position: Manager, Project\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Location: Lagos\nJob Type: Full-time\n\nJob Description\n\n\n\tTo manage the delivery of projects through the application of best practice project management skills, tools and techniques, whilst engaging with and leading cross-functional teams to deliver scalable business solutions within the required parameters in terms of scope, cost and quality.\n\n\nRequirements\n\n\n\tFirst degree in IT and Computer Sciences or related discipline\n\tMinimum of 4 years of experience in Business Operations and Information Technology related roles is an additional requirement.\n\tProject Management Certification (PMP, PRINCE2, SAFE Agile etc.) will be an added advantage.\n\n\nBehavioural Competencies:\n\n\n\tFollowing Procedures\n\tMaking Decisions\n\tManaging Tasks\n\tMeeting Timescales\n\tProducing Output\n\tTeam Working\n\tUpholding Standards.\n\n\nTechnical Competencies:\n\n\n\tProject Accounting\n\tChange Management\n\tProject Management\n\tProject Reporting.\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Logistics Supervisor Job at Médecins Sans Frontières/Doctor without Borders",
    "link": "https://www.jobgurus.com.ng/jobs/view/logistics-supervisor-job-at-médecins-sans-frontièresdoctor-without-borders",
    "pubDate": "Tue, 08 Jul 2025 12:33:31 GMT",
    "source": "JobGurus",
    "keyword": "médecins sans frontières/doctor without borders",
    "duplicate": false,
    "classifications": [
      "Software Engineering"
    ],
    "content": "Join our Cohort 32 and Become a Software Developer            \n        \n\n        \n            \n\n                        Moat Academy  \n            \n                         Software/ Programming / Web development  \n             \n                         Abuja\n                                     and 2 other locations\n                            \n        \n\n        Our Cohort 31 is currently ongoing. Ifeoluwa was a member of our Cohort 30, and he developed Peddle, a web application for bicycle rentals, at the boot camp. In an interview with him, he stated, \"I've…\n    \n\n    \n        Apply\n        13th July, 2025",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Branch Manager Job at 1k shop",
    "link": "https://www.jobgurus.com.ng/jobs/view/branch-manager-job-at-1k-shop",
    "pubDate": "Tue, 08 Jul 2025 12:33:31 GMT",
    "source": "JobGurus",
    "keyword": "1k shop",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "1k shop is one of the best super market in Benin city around airport road.\n\nWe are recruiting to fill the position below:\n\nJob Position: Branch Manager\n\nJob Location: Benin / Airport road, Edo\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tPlan and direct day to day operational activities of the branch.\n\tLiaise with General Manager to develop business strategies that will attract new customers, expand store traffic, and enhance profitability towards achieving set target.\n\tSupervise the activities of the Floor Manager and all heads of department, also, communicate with cleaning and security agents on the performance of their employees.\n\tHandling the process for product swap and customer cash refunds.\n\tEnsure all employees in the branch deliver excellent customer service at all times to enhance customer satisfaction.\n\tEnsure all employees are properly dresses and presentable at all times depicting morals and the organizational standard.\n\tMonitor sales trends of different products and motivate the team to drive sales to meet sales objectives\n\tFoster positive environment and ensure customer satisfaction by responding to customer complaints and resolving customers concerns in a professional manner\n\tLiaise with government regulatory agencies and ensure timely compliance.\n\tMonitor inventory levels and ensure that items ordered are supplied on time to avoid stock-out on the shop floor.\n\tCommunicate any new policies and relevant information to all employee in the branch, giving correction and advice, and also receiving feedbacks and questions concerning their challenges as it relates to their job and any other relevant issues.\n\tReview duty roster to ensure adequate manning of every section and department\n\tMonitor staff attendance and report lateness and absenteeis\n\tOversee the process of product procurement, Inventory process, product storage, proper product display and sales of product.\n\tRelate the outcome of such meetings to Management including suggestion/recommendation.\n\tIssue queries to employee who violate the company’s policy and forward the query issued and response received with your recommendation to the Human Resource Manager through the GM.\n\tControl losses that arise from damaged products, product stock out and expired products.\n\tKeep abreast with changes in government policies and its effect on the business and inform Management.\n\tOther responsibilities as may be assigned from time to time.\n\n\nQualifications\n\n\n\tInterested candidates should possess a Bachelor’s Degree with 3 - 5 years of work experience.\n\n\nSalary\nN100,000 - N120,000 monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: staffmanager@yehgs.co.uk using the Job Position as the subject of the mail.\n\nNote: For more enquiries, call:+234 812 920 7496.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Accountant Job at 1k shop",
    "link": "https://www.jobgurus.com.ng/jobs/view/accountant-job-at-1k-shop",
    "pubDate": "Tue, 08 Jul 2025 12:33:31 GMT",
    "source": "JobGurus",
    "keyword": "1k shop",
    "duplicate": false,
    "classifications": [],
    "content": "1k shop is one of the best super market in Benin city around airport road.\n\nWe are recruiting to fill the position below:\n\nJob Postion: Accountant\nJob Location: Benin / airport road, Edo\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tPreparing accounts and tax returns\n\tAuditing financial information\n\tCompiling and presenting reports, budgets, business plans, commentaries and financial statements\n\tAnalysing business plans\n\tProviding tax planning services based on current legislation\n\tFinancial forecasting and risk analysis\n\tDealing with insolvency situations\n\tNegotiating the terms of business deals with customer\n\tMeeting and interviewing customer\n\tManaging colleagues.\n\n\nRequirements\n\n\n\tInterested candidates should possess a B.Sc Degree with 3 - 5 years of work experience. \n\n\nSalary\nN100,000 - N120,000 per month. \n\nMethod of Application\nInterested and qualified candidates should send their CV to: staffmanager@yehgs.co.uk using the Job Postion as the subject of the mail.\n\nNote: For more enquires contact via phone no:+234 812 920 7496.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]