[
  {
    "title": "Job Openings at DreamWorks Global Logistics Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-dreamworks-global-logistics-limited",
    "pubDate": "Mon, 09 Jun 2025 09:41:57 GMT",
    "source": "JobGurus",
    "keyword": "dreamworks global logistics limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "DreamWorks Global Logistics Limited - We link manufacturers with numerous customers in over 100 cities and villages across Nigeria, getting their products to them seamlessly and rapidly. We have a precise customer-focused strategy that addresses our customers’ supply chain requirements seamlessly. We know how to deliver!\n\nWe are recruiting suitably qualified candidates to fill the following positions below:\n\n1.) Sales Manager\n\nJobLocation: Lagos Mainland, Lagos\nEmployment Type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThis role requires leadership in managing sales teams, fostering strong customer relationships, leveraging both digital and offline marketing strategies, and ensuring profitability through effective sales and logistics coordination.\n\n\nJob responsibilities\n\n\n\tDevelop and implement comprehensive sales strategies tailored to the logistics sector, focusing on market penetration ,expansion and revenue growth.\n\tAnalyze logistics market trends, customer needs, and competitor activities to refine sales approaches and forecast sales accurately.\n\tIdentify sales leads, pitch products to new clients and maintain a good working relationship with new contacts.\n\tPartner with marketing to design and execute integrated digital campaigns (SEO, social media, email marketing) and offline initiatives (trade shows, networking events) to generate qualified leads.\n\tSet clear sales targets and quotas based on market analysis and company objectives.\n\tMonitor sales pipeline and adjust strategies proactively to ensure targets are met or exceeded.\n\tConduct regular performance reviews, provide coaching, and implement training programs to enhance team capabilities and motivation.\n\tPrepare and present detailed sales performance reports, forecasts, and market insights to senior management.\n\n\nGeneral Skills Requirements\n\n\n\tA First Degree or post-graduate Diploma in Marketing, Accounting, Business Administration or a related discipline\n\tMinimum of 3 years of sales experience, preferably with relevant experience in the Logistics industry\n\tThe ability and desire to sell.\n\tA positive, confident, and determined approach.\n\tFamiliarity with product and sales analysis\n\tProficiency in all Microsoft Office applications.\n\n\nSalary\nN350,000 - N400,000 / Month.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: dglhrexecutive@gmail.com using the Job Position as the subject of the email.\n\n \n\n \n\n2.) Dispatch Rider\n\nJob Locations: Abuja (FCT) & Lagos\nEmployment Type: Full-time\n\nJob Description\n\n\n\tWe are seeking enthusiastic and reliable Dispatch Riders to join our team.\n\tIn this role, you will be responsible for delivering packages or other items to customers in a timely and efficient manner.\n\tYou will play a crucial role in ensuring customer satisfaction and representing our brand positively.\n\n\nKey Responsibilities\n\n\n\tSafely operate a motorcycle or other vechicle to deliver items to customers.\n\tDelivering of items to customers / clients\n\tNavigate through city streets efficiently to meet delivery deadlines.\n\tEnsure the accuracy of deliveries by double-checking items before departure.\n\tMaintain a professional demeanor and provide excellent customer service during interactions.\n\tFollow safety regulations and traffic laws at all times.\n\tKeep the delivery vehicle clean and in good working condition.\n\tHandle cash or digital payment transactions as required.\n\tReport any issues or delays to management promptly.\n\n\nQualifications\n\n\n\tValid driver's license and/or appropriate certification for the vehicle used.\n\tExperience in delivery or riding is required.\n\tFamiliarity with local roads and neighborhoods.\n\tStrong time management skills and the ability to work independently.\n\tExcellent communication and interpersonal skills.\n\tA smartphone with navigation capabilities.\n\n\nPhysical Requirements:\n\n\n\tAbility to lift packages weighing up.\n\tProlonged periods of sitting or riding.\n\n\nWorking Conditions:\n\n\n\tFlexible hours, including evenings and weekends.\n\tExposure to various weather conditions.\n\n\nBenefits\n\n\n\tSalary: N70,000 Monthly.\n\tCompetitive pay per delivery or hourly rate.\n\tIncentives based on performance.\n\tInstant Health Package like HMO\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: dglhrexecutive@gmail.com using the Job Posiiton as the subject of the email.\n\n \n\n \n\n3.) Sales Executive\n\nJob Locations: Lagos, Benin - Edo & Kano\nEmployment Type: Full-time\n\nJob Description\n\n\n\tWe are seeking a highly motivated and results-driven Sales Executive with a strong background in logistics to join our team.\n\tThis role involves identifying new business opportunities, developing client relationships, and driving revenue growth through the sale of logistics services.\n\tThe ideal candidate will have a solid understanding of logistics operations, supply chain management, and transportation solutions, along with excellent sales and communication skills.\n\n\nResponsibilities\n\n\n\tGenerate new leads and identify potential clients in the logistics and transportation sectors.\n\tPromote the company’s logistics services, including freight forwarding, supply chain solutions, and transportation management.\n\tConduct product presentations, demonstrations, and meetings to drive sales and close deals.\n\tNegotiate contracts and pricing with clients to ensure mutually beneficial agreements.\n\tMeet or exceed sales targets, KPIs, and revenue goals set by the company.\n\tMaintain accurate sales records, customer data, and reports in the CRM system.\n\n\nRequirements\n\n\n\tBachelor’s Degree in Business, Logistics, Supply Chain Management, or a related field (preferred).\n\tMinimum of 2 - 5 years of experience in sales, with at least 2 years in the logistics or transportation industry.\n\tActive clientelle database.\n\n\nSkills:\n\n\n\tStrong understanding of logistics, supply chain management, and transportation solutions.\n\tProven track record of achieving sales targets and generating new business.\n\tExcellent communication, negotiation, and interpersonal skills.\n\tAbility to work independently and as part of a team in a fast-paced environment.\n\n\nSalary\nN150,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: dglhrexecutive@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Accounting & Administrative Officer Job at Admiralty Resources Services",
    "link": "https://www.jobgurus.com.ng/jobs/view/accounting-administrative-officer-job-at-admiralty-resources-services",
    "pubDate": "Mon, 09 Jun 2025 09:41:57 GMT",
    "source": "JobGurus",
    "keyword": "admiralty resources services",
    "duplicate": false,
    "classifications": [],
    "content": "Admiralty Resources Services (ARS), a Professional Services Firm, is recruiting to fill the position below:\n\nJob Position: Accounting & Administrative Officer\nJob Location: Lekki Phase 1, Lagos\nEmployment Type: Full-time\n\nRequirements\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tA first degree in Accounting, Business Administration, Law, or a related discipline from a reputable institution.\n\tMinimum of 5 years of experience in a similar role\n\tStrong verbal and written communication skills\n\tProficiency in accounting practices and statutory compliance\n\tProficient in professional administrative practices\n\tExperience in HR coordination for day-to-day operations, staff, clients, and vendors\n\tSkilled in Microsoft Office (Word, Excel, PowerPoint), Google Workspace, and other work-support software\n\tExcellent organizational and scheduling abilities\n\tPreferred age for this role will be 35 and below.\n\n\nSalary\nN300,000 - N350,000 per month.\n\nMethod of Application\nInterested and qualified candidates should submit their updated CV and a capability statement referencing the specific role to: ars.jobs@ymail.com using the Job Position as the subject of the email.\n\nNote\n\n\n\tSuccessful candidates will be expected to resume on or before June 23, 2025.\n\tPlease do not apply if you do not meet the stated requirements.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Business Development Officer Job at Admiralty Resources Services",
    "link": "https://www.jobgurus.com.ng/jobs/view/business-development-officer-job-at-admiralty-resources-services",
    "pubDate": "Mon, 09 Jun 2025 09:41:57 GMT",
    "source": "JobGurus",
    "keyword": "admiralty resources services",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Admiralty Resources Services (ARS), a Professional Services Firm, is recruiting to fill the position below:\n\nJob Position: Business Development Officer\nJob Location: Lekki Phase 1, Lagos\nEmployment Type: Full-time\n\n Requirements\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tA minimum of a first degree in a relevant discipline from a reputable institution\n\tMinimum of 5 years of experience in a similar role\n\tStrong communication skills (writing, publishing, presentation)\n\tProven marketing skills with a track record of successful deal closures\n\tExcellent elocution and telephone etiquette\n\tStrong digital marketing competence and use of appropriate tools\n\tResearch skills and use of research tools are an added advantage\n\tFamiliarity with the downstream energy sector is a plus\n\tProject management capability\n\tUnderstanding of corporate customer practices and market economics\n\tPreferred age for this role will be 32 and below\n\n\nSalary\nN300,000 per month.\n\nMethod of Application\nInterested and qualified candidates should submit their updated CV and a capability statement referencing the specific role to: ars.jobs@ymail.com using the Job Position as the subject of the email.\n\nNote\n\n\n\tSuccessful candidates will be expected to resume on or before June 23, 2025.\n\tPlease do not apply if you do not meet the stated requirements.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]