[
  {
    "title": "Job Vacancies at NexusHR Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancies-at-nexushr-group",
    "pubDate": "Tue, 17 Feb 2026 07:48:13 GMT",
    "source": "JobGurus",
    "keyword": "nexushr group",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "NexusHR Group is recruiting suitably qualified candidates to fill the follwing positions below:\n\n1.) Head of Operations & Business\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nDescription\n     \n\n            \n    \n\n\n\n\n\tThe Head of Operations & Business Performance is responsible for driving end-to-end operational excellence, business performance execution, and supply-chain reliability across MedStock, Medbury’s pharmaceutical distribution, stock-financing, and supply-optimization business unit.\n\tThis role acts as the strategic and operational engine of MedStock, overseeing procurement cycles, inventory flow, warehousing, logistics, partner operations, performance management, and financial efficiency.\n\tThe position ensures that products move seamlessly from suppliers, warehouses, facilities, patients, while maintaining accuracy, speed, compliance, customer satisfaction, and profitability.\n\tThe role requires strong operational leadership, data-driven decision-making, risk management, and cross-functional coordination to deliver MedStock’s mission of enabling uninterrupted pharmaceutical access across public and private health facilities nationwide.\n\n\nKey Responsibilities\nStrategic & Operational Leadership:\n\n\n\tTranslate MedStock’s business objectives into executable operational strategies.\n\tLead expansion initiatives including new facilities, warehouse scaling, and partner onboarding.\n\tSet and manage KPIs, performance targets, and scorecards for all operational units.\n\tDrive continuous improvement, operational optimization, and cost-efficiency across the value chain.\n\n\nSupply Chain Management & Operational Execution:\n\n\n\tOversee end-to-end supply chain operations including procurement, warehousing, distribution, inventory control, and facility-level operations.\n\tEnsure accurate and timely execution of monthly and quarterly procurement cycles.\n\tSupervise inventory planning, replenishment accuracy, cycle counts, batch tracking, and expiry management.\n\tOptimize picking, packing, dispatch, fleet utilization, routing, and last-mile delivery.\n\tAchieve strong product availability to support partner hospitals, DMAs, tertiary facilities, and private institutions.\n\n\nBusiness Performance Management:\n\n\n\tTrack operational performance metrics including COGS, stock turnover, collections cycle, cash flow impact, and overall contribution margin.\n\tLead weekly and monthly business performance reviews with the Head of Business/COO.\n\tEnsure timely submission of reports, dashboards, and data analytics to support strategic decisions.\n\tIdentify performance gaps and drive swift corrective actions across all operational lines.\n\n\nPartner & Stakeholder Management:\n\n\n\tOversee operational engagement with DMAs, state programs, tertiary hospitals, private hospitals, and institutional partners.\n\tEnsure high service levels, timely fulfilment, and continuous facility support.\n\tCollaborate with Sales & KAM to align stock levels, pricing, and fulfilment needs.\n\tEnhance supplier/vendor performance through active monitoring and negotiation support.\n\n\nCompliance, Quality, Risk & Governance:\n\n\n\tEnsure 100% adherence to SOPs, GDP standards, regulatory guidelines (NAFDAC, PCN, FMoH), and audit expectations.\n\tLead operational audits, stock counts, and discrepancy investigations alongside the Audit & Assurance team.\n\tChampion strong internal controls and operational discipline across all MedStock processes.\n\tImplement business continuity, risk mitigation, safety, and HSE protocols.\n\n\nTechnology, Systems & Process Optimization\n\n\n\tDrive ERP/WMS utilization to ensure data accuracy, inventory visibility, and process automation.\n\tWork with IT to implement digital tools for forecasting, dashboards, and workflow optimization.\n\t?nsure 100% accurate and real-time data capture across all operational channels.\n\n\nLeadership & People Development:\n\n\n\tLead and develop warehouse, logistics, inventory, and field operations teams.\n\tBuild supervisory and managerial capabilities within the operations structure.\n\tConduct performance appraisals for all direct and indirect reports.\n\tPromote a culture of discipline, accountability, teamwork, and high operational standards.\n\n\nQualifications\n\n\n\tInterested candidates should possess a Bachelor`s Degree with 8 - 10 years of experience.\n\n\nApplication Closing Date: 31st March, 2026.\n\nMethod of Application \nInterested and qualified candidates should send their introduction message and CV to: nexushrgroup@gmail.com using the Job Position as the subject of the email.\n\n \n\n \n\n2.) SME Team Lead (Hub Manager)\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob summary\n\n\n\tThe SME Hub Manager is responsible for establishing, leading, and growing Assets Microfinance Bank’s presence within the assigned Lagos markets where the Bank does not maintain a physical branch.\n\tThe role functions as a market-based branch equivalent, with full accountability for revenue generation, loan disbursement, investment mobilization, customer acquisition, brand visibility, and operational planning within the assigned hub.\n\n\nResponsibilities\n\n\n\tEstablish Assets MFB as a visible, trusted, and preferred financial partner within the assigned market or cluster.\n\tDrive continuous on-ground activation, relationship building, and strategic visibility initiatives(market storms, trade associations, merchant clusters, cooperative engagements).\n\tBuild and maintain strong relationships with market leaders, associations, landlords, trade unions, and key influencers.\n\tServe as the Bank’s first point of contact for SMEs, traders, and institutional partners within the hub.\n\tOwn and deliver monthly, quarterly, and annual revenue targets for the assigned hub.\n\tDrive deposit mobilization across SME accounts, current accounts, savings, and fixed/term investments.\n\tGrow fee-based income through account usage, digital channels, POS deployment, collections, and value-added services.\n\tActively cross-sell the Bank’s full product suite to customers within the hub.\n\tDrive healthy loan origination in line with approved products, sectors, and risk appetite.\n\tEnsure high-quality loan sourcing, documentation, and pre-screening prior to credit review.\n\tMonitor loan performance within the hub and proactively manage delinquency, early warning signals, and recoveries.\n\tWork closely with Bank’s Credit Risk and other internal teams to ensure loan turnaround time and portfolio quality.\n\tLead the sourcing and management of investment funds, including fixed deposits and structured investment products.\n\tBuild long-term relationships with high-value customers, cooperatives, and associations for recurring investments.\n\tEnsure compliance with investment documentation, tenor management, and maturity planning.\n\tPlan, structure, and manage the day-to-day operations of the SME Hub as a mini-branch.\n\tOversee and build the workforce the hub, including recommendations for Sales Officers, DSAs, Relationship Officers, and support staff.\n\tSupervise assigned staff, agents, or DSAs operating within the hub, ensuring productivity, discipline, and performance delivery.\n\tEnsure efficient utilization of resources allocated to the hub.\n\tDeliver a high-quality, responsive, and professional customer experience despite the absence of a physical branch.\n\tResolve customer complaints promptly and escalate issues in line with the Bank’s service framework.\n\tEnsure customer onboarding, documentation, and KYC standards are strictly adhered to.\n\tTrack and report hub performance across revenue, loans, investments, customer acquisition, and portfolio quality.\n\tSubmit regular market intelligence, competitor insights, and performance updates to management.\n\tMaintain accurate records of all hub activities in line with internal reporting requirements.\n\tEnsure full compliance with internal policies, regulatory guidelines, and CBN requirements.\n\tEnforce KYC, AML/CFT, and customer due diligence standards within the hub.\n\tIdentify operational, credit, and reputational risks and escalate appropriately.\n\n\nQualifications\n\n\n\tInterested candidates should possess a Master's Degree with 7 - 9 years of experience.\n\n\nApplication Closing Date: 30th March, 2026.\n\nMethod of Application \nInterested and qualified candidates should send their Applications to: nexushrgroup@gmail.com using the Job Position as the subject of the email.\n\n \n\n3.) Head of Investment\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tThe Head of Investment department would be grossly responsible for the day-to-day operations and management of the Investment department including team members, sales, and ensuring adequate financial liquidity relevant to the business and financial activities of Assets MFB.\n\tHe/she would be grossly responsible for ensuring liquidity by mobilizing funds for the company, monitoring and executing action plans in achieving overall funds and sales target allocated, as well as overseeing the departments of the entire department towards achieving set objectives.\n\n\nKey Responsibilities\n\n\n\tDevelop and execute the department’s strategic objectives in line with the bank’s\n\tProvide strategic advice to the MD with accurate view of the market and the bank’s future.\n\tInnovate and develop attractive value-added deposit products and marketing strategies based on field experience.\n\tLead and co-ordinate a portfolio of strategic sales and partnerships, related to growth initiatives to accelerate go-to market and drive commercial outcomes, overseeing team members.\n\tPrepare and implement comprehensive business plans to facilitate achievement by planning cost-effective operations and market development activities\n\tDrive and meet assigned sales targets and quota of the company\n\tProduce periodic reports for board, management and relevant stakeholders’ meetings\n\tCultivate and maintain an active portfolio of HNI clientele on an on-going basis for investment.\n\tContribute to the development of new products and/or better marketing and sales strategies.\n\tCultivate and maintain courteous and efficient relationship with internal and external stakeholders and drive team to do same.\n\tProvide recommendations to enhance the company’s strategies, policies and processes\n\tParticipate in creating new and better marketing strategies based on field experience.\n\tRegularly liaise with treasury management unit and other divisions in order to understand ongoing changes in business activities and developments, and drive business objectives\n\tResponsible for planning, managing, and coordinating the activities of the Investment/deposit mobilization sales teams to drive deposit mobilization\n\tSource appropriately priced and structured deposit liabilities for the company from individual and corporate sources through the sale of specially designed investment products.\n\tMarketing and sale of all bank’s deposit products\n\tMeeting and exceeding sales target as assigned by board/management\n\tSourcing for new and maintaining existing deposit clients.\n\tCultivating, enhancing and establishing courteous relationship with existing and prospective customers\n\tParticipate in creating new and better marketing based on field experience.\n\tAchieve set targets in deposit mobilization and other assigned tasks\n\tEnsure that, due diligence is always enforced to meet the requirements of the regulator, and protect the interest of both the depositors and the organization.\n\tInnovate and develop attractive value-added deposit products and marketing strategies based on field experience.\n\tContinually generate a viable pipeline of prospects/potential clients within the desired target market that will ensure the achievement of the set personal and departmental targets\n\tContribute to the development of new products and/or better marketing strategies.\n\tProvide recommendations to enhance the departments and company’s policies and processes\n\tRegularly liaises with treasury management unit and other divisions in order to understand ongoing changes in business activities and developments.\n\tExecute other related tasks and duties as assigned by management.\n\n\nRequirement\n\n\n\tInterested candidates should possess relevant qualifications with experience.\n\n\nApplication Closing Date: 10th March, 2026.\n\nMethod of Application \nInterested and qualified candidates should send their CV to: nexushrgroup@gmail.com using the Job Posiiton as the subject of the email.\n\n     \n\n    \n\n        Click here to Apply",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]