[
  {
    "title": "Customer Service Officer (Call Center) Job at Mactay Consulting",
    "link": "https://www.jobgurus.com.ng/jobs/view/customer-service-officer-call-center-job-at-mactay-consulting-1",
    "pubDate": "Wed, 25 Jun 2025 11:14:13 GMT",
    "source": "JobGurus",
    "keyword": "mactay consulting",
    "duplicate": false,
    "classifications": [],
    "content": "Mactay Consulting, We are the leading management consulting firm in Nigeria, providing HR Consulting, Learning & Development Solutions, Outsourcing and Contact Centre Solutions.\n\nWe are recruiting to fill the position below:\n\nJob Position: Customer Service Officer (Call Center)\n\nJob Location: Lagos \nEmployment Type: Full-time\n\nJob Brief\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAs a Customer Service Officers (Call Center) you will be required to provide excellent customer service to the company's subscribers by answering inquiries, resolving complaints, offering product information, and assisting with account management through phone calls, emails, or live chat, while adhering to company's standards and achieving set performance metrics like call resolution rates and customer satisfaction levels.\n\n\nResponsibilities\n\n\n\tAnswering customer calls regarding billing issues, service inquiries, product information, account updates and complaints.\n\tIdentifying the root cause of customer problems, providing solutions and ensuring timely resolution within company’s guideline\n\tActively offering relevant organization products and services to customers based on their needs and current plan\n\tAccurately documenting customer interactions, including details of inquiries, complaints and resolutions in the CRM system\n\tMaintaining high levels of customer service by meeting established quality metrics like call handling time, first contact resolution and customer satisfaction\n\tKeeping up to date with the latest company’s products, services, policies and system updates ti provide accurate information to customers\n\n\nRequirements and Skills\n\n\n\tBachelor’s Degree in any field of study.\n\t0 - 1 year of working experience.\n\tExcellent communication and interpersonal skills.\n\tStrong listening and problem solving abilities.\n\tThe ideal candidate must have completed NYSC\n\tKnowledge of customer service principle and practices.\n\n\nSalary\nOpen.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Admin Officer Job at Binary Consulting Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/admin-officer-job-at-binary-consulting-limited",
    "pubDate": "Wed, 25 Jun 2025 11:14:13 GMT",
    "source": "JobGurus",
    "keyword": "binary consulting limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Binary Consulting Limited - Our client in the legal profession is recruiting to fill the position below:\n\nJob Position: Admin Officer\n\nJob Location: Victoria Island, Lagos\nEmployment Type: Full-time\nReporting to: Administrator\n\nResponsibilities\n\n\n\tProvide day-to-day admin support\n\tAssist with scheduling, record-keeping & documentation\n\tCoordinate logistics for meetings and legal events\n\tManage the association’s social media platforms.\n\n\nRequirements:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tBSc./HND Business Administration, Office Technology, Information Technology, or a related field\n\t2–4 years in administrative roles\n\tStrong MS Office proficiency\n\tSocial media management skills\n\tExcellent communication & organization\n\tAttention to detail and willingness to learn.\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Human Resources / Admin Officer Job at Ekiti Agro-Allied International Cargo Airport",
    "link": "https://www.jobgurus.com.ng/jobs/view/human-resources-admin-officer-job-at-ekiti-agro-allied-international-cargo-airport-1",
    "pubDate": "Wed, 25 Jun 2025 11:14:13 GMT",
    "source": "JobGurus",
    "keyword": "ekiti agro-allied international cargo airport",
    "duplicate": false,
    "classifications": [],
    "content": "The Ekiti Agro-Allied International Cargo Airport is a new airport in Ekiti State, Nigeria, designed for both cargo and passenger flights. It received approval for non-scheduled flight operations in December 2024, with the aim of boosting the state's economy and facilitating the export of agricultural products.\n\nWe are recruiting to fill the position below:\n\nJob Position: Human Resources / Admin Officer\n\nJob Location: Ekiti\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tTo be responsible for and proactively drive the design, development, and effective delivery of training to the organization's employees within defined timescales\n\tLiaising with HODS and interviewing employees at all levels to identify and assess training and development needs\n\tExplaining and providing information on employee benefits, programs, and education\n\n\nQualification/Job Specifications\n\n\n\tB.Sc. in any Social Sciences. CIPM will be an added advantage.\n\tMinimum of 2 years of post-qualifications\n\n\nSkills and Competence:\n\n\n\tAbility to work with extremely confidential & sensitive data\n\tTeamwork\n\tTime management\n\tConflict resolution\n\tGood Leadership skills.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and a certificate of Local Government of Origin to: jobs.airport@ekitistate.gov.ng using the Job Position as the subject of the mail.\n\nNote\n\n\n\tOnly qualified candidates should apply.\n\tOnly shortlisted candidates will be contacted.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Senior Supply Officer Job at Action Against Hunger",
    "link": "https://www.jobgurus.com.ng/jobs/view/senior-supply-officer-job-at-action-against-hunger",
    "pubDate": "Wed, 25 Jun 2025 11:14:13 GMT",
    "source": "JobGurus",
    "keyword": "action against hunger",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Action Against Hunger is the world’s hunger specialist and leader in a global movement that aims to end life-threatening hunger for good within our lifetimes. For 40 years, the humanitarian and development organization has been on the front lines, treating and preventing hunger across nearly 50 countries. It served more than 21 million people in 2018 alone.\n\nWe are recruiting to fill the position below:\n\nJob Position: Senior Supply Officer\n\nJob Location: Maiduguri, Borno\nReporting to: Logistics and Supply Chain Manager\nProposed start date: July 2025\n\nKey responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tEnsure procurement is processes according to the project's PPP;\n\tHandle supplies in accordance with the appropriate procedure\n\tHandle orders in accordance with ACF procedures;\n\tOrganize and manage PDs in LINK\n\tPrepare the necessary documents related to the order: Supplier Purchase Order, Delivery Note, etc;\n\tCheck the accuracy of the information on all documentation;\n\tEnsure that all required validations are completed prior to procurement.\n\tMaintain and develop a supplier database into LINK\n\tEnsure that ACF policies (Gender and Safeguarding, etc.) are well understood by suppliers\n\tInform logistics and programs of their supply progress\n\tConduct market reviews to find new suppliers;\n\tDevelop good relationships with suppliers;\n\tNegotiate prices with suppliers\n\tKeep LINK up to date with all relevant suppliers and market information;\n\tEnsure that all elements of procurement files are complete in LINK;\n\tEnsure that all procurement related documentation is carefully archived (Procurement Files,DN) electronically and physically in the archive room. \n\tEnsure warehouse team is well informed of deliveries to receive;\n\tEnsure that invoices contain the required information in accordance with ACF procedures;\n\tEnsure the update of procurement files with corresponding invoices;\n\tEnsure advance of cash is use and close according to the procedures of the finance department;\n\tCoordinate with the finance department to ensure proper follow-up of supplier payment.\n\tComplete and maintain the Contract Monitoring follow up;\n\tComplete and maintain the supply minutes.\n\n\nPosition Requirements\n\n\n\tMinimum Bachelor degree/HND or equivalent \n\tMin 2 years of experience in procurement and/or logistics position\n\tSome experience in supervising Staff\n\tStrong computer skills in MS Office, especially MS Excel\n\tRigorous, with strong organization skills and attention to detail\n\tStrong communication skills\n\tStrong negotiation skills\n\tStrong Integrity\n\tProfessional level of English\n\tAbility to work in complex environment and can bear the work load\n\tPrevious experience working for NGOs an asset, particularly international and/or Nutrition-health, WASH and FSL related NGOs.\n\n\nNote\n\n\n\tOur employees enjoy a work culture that promotes diversity and inclusion\n\tAction Against Hunger does not charge any fee at any stage of the recruitment process (application, interview, processing)\n\tAction Against Hunger provides Equal Employment Opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, gender, national origin, age, disability, or genetics.\n\tOther benefits include but are not limited to 100% health care coverage, free and direct access to Cross Knowledge e-learning platform.\n\tWomen at ACF are entitled to benefits such as maternity leave, compassionate leave for a hospitalized child, and creche facilities for babies and toddlers.\n\tAll candidates MUST ensure they answer all the questions asked for this application. Failure to do so means candidates will not be considered for the process.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Investment Advisor Job at Mshel Homes Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/investment-advisor-job-at-mshel-homes-limited",
    "pubDate": "Wed, 25 Jun 2025 11:14:13 GMT",
    "source": "JobGurus",
    "keyword": "mshel homes limited",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "Mshel Homes Limited is a real estate development and marketing company incorporated in 2018 with a unique vision to be the leading real estate company in Nigeria, with an outstanding reputation for honesty, integrity and impeccable customer service.\n\nAt Mshel Homes Limited our mission is to create a lifetime relationship with our clientele by deliverying property solutions through innovative and technological driven processes that caters to your real estate needs whilst adhering to the highest standards, systems and performance goals necessary to achieving your dreams.\n\nWe are recruiting to fill the position below:\n\nJob Position: Investment Advisor\n\nJob Location: Abuja\nJob Type: Full-time\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Summary \n\n\n\tWe are seeking a results-driven Investment Advisor to join our team.\n\tThe ideal candidate will be responsible for identifying and securing new real estate investors, educating clients on investment opportunities, and providing expert advice that ensures long-term value for both the client and the company.\n\n\n Key Responsibilities \n\n\n\tIdentify and engage potential investors through various channels.\n\tPromote the company’s real estate investment products (e.g., land, housing units, off-plan projects).\n\tProvide detailed and customized investment advice based on clients’ financial goals.\n\tCollaborate with the sales and marketing teams to achieve company targets.\n\tEnsure full compliance with regulatory and company investment policies\n\tMaintain a pipeline of prospective investors and follow up regularly to close deals.\n\tBuild and maintain strong relationships with individual and institutional investors.\n\tConduct market research and monitor trends in real estate and investment sectors.\n\tPrepare and present investment proposals and sales pitches to clients.\n\tMaintain accurate records of investor interactions and transactions using CRM tools.\n\tMaintain long-term relationships with clients by providing periodic updates on investment performance, new offers, and additional property opportunities.\n\tAddress client inquiries, resolve complaints, and ensure excellent post-investment support.\n\tKeep accurate records of investor interactions, agreements, and transactions.\n\tPrepare periodic reports on sales performance, market feedback, and client satisfaction.\n\n\n  Qualifications\n\n\n\tBachelor’s Degree in Marketing, Finance, Business Administration, Real Estate, or related field.\n\tMinimum of 2 years of experience in investment sales, real estate advisory, or financial consulting.\n\tStrong understanding of real estate market and investment principles.\n\tExcellent communication, negotiation, and client relationship skills.\n\tHigh level of professionalism, integrity, and work ethic.\n\tProficiency in Microsoft Office Suite; familiarity with CRM software is a plus.\n\n\nKey Competencies:\n\n\n\tInvestment analysis\n\tReal estate market knowledge\n\tSales and business development\n\tClient advisory and support\n\tStrategic thinking and problem solving\n\tPresentation and persuasion skills\n\n\nWhat We Offer\n\n\n\tCompetitive salary and performance-based incentives.\n\tCareer growth and professional development opportunities.\n\tWork in a dynamic and innovative real estate company\n\tAccess to exclusive investment and tools\n\tPositive work environment \n\n\nMethod of Application\nInterested and qualified candidates should forward their CV to: mshelrecruitment@gmail.com using the Job Position as subject of email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]