[
  {
    "title": "Talent Management Advisor Job at NTEL",
    "link": "https://www.jobgurus.com.ng/jobs/view/talent-management-advisor-job-at-ntel",
    "pubDate": "Sat, 05 Jul 2025 16:44:30 GMT",
    "source": "JobGurus",
    "keyword": "ntel",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "NTEL, is a Nigerian telecommunications companythat launched as a 4G LTE provider in 2016. It was formed after NATCOM Development and Investment Limited (NatCom) acquired the assets of the defunct NITEL.NTEL aims to redefine the Nigerian telecommunications landscape by offering high-speed internet access and clear voice over LTE. NTEL aims to deliver its services across the largest possible network coverage in Nigeria.\n\nWe are recruiting to fill the position below:\n\nJob Position: Talent Management Advisor\nJob Location: Lagos Island, Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDevelop and execute comprehensive talent acquisition strategies to meet current and future hiring needs across all department\n\tIdentity talent needs based on business goals and strategic manage the recruitment process by working closely with HRBPs and hiring managers to ensure the right candidates are identified and selected.\n\tIdentify high-potential talent within the organization and develop strategies for their retention and growth.\n\tFoster a culture of diversity, equity, and inclusion in recruitment and hiring practices, aligning with the company’s values and objectives.\n\tDevelop and implement performance management frameworks that align with the company's business objectives.\n\tManage the end-to-end recruitment process, from job posting and sourcing to interviewing, selection, and onboarding.\n\tConduct regular employee surveys and feedback sessions to monitor engagement levels and identify workforce challenges.\n\tAnalyze and report on talent acquisition metrics to assess the effectiveness of recruitment strategies and make data-driven improvements.\n\tPerform additional assignments and responsibilities as requested by line manager/supervisor\n\n\nEducation / Certifcation\n\n\n\tBachelor's degree in Human Resources, Psychology, Business Administration, or a related field.\n\tProfessional Certification in Human Resources (e.g., ACIPM, SHRM-CP, PHRi, or similar) is required\n\n\nExperience:\n\n\n\t3-5 years of experience in, Talent Acquisition, Recruitment, HR generalist, or a related field, preferably within the Telecommunication environment or related industry.\n\tExperience with applicant tracking systems (ATS), recruitment automation tools and HR software\n\tExperience with performance management, learning and development, and workforce planning.\n\tExperience working with diverse teams in a large, fast paced organization.\n\n\nCompetencies:\nKnowledge\n\n\n\tKnowledge of labour laws, HR policies and best practices.\n\tKnowledge of recruitment and HR operations\n\tKnowledge of performance management systems and frameworks\n\n\nSkills:\n\n\n\tEffective communication skills\n\tStrong multi-tasking and organizational skills\n\tSound decision making and initiative\n\tGood interpersonal and leadership skills\n\tStrong research and analytical skills.\n\tExcellent relationship building and stakeholder management skills\n\tNegotiation skills\n\tConflict Resolution skills\n\tMicrosoft Office Suite\n\tUse of HRIS platforms and Talent Management Software\n\tData Management\n\n\nBehaviour:\n\n\n\tResilient\n\tIntegrity\n\tAdaptable\n\tEmpathy\n\tAttention to Detail\n\tProactive and solution-oriented\n\tDiscretion and confidentiality\n\tDemonstrated willingness to be flexible and adaptable to changing priorities\n\tAbility to work independently and as part of a team\n\tSelf-motivated and able to work unsupervised.\n\n\nMethod of Application\nInterested and qualified candidates should submit their CV (PDF) to: careers@ntel.com.ng using the Job Position and Job Location as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Property Officer Job at NTEL",
    "link": "https://www.jobgurus.com.ng/jobs/view/property-officer-job-at-ntel",
    "pubDate": "Sat, 05 Jul 2025 16:44:30 GMT",
    "source": "JobGurus",
    "keyword": "ntel",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "NTEL, is aNigerian telecommunications companythat launched as a 4G LTE provider in 2016. It was formed after NATCOM Development and Investment Limited (NatCom) acquired the assets of the defunct NITEL.NTEL aims to redefine the Nigerian telecommunications landscape by offering high-speed internet access and clear voice over LTE. NTEL aims to deliver its services across the largest possible network coverage in Nigeria.\n\nWe are recruiting to fill the position below:\n\nJob Position: Property Officer\n\nJob Location: Marina, Lagos Island - Lagos\nEmployment Type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tCoordinate and oversee the daily maintenance and repair of properties, including scheduling contractors, supervising work, and ensuring high standards of upkeep. This involves responding promptly to maintenance requests and conducting regular property inspections.\n\tAct as a primary point of contact for tenants, addressing inquiries, resolving issues, and fostering positive relationships to ensure high levels of tenant satisfaction and retention. This includes facilitating move-ins and move-outs and communicating important property information.\n\tAssist with property-related financial tasks, such as collecting rent, processing invoices, tracking expenses, and preparing basic financial reports for review by the Property Manager\n\tMaintain accurate and up-to-date property records, including tenant information, maintenance logs, inspection reports, and financial documentation. Prepare regular reports on property status, occupancy, and operational activities.\n\tAssist with the administration of lease agreements, including tracking lease terms, coordinating renewals, and ensuring tenant adherence to lease obligations and property rules.\n\tSource, engage, and manage relationships with various service providers and contractors (e.g., cleaners, landscapers, security) to ensure quality services are delivered efficiently and cost-effectively.\n\tEnsure properties comply with all relevant health, safety, and environmental regulations. This includes conducting safety checks, managing emergency procedures, and ensuring the security of the premises.\n\n\nEducation / Certification\n\n\n\tHigher National Diploma (HND) or Bachelor's Degree in Real Estate Management, Estate Management, Facilities Management, Business Administration, or a closely related field.\n\tCertifications related to basic property administration, safety, or customer service would be considered a plus.\n\n\nExperience:\n\n\n\tMinimum of 1 - 3 years of experience in a property administration, property management, or facilities support role.\n\tProven track record in assisting with the day-to-day operations and maintenance of properties.\n\tExperience in tenant interaction, handling inquiries, and resolving minor issues.\n\tFamiliarity with coordinating and overseeing contractor work.\n\n\nCompetencies\nKnowledge:\n\n\n\tBasic understanding of property maintenance practices and common building systems.\n\tFamiliarity with health and safety regulations applicable to property operations.\n\tKnowledge of basic lease terms and tenant obligations.\n\tAwareness of customer service principles.\n\tAbility to learn and utilize new software and tools quickly.\n\n\nSkills\nCommunication skills:\n\n\n\tTime Management skills\n\tAbility to prioritize and multitask in a dynamic environment.\n\tProblem-solving skills\n\tAttention to details\n\tActive listening skills\n\tFluent in English\n\tTeam Player\n\tProficiency in general office software (e.g., Microsoft Word, Excel).\n\n\nBehaviour:\n\n\n\tCommitted to providing excellent service to tenants and stakeholders.\n\tDemonstrates honesty and strong ethical principles.\n\tPossesses a confident demeanour in interactions and decision-making.\n\tWorks cooperatively and effectively within a team environment.\n\tMaintains a polite and respectful attitude.\n\tAbility to handle challenges and setbacks constructively.\n\tOpen to new ideas and able to adjust to changing priorities.\n\n\nMethod of Application\nInterested and qualified candidates should submit their CV (PDF) to: careers@ntel.com.ng using \"Property Officer\" as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Head of Procurement Job at NTEL",
    "link": "https://www.jobgurus.com.ng/jobs/view/head-of-procurement-job-at-ntel",
    "pubDate": "Sat, 05 Jul 2025 16:44:30 GMT",
    "source": "JobGurus",
    "keyword": "ntel",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "NTEL, is a Nigerian telecommunications company that launched as a 4G LTE provider in 2016. It was formed after NATCOM Development and Investment Limited (NatCom) acquired the assets of the defunct NITEL. NTEL aims to redefine the Nigerian telecommunications landscape by offering high-speed internet access and clear voice over LTE. NTEL aims to deliver its services across the largest possible network coverage in Nigeria.\n\nWe are recruiting to fill the position below:\n\nJob Position: Head of Procurement\n\nJob Location: Lagos Island, Lagos\nEmployment Type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDevelop and implement procurement policies, procedures, and strategies to optimize spending and enhance operational efficiency.\n\tIdentify and mitigate procurement-related risks, including supplier reliability, regulatory compliance, and market fluctuations.\n\tEstablish and manage strong relationships with key suppliers and vendors to ensure the timely and cost-effective delivery of goods and services.\n\tDevelop and oversee procurement budgets and spending forecasts, ensuring cost-effective purchasing decisions\n\tEnsure that procurement processes comply with internal policies, industry standards, and regulatory requirements\n\tBuild, train, and manage a high-performing procurement team, fostering a culture of efficiency and continuous improvement\n\tMonitor industry trends, pricing fluctuations and emerging best practices to enhance ntel’s procurement strategy.\n\tPresent procurement performance reports and strategic recommendations to senior management.\n\n\nRequirements\nEducation / Certification:\n\n\n\tBachelor's Degree in Supply chain management, Logistics, Business Administration, or a related field.\n\tMasters in a related field is required\n\tRelevant certification and/or professional qualification from recognized bodies(CIPS, or similar) is required\n\n\nExperience:\n\n\n\t7+ years of experience in logistics including:\n\t3 years in a leadership role, preferably in the Telecoms, ICT, or Finance sector.\n\t3 years in managing logistics operations, optimizing supply chain efficiency, and driving cost reduction strategies.\n\tManaging investor relations, working with Senior Executives and Boards of Director\n\n\nCompetencies:\nKnowledge:\n\n\n\tKnowledge of supply chain management principles, logistics technologies,and warehousing\n\tKnowledge of procurement best practices, contract negotiation, and vendor management\n\tKnowledge of International shipping and import/export regulations (if applicable)\n\n\nSkills:\n\n\n\tStrategic thinking and decision making\n\tExcellent interpersonal and communication skills,\n\tExcellent sourcing and negotiation skills\n\tRisk assessment and mitigation\n\tMicrosoft Office Suite\n\tERP and Procurement software.\n\tAnalytical and problem-solving skills\n\tComputer and Information Technology\n\tAbility to manage and prioritize multiple tasks and projects in a fast-paced environment.\n\n\nBehaviour:\n\n\n\tResilience\n\tAdaptable\n\tHigh integrity and ethical standards\n\tAnalytical and detail-oriented.\n\tCommitment to continuous improvement\n\tLeadership and team development\n\tCollaboration and relationship building\n\n\nMethod of Application\nInterested and qualified candidates should submit their CV (PDF) to: careers@ntel.com.ng using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Manager, Internal Audit Job at NTEL",
    "link": "https://www.jobgurus.com.ng/jobs/view/manager-internal-audit-job-at-ntel",
    "pubDate": "Sat, 05 Jul 2025 16:44:30 GMT",
    "source": "JobGurus",
    "keyword": "ntel",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "NTEL is a Nigerian telecommunications company that launched as a 4G LTE provider in 2016. It was formed after NATCOM Development and Investment Limited (NatCom) acquired the assets of the defunct NITEL. NTEL aims to redefine the Nigerian telecommunications landscape by offering high-speed internet access and clear voice over LTE. NTEL aims to deliver its services across the largest possible network coverage in Nigeria.\n\nWe are recruiting to fill the position below:\n\nJob Position: Manager, Internal Audit\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tExamine financial records, accounting practices, and operational procedures to ensure accuracy, compliance, and efficiency\n\tIdentify potential risks to the organization and evaluate the effectiveness of risk management strategies\n\tProvide constructive feedback and recommendations to management on how to improve internal controls, risk management, and operational efficiency\n\tMonitor adherence to relevant laws, regulations, and company policies\n\tWhere necessary, investigate potential fraud or irregularities\n\tPrepare clear and concise audit reports for senior management, outlining findings, recommendations, and progress on implementing corrective action\n\tWork with other departments and stakeholders to improve processes and address identified issues\n\tKeep abreast of changes in relevant laws, regulations, and best practices within the audit profession\n\n\nEducation / Professional Certification\n\n\n\tBachelor's Degree in Accounting, Finance, or a related field. A master's degree in finance, audit, or an MBA\n\tCertifications in ICAN or ACCA is mandatory. Other relevant certifications (CPA, CFA, CISA, CIA) are expected.\n\n\nExperience:\n\n\n\tExtensive Auditing Experience:\n\tA minimum of 7-10 years of experience in internal audit is required, with at least 3 years in a senior or leadership role.\n\tExperience in the Financial Services Sector (desirable):\n\tRisk Management and Regulatory Compliance:\n\tExperience in conducting risk-based audits and navigating regulatory requirements\n\tExperience in Leading Audit Teams\n\n\nKnowledge:\n\n\n\tProficiency in accounting and auditing principles\n\tKnowledge of relevant laws and regulations\n\tProficiency in the use of audit software and tools.\n\tKnowledge of Audit Methodologies and Frameworks\n\tFamiliarity with international standards like COSO,SOX,andISO\n\n\nSkills:\n\n\n\tPeople management skills\n\tTeam building skills\n\tHigh level of integrity, objectivity and proofessionalism\n\tManagement skills\n\tStrong analytical skills\n\tReport writing skills\n\tProblem solving skills\n\tExcellent communication\n\tAbility to manage and lead audit teams, delegate tasks, and provide guidance\n\tExcellent interpersonal skills\n\n\nBehavioral Competencies:\n\n\n\tTeam player\n\tPassion for Excellence\n\tAttention to details and accuracy.\n\n\nMethod of Application\nInterested and qualified candidates should submit their CV (PDF) to: careers@ntel.com.ng using \"Manager, Internal Audit\" as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Radiographer (ECG Proficient) Job at Solution Impact Global Resources",
    "link": "https://www.jobgurus.com.ng/jobs/view/radiographer-ecg-proficient-job-at-solution-impact-global-resources",
    "pubDate": "Sat, 05 Jul 2025 16:44:30 GMT",
    "source": "JobGurus",
    "keyword": "solution impact global resources",
    "duplicate": false,
    "classifications": [],
    "content": "Solution Impaact Global Resources - Our client, a reputable diagnostic and imaging center, is recruiting to fill the position below:\n\nJob Position: Radiographer (ECG Proficient)\n\nJob Location: Ibadan, Oyo\nEmployment Type: Full-time\n\nSummary\n\n\n\tThis role is ideal for a licensed imaging professional with strong technical expertise in radiographic procedures and hands-on experience in ECG diagnostics.\n\tThe ideal candidate will be responsible for conducting high-quality imaging and ECG tests, ensuring patient safety, and supporting clinical teams with accurate diagnostic data.\n\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tPerform radiographic imaging procedures, including X-rays\n\tConduct and interpret ECG tests\n\tEnsure proper patient positioning and adherence to radiation safety protocols\n\tMaintain and calibrate imaging equipment, reporting any faults promptly\n\tCollaborate with physicians and healthcare professionals to support diagnosis and treatment\n\tMaintain accurate and confidential patient records\n\tUphold infection control and quality assurance standards.\n\n\nRequirements\n\n\n\tBachelor’s Degree in Radiography or Medical Imaging\n\tMinimum of 3 years of post-NYSC experience in a clinical or diagnostic setting\n\tValid license from the Radiographers Registration Board of Nigeria (RRBN)\n\tProficiency in ECG procedures is essential\n\tUltrasound imaging skills are an added advantage\n\tStrong interpersonal and communication skills\n\tAbility to work independently and within a multidisciplinary team\n\tFamiliarity with digital imaging systems is a plus.\n\n\nMethod of Application\nInterested and qualified candidates should forward their CV to: solutionimpactglobalresources@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]