[
  {
    "title": "Job Vacancies at Devien Consult Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancies-at-devien-consult-limited-3",
    "pubDate": "Mon, 16 Jun 2025 10:45:36 GMT",
    "source": "JobGurus",
    "keyword": "devien consult limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Devien Consult Limited is a human resources consulting firm that is dedicated to providing innovative and effective HR solutions to businesses of all sizes.\n\nWe are recruiting suitably qualified candidates to fill the following positions below:\n\n1.) Customer Service Representative\n\nJob Location: Ikotun, Lagos\nEmployment Type: Full-time (On-site)\nIndustry: Health & Wellness\n\nSummary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tOur client in the health industry is hiring a Customer Service Representative with strong communication and sales skills.\n\tThe ideal candidate will handle customer inquiries, provide product information, and convert leads into sales.\n\n\nJob Requirements\n\n\n\tInterested candidates should possess a Bachelor's Degree with 1 - 2 years of experience in customer service or sales\n\tStrong communication and people skills\n\tAbility to upsell and close sales\n\tFriendly, professional, and customer-focused\n\tMust live within or close to Ikotun.\n\n\nSalary\nN120,000 monthly. \n\nClick here to apply online\n\nNote: Only qualified candidates will be contacted.\n\n \n\n2.) Graphics Designer\n\nJob Location: Mushin, Lagos\nEmployment Type: Full-time\n\nResponsibilities\n\n\n\tCreate visually appealing designs for digital and print materials (flyers, social media posts, banners, etc.)\n\tCollaborate with the marketing team to develop engaging content\n\tMaintain brand consistency in all designs\n\tEdit images and graphics for various projects.\n\n\nRequirements\n\n\n\tInterested candidates should possess a B.Sc Degree with 2 - 3 years of experience.\n\tProficiency in design tools like Adobe Photoshop, Illustrator, or CorelDRAW\n\tA strong portfolio of previous design work\n\tGood sense of color, layout, and typography\n\tAbility to work independently and meet deadlines.\n\n\nClick here to apply online\n\nNote: Only shortlisted candidates will be contacted.\n\n \n\n \n\n3.) Business Manager\n\nJob Location: Onipanu, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe are looking for a Business Manager to handle daily operations, support the team, and help drive business growth.\n\n\nJob Responsibilities\n\n\n\tManage day-to-day business activities\n\tSupport staff recruitment, onboarding, and performance reviews\n\tOversee expenses, staff salaries, and basic accounting\n\tEnsure production runs smoothly and meets quality standards\n\tOrganize staff training and development\n\tFollow up on client payments and manage invoices\n\tSupport basic marketing and customer relations.\n\n\nJob Requirements\n\n\n\tCandidates should possess a B.Sc Degree with 2 - 3 years of experience.\n\tStrong leadership and coordination skills\n\tGood knowledge of business operations\n\tExperience in printing or production is a plus\n\tOrganized, proactive, and detail-oriented\n\tComfortable using Microsoft Office and accounting tools.\n\n\nSalary\nN200,000 - N250,000 Monthly.\n\nClick here to apply online\n\nNote: Only qualified candidates will be contacted.\n\n \n\n\n4.) Business Development Executive\n\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\n\nJob Responsibilities\n\n\n\tIdentify and develop new business opportunities within the fire and security systems sector.\n\tBuild and maintain strong client relationships to ensure repeat business and referrals.\n\tPresent, promote, and sell company products and solutions to prospective clients.\n\tCollaborate with technical teams to deliver solutions that meet client needs.\n\tConduct market research to stay updated on industry trends and competitor activities.\n\tPrepare proposals, quotations, and presentations for clients.\n\n\nRequirements\n\n\n\t2 to 4 years of experience in business development within the fire and security systems industry.\n\tStrong knowledge of electrical fire devices, access control systems, CCTV, and related technologies.\n\tExcellent communication and negotiation skills.\n\tSelf-motivated, goal-oriented, and able to work independently.\n\tStrong network within the Lagos region is an added advantage.\n\n\nClick here to apply online\n\nNote: Only qualified candidates will be contacted.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Content and Media Manager Job at Soft Nigeria",
    "link": "https://www.jobgurus.com.ng/jobs/view/content-and-media-manager-job-at-soft-nigeria",
    "pubDate": "Mon, 16 Jun 2025 10:45:36 GMT",
    "source": "JobGurus",
    "keyword": "soft nigeria",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Soft Nigeria is a premium lifestyle and entertainment media brand that showcases the best of Nigerian luxury, culture, and influence. We also operate a dynamic news blog delivering timely stories in entertainment, celebrity lifestyle, politics, and more.\n\nWe are recruiting to fill the position below:\n\nJob Position: Content and Media Manager\nJob Location: Abuja (FCT)\nEmployment Type: Full-time\nWork mode: (Hybrid / Remote options available)\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking an experienced and highly creative Content & Media Manager to lead the creation, management, and distribution of engaging digital content across Soft Nigeria’s social platforms and news blog.\n\tThe ideal candidate must have a strong background working with established media companies and a proven track record of delivering high-impact content in both lifestyle and news sectors.\n\n\nKey Responsibilities\nContent Development & Strategy:\n\n\n\tLead the planning, creation, and execution of high-quality visual, written, and video content for all Soft Nigeria platforms.\n\tDevelop and manage a strategic content calendar across social media, YouTube, the news blog, and other digital channels.\n\tEnsure all content aligns with Soft Nigeria’s brand voice, luxury lifestyle focus, and current digital trends.\n\n\nMultimedia Production Oversight:\n\n\n\tOversee the production of visual and video content including interviews, lifestyle features, event coverage, and digital shows.\n\tCoordinate shoots, scripting, editing, and post-production to maintain broadcast-quality content for digital platforms.\n\tUphold professional production standards that reflect the sophistication of Soft Nigeria’s brand.\n\n\nSocial Media Management:\n\n\n\tManage and grow all Soft Nigeria social media accounts through curated content, timely posting, and strategic engagement.\n\tAnalyze audience insights to refine content strategy and maximize engagement and reach.\n\tCollaborate with influencers, celebrities, and brand partners to enhance social media presence.\n\n\nEditorial Leadership:\n\n\n\tSupervise content creation for the Soft Nigeria news blog, ensuring accuracy, originality, and relevance.\n\tAssign topics, edit submissions, and oversee the publishing of breaking news and long-form features.\n\n\nTeam Collaboration & Leadership:\n\n\n\tLead and mentor a team of creatives, content writers, videographers, editors, and freelancers.\n\tEnsure cohesive and timely delivery of multimedia content across platforms.\n\tReport directly to senior leadership with performance updates, growth strategies, and innovative content ideas.\n\n\nRequirements\n\n\n\tMinimum 3 years of experience in a content creation, media management, or digital production role.\n\tMust have prior experience working with established media companies (broadcast, digital, or publishing).\n\tDeep understanding of content trends, audience engagement strategies, and social media algorithms.\n\tStrong proficiency in video production, content planning tools, and editing software.\n\tExcellent writing, editing, and visual storytelling skills.\n\tAbility to manage multiple projects in a fast-paced environment.\n\tPassion for lifestyle, luxury culture, entertainment, and news.\n\n\nWhy Join Us?\n\n\n\tBe part of a forward-thinking media brand reshaping Nigerian luxury and digital storytelling.\n\tWork within a creative, ambitious, and collaborative environment.\n\tEnjoy growth opportunities and the chance to lead content strategy for a rising media powerhouse.\n\n\nCompensation\nN200,000 per month. \n\nMethod of Application\nInterested and qualified candidates should send their CV, a short cover letter, and links to samples of their past media work (videos, campaigns, social pages, or articles) to : careers@amogamarketing.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Customer Service Representative Job at Devien Consult Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/customer-service-representative-job-at-devien-consult-limited-1",
    "pubDate": "Mon, 16 Jun 2025 10:45:36 GMT",
    "source": "JobGurus",
    "keyword": "devien consult limited",
    "duplicate": false,
    "classifications": [],
    "content": "Devien Consult Limited - Our client in the health industry is recruiting to fill the position below:\n\nJob Position: Customer Service Representative\n\nJob Location: Ikotun, Lagos\nEmployment Type: Full-time (On-site)\nIndustry: Health & Wellness\n\nSummary\n\n\n\tOur client in the health industry is hiring a Customer Service Representative with strong communication and sales skills.\n\tThe ideal candidate will handle customer inquiries, provide product information, and convert leads into sales.\n\n\nJob Requirements\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tInterested candidates should possess a Bachelor's Degree with 1 - 2 years of experience in customer service or sales\n\tStrong communication and people skills\n\tAbility to upsell and close sales\n\tFriendly, professional, and customer-focused\n\tMust live within or close to Ikotun.\n\n\nSalary\nN120,000 monthly. \n\n \n\nNote: Only qualified candidates will be contacted.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "ICT Officer Job at Staff-Recruit",
    "link": "https://www.jobgurus.com.ng/jobs/view/ict-officer-job-at-staff-recruit",
    "pubDate": "Mon, 16 Jun 2025 10:45:36 GMT",
    "source": "JobGurus",
    "keyword": "staff-recruit",
    "duplicate": false,
    "classifications": [],
    "content": "Staff-Recruit is a leading Human Resource and Management Consulting firm which provides a range of recruitment, selection, outsourcing, training & development solutions. We are a dedicated team of professional consultants offering top of the line executive recruitment and selection services. We cater for the needs of a range of professionals seeking employment and work together to create effective solutions using our networks and strong client base.\n\nWe are recruiting to fill the position below:\n\nJob Position: ICT Officer\nJob Location: Ajah, Lagos\nEmployment Type: Full-time\nWork Schedule: Hybrid workmode (3days onsite).\n\nJob Brief\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a skilled ICT Officer to join the Real Estate Sector. The ideal candidate will have a strong background in information technology, with expertise in computer systems, networks, and software applications. This role requires problem-solving abilities, attention to detail, and a proactive approach to maintaining and improving our ICT infrastructure.\n\n\nResponsibilities\n\n\n\tInstall, configure, and maintain hardware and software components of our ICT infrastructure, including servers, networks, and peripherals.\n\tMonitor system performance and troubleshoot issues, ensuring timely resolution and minimal downtime.\n\tImplement and maintain security measures to protect our ICT systems and data from unauthorized access, malware, and other threats.\n\tConduct periodic audits and assessments of our ICT environment to identify areas for improvement and optimization.\n\tTrain and mentor staff on ICT best practices, security protocols, and proper use of technology tools and resources.\n\tMonitor and enforce compliance with ICT policies, standards, and regulatory requirements.\n\tManage user accounts, permissions, and access rights, ensuring compliance with security policies and procedures.\n\tConduct regular backups and disaster recovery procedures to safeguard critical data and systems.\n\tPlan and implement ICT projects, upgrades, and migrations, ensuring minimal disruption to business operations.\n\tCollaborate with cross-functional teams to support business initiatives and projects that require ICT expertise.\n\n\nRequirements and Qualifications:\n\n\n\tBachelor's degree in Information Technology, Computer Science, or related field; professional certifications (e.g., CompTIA, Cisco, Microsoft) is an added advantage\n\tProven experience, minimum of 5 years in ICT support and administration, with a strong technical background in IT systems and networks.\n\tSolid understanding of network protocols, security principles, and best practices.\n\tProficiency in installing, configuring, and troubleshooting hardware and software components, including servers, routers, switches, and firewalls.\n\tExperience with virtualization technologies (e.g., VMware, Hyper-V) and cloud platforms (e.g., AWS, Azure) is a plus.\n\n\nSalary\nN150,000 - N200,000 per month. \n\nMethod of Application\nInterested and qualified candidates should forward their CV to: careers@atcohomes.ng using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "NOC Engineer Job at Willers Solutions Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/noc-engineer-job-at-willers-solutions-limited",
    "pubDate": "Mon, 16 Jun 2025 10:45:36 GMT",
    "source": "JobGurus",
    "keyword": "willers solutions limited",
    "duplicate": false,
    "classifications": [],
    "content": "Willers Solutions Limited - Our client, a reputable firm in the internet service providing sector, is recruiting to fill the position below:\n\nJob Position: NOC Engineer\n\nJob Location: Lagos\nEmployment Type: Full Time\n\nJob Summary\n\n\n\tOur client, a reputable firm in the ISP sector, is recruiting for the role of NOC Engineer to join their team.\n\tThe ideal candidate will be responsible for monitoring and maintaining the performance of network systems, ensuring round-the-clock service availability, and escalating issues when necessary to ensure uninterrupted network operations.\n\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tPerform general system administration tasks across all network elements\n\tDetect and address potential issues affecting system performance or customer satisfaction\n\tProactively monitor network and system performance\n\tAnalyze traffic data/trends and escalate concerns to the network design authority\n\tEscalate unresolved issues to third-level support (Problem Management Team)\n\tConduct 24/7 network surveillance and respond to both network- and customer-reported issues\n\tTake ownership to resolve all issues promptly and efficiently\n\tUtilize network monitoring/management tools for problem resolution\n\tMonitor service levels of key suppliers and report SLA breaches\n\n\nEducation & Qualifications\n\n\n\tHND / B.Sc Degree in Computer Engineering, Telecommunications, or related field\n\tStrong communication skills (written and verbal)\n\tSolid, fact-based decision-making ability under pressure\n\tCisco CCNA/CCNP certification\n\tAbility to manage Cisco switches\n\tAbility to thrive in an international, multicultural, and high-pressure environment\n\tTechnical experience in telecom or network operations\n\tGood understanding of wireless communication technologies\n\tWillingness to work in a 24/7 shift rotation.\n\n\nMethod of Application\nInterested candidates should send their CV to: resource@willerssolutions.com using “NOC Engineer” as the subject of the mail    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]