[
  {
    "title": "Customer Service Representative Job at Above Lifestyle",
    "link": "https://www.jobgurus.com.ng/jobs/view/customer-service-representative-job-at-above-lifestyle",
    "pubDate": "Tue, 03 Jun 2025 13:30:15 GMT",
    "source": "JobGurus",
    "keyword": "above lifestyle",
    "duplicate": false,
    "classifications": [],
    "content": "Above Lifestyle is a premium destination that blends fine dining, upscale nightlife, and sophisticated leisure into one unforgettable experience. From our elegant à la carte restaurant to our stylish lounge, vibrant nightclub, and curated bar, every element is crafted for guests who appreciate the finer things.\n\nWe are recruiting to fill the position below:\n\nJob Position: Customer Service Representative\n\nJob Location: Lagos\n\nKey Roles & Responsibilities\nHandling Reservations & Bookings:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tManage phone, online, and walk-in reservations.\n\tRecord guest preferences, table requests, and special occasions (birthdays, anniversaries, VIP bookings).\n\tCoordinate with supervisors and floor staff to ensure smooth guest accommodation.\n\n\nComplaint Resolution:\n\n\n\tListen to guest complaints or dissatisfaction patiently and empathetically.\n\tOffer immediate solutions or escalate issues to supervisors or management as needed.\n\tFollow up on guest feedback to ensure a satisfactory resolution.\n\n\nCommunication & Coordination:\n\n\n\tLiaise between guests and internal departments (kitchen, bar, supervisors, dispatch riders).\n\tProvide accurate information about menus, promotions, pricing, and services.\n\tCommunicate delays or issues professionally to manage customer expectations.\n\n\nRecord-Keeping & Feedback:\n\n\n\tMaintain records of customer complaints, inquiries, and feedback.\n\tCollect reviews, testimonials, or survey responses to assess service quality.\n\tAssist in compiling reports on customer service trends and areas for improvement.\n\n\nSales & Upselling Support:\n\n\n\tInform guests about ongoing promotions, special packages, or events.\n\tSuggest complementary food, drinks, or services to enhance the guest experience.\n\n\nAppearance & Professionalism:\n\n\n\tMaintain a neat, professional appearance and wear the required uniform.\n\tDemonstrate calmness and politeness under pressure.\n\tUphold the brand’s service standards in all guest interactions.\n\n\nRequirements\n\n\n\tPrevious experience in customer service, hospitality, or front-desk roles.\n\tExcellent verbal communication and interpersonal skills.\n\tAbility to multitask and work in a fast-paced, high-pressure environment.\n\tFamiliarity with reservation software or POS systems is an added advantage.\n\tFriendly, patient, and customer-oriented personality.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: info@rosaabinternational.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Investment Officer Job at Femaus Consults",
    "link": "https://www.jobgurus.com.ng/jobs/view/investment-officer-job-at-femaus-consults-1",
    "pubDate": "Tue, 03 Jun 2025 13:30:15 GMT",
    "source": "JobGurus",
    "keyword": "femaus consults",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Femaus Consults is a assembling a high performance team of investment managers who want more than a paycheck, they want a sit at the table. We are a dynamic brand dedicated to driving excellence across diverse sectors. We specialize in capacity building,recruitment tailored to elevate businesses and organizations.\n\nWe are recruiting to fill the position below:\n\nJob Position: Investment Officer\nJob Location: Abuja (FCT)\nEmployment Type: Full-time\n\nJob Requirements\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tBachelor's Degree in Finance, Economics, Business Administration, or related field\n\t2 - 3 years of cognate experience.\n\tStrong investment client base\n\tProven experience in wealth management, financial advising, or investment management.\n\tExcellent communication, interpersonal, and negotiation skills.\n\tAbility to build and maintain strong client relationships.\n\tStrong knowledge of financial products, investment strategies, and market analysis.\n\tHigh level of integrity, ethics, and professionalism.\n\n\nMethod of Application\nInterested and qualified candidates should send their Resume and a Cover Letter detailing their qualifications and experience to: femausconsults@gmail.com using “Investment Officer” as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Vacancancies at CFAO Yamaha Motor",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancancies-at-cfao-yamaha-motor",
    "pubDate": "Tue, 03 Jun 2025 13:30:15 GMT",
    "source": "JobGurus",
    "keyword": "cfao yamaha motor",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "CFAO Yamaha Motor deals on Outboard marine engines, Motorcycles, Generators and Lubricants. We are the most known name when it comes to power products and Lubricants.\n\nWe are recruiting to fill the following positions below:\n\n1.) Storekeeper\n\nJob Location: Port Harcourt, Rivers\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tReceive and check consignments (imported and local purchases) against delivery note before shelving\n\tEnsure parts are supplied to workshop and counter customers on time and in full. (OTIF)\n\tReport shortages and damages immediately to line manager\n\tSupply both parts and stock requested to the relevant staff with the right documentation\n\tEnsure parts are checked and signed for\n\tCheck all damaged goods are returned before taking them back to stock\n\tEnsure parts and store area is kept tidy and safety at all times\n\tBe the custodian for the keys of the store\n\tReport weekly on the stock movement, orders, shortages and non-moving stock\n\tAdhere to internal control procedures and PACI rules are followed.\n\n\nRequirements\n\n\n\tCandidates should possess an OND qualification with 2 - 3 years of work experience.\n\n\nSalary\nN120,000 - N130,000 Monthly.\n\nApplication Closing Date: 7th June, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: aesjobsng@cfao.com using  \"Storekeeper PHC\" as the subject of the mail.\n\n \n\n \n\n2.) Service Technician\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nResponsibilities\n\n\n\tExplore various repair techniques and always use the correct tools, equipment and technical documentation where necessary\n\tEnsure consistent clocking of assigned jobs in INCADEA\n\tReport all observations outside the job scope to the service Team Leader\n\tNotify Service Team Leader about complex issues\n\tAlways use the Personal Protective Equipment (PPE) while working\n\tTools management - weekly tool audit and list out damage tools\n\tEnsure timely and qualitative resolution of assigned jobs\n\tDiagnose faults in line with lay down diagnostic procedures/workshop manual\n\tProvide regular update on repair works to the Service Team Leader\n\tRespect safety rules at all times when working on vehicles\n\tPerform other duties as assigned.\n\n\nRequirements\n\n\n\tCandidates should possess an HND qualification\n\t2-4 years work experience.\n\n\nSalary\nN150,000 - N200,000 / Month.\n\nApplication Closing Date: 24th June, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: aesjobsng@cfao.com using the Job Position as the subject of the mail.\n\n \n\n \n\n3.) Sales Executive\n\nJob Locations: Abuja (FCT), Cross River, Enugu, Kano, Kwara, Lagos, Niger & Ondo\nEmployment Type: Contract\n\nResponsibilities\n\n\n\tEffectively manage relationships with existing customers\n\tCustomer survey reporting – weekly & monthly\n\tDevelop relationships with prospective clients and maintain the existing customer base\n\tIdentify and secure business opportunities for the organisation\n\tCollaborate with the MD to secure, retain and grow accounts (Dealers) through understanding clients' needs\n\tMeet monthly, quarterly and annual targets through effective competitor research and business environment analysis\n\tPrepare/submit a weekly report on sales and competition activities\n\tOrganize and execute daily trade visits/calls, route plans\n\tMake sales presentations and customer analysis reporting\n\tEnsure proper and up-to-date record-keeping of the customer database\n\tGenerate Proforma Invoices and customer follow-up\n\tOrganize meetings with prospective clients and make product demonstrations\n\tAdhere strictly to the company's compliance policies and standard business relationship ethics\n\tProvide strategic support on sales growth-related projects\n\tFollow-up with online lead generation\n\tEstablish customers' needs and selling allocated products accordingly\n\tGenerate business leads and follow up on sales opportunities\n\tOrganise and submit route plans weekly and monthly, lead generation\n\tWeekly dealers' follow-up reports\n\tDealer network development – ??Onboarding of new dealers (Quarterly review).\n\n\nSalary\nN120,000 -N150,000 Monthly.\n\nApplication Closing Date: 6th June, 2025.\n\nMethod of Application\nInterested and qualified candidates should send CV to: aesjobsng@cfao.com usng \"Sales Executive - Location\" eg \"Sales Executive - Lagos\" as subject of the email.\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Vacancies at Filmhouse Cinemas Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancies-at-filmhouse-cinemas-limited-3",
    "pubDate": "Tue, 03 Jun 2025 13:30:15 GMT",
    "source": "JobGurus",
    "keyword": "filmhouse cinemas limited",
    "duplicate": false,
    "classifications": [],
    "content": "Filmhouse Cinemas Limited is a dynamic film exhibition company. Our expertise are in the areas of: Cinema operations, management of sites, Ownership of sites, Consultancy for cinema development, Design Fit-out; Cinema project management, Film Distribution: Rights Acquisition, Booking into cinemas, and content development.\n\nWe are recruiting to fill the following positions below:\n\n1.) Cinema Manager\n\nJob Locations: Lagos and Akure - Ondo \n\nEssential Duties and Key Responsibilities\ninclude the following and other duties as may be assigned:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tTo oversee the management of the day to day activities of the cinemas.\n\tTo support the business manager in driving daily retail profitability by maximising RPH & minimising shrinkage and wastage.\n\tTo pro-actively manage operational costs on a day-to-day basis.  Support the business manager in the effective management of controllable costs, third party contractors and team members.\n\tTo plan, perform and manage operational tasks within the cinema.\n\tTo continually give feedback to the business manager and colleagues’ ways in which Cinema Operations could be improved and to always champion the needs of the guest and team members\n\tTo maximise the performance of all employees by team work, motivation and effective coaching and performance management.\n\tUndertaking administrative tasks, setting shift rotas and organizing staff renumeration.\n\tTo propose and prepare in conjunction with the filmbooking department, performance schedule plan to meet business plan objectives.\n\tTo drive daily retail profitability by maximising RPH & minimising shrinkage and wastage.\n\tEnsure the cinemas meets set audience targets each week/period.\n\n\nQualifications\n\n\n\tMinimum of 3 years in operations management at a supervisory level (retail experience preferred)\n\tExcellent customer relationship and management\n\tMust be a good Team player with excellent ability to multi-tasking and able to adapt to varying situations.\n\tHe/ She must have the ability to keep abreast of the trend in this field of expertise and make practical application of specialized knowledge in everyday situation.\n\tMust have a deep understanding of Health and Safety\n\tExcellent report writing and presentation skills\n\tGood Microsoft Office, excel and power point usage\n\tJob knowledge\n\tCustomer Relation Skills\n\tNegotiation & Networking Skills\n\tPersonal Credibility\n\tPlanning and Organizational Skills\n\tCommunication Skills\n\tAnalytical skills.\n\n\nClick here to apply online\n\n \n\n2.) Surveillance Officer\n\nJob Locations: Victoria Island, Lagos\nEmployment Type: Full-time\n\nResponsibilities\n\n\n\tEnsure proper monitoring of activities carried out by staff at the various site to prevent fraudulent acts\n\tReport/escalate all violators daily appropriately as seen in the scene of the incident\n\tReport all abnormalities observed during CCTV surveillance during field observation\n\tWrite monthly report to the Lead, Investigations on all issues captured\n\tMaintain the confidentiality on official information during the month, for management decisions\n\tEnsure proper maintenance of CCTV equipment and troubleshooting of offline/faulty cameras daily\n\tIntegrity, accuracy and confidentiality of all information gained in CCTV control center by quality standards and legislation to ensure implementation of various modifications for smooth running\n\tAttend related meeting\n\tProffer ideas to reporting line in the improvement of CCTV surveillance monitoring system\n\tSuggest modification for betterment of CCTV devices/equipment\n\tEnsure CCTV equipment are always in good working conditions\n\tCarry out any other functions as assigned by the Lead, Investigations.\n\n\nQualifications\n\n\n\tThe right candidate must have a minimum of a bachelor’s degree from a recognized university in Engineering, Computer Science\n\tMinimum of 3 years of post qualification experience in CCTV operations or maintenance.\n\n\nAdditional Information:\n\n\n\tAttention to details: Must be able to see and remember the specific details of incidents\n\tReport writing\n\tListening skills\n\tGood communication skills\n\tAbility to maintain CCTV equipment is an added advantage.\n\n\nClick here to apply online\n\n \n\n3.) Customer Service Representative (Team Member)\n\nJob Location: Akure, Ondo\nJob type: Full-time\n\nJob Description\nEssential duties and key responsibilities include the following and other duties as may be assigned:\n\n\n\tSelling box office tickets, responding to queries reservations and sales.\n\tMonitoring and maintaining cash flow, ensuring that there are no shortages.\n\tAttend and participate in training sessions as required by managers and HR.\n\tContribute to increasing concession revenues.\n\tEnsuring that guests are well guided to entrance and exit into the cinema.\n\tMonitoring and maintaining guest flow, ensuring that there are no obstructions to guest cinematic experience.\n\tParticipating in briefings and other meetings as requested by the cinema manager.\n\tResponsible in the arrangement and cleaning of designated areas.\n\n\nQualifications\n\n\n\tCandidates should possess an ND (National Diploma), HND (Higher National Diploma),  BSc / BSE (Bachelor’s Degree), or NCE (Nigerian Certificate in Education)\n\n\nAge Requirement:\n\n\n\tCandidates must be between 19 and 26 years old.\n\n\nClick here to apply online    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]