[
  {
    "title": "Area Sales Representative Job at BIC Nigeria",
    "link": "https://www.jobgurus.com.ng/jobs/view/area-sales-representative-job-at-bic-nigeria-1",
    "pubDate": "Fri, 06 Jun 2025 12:31:14 GMT",
    "source": "JobGurus",
    "keyword": "bic nigeria",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "BIC® products are known and appreciated all over the world for their quality, their affordability and ease of use. The ballpoint pen, the pocket lighter, the one-piece shaver are all part of the daily lives of millions of consumers. These products make BIC® one of the best known international brands, present in 3.2 million retail outlets, in more than 160 countries. As we explore the tremendous opportunities ahead, we have a need for dedicated and dynamic employees to help build our team.\n\nWe are recruiting to fill the position below:\n\nJob Position: Area Sales Representative - Lagos IV\nJob ID: 6657\nJob Location: Lagos\nEmployment type: Full-time\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nMain Responsibilities / Tasks\n\n\n\tGenerate sales order and ensure delivery of products in the assigned sales areas and outlets\n\tEfficient retail redistribution of all LSNL/BIC products and effective coverage of relevant outlets in the assigned sales areas\n\tRegularly review of performance with the regional managers and customers in line with agreed target.\n\tDevelop coverage Plan for the territory.\n\tSeek new sales opportunities within designated sales areas.\n\tFlawless implementation of SFA and other projects in sales areas.\n\tFlawless promotion execution and POSM deployment\n\n\nKey Performance Indicators\n\n\n\tAchieving sales targets; Volume and Value\n\tAchieves coverage plan and number of new outlets listing\n\tFrequency of orders and cash collection\n\tSpeed to shelf and high impact visibility\n\tStrong Numeric and Weighted Distribution of LSNL/BIC products in region.\n\n\nComplex Criteria\nProfessional skills:\n\n\n\tR - Business and results oriented with proven negotiation skills\n\tR - Able to identify new sales opportunities\n\tD - Understand needs of customers and provide solution lead\n\tR - Hard working, rigorous, well organized and able to work autonomously\n\tR - Ability to complete assigned task within a short period of time\n\tD - Analytic, accurate and quick interpretation of figures\n\n\n Personal skills:\n\n\n\tR - A self-starter, working under their own initiative... and a completer/finisher\n\tR - Ability to analyze and provide clear recommendations\n\tR - Good communication skills (writing & verbal)\n\tR - Build strong relationships with both key external and internal customers\n\tR - Energy and passion for achievement of own commitments and delivering company objectives\n\tD - Able to influence and persuade others to take a specific course of action\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Administrative Officer Job at Handyman Daige Properties",
    "link": "https://www.jobgurus.com.ng/jobs/view/administrative-officer-job-at-handyman-daige-properties",
    "pubDate": "Fri, 06 Jun 2025 12:31:14 GMT",
    "source": "JobGurus",
    "keyword": "handyman daige properties",
    "duplicate": false,
    "classifications": [],
    "content": "Handyman Daige Properties is a private company in Abuja offering real estate development services. We prioritize delivering customized homes that meet our clients requirements.\n\nWe are recruiting to fill the position below:\n\nJob Position: Administrative Officer\n\nJob Location: Wuse 2, Abuja (FCT) \nEmployment Type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tHe will be responsible for overseeing and supervising the day-to-day office management, including facility management, travel management, logistics, office procurement and fleet management.\n\tHe is to report to General Manager General Services\n\n\nCore Responsibilities and Key Result Areas\n\n\n\tEnsuring that the office is conducive for work and all office equipment are functioning optimally.\n\tEnsure that internal communications channels(CUG) are functional\n\tStore/Inventory Management\n\tManage meeting rooms, and ensure proper meeting rooms are set up before any meeting\n\tMaintain and manage office generator fueling, servicing, etc.\n\tLiaises with the company’s chief security officer to ensure safety of staff and assets within the premises\n\tMaintaining office inventory\n\tCoordinate Drivers\n\tManage all vehicle maintenance and fueling\n\tEnsure office cleanliness\n\tCake and birthday Celebration\n\tOther assigned responsibilities/duties\n\n\nFacility Management:\n\n\n\tEnsure that all utilities (power, water, internet, etc.) are available functional.\n\tEnsure all utility bills are promptly paid .\n\tEnsure prompt payment of rents and service fees .\n\tLiaising with External Facility Managers, where applicable .\n\tEnsure prompt payment of government levies.\n\n\nTravel Management:\n\n\n\tEnsure cost effective purchase of travel tickets for directors, staff and partners, where applicable .\n\tEnsure accurate management of petrol issuance and reconciliation with petrol vendor\n\tHandling of hotel bookings for directors, staff and partners, where applicable .\n\tProcessing of travel visas for staff and partners, where applicable .\n\tTransportation and Logistics .\n\tEnsure proper fleet Management of the company vehicles .\n\tHandling of airport meet and greet activities .\n\tHandling of local road trip for directors, staff and partners of the company\n\tProvision of logistics support for corporate event.\n\n\nKey Performance Indicators\n\n\n\tCost effective management of company’s fixed asset.\n\tTimely resolution of office facility issues .\n\tEfficient handling of events, protocol and logistical arrangements.\n\tEfficient and effective handling of petrol reconciliation with vendor\n\n\nQualifications\nEducational Qualifications\n\n\n\tA Bachelor’s Degree in Business Administration or any Social Sciences related discipline.\n\tMust be proficient with MS Office (word, excel and PowerPoint)\n\n\nExperience Qualifications:\n\n\n\tMinimum of 5 years of working experience in an administrative/procurement related role.\n\n\nCompetencies\nKnowledge:\n\n\n\tUnderstanding of relevant procurement processes and policy .\n\tUnderstanding of facility management procedures and policies .\n\tKnowledge of vendor management and negotiation .\n\tUnderstanding of hotel and air ticketing booking processes .\n\tUnderstanding of fleet management principles.\n\n\nTechnical Competencies:\n\n\n\tDemonstrates expertise in procurement processes and procedure.\n\tDemonstrates expertise in Budget and cost management\n\tExcellent written and oral communications skills\n\tExcellent organisational and coordination skills\n\tExcellent analytical skills .\n\tDemonstrates expertise in handing of facility management\n\tDemonstrates expertise in fleet management Demonstrates expertise in hotel booking and air ticketing procedures.\n\n\nBehavioural Competencies:\n\n\n\tLeadership ability\n\tProblem-Solving/Decision making ability .\n\tConfidentiality and discretion .\n\tMulti-tasking ability .\n\tSound Practical Judgment .\n\tExcellent time management .\n\tDeadline-driven \n\tResilience and Tenacity \n\tIntegrity and proactiveness\n\tStrong communication skills \n\tConflict management \n\tResponsiveness \n\tIndustry Knowledge.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: victoria.negedu@handymandaige.com using Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Electrical Graduate Trainee (Female) Job at Catalyst Path Consulting",
    "link": "https://www.jobgurus.com.ng/jobs/view/electrical-graduate-trainee-female-job-at-catalyst-path-consulting",
    "pubDate": "Fri, 06 Jun 2025 12:31:14 GMT",
    "source": "JobGurus",
    "keyword": "catalyst path consulting",
    "duplicate": false,
    "classifications": [],
    "content": "Catalyst Path Consulting is recruiting suitably qualified candidates to fill the position below:\n\nJob Position: Electrical Graduate Trainee (Female)\nJob Location: Gujeni, Kaduna\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe are looking for a motivated and talented Electrical Graduate Trainee to join our team in Kaduna.\n\tThis role is designed to provide recent graduates with hands-on experience and professional development in electrical engineering.\n\tThe ideal candidate will be eager to learn, adaptable, and passionate about advancing their skills in a dynamic environment.\n\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAssist in the design, installation, testing, and maintenance of electrical systems.\n\tSupport senior engineers in troubleshooting and resolving technical issues.\n\tCollaborate with cross-functional teams to achieve project goals.\n\tParticipate in project planning, execution, and documentation.\n\tConduct research and stay updated on industry trends, standards, and innovations.\n\tEnsure compliance with safety regulations and company policies.\n\tPerform other duties as assigned to enhance learning and skill development.\n\n\nQualifications & Requirements\n\n\n\tBachelor's Degree in Electrical Engineering or a related field.\n\tStrong analytical and problem-solving skills.\n\tBasic understanding of electrical systems, circuits, and components.\n\tProficiency in using electrical design software and tools is an advantage.\n\tExcellent communication and teamwork abilities.\n\tWillingness to learn and adapt in a fast-paced environment.\n\tAttention to detail and a commitment to safety and quality.\n\n\nBenefits\n\n\n\tStructured training and mentorship.\n\tCareer growth opportunities.\n\tExposure to real-world engineering projects.\n\tSupportive and inclusive work environment.\n\n\nMethod of Application\nInterested and qualified candidates should send their Applications to: isaac.samuel@Anrml.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Junior Account Officer - Payable Job at Jtechtrade",
    "link": "https://www.jobgurus.com.ng/jobs/view/junior-account-officer-payable-job-at-jtechtrade",
    "pubDate": "Fri, 06 Jun 2025 12:31:14 GMT",
    "source": "JobGurus",
    "keyword": "jtechtrade",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Jtechtrade is an online financial service provider . The Dream was birthed in year 2018 but Jtechtrade became a reality in 2019 and ever since then we have digital financial assets to both Merchants and Users of our platform and gaining a vast knowledge and experience on how the Digital space has paved way for a digital financial revolution. Our platform is designed with our Users in mind, it has a high anti-cyber security technology system making it safe and secured which also makes our payment system fast and reliable.\n\nWe are recruiting to fill the position below:\n\nJob Position: Junior Account Officer - Payable\nJob Location: Amuwo Odofin, Lagos\nEmployment Type: Full-time\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Summary\n\n\n\tWe are seeking a detail-oriented and organized Junior Accounts Officer to join our finance team. \n\tThe primary responsibility of this role will be managing accounts payable activities, ensuring timely and accurate processing of invoices.\n\n\nKey Responsibilities\n\n\n\tReview, verify, and process invoices for payment in accordance with company policies.\n\tPrepare and execute payment runs, ensuring timely payments to suppliers.\n\tMaintain accurate records of all accounts payable transactions and ensure all documentation is complete and compliant.\n\tAssist in the reconciliation of accounts payable ledger with statements and internal records.\n\tPrepare accounts payable reports and summaries for management review.\n\tProvide necessary documentation and support during internal and external audits.\n\n\nQualifications\n\n\n\tDegree in Finance, Accounting, Business Administration, or a related field is preferred.\n\tStrong numerical and analytical skills with attention to detail.\n\tProficient in Microsoft Office Suite (especially Excel) and familiarity with accounting software.\n\tMust be staying in close proximity to Festac Town, Amuwo Odofin.\n\n\nSalary\nN105,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their Resume and Cover Letter to: jtechtradecareers@outlook.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Digital Marketer Job at Vi-M Professional Solutions",
    "link": "https://www.jobgurus.com.ng/jobs/view/digital-marketer-job-at-vi-m-professional-solutions",
    "pubDate": "Fri, 06 Jun 2025 12:31:14 GMT",
    "source": "JobGurus",
    "keyword": "vi-m professional solutions",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance"
    ],
    "content": "Vi-M Professional Solutions is a dynamic and innovative multidisciplinary professional services firm based in Nigeria. We specialize in tax, audit and assurance, business advisory, market entry services, HR and payroll outsourcing, immigration consulting, and digital transformation solutions, including tax technology development. \n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nAt Vi-M, we are committed to delivering exceptional value to businesses and individuals by combining deep industry knowledge with technology-driven strategies. Our team comprises seasoned professionals with Big 4 backgrounds, and we have proudly served multinational companies, regulatory bodies, startups, and SMEs across a wide range of sectors, including trading, telecoms, fintech, manufacturing, real estate, healthcare, hospitality and professional services. We value integrity, excellence, client commitment, and continuous innovation. Joining Vi-M means being part of a collaborative environment where your expertise will help shape the future of business support services in Africa.\n\nWe are recruiting to fill the position below:\n\nJob Position: Digital Marketer\nJob Location: Okota - Isolo, Lagos (Hybrid or Remote)\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tThe Digital Marketer will drive Vi-M’s online brand visibility and business lead generation through creative digital campaigns, SEO, and content marketing strategies.\n\tThis role blends creativity with performance marketing and is key to business growth.\n\n\nKey Responsibilities\n\n\n\tDesign and execute multichannel digital campaigns (LinkedIn, Instagram, X/Twitter, Facebook).\n\tCreate and manage original SEO-friendly content (blogs, videos, infographics, and newsletters).\n\tPlan and manage paid ad campaigns (Google Ads, LinkedIn Ads, Meta).\n\tTrack digital KPIs and generate performance reports using tools like Google Analytics.\n\tOptimize website and landing pages for user engagement and lead capture.\n\tCollaborate with consulting teams to promote service offerings through storytelling and campaigns.\n\tStay informed on the latest digital trends and tools.\n\n\nRequirements\n\n\n\tB.Sc. in Marketing, Mass Communication, or related field.\n\tMinimum 3 years of experience in digital marketing (preferably in a professional services setting).\n\tProficiency in tools like Canva, Meta Business Suite, Mailchimp, Google Analytics, and SEO platforms.\n\tStrong visual and copywriting skills.\n\tKnowledge of lead funnels, audience targeting, and remarketing.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: Recruitment@vi-m.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]