[
  {
    "title": "General Manager - Cost Controller Job at Zigma Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/general-manager-cost-controller-job-at-zigma-limited",
    "pubDate": "Wed, 04 Jun 2025 16:17:30 GMT",
    "source": "JobGurus",
    "keyword": "zigma limited",
    "duplicate": false,
    "classifications": [
      "Software Engineering",
      "Finance"
    ],
    "content": "Zigma Limited is an independent, indigenous energy company in Nigeria. Zigma’s mission, under its CEO Funmi Ogbue, is to become the first female-led ‘mini-major’ with interests in the upstream, midstream and downstream energy sectors, first in Nigeria and then in Africa more widely. Aligning with Funmi’s passion for improving local communities, Zigma will place Environmental, Social and Governance (ESG) policies at the heart of its operations and aims to become a champion for the responsible development of African energy projects–at the same time as delivering significant value to its investors and partners.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nToo often, women and children in Africa suffer the worst from the over-zealous exploitation of energy resources. Zigma believes this should stop. Join us on our journey.  Use the menu below to find out more about becoming a partner, an investor or a team member.  You can find out more about our current projects and partners by using the links here. Together, we will show that responsible, thoughtful behaviour can make a difference.  And deliver long term economic benefits to our investors, countries and our communities. \n\nWe are recruiting to fill the position below:\n\nJob Position: General Manager - Cost Controller\nJob Location: Port Harcourt, Rivers\nJob Type: Full-time\n\nAbout the job\n\n\n\tAs a general manner, to provide assistance to the Project Management for all matters related to Budget and Cost Control for IMA Project activities and general Cost reporting.\n\n\nResponsibilities\n\n\n\tTo organize, co-ordinate and control all the activities by informing, supporting, and directing personnel in their roles, responsibilities and objectives.\n\tTo give advice and propose improvements with regards to the IMA Project coding structure to be developed.\n\tTo ensure the right implementation and propose improvements of Project and Corporate procedures, means and tools in order to ensure the efficient organization and operation of the Project Cost Control activities.\n\tTo participate (from Cost Control point of view) in the preparation / consolidation and review of the various Project budgets and updates (internal and external / Annual and Multiyear) with inputs from the members of the Project\n\tTeam and provide “ad hoc” economics support as required.\n\tTo provide the necessary checks, approval functions for invoices submitted, in accordance with Contracts,\n\tProject & Company procedures, Sarbanes & Oxley requirements and DoA.\n\tTo provide input into the UNISUP System, regarding payment schedules (cash calls), invoicing and cost control issues as required.\n\tTo liaise actively with TEPNG Finance Department for all matters related to cost and accounting as required (Commitments, invoice processing and payment, accruals, payment claims and disputes...)\n\tTo prepare for issuance the necessary Project cost information and data, Subsidiary and Partners / Shareholders / Concessionaire / Company.\n\tTo assist in the cost assessment of any contract variations and identify any Project cost trends, drifts, variances data update and maintain the Project Final Cost Estimate, prepare the Monthly Cost Report with comments.\n\tTo ensure strict confidentiality of all the Budget and Cost documentation (whatever its support)\n\tTo timely report to Project Control Manager, highlighting achieved progress and timely reporting any area of concern or problem encountered; to assist and support him with all matters related to Cost Control.\n\n\nAccountability:\n\n\n\tOrganize his job in full respect and within the limits of defined and approved planning & budgets.\n\tHave good relationships with other Departments / Packages of the Division.\n\tHave good relationships with other TEPNG entities such as Strategy and Planning Division, Production\n\tDivision, Drilling and Completion Division; Engineering, Project and Modifications Division.\n\tEnsure a transversal way of working, in a good team spirit.\n\n\nQualifications\n\n\n\tProfessional Experience (years): 5-15\n\tExperience in similar position (years): 5\n\tLevel / Diploma: Engineer, or equivalent.\n\tLanguages: English mandatory\n\n\nMethod of Application\nInterested and qualified candidates should send their application and detailed CV to: engineering@zigmaltd.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Hotel Front Office Manager Job at Tivana Workforce",
    "link": "https://www.jobgurus.com.ng/jobs/view/hotel-front-office-manager-job-at-tivana-workforce",
    "pubDate": "Wed, 04 Jun 2025 16:17:30 GMT",
    "source": "JobGurus",
    "keyword": "tivana workforce",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Tivana Workforce is a workforce solutions company that provides services that unlock the full potential of human capital to drive business excellence and growth in an ever-evolving marketplace. Our Services include Staffing and Recruitment, Workforce Management, Training and Development, Technology Solutions, HR Consulting, Team Retreat Planning and Specialized services.\n\nWe are recruiting to fill the position below:\n\nJob Position: Hotel Front Office Manager\nJob Location: Abuja (FCT)\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tA Hotel Front Office Manager is responsible for supervising all front desk operations and ensuring a seamless guest experience from check-in to check-out.\n\tThe role involves managing reception staff, handling guest relations, coordinating with other departments, and maintaining high service standards to enhance guest satisfaction.\n\n\nKey Responsibilities\n\n\n\tOversee front desk operations, including reservations, check-in/check-out, and guest services.\n\tSupervise, train, and schedule front office staff to ensure efficient and professional service.\n\tResolve guest complaints and ensure prompt responses to inquiries and issues.\n\tCoordinate with housekeeping, maintenance, and other departments to ensure smooth operations.\n\tMonitor room availability, occupancy rates, and revenue targets in coordination with the reservations and sales team.\n\tEnsure accurate billing, cashiering, and financial procedures at the front desk.\n\tPrepare and analyze front office reports and performance metrics.\n\n\nSkills & Qualifications\n\n\n\tDegree or diploma in Hospitality Management or related field.\n\tProven experience in front office or guest services, preferably in a supervisory role.\n\tExcellent communication, interpersonal, and leadership skills.\n\tProficiency in hotel management software (e.g., OPERA, IDS).\n\tStrong problem-solving abilities and a guest-focused mindset.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and Photograph to: tivanaworkforce@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Vacancies at Bat Computer Technologies Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancies-at-bat-computer-technologies-limited",
    "pubDate": "Wed, 04 Jun 2025 16:17:30 GMT",
    "source": "JobGurus",
    "keyword": "bat computer technologies limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Bat Computer Technologies Limited is a Technology Systems integration company with vast experience in the Design, Installation and Integration of Digital Networks, Telecommunication Systems and e-business solutions. Licensed by the Nigerian Communications Commission(NCC), to provide telecommunications deployment and installation services.\n\nWe are recruiting to fill the following positions below:\n\n1.) Sales Manager\n\nJob Location: Lagos\n\nJob Overview\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a results-driven Sales Manager to lead our sales operations, drive revenue growth, and expand our customer base in the telecommunications sector.\n\n\nKey Responsibilities\n\n\n\tDevelop and execute marketing campaigns to promote telecom services.\n\tConduct market and competitor research to identify growth opportunities and customer trends.\n\tIdentify new business opportunities and expand the client base.\n\tCollaborate with the marketing team to support lead generation and promotional campaigns.\n\tSupport product launches, promotional activities, and brand events.\n\tMonitor and analyse campaign performance metrics to improve future strategies.\n\tEnsure high levels of customer satisfaction and address client issues effectively.\n\n\nRequirements\n\n\n\tBachelor's Degree in Marketing, Business Admin, or a related field.\n\t3 - 6 years of experience in marketing, preferably in the telecom industry.\n\tStrong communication, writing, and interpersonal skills.\n\tAbility to multitask and deliver under tight deadlines.\n\tExperience in telecom product marketing or customer acquisition strategy.\n\n\nApplication Closing Date: 13th June, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: bathr@batcomputers.net using the Job Position as the subject of the mail.\n\n \n\n \n\n2.) Driver\n\nJob Location: Oshodi, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe are seeking a reliable and experienced Driver to support our operations team.\n\tThe ideal candidate will be responsible for the safe and timely transportation of staff, equipment and materials to project sites and client locations.\n\n\nKey Responsibilities\n\n\n\tSafely drive company vehicles to assigned destinations.\n\tEnsure proper maintenance and cleanliness of the vehicle.\n\tFollow all traffic laws and company policies.\n\tAssist with loading and unloading equipment when necessary.\n\tKeep accurate records of vehicle usage.\n\tReport any vehicle issues or incidents immediately.\n\tSupport logistics and project teams with the movement of materials.\n\n\nRequirements\n\n\n\tMinimum of SSCE.\n\t2-5 years of driving experience, preferably in a corporate setting.\n\tValid driver’s license with a clean driving record.\n\tGood communication skills and a professional attitude.\n\n\nApplication Closing Date: 10th July, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: bathr@batcomputers.net using the Job Position as the subject of the mail.\n\n \n\n \n\n3.) Communication & Marketing Officer\n\nJob Location: Mafoluku, Oshodi - Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe are seeking a dynamic and creative Communication & Marketing Officer to support and enhance the company’s brand image, public relations, and marketing efforts.\n\tThe ideal candidate will manage internal and external communications, develop marketing strategies, create content, and ensure consistent messaging across all platforms.\n\n\nKey Responsibilities\n\n\n\tDevelop and implement internal and external communication strategies.\n\tDevelop and execute marketing campaigns to promote services.\n\tWrite engaging content for websites, blogs, newsletters, and social media platforms.\n\tEnsure brand consistency in all communications and marketing materials.\n\tManage digital marketing activities, including SEO, email marketing, and social media.\n\tConduct market research and analyze trends to identify marketing opportunities.\n\tTrack and report on marketing campaign performance and media engagement.\n\tUse analytics tools to evaluate the effectiveness of communication and marketing strategies.\n\n\nQualifications\n\n\n\tBachelor's Degree in Communications, Marketing, Public Relations, or a related field.\n\t2–4 years of relevant experience in communication and marketing roles.\n\tExcellent verbal and written communication skills.\n\tProficiency with digital marketing tools.\n\tStrong organizational and project management skills.\n\tCreativity and attention to detail.\n\n\nApplication Closing Date: 24th June, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: bathr@batcomputers.net using the Job Position as the subject of the mail\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Guest Relations Officer Job at Tivana Workforce",
    "link": "https://www.jobgurus.com.ng/jobs/view/guest-relations-officer-job-at-tivana-workforce-1",
    "pubDate": "Wed, 04 Jun 2025 16:17:30 GMT",
    "source": "JobGurus",
    "keyword": "tivana workforce",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Tivana Workforce is a workforce solutions company that provides services that unlock the full potential of human capital to drive business excellence and growth in an ever-evolving marketplace. Our Services include Staffing and Recruitment, Workforce Management, Training and Development, Technology Solutions, HR Consulting, Team Retreat Planning and Specialized services.\n\nWe are recruiting to fill the position below:\n\nJob Position: Guest Relations Officer\n\nJob Location: Abuja (FCT)\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Guest Relations Officer (GRO) is responsible for providing outstanding customer service and ensuring a positive and welcoming experience for all guests. \n\tThe GRO acts as the primary point of contact for guests, resolving issues, responding to inquiries, and offering information about services, amenities, and local attractions.\n\n\nKey Responsibilities\n\n\n\tWelcome guests warmly upon arrival and ensure they feel valued and cared for.\n\tHandle guest check-ins and check-outs professionally and efficiently.\n\tMaintain a strong presence in the lobby and guest areas to proactively assist guests.\n\tRespond to guest inquiries, requests, and complaints promptly and effectively.\n\tRecord guest preferences and feedback to enhance future visits.\n\tHandle VIP guests with discretion and provide personalized service.\n\tEnsure guest satisfaction and follow up on any unresolved issues.\n\tCoordinate with other departments (housekeeping, room service, maintenance) to meet guest needs.\n\tArrange special services such as transportation, restaurant reservations, or event tickets.\n\tPromote hotel services and facilities, upselling where appropriate.\n\tMaintain knowledge of hotel policies, services, pricing, and local area attractions.\n\n\nQualifications and Skills\n\n\n\tBachelor’s Degree in Hospitality Management, Business Administration, or a related field (preferred).\n\tPrevious experience in customer service or hospitality (1–2 years minimum preferred).\n\tExcellent communication and interpersonal skills.\n\tFriendly, professional demeanour and strong problem-solving abilities.\n\tAbility to handle stressful situations with poise and diplomacy.\n\tFluency in English; additional languages are a plus.\n\tProficiency in hotel management software (e.g., Opera, etc) and Microsoft Office Suite.\n\tFlexible schedule including weekends, holidays, and evenings.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and Photograph to: tivanaworkforce@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Openings at Bolton White Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-bolton-white-group-2",
    "pubDate": "Wed, 04 Jun 2025 16:17:30 GMT",
    "source": "JobGurus",
    "keyword": "bolton white group",
    "duplicate": false,
    "classifications": [],
    "content": "Bolton White Group is a group of hospitality brands providing exceptional services across all our business units. Our team is dedicated to providing a wide range of clients with world-class services. Bolton White Group is well regarded for its focus on international best practices in all aspects of its business.\n\nBolton White Group is an independent entrepreneurial-driven institution offering a complete range of hospitality services with a focus on providing a ‘home away from home’ experience to our clients. By choosing to join Bolton White Group you have assumed your share of the responsibility for maintaining the high principles and standards to which we are dedicated.\n\nWe are recruiting to fill the following positions below:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n1.) Continental Chef\n\nJob Location: Abuja (FCT)\nEmployment Type: Full-time\n\nKey Responsibilities\n\n\n\tPrepare and cook a wide range of Continental dishes, including appetizers, mains, and desserts.\n\tDesign menus and suggest new recipes in line with current food trends and customer preferences.\n\tEnsure food quality, taste, and presentation meet established standards.\n\tSupervise kitchen staff and maintain a clean, organized kitchen environment.\n\tManage inventory, order supplies, and minimize food wastage.\n\tComply with food safety, hygiene, and health regulations.\n\n\nSkills & Qualifications\n\n\n\tCulinary Diploma or Certification from a recognized institution.\n\tProven experience as a chef specializing in Continental cuisine.\n\tStrong knowledge of European cooking techniques and ingredients.\n\tCreativity, attention to detail, and plating skills.\n\tAbility to work under pressure and in a fast-paced kitchen environment.\n\n\nApplication Closing Date: 20th June, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV and Photograph to: jobs@boltonwhitegroup.com using the Job Position as the subject of the email.\n\n \n\n2.) Security Operative\n\nJob Location:  Abuja (FCT)\nEmployment Type: Full-time\n\nRequirements\n\n\n\tCandidates should possess relevant qualifications with At least 2 years of experience in a similar role.\n\n\nApplication Closing Date: 15th June, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV and Photograph to: jobs@boltonwhitegroup.com using the Job Position as the subject of the mail.\n\n \n\n \n\n3.) Chief Security Officer\n\nJob Location: Abuja (FCT)\nEmployment Type: Full-time\n\nKey Responsibilities\n\n\n\tDevelop, implement, and manage comprehensive security strategies for the organisation.\n\tEstablish and maintain policies and procedures to ensure physical, personnel, and information security.\n\tLead the response to security incidents and crises, including investigations and risk mitigation.\n\tManage the recruitment, training, and supervision of security personnel.\n\tEnsure compliance with local and international laws, regulations, and standards relating to security.\n\tLiaise with law enforcement, regulatory bodies, and emergency services when needed.\n\tOversee and evaluate the performance of security systems, including surveillance and access control.\n\tConduct regular security audits and assessments across departments or properties.\n\tCollaborate with senior management and other stakeholders to align security with business operations.\n\tMaintain incident reports and manage data protection policies to secure sensitive information.\n\n\nJob Requirements\nEducation & Certifications:\n\n\n\tBachelor’s degree in any related field.\n\n\nExperience:\n\n\n\tA minimum of 7–10 years of experience in a similar role.\n\tA military experience is an advantage.\n\tProven track record of managing security operations in large or complex environments.\n\n\nSkills & Competencies:\n\n\n\tExcellent knowledge of security protocols, crisis management, and investigation procedures.\n\tStrong leadership, communication, and decision-making skills.\n\tAbility to develop strategic security initiatives that support business objectives.\n\tProficiency in modern security technology and information systems.\n\n\nApplication Closing Date: 15th June, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV and Photograph to: jobs@boltonwhitegroup.com using the Job Position as the subject of the mail.\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]