[
  {
    "title": "Administrative Officer Job at Kinz Global Consult Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/administrative-officer-job-at-kinz-global-consult-limited",
    "pubDate": "Fri, 20 Jun 2025 10:44:30 GMT",
    "source": "JobGurus",
    "keyword": "kinz global consult limited",
    "duplicate": false,
    "classifications": [],
    "content": "Kinz Global Consult Limited - Our client, a reputable Supermarket, is recruiting suitably qualified candidates to fill the position below:\n\nJob Position: Administrative Officer\nJob Location: Isefun Ayobo, Lagos\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAnswering telephone calls, responding to queries, and replying to emails.\n\tPreparing expense reports and office budgets.\n\tManaging office supplies and ordering new supplies as needed.\n\tScheduling meetings and booking conference rooms.\n\tHiring maintenance vendors to repair or replace damaged office equipment.\n\tSystematically filing important company documents.\n\tForwarding all correspondence, such as letters and packages, to staff members.\n\tAssisting the HR department with job postings and interviews.\n\n\nRequirements\n\n\n\tBachelor's Degree in Business Administration or other relevant field.\n\tProven experience working in an office environment.\n\tProficiency in all Microsoft Office applications.\n\tWorking knowledge of business management.\n\tThe ability to multitask.\n\tExcellent organizational skills.\n\tEffective communication skills.\n\tExceptional customer service skills.\n\n\nSalary\nN100,000 / Month.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: cv@kinzglobalconsult.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Android Engineer Job at NewGlobe",
    "link": "https://www.jobgurus.com.ng/jobs/view/android-engineer-job-at-newglobe",
    "pubDate": "Fri, 20 Jun 2025 10:44:30 GMT",
    "source": "JobGurus",
    "keyword": "newglobe",
    "duplicate": false,
    "classifications": [],
    "content": "NewGlobe supports visionary governments to transform public education systems, the cornerstone of a prosperous, equitable, and peaceful society. With a comprehensive system transformation platform and data-driven educational services, NewGlobe delivers rapid and dramatic improvements in learning outcomes at state and nationwide scale. Through building impactful partnerships and programmes, NewGlobe ensures that all children have access to an education that will develop their full potential and create a foundation for growth and prosperity.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nNewGlobe leverages more than a decade of educational experience and proven impact in integrated school management, teacher professional development, instructional design innovation, technological system support, child-centered classroom practice, and parent engagement -  all grounded in learning science - to ensure each teacher is empowered to engage children in transformational learning, and all children have the opportunity to develop to their full potential. Every day, NewGlobe supports governments to solve what were once seen as intractable problems, and by doing so, ensures this generation will be able to grow up to lead more fulfilled lives, while simultaneously building economic prosperity for themselves, their communities, and the globe.\n\nWe are recruiting to fill the position below:\n\nJob Position: Android Engineer\n\nJob Location: Lagos\n\nJob Summary\n\n\n\tWe are looking for an experienced full time Android engineer to join our new cross-functional software development team, which will build the software that powers and improves our ability to deliver massive learning gains – at scale. \n\tThe team will have a special focus on the learning management platform and the rest of the tech running in our academies (which is all Android based). \n\tThis person will join an elite, interdisciplinary team that will be building the technology that will take Bridge to the next level. It's a great opportunity to grow and learn, while working on developing software with a mission that few, if any, can compete with. \n\tWe believe in innovation, fast feedback, and high impact. We have an existing portfolio of native Android applications that undergird our ability to support self-sufficient academy management, engage the local community, and deliver high-quality education to our pupils.\n\tHowever, we need someone that can drive the next generation of these platforms, ensuring high availability even in challenging conditions and generally driving innovation in the mobile space. \n\tIt's all about rolling up one's sleeves to introduce best practices, deliver key functionality, and pave the way for exciting future possibilities, like adaptive curriculums and automated grading of tests (to name just a few).\n\n\nResponsibilities\n\n\n\tGather requirements, build, test, and ship new Android functionality for our academy tech platform\n\tCollaborate with the server-side developers to design the APIs for specifically for the Android application (not just consuming APIs that were already developed for a web app)\n\tEngage on all dimensions of the app, from UI and UX, to business logic, to storage and networking\n\tIntroduce architectural patterns to improve scalability, stability, and maintainability.\n\n\nRequirements\n\n\n\tBachelor's Degree in related field with superior academic performance\n\tAt least 3 years of professional Android development experience. Senior Android Engineer, especially published apps on Google Play\n\tFull lifecycle experience, from conceptualisation to deployment to feedback from production\n\tExperience architecting whole Android applications, not just adding features or porting existing apps\n\tBelief in the importance of automated unit, integration, and functional tests for Android apps\n\tExperience with writing library projects that get reused across multiple android apps\n\tKnowledge of Gradle and DI helpful\n\tExposure to continuous integration and continuous delivery practices, especially in an environment of weekly (or even more frequent) releases to production\n\tLove for collaboration and working with driven stakeholders, including presenting work with confidence when interacting with business owners and users\n\tOpenness and eagerness for learning new paradigms and practices\n\tPassion for NewGlobe's vision of democratising the right for all children to succeed.\n\n\nWhat We Offer\n\n\n\tThe opportunity to make a difference for children every day at a proven, internationally recognized, mission-driven company.\n\tFlexible hybrid working arrangement.\n\tTake the lead and help us grow our engineering team\n\tThe opportunity to work on challenging and innovative projects.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Full-Stack Developer (React Native, React.js, Node.js/Python) Job at Tiva Creative",
    "link": "https://www.jobgurus.com.ng/jobs/view/full-stack-developer-react-native-reactjs-nodejspython-job-at-tiva-creative",
    "pubDate": "Fri, 20 Jun 2025 10:44:30 GMT",
    "source": "JobGurus",
    "keyword": "tiva creative",
    "duplicate": false,
    "classifications": [
      "Software Engineering",
      "Marketing"
    ],
    "content": "Tiva Creative is a dynamic and innovative company dedicated to building responsive, scalable, and high-performance websites and digital solutions for businesses and organizations.\n\nWe are recruiting to fill the position below:\n\nJob Position: Full-Stack Developer (React Native, React.js, Node.js/Python)\nJob Location: Uyo, Akwa Ibom\n\nJob Summary\n\n\n\tWe are seeking a Full-Stack Developer with 3+ years of experience who has expertise in both custom web development (React, React Native, Node.js/Python) and WordPress development for content-driven websites.\n\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDevelop and maintain responsive and scalable websites using React.js, React Native, and WordPress.\n\tBuild and optimize backend services using Node.js or Python (Django/Flask).\n\tDesign and customize WordPress themes and plugins to meet business requirements.\n\tEnsure seamless integration between custom web applications and WordPress sites.\n\tImplement secure authentication and authorization (OAuth, JWT).\n\tOptimize performance and SEO for WordPress and React-based websites.\n\tDeploy and manage applications on AWS or Google Cloud.\n\tIntegrate Google Maps API for location-based features and payment gateways (Budpay, Monnify, Paystack, Flutterwave).\n\tEnsure cross-browser and mobile compatibility for all projects.\n\tCollaborate with UI/UX designers, project managers, and marketing teams.\n\tWrite clean, efficient, and well-documented code.\n\n\nRequirements\n\n\n\t3+ years of hands-on experience in full-stack development.\n\t3+ years of hands-on experience in building scalable solutions.\n\tProficiency in React.js (web) and React Native (mobile).\n\tStrong backend experience with Node.js or Python (Django/Flask).\n\tExtensive experience with WordPress, including theme and plugin development.\n\tKnowledge of PostgreSQL and real-time updates using Firebase.\n\tFamiliarity with AWS or Google Cloud for hosting and deployment.\n\tExperience integrating Google Maps API and payment gateways (Budpay, Monnify, Paystack, Flutterwave).\n\tUnderstanding of RESTful APIs, authentication (JWT, OAuth), and security best practices.\n\tExperience with SEO optimization for WordPress and React-based sites.\n\tStrong debugging, troubleshooting, and problem-solving skills.\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Project Manager Job at Sujimoto Construction Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/project-manager-job-at-sujimoto-construction-limited-2",
    "pubDate": "Fri, 20 Jun 2025 10:44:30 GMT",
    "source": "JobGurus",
    "keyword": "sujimoto construction limited",
    "duplicate": false,
    "classifications": [],
    "content": "Sujimoto Construction Limited is a luxury real estate and construction company with a vision to dominate Nigeria's real estate industry. The firm covers all areas of construction, including the pre and post phases. Our major expertise is in luxury real estate development. We have also expanded our operations into facility management and direct construction, catering to the discerning real estate investor who wishes to be associated only with bespoke and iconic structures.\n\nWe are recruiting to fill the position below:\n\nJob Position: Project Manager \n\nJob Location: Abuja\njob Type: Full-time\n\nAbout the job\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a highly skilled and experienced Project Manager to oversee and manage all aspects of construction projects from inception to completion.\n\tHe/She most have a strong background in Civil/Structural Engineering, Building Technology, Architecture with 10 years at managerial level of Solid experience at foundation, carcass and finishing levels.\n\n\nResponsibilities\n\n\n\tDevelop and implement project plans, including scheduling, budgeting, and resource allocation • Coordinate and oversee all aspects of construction projects, including planning, design, procurement, and construction\n\tManage and supervise construction teams, contractors, and subcontractors to ensure quality workmanship and adherence to project specifications\n\tEnsure compliance with all relevant building codes, regulations, and safety standards\n\tPrepare and submit progress reports, budget updates, and other project documentation as required\n\tMonitor and track project progress, identify potential issues or delays, and implement solutions to keep projects on schedule\n\tCommunicate regularly with clients, architects, engineers, and other stakeholders to provide updates on project status and address any concerns\n\tManage project budgets, track expenses, and make adjustments as needed to ensure projects stay within budget constraints\n\tConduct regular site visits to inspect work in progress, resolve issues, and ensure quality control\n\n\nRequirements \n\n\n\tMinimum of 10 years of experience in construction project management\n\tStrong knowledge of construction methods, materials, and techniques\n\tExcellent communication and interpersonal skills\n\tAbility to manage multiple projects simultaneously and prioritize tasks effectively\n\tProficient in project management software and tools\n\tStrong leadership and team management skills\n\tKnowledge of building codes, regulations, and safety standards\n\tPMP certification is a plus If you have a passion for construction and a proven track record of delivering successful projects,\n\n\nMethod of Application\nInterested and qualified candidates should submit their CV and portfolio showcasing relevant work to: Best@sujimotonig.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]