[
  {
    "title": "Field Fiber Engineer Job at Timeless Telecoms",
    "link": "https://www.jobgurus.com.ng/jobs/view/field-fiber-engineer-job-at-timeless-telecoms",
    "pubDate": "Thu, 19 Jun 2025 18:20:46 GMT",
    "source": "JobGurus",
    "keyword": "timeless telecoms",
    "duplicate": false,
    "classifications": [],
    "content": "At Timeless Telecom, we are at the forefront of delivering advanced Fiber to the Home (FTTH) solutions, providing high-speed internet and cutting-edge connectivity to residential customers.\n\nAs part of our continued expansion, we are recruiting a motivated and experienced candidate to join our team and drive the growth of our FTTH services in the capacity below:\n\nJob Position: Field Fiber Engineer\n\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Fiber Field Engineer will be responsible for installing, repairing, and maintaining fiber optic systems for residential and commercial customers (FTTH, Backbone, Fiber SME / Enterprise, Fiber P2P).\n\tThis role involves working outdoors in various weather conditions, performing splicing, and testing of fiber optic cables, and ensuring network integrity and performance.\n\n\nKey Responsibilities\nInstallation and Service:\n\n\n\tInstall and configure fiber optic cables and related equipment according to specifications and safety standards.\n\tPerform field surveys and assessments to determine installation requirements for fiber optics. (Network expansion, new SME / Enterprise P2P client survey).\n\n\nMaintenance and Troubleshooting:\n\n\n\tTroubleshoot and repair fiber optic networks and equipment issues, using a variety of testing equipment. (OTDR, Power Meter, VFL)\n\tConduct routine maintenance and inspections to ensure optimal network performance.\n\n\nSplicing and Testing:\n\n\n\tPerform fiber splicing and testing using fusion splicers and optical time-domain reflectometers (OTDRs).\n\tDocument and maintain accurate records of all installations, repairs, and maintenance activities. (Daily Report format)\n\n\nCustomer Interaction:\n\n\n\tCommunicate with customers to explain services, resolve issues, and provide information regarding fiber optic services.\n\tCollaborate with team members to ensure customer satisfaction and timely service delivery.\n\n\nSafety and Compliance:\n\n\n\tAdhere to all safety protocols and regulations while working in the field.\n\tMaintain compliance with industry standards and company policies related to fiber optic installations and repairs.\n\n\nQualifications\n\n\n\tHND, B.Tech, or Bachelor's Degree in Electrical Engineering or a relevant field\n\tMinimum 2 years of relevant work experience.\n\n\nKey Requirements\n\n\n\tSolid understanding of electrical systems and networks\n\tKnowledge of fiber optic telecommunication and data networks\n\tExperience with setting up and testing fiber optic systems\n\tUnderstanding of safety and compliance regulations.\n\n\nSalary\nN190,000 - N300,000 monthly.\n\nMethod of Application\nInterested and qualified candidates should send their resume to: trecruitment@timelessnet.com using the Job Position as the subject of the mail.\n\nNote: Only qualified candidates will be contacted.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "PHP Developer Job at Odixcity Consulting",
    "link": "https://www.jobgurus.com.ng/jobs/view/php-developer-job-at-odixcity-consulting",
    "pubDate": "Thu, 19 Jun 2025 18:20:46 GMT",
    "source": "JobGurus",
    "keyword": "odixcity consulting",
    "duplicate": false,
    "classifications": [
      "Software Engineering"
    ],
    "content": "Odixcity Consulting is an International Hr consulting and procurement firm. With expertise in Recruitment & Selection, Performance management, Training & Development, Compensation and benefits, as well as Outsourcing of goods and services for organizations.\n\nWe are recruiting to fill the position below:\n\nJob Position: PHP Developer\n\nJob Location: Remote\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are looking for a talented and motivated PHP developer to join our development team.\n\tYou will be responsible for designing, building, and maintain high-performance web applications using PHP and related technologies.\n\n\nResponsibilities\n\n\n\tWrite clean code that processes data, interacts with databases, and handles server-side logic.\n\tInteract with databases, writing SQL queries to store, retrieve, and manipulate data, optimize database performance.\n\tIdentify and fix errors in the codebase and ensure the application functions correctly.\n\tCreate modules, APIs endpoints, and other components that form the foundation of web applications.\n\tWrite code that is efficient, reuseable, and can handle increasing traffic and data.\n\tWrite test units, and create documentation for the codes.\n\tIntegrate back-end codes with front-end components, ensuring a cohesive user experience.\n\n\nRequirements\n\n\n\tBachelor’s Degree in Computer science, Data science or a related field.\n\tProficiency in PHP (Laravel, Symfony, or CodeIgniter).\n\tStrong understanding of OOP, MVC architecture, and RESTful API development.\n\tExperience with front-end technologies (HTML5, CSS3, JavaScript, jQuery).\n\tFamiliarity with MySQL or PostgreSQL, and writing complex queries.\n\tVersion control experience.\n\tExperience with Laravel Queues, Events, and Middleware.\n\tExposure to DevOps tools (Docker, CI/CD pipelines).\n\tKnowledge of test-driven development (TDD) and unit testing.\n\tStrong debugging and problem-solving skills.\n\n\nSalary\n\n\n\tN400,000 Monthly (non-negotiable).\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: jobscandidate8@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Hotel Manager Job at NSPRI Guest House",
    "link": "https://www.jobgurus.com.ng/jobs/view/hotel-manager-job-at-nspri-guest-house",
    "pubDate": "Thu, 19 Jun 2025 18:20:46 GMT",
    "source": "JobGurus",
    "keyword": "nspri guest house",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "NSPRI Guest House - Our Hotel is a dynamic and multifaceted field that involves overseeing the operations of hotels, resorts, restaurants, and other lodging and hospitality establishments. NSPRI Guest Houses are reputable and serene hospitality facilities located within academic and research environments, providing top-quality lodging and guest services.\n\nWe are recruiting to fill the position below:\n\nJob Position: Hotel Manager\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Vacancy\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a highly motivated, experienced, and service-oriented Hotel Manager to oversee operations, ensure guest satisfaction, and manage staff performance.\n\n\nResponsibilities\n\n\n\tOversee day-to-day operations of the guest houses\n\tManage hotel staff, including hiring, training, and scheduling\n\tMaintain high standards of customer service and guest satisfaction\n\tHandle customer complaints and resolve issues promptly\n\tDevelop marketing strategies to increase occupancy and brand visibility\n\tEnsure compliance with safety, hygiene, and hospitality regulations\n\tPrepare and manage budgets, control expenses, and increase profitability\n\tSupervise maintenance, housekeeping, and front desk operations\n\tPrepare reports and present performance metrics to management.\n\n\nRequirements\n\n\n\tHND or B.Sc Degree in Hospitality Management, in any recognized institutions\n\t8 - 10 years of experience in hotel or guest house management\n\tStrong leadership and interpersonal skills\n\tExcellent organizational and time-management abilities\n\tSound financial management and reporting skills\n\tGood knowledge of hotel management software and Microsoft Office\n\tAbility to work under pressure and handle multiple tasks.\n\n\nMethod of Application\nInterested and qualified candidates should forward their comprehensive CV, Contact Address (not P.O. Box) with a functional e-mail address and other relevant details to \"The Head Corporate\" via: recruitment@robertjohnsonholdings.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Head of Accounts Job at Goldline Nigeria Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/head-of-accounts-job-at-goldline-nigeria-limited",
    "pubDate": "Thu, 19 Jun 2025 18:20:46 GMT",
    "source": "JobGurus",
    "keyword": "goldline nigeria limited",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "Goldline Nigeria Limited is a reputable manufacturing and distribution company that specializes in high-quality building and finishing materials for the construction industry. With over 20 years of experience, we have established a strong reputation for exceptional customer service and our dedication to providing the best products and services. Our range of exclusive products, including steel and wooden doors, architectural ironmongery, Italian-style furniture, and stainless metal railings, are designed to meet the specific needs of our customers in terms of security, durability, and aesthetics. We also offer a wide selection of sanitary wares, tiles, and wall panels. We are committed to delivering excellence, quality, and peace of mind to our clients.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Head of Accounts\nJob Location: Ago Palace, Okota, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe are currently searching for a qualified accountant with the much needed experience in taxation, budgeting and financial management.\n\n\nResponsibilities\nHe/she will be expected to perform the following responsibilities:\n\n\n\tEnsure that the company complies with highest professional accounting principles, conventions and practise for all its financial activities and transactions.\n\tEnforce compliance with all Goldline accounting policies and expected professional standards of accountability, transparency and speed in the company’s accounting and financial management.\n\tGuarantee the completeness, correctness, relevance, accessibility, timeliness, presentation and efficient preparations of the company’s accounting reports for managerial use and decision making.\n\tEnsure through focused, consistent and effective oversight that the internal control unit of the department does relentless and meticulous vouching and verification of all entries and postings into the company’s ERP on a real time basis and that any errors and variations are investigated, sanctioned (where necessary) and corrections made immediately.\n\tConfirm payments for all sales and deposits and immediately raise relevant documents/payment receipts.\n\tCustomers’ debts management:\n\t\n\t\tProduce weekly debtors’ reports.\n\t\tMake report available to head of sales & marketing and managing director.\n\t\tLead and monitor debts recovery efforts.\n\t\tWhere necessary, embark on direct customers’ debts recovery.\n\t\tManage company’s account payable with a high sense of responsibility for the company’s reputation by planning payment commitments efficiently in a manner that allows the company to meet its obligations promptly and in an orderly manner.\n\t\n\t\n\tControl cash flows:\n\t\n\t\tPrepare periodic cash flow plans of the company. Monthly, quarterly and yearly cash inflows and outflows.\n\t\tProduce actual cash flow statements, analyses and interpretations to management.\n\t\tCompute, prepare and ensure timely remittances of all necessary taxes, pensions and other relevant statutory payments.\n\t\tManage workers’ loans, advances and IOUs.\n\t\tProcess and settle insurance premiums, utility bills, and other administrative bills.\n\t\n\t\n\tEnsure that all accounting transactions of the company anywhere is accurately posted into the company’s ERP system speedily and on a real time basis.\n\tReconcile all cash accounts, bank accounts, debtor accounts, creditor accounts, journals and ledger accounts that require reconciliations on a daily basis.\n\tControl and coordinate all petty cash accounts of the company.\n\tEnsure correctness of ledger balances in the trial balance; and correct classifications of posted transactions into appropriate accounting heads.\n\tFixed assets management:\n\t\n\t\tPrepare, maintain and update fixed assets schedule.\n\t\tCompute and post depreciation, amortizations, depletion, impairments, disposals, revaluations, provisions, loses, etc.\n\t\tMaintain fixed assets replacement analysis plan.\n\t\tMake a monthly report on fixed assets to the Managing Director.\n\t\n\t\n\tTax management:\n\t\n\t\tCompute, prepare, files and settle all federal, state and local government taxes.\n\t\tLiaise with all tax agencies, consultants, and government officials to resolve any tax related matters.\n\t\tMaintain perpetual tax record and document history.\n\t\n\t\n\tPrepare weekly, monthly, quarterly, biyearly and yearly financial reports. These include statement of comprehensive income, income statements, financial positions, cash flow statements; notes to the accounts, financial analyses and interpretations.\n\tMonitoring and resolution of suspense accounts, clearing accounts, settlement accounts, sundry accounts and Inter-branch accounts.\n\tProvide relevant and timely financial accounting intelligence to management for planning and decision making.\n\tEnsure that confidential financial accounting information are tightly contained and not accessed by unauthorised bodies.\n\tTake custody of important financial accounting documents and original documents relating to taxes, insurances, bank loans & overdrafts, debtors’ settlement agreements, liability commitments, investments, and other forms of financial agreements are safely kept.\n\tIssue job descriptions to subordinates whose jobs are not explicitly described in the personnel policy and manage and supervise them for high productivity. Delegate duties as necessary under close supervision to continually develop subordinates. Submit the supplementary job descriptions to the head of human resources for records while retaining final responsibility for the quality of job done.\n\tAppraise, query and make recommendations about subordinates to head of human resources, managing director and unit/department heads, as necessary.\n\tLead in the development of a robust and a relentlessly consistent and accurate stock integrity and auditing system for the company by direct participation, process development, planning, decisive and consistent over sight of the internal control unit.\n\tBudget management: \n\t\n\t\tDevelop budget templates for all departments’ and branches.\n\t\tInitiates budgeting processes by receiving departmental budgets (revenues and expenses) from respective heads of departments.\n\t\tReview, reconcile and consolidate submitted budget proposals with departmental heads.\n\t\tCall budget defence meetings. \n\t\tPrepare and disseminates approved budgets.\n\t\tMonitor budget performances.\n\t\tPresent budgets analyses and interpretations at monthly performance review (MPR).\n\t\n\t\n\tCarryout any other job that the managing director may assign.\n\n\nQualifications\n\n\n\tMust be an HND or B.Sc. holder in Accountancy (other science or social sciences are acceptable if combined with professional or academic qualifications in accountancy).\n\tMust have ACA, ACCA, or other related professional qualifications in accountancy.\n\tShall possess minimum of 5 years of post graduate experience.\n\tShall possess strong analytical and critical mind.\n\tShall be able to interpret financial data.\n\tShall have good computational and data presentation skills.\n\tShall have vast computer knowledge with appreciable accounting packages knowledge.\n\tShall be conversant with latest changes that affect the company’s taxation laws, international financial reporting standards, and other financial accounting matters.\n\tMust possess strong conceptual intelligence to perceive and conceive corporate goals.\n\tShall have the ability to work without supervision.\n\tShall possess very sound budgetary management skill.\n\tShall have very good interpersonal skill.\n\tShall have an excellent sense of judgment.\n\tShall have impeccable character, punctuality, integrity, contentment, objectivity and impartiality.\n\tShall be teachable and ever willing to lend personal knowledge to others.\n\tShall possess good report and memo writing skills.\n\tMust live in and around Ago Palace Way or Okota, Isolo, Lagos.\n\n\nSalary\nN200,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV and Cover Letter to: goldlinehhr@gmail.com using the Job Position (HEAD OF ACCOUNTS) as the subject of the mail.\n\nNote: All selections will be made based on experience and proximity.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Receptionist / Admin Officer Job at IT Horizons Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/receptionist-admin-officer-job-at-it-horizons-limited",
    "pubDate": "Thu, 19 Jun 2025 18:20:46 GMT",
    "source": "JobGurus",
    "keyword": "it horizons limited",
    "duplicate": false,
    "classifications": [],
    "content": "IT Horizons Limited is a company with diverse talents and skills in existing, recent and upcoming technologies worldwide. We are a team of young, vibrant, ambitious, but experienced professionals who deal with everything relating to technologies, especially information communication technologies (ICT). In addition, we have the ability to update with the latest trends and requirements of our esteemed clients. Our compan,y established in 2010, had been driven by innovations and excellence, and with its rapid rate of success and customers’ requirements, we were fully incorporated into a private limited company in 2012 with the aim of helping organizations in achieving their goals by providing optimum technological solutions while reducing total cost of ownerships.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Receptionist / Admin Officer\n\nJob Location: Gbagada Phase II, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tAs a receptionist, you will be the first point of contact for visitors, clients, and staff.\n\tYour role is vital in ensuring the smooth running of the office by providing essential administrative support across the organization.\n\tYou will handle a variety of tasks, ranging from greeting and welcoming guests to managing phone calls, correspondence, and administrative data analysis.\n\tYour role is key in facilitating a professional and efficient environment for both clients and staff.\n\n\nJob Responsibilities\n\n\n\tServe as the first point of contact for clients, guests, and visitors, ensuring a positive and professional experience.\n\tDirect visitors to the appropriate departments or individuals.\n\tAnswer and direct phone calls appropriately, ensuring all calls are handled efficiently.\n\tRespond to general inquiries and emails and redirect them to the relevant personnel as necessary.\n\tProvide general administrative support to staff and management as required.\n\tAssist in scheduling appointments and managing calendars.\n\tCoordinate internal and external communications, including distributing correspondence and office mail.\n\tPerform administrative data analysis to support decision-making and reporting processes.\n\tEnsure the reception area is tidy and always welcoming.\n\tMaintain the visitor logbook and keep accurate records of incoming and outgoing visitors.\n\tReceive, sort, and distribute packages, letters, and deliveries to appropriate departments.\n\tProvide support to various departments as required, assisting in organizing meetings or events and preparing necessary documents.\n\tHelp with other office-related tasks as needed, ensuring the workplace runs smoothly.\n\tEnsure outgoing correspondence and parcels are sent out promptly.\n\tAssist with administrative data-based analysis, organizing and maintaining records and files.\n\tPerform general office tasks such as filing, photocopying, and document management.\n\tYou will be required to arrive at least 30 minutes before regular office hours to ensure the office is prepared for the day and to close the office an hour after business hours to ensure a smooth transition at the end of workday.\n\tSupervise and coordinate the activities of janitors to maintain a clean work and general environment\n\tPrepare and submit daily activity and status reports to the Admin Manager.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: careers@ithorizonsgroup.comusing the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]