[
  {
    "title": "Job Vacancies at the Vault Recruitment (TVR)",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancies-at-the-vault-recruitment-tvr",
    "pubDate": "Fri, 04 Jul 2025 16:19:18 GMT",
    "source": "JobGurus",
    "keyword": "the vault recruitment (tvr)",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "The Vault Recruitment (TVR) is a fast growing recruitment firm specializing in connecting top talent with SME's and Startup organizations. Our team of experienced recruiters understands the unique needs and challenges of the modern job market and uses our extensive network and industry knowledge to find the best candidates for our clients.\n\nWe are recruiting to fill the following positions below:\n\n1.) Instore Sales Executive\n\nVacancy Code: SSC011\nJob Location: Idumota, Lagos Island - Lagos\nEmployment Type: Full-time\n\nQualifications & Requirements\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tOND, HND, or BSc in any field.\n\tMinimum of 1 year of sales experience.\n\tExcellent communication and negotiation skills.\n\tStrong customer service and relationship management abilities.\n\n\nSalary\nN85,000 / Month.\n\nClick here to apply online\n\n \n\n2.) Admin Executive\n\nVacancy Code: SSC012\nJob Location: Idumota, Lagos Island - Lagos\nEmployment Type: Full-time\nWork Mode: On-site\n\nRequirements\n\n\n\tMinimum of OND in any field with 1 - 2 years of work experience\n\tBasic knowledge of Microsoft Office (Ms Word).\n\tOperate computer systems and software efficiently.\n\tGender: Male or Female\n\tManage documents, perform data entry, and maintain accurate records.\n\tMonitor system performance and troubleshoot basic issues.\n\tGood typing speed and attention to detail.\n\tAbility to follow instructions and work independently.\n\tMust reside around Idumota, Lagos Island (e.g., Obalende, CMS, Ebute Metta, etc.).\n\tMust be available to resume immediately.\n\n\nSalary\nN80,000 - N90,000 monthly.\n\nClick here to apply online\n\n \n\n3.) Relationship Manager / Customer Care Representative\n\nJob Location: Ikoyi, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe're seeking a highly skilled, organised and proactive Relationship Manager/ Customer care representative to join our team.\n\tAs a Relationship Manager, you will be responsible for the presentation, promotion and sales of the products/services to customers, using solid arguments to ensure that the organisation’s revenue goals are met.\n\tIf you have excellent communication and analytical skills, and a passion for delivering outstanding service, we'd love to hear from you!\n\n\nRequirements\n\n\n\tMinimum of BSC or HND in any field.\n\tMinimum 3 years of experience in a financial institution\n\tExcellent funds mobilization, loan processing and loan recovery skills\n\tExcellent communication, interpersonal, negotiating skills.\n\tAbility to work independently and as part of a team.\n\tStrong sales and negotiation abilities.\n\tExcellent business development and relationship management skills\n\tMust reside in Ikoyi or its environs.\n\n\nSalary\nN250,000 Monthly plus up to N500,000 Monthly Performance Bonus.\n\nStart Date\nImmediate resumption.\n\nClick here to apply online    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Communications and PR Manager Job at Moniepoint",
    "link": "https://www.jobgurus.com.ng/jobs/view/communications-and-pr-manager-job-at-moniepoint",
    "pubDate": "Fri, 04 Jul 2025 16:19:18 GMT",
    "source": "JobGurus",
    "keyword": "moniepoint",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "Moniepoint Incorporated is a global business payments and banking platform and recently became QED Investors’ first investment in Africa. We are the partner of choice for over 600,000 businesses of all sizes, powering the dreams of SMBs and providing them with equal access to the tools they need to grow and scale.\n\nWe are recruiting to fill the position below:\n\nJob Position: Communications and PR Manager\n\nJob Location: Lagos, Nigeria\n\nAbout the Role\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe’re looking for a Communications Expert to lead the strategic development and execution of our public relations strategy and help define what the market thinks of TeamApt Ltd.\n\tWe want an ambitious communications expert who has delivered excellent results managing the day-to-day tasks of a press office and running longer-term campaigns.\n\tIn your role, you will refine and execute the company’s media relations efforts designed to build/leverage thought leadership and drive our positioning; you’ll forge relationships with journalists and keep them in the loop with our news.\n\tOne of our core values is candour, and you will be truthful and transparent while telling compelling stories about the company.\n\tYou’ll define how we message new features and big announcements and find clever opportunities to show the country what we do while helping us quantify the value of PR and measure its impact and success.\n\n\nKey Responsibilities\n\n\n\tDrive and maintain overall narrative and message framework for cohesive and integrated external communications programming via related channels, including media relations materials, corporate website, social media, etc.\n\tInitiate, create, and deliver earned media programming/stories that drive awareness and engagement linked to TeamApt’s business and brand strategy\n\tProactively pitch stories positioning TeamApt Ltd and spokespeople as experts on identified topics and key related growth trends.\n\tServe as communications subject matter expert with the ability to direct and manage media engagements proactively and reactively.\n\tPrepare spokespeople and leaders for media interviews and speaking engagements through media training as appropriate.\n\tServe as a key media contact as appropriate, including during crises.\n\tDrive media relations efforts to support financial performance reporting and investor/analyst events and activities as needed\n\tEstablish, maintain and strengthen relationships with related industry and financial reporters\n\tEvaluate and prepare briefing documents related to interviews, external conferences and opportunities\n\tManage external PR or external comms agency partners where applicable, including tracking budgets, reporting, and delivery of support to meet business goals.\n\n\nRequirements\nYou Should Apply If You Have:\n\n\n\tCandidates should possess a Bachelor’s Degree in Communications, PR, Journalism or related discipline with at least 5 years of subject matter experience. \n\tExperience working in a busy press office or PR within the financial services sector with a strong book of press contacts\n\tSolid ability to build productive relationships and lead the development of communications strategies through interactions with internal and external partners.\n\tStrong writing & editing skills are a must, with a focus on quality control.\n\tExcellent presentation and speaking skills\n\tHave an understanding of how you can tell a story using data.\n\tUnderstand how to quantify and measure the value of PR, and show the rest of the company why it’s important too\n\n\nWhat We Can Offer You\n\n\n\tCulture - We put our people first and prioritize the well-being of every team member. We’ve built a company where all opinions carry weight and where all voices are heard. We value and respect each other and always look out for one another. Above all, we are human.\n\tLearning - We have a learning and development-focused environment with an emphasis on knowledge sharing, training, and regular internal technical talks.\n\tCompensation - You’ll receive an attractive salary, pension, health insurance, annual bonus, plus other benefits.\n\n\nWhat to expect in the hiring process\n\n\n\tA preliminary phone call with one of our recruiters.\n\tA panel interview with a member of the hiring team.\n\tA behavioral and technical interview with a member of the Executive team.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Sales Executive Job at Express Resource Connect",
    "link": "https://www.jobgurus.com.ng/jobs/view/sales-executive-job-at-express-resource-connect",
    "pubDate": "Fri, 04 Jul 2025 16:19:18 GMT",
    "source": "JobGurus",
    "keyword": "express resource connect",
    "duplicate": false,
    "classifications": [],
    "content": "Express Resource Connect was launched in 2020 as a response to developing a home grown business management solution simplified enough to be used by an owner manager of any business or an enterprise with multiple business processes and employees. We offer a comprehensive business management solution, empowering smal, mid-size, and large enterprises to automate, digitise, and seamlessly manage al their business operations in one integrated platform. We are a Consulting firm that links candidates to their employers.\n\nWe are recruiting to fill the position below:\n\nJob Position: Sales Executive\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAre you a result-oriented sales professional with experience in financial services? Join our expanding team as a Sales Executive and enjoy a rewarding career with performance-based benefits.\n\n\nResponsibilities\n\n\n\tIdentify and acquire new clients and business opportunities\n\tMobilize and manage client assets\n\tBuild strong client relationships and maintain retention\n\tAchieve sales targets and performance milestones\n\tProvide regular reports and market feedback\n\tCollaborate with internal teams for smooth service delivery\n\n\nRequirements\n\n\n\tMinimum of OND, HND, or BSc\n\tProven sales experience in a financial institution\n\tStrong communication and relationship-building skills\n\tMust be 45 years or younger by December 2025\n\tTarget-driven and self-motivated.\n\n\nWhy join us?\n\n\n\tAttractive commission on assets mobilised\n\tPerformance-based bonuses\n\tMonthly health coverage\n\tFixed service-related support\n\tOpportunities for professional growth.\n\n\nApplication Closing Date\n10th July, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: recruitment@express-resource.com using the Job Position and Location as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Embedded Linux Senior Software Engineer - Optimisation Job at Canonical Nigeria",
    "link": "https://www.jobgurus.com.ng/jobs/view/embedded-linux-senior-software-engineer-optimisation-job-at-canonical-nigeria",
    "pubDate": "Fri, 04 Jul 2025 16:19:18 GMT",
    "source": "JobGurus",
    "keyword": "canonical nigeria",
    "duplicate": false,
    "classifications": [],
    "content": "(adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\nCanonical - We deliver open source to the world faster, more securely, and more cost-effectively than any other company. We develop Ubuntu, the world’s most popular enterprise Linux from cloud to edge, together with a passionate global community of 200,000 contributors. Ubuntu means 'humanity to others. We chose it because it embodies the generosity at the heart of open source, the new normal for platforms and innovation. Together with a community of 200,000, we publish an operating system that runs from the tiny connected devices up to the world's biggest mainframes, the platform that everybody uses on the public cloud, and the workstation experience of the world's most productive developers. Secure and reliable, elegant and intuitive, and open for innovation - Ubuntu is the future of open source, which is why it's the fastest-growing Linux in the world despite already being the most widely deployed.\n\nWe are recruiting to fill the position below:\n\nJob Position: Embedded Linux Senior Software Engineer - Optimisation\nJob Location: Lagos\nJob type: Full time\n\nWhat your day will look like\n\n\n\tDesign and implement the best Ubuntu integration for the latest IoT and server-class hardware platforms and software stacks\n\tWork with partners to deliver a delightful, optimised, first class Ubuntu experience on their platforms\n\tTake a holistic approach to the Ubuntu experience on partner platforms with inputs on technical plans, testing strategy, quality metrics\n\tParticipate as technical lead on complex customer engagements involving complete system architectures from cloud to edge\n\tHelp our customers integrate their apps, SDKs, build device OS images, optimize applications with Ubuntu Core, Desktop and Server\n\tWork with the most advanced operating systems and application technologies available in the enterprise world.\n\n\nWhat we are looking for in you\n\n\n\tYou love technology and working with brilliant people\n\tYou have a Bachelor’s degree in Computer Science, STEM or similar \n\tYou have experience with Linux packaging (Debian, RPM, Yocto)\n\tYou have experience working with open source communities and licences\n\tYou have experience working with C, C++\n\tYou can work in a globally distributed team through self-discipline and self-motivation.\n\n\nAdditional skills that you might also bring:\n\n\n\tExperience with graphics stacks\n\tGood understanding of networking - TCP/IP, DHCP, HTTP/REST\n\tBasic understanding of security best practices in IoT or server environments\n\tGood communication skills, ideally public speaking experience\n\tIoT / Embedded experience – from board and SoC, BMCs, bootloaders and firmware to OS, through apps and services\n\tSome experience with Docker/OCI containers/K8s.\n\n\nWhat we offer colleagues\n\n\n\tWe consider geographical location, experience, and performance in shaping compensation worldwide.\n\tWe revisit compensation annually (and more often for graduates and associates) to ensure we recognise outstanding performance.\n\tIn addition to base pay, we offer a performance-driven annual bonus.\n\tWe provide all team members with additional benefits, which reflect our values and ideals.\n\tWe balance our programs to meet local needs and ensure fairness globally.\n\tDistributed work environment with twice-yearly team sprints in person\n\tPersonal learning and development budget of USD 2,000 per year\n\tAnnual compensation review\n\tRecognition rewards\n\tAnnual holiday leave\n\tMaternity and paternity leave\n\tEmployee Assistance Programme\n\tOpportunity to travel to new locations to meet colleagues\n\tPriority Pass, and travel upgrades for long haul company    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "IT Support Officer Job at Filmhouse Cinemas Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/it-support-officer-job-at-filmhouse-cinemas-limited",
    "pubDate": "Fri, 04 Jul 2025 16:19:18 GMT",
    "source": "JobGurus",
    "keyword": "filmhouse cinemas limited",
    "duplicate": false,
    "classifications": [],
    "content": "Filmhouse Cinemas Limited is a dynamic film exhibition company. Our expertise are in the areas of: Cinema operations, management of sites, Ownership of sites, Consultancy for cinema development, Design Fit-out; Cinema project management, Film Distribution: Rights Acquisition, Booking into cinemas, and content development.\n\nWe are recruiting to fill the position below:\n\nJob Position: IT Support Officer\n\nJob Location: Victoria Island, Lagos\nJob Schedule: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tServe as the first point of contact for all IT support requests via phone, email, or ticketing system.\n\tProvide timely and effective technical support and troubleshooting for hardware, software, and network-related issues.\n\tDiagnose and resolve technical problems, including system errors, software malfunctions, and connectivity issues.\n\tAssist with user account management tasks, including account creation, password resets, and access permissions.\n\tCollaborate with other IT team members to identify recurring issues and opportunities for process improvements.\n\tKeep abreast of new technologies and best practices in IT support and service delivery.\n\tDocument all support interactions, including details of the issue, troubleshooting steps taken, and resolutions provided, in the IT service management system.\n\tEscalate unresolved issues to the appropriate IT support teams or third-party vendors, ensuring timely resolution and follow-up with users.\n\tInstall, configure, and maintain desktops, laptops, printers, mobile devices, and other IT equipment as needed.\n\tContribute to the development and maintenance of IT documentation, knowledge base articles, and user guides.\n\n\nQualifications\n\n\n\tBachelor's Degree in Information Technology, Computer Science, or related field preferred.\n\tProven experience in a technical support role, preferably in an IT service desk environment.\n\tStrong knowledge of IT fundamentals, including operating systems (Windows, macOS), hardware components, networking concepts, and software applications.\n\tExperience with IT service management tools.\n\tExcellent problem-solving skills and the ability to troubleshoot technical issues independently.\n\tExceptional communication skills, both verbal and written, with a customer-oriented approach.\n\tAbility to multitask, prioritize workload, and work effectively under pressure in a fast-paced environment.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]