[
  {
    "title": "Executive Assistant / Business Manager (Airbnb Operations) Job at Raphael Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/executive-assistant-business-manager-airbnb-operations-job-at-raphael-group-2",
    "pubDate": "Thu, 12 Jun 2025 15:42:38 GMT",
    "source": "JobGurus",
    "keyword": "raphael group",
    "duplicate": false,
    "classifications": [],
    "content": "Raphael Group is professional Virtual Assistant service that connects employers with skilled remote assistants. We offer a wide range of services to support individuals and businesses, including scheduling, email management, research, and more. We take the hassle out of finding and hiring qualified virtual assistants, allowing you to focus on growing your business.\n\nWe are recruiting to fill the position below:\n\nJob Position: Executive Assistant / Business Manager (Airbnb Operations)\n\nJob Location: Remote\nEmployment Type: Full-time\nWorking Hours:Full-time: (Wednesday - Sunday, 10 am - 4 pm)\n\nAbout the Role\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe’re seeking a highly organized, proactive, and experienced Executive Assistant / Business Manager to oversee daily operations and manage a remote team of Virtual Assistants (VAs), cleaners, and service providers for an established Airbnb property management business.\n\tThis role is ideal for someone with a solid background in Airbnb hosting or short-term rental property management, combined with exceptional people management and leadership skills.\n\tYou will serve as the right hand to the business owner - ensuring seamless day-to-day operations, managing teams, and maintaining high standards across all properties.\n\n\nKey Responsibilities\n\n\n\tOversee and coordinate a team of Virtual Assistants (VAs) responsible for guest communications, calendar management, and operational tasks.\n\tManage schedules, assign tasks, and monitor performance of VAs, cleaning staff, maintenance personnel, and other service providers (e.g., electricians, plumbers, handymen).\n\tEnsure all Airbnb properties are guest-ready, well-maintained, and compliant with hosting standards at all times.\n\tHandle escalated issues from team members or on-the-ground staff quickly and professionally.\n\tCoordinate regular property inspections, deep cleaning schedules, and urgent repair needs.\n\tAssist with onboarding, training, and performance evaluations of new team members.\n\tCreate and maintain systems and Standard Operating Procedures (SOPs) that promote efficiency, accountability, and outstanding guest experiences.\n\tProvide executive-level support to the business owner - including project tracking, operational reporting, and highlevel administrative support.\n\n\nRequirements\n\n\n\t3+ years of experience in Airbnb or vacation rental management, property coordination, or short-term rental operations.\n\tProven experience in managing remote teams.\n\tStrong interpersonal, organizational, and leadership skills; capable of guiding teams with clarity, empathy, and decisiveness.\n\tProficiency in using tools such as the Airbnb platform, Google Workspace (Docs, Sheets, Calendar), Slack, Trello or Asana (project management tools), and other property management software.\n\tSelf-motivated, detail-oriented, and able to resolve problems efficiently under pressure.\n\tWillingness to be on-call and responsive to urgent matters that may arise on weekends.\n\n\nWhat We Offer\n\n\n\tSalary:N175,000 / Monthly.\n\tA key leadership role within a growing and professional Airbnb management company\n\tRemote working environment with flexibility and autonomy\n\tOpportunities to lead and scale a remote operations team\n\tCompetitive pay with performance-based growth potential.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Study Abroad Consultant Job at HRLeverage Africa",
    "link": "https://www.jobgurus.com.ng/jobs/view/study-abroad-consultant-job-at-hrleverage-africa",
    "pubDate": "Thu, 12 Jun 2025 15:42:38 GMT",
    "source": "JobGurus",
    "keyword": "hrleverage africa",
    "duplicate": false,
    "classifications": [],
    "content": "HRLeverage Africa - Our client, a leading international education firm, is recruiting suitable candidates to join their team in the capacity below:\n\nJob Position: Study Abroad Consultant\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nPosition Overview\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe ideal candidate will provide expert guidance to students seeking higher education opportunities abroad, particularly in countries like the USA, UK, Canada, and Australia.\n\tThe role involves end-to-end student counselling, application support, visa guidance, and conducting seminars and information sessions.\n\tStrong communication skills and prior experience in the study abroad or education consultancy domain are preferred.\n\n\nKey Responsibilities\n\n\n\tGuide students on study abroad destinations, programs, and career pathways\n\tManage the complete application process, including SOPs, LORs, documentation, and visa formalities\n\tConduct webinars, seminars, and sessions to educate prospective students and parents\n\tRespond to walk-in inquiries and follow up with leads through calls, emails, and online platforms\n\tStay up to date on university admission cycles, requirements, and international visa policies\n\tBuild and maintain strong relationships with global academic institutions\n\tUtilize CRM tools to track student applications and manage records\n\tSupport students with pre-departure briefings and travel arrangements\n\n\nKey Requirements\n\n\n\tBachelor’s degree or higher in Education, Counselling, or a related field\n\tExperience in study abroad counselling or education consultancy is an advantage\n\tExcellent communication, interpersonal, and presentation skills\n\tFamiliarity with international education systems and visa protocols\n\tAbility to thrive in a goal-driven, student-focused environment.\n\n\nSalary\n\n\n\tN200,000 - N300,000 per month (Negotiable based on experience and qualifications).\n\n\nBenefits:\n\n\n\tCareer growth and development opportunities\n\tSupportive and collaborative work environment\n\tExposure to global institutions and processes.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and a cover letter to: hr.hrleverageafrica@gmail.com using the Job Position as the subject of the mail.\n\nNote: Only shortlisted candidates will be contacted.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "HSE Officer Job at HRLeverage",
    "link": "https://www.jobgurus.com.ng/jobs/view/hse-officer-job-at-hrleverage-1",
    "pubDate": "Thu, 12 Jun 2025 15:42:38 GMT",
    "source": "JobGurus",
    "keyword": "hrleverage",
    "duplicate": false,
    "classifications": [],
    "content": "HRLeverage delivers excellent spectrum of HR Business Solutions and strategic management support services through a customs built approach for organisations.As a premium professional HR Boutique firm domicile in Africa, with our global partners, we leverage on technology in providing a one-stop human resources services to various industries in terms of Staffing, Outsourcing, Executive search and recruitment, HR advisory, HR4SMEs, Expatriate management.\n\nWe are recruiting to fill the position below:\n\nJob Position: HSE Officer\n\nJob Location: Mokwa, Niger\n\nResponsibilities\nHSE Compliance & Monitoring:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tEnsure that all activities comply with applicable HSE regulations and company policies.\n\tConduct regular inspections and audits to identify hazards and ensure corrective actions are implemented.\n\n\nRisk Assessment & Control:\n\n\n\tCarry out risk assessments and enforce preventive measures.\n\tDevelop, implement, and monitor safe work procedures and practices.\n\n\nTraining & Awareness:\n\n\n\tConduct HSE inductions and regular safety training for employees and contractors.\n\tPromote safety awareness and culture through campaigns, toolbox talks, and meetings.\n\n\nIncident Investigation & Reporting:\n\n\n\tInvestigate incidents, accidents, near misses, and unsafe conditions; prepare reports and recommend corrective actions.\n\tMaintain incident records and follow up on the implementation of improvements.\n\n\nDocumentation & Reporting:\n\n\n\tPrepare and maintain accurate HSE documentation and reports, including safety statistics and compliance logs.\n\tSupport in preparing reports for regulatory authorities as required.\n\n\nEmergency Preparedness:\n\n\n\tEnsure emergency response plans are developed, tested, and updated.\n\tConduct drills and training on emergency procedures.\n\n\nEnvironmental Management:\n\n\n\tMonitor and report environmental impacts, including waste, emissions, and spills.\n\tPromote environmentally sustainable practices and compliance with environmental regulations.\n\n\nRequirements\n\n\n\tInterested candidates should possess an HND / Bachelor's Degree with 2-4 years of work experience.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: ogohjohn92@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Client Service / Account Management Officer Job at HRLeverage Africa",
    "link": "https://www.jobgurus.com.ng/jobs/view/client-service-account-management-officer-job-at-hrleverage-africa-1",
    "pubDate": "Thu, 12 Jun 2025 15:42:38 GMT",
    "source": "JobGurus",
    "keyword": "hrleverage africa",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "HRLeverage Africa Consulting Limited delivers excellent spectrum of HR Business Solutions and strategic management support services through a customs built approach for organisations.As a premium professional HR Boutique firm domicile in Africa, with our global partners, we leverage on technology in providing a one-stop human resources services to various industries in terms of Staffing, Outsourcing, Executive search and recruitment, HR advisory, HR4SMEs, Expatriate management.\n\nWe are recruiting to fill the position below:\n\nJob Position: Client Service / Account Management Officer\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are looking for a Client Service / Account Management Officer to manage end-to-end client interactions, ensure accurate costing and budgeting, and support seamless execution of brand activation and experiential marketing campaigns.\n\n\nKey Responsibilities\n\n\n\tServe as the primary liaison between clients, vendors, and internal teams.\n\tLead project cost estimation, budgeting, and financial tracking using QS expertise.\n\tPrepare BOQs, job measurements, and ensure accurate documentation.\n\tMonitor project timelines, ensuring timely delivery and quality control.\n\tCoordinate with vendors and production teams to deliver on client expectations.\n\n\nRequirements\n\n\n\tBSc/HND in Quantity Surveying or related field.\n\tMinimum of 2–3 years of experience in client servicing or account/project management.\n\tStrong analytical, budgeting, and vendor negotiation skills.\n\tExcellent communication and organizational skills.\n\tFamiliarity with branding, activation, or marketing projects is an advantage.\n\n\nSalary\nN150,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CVs and cover letter (to be sent as body of the mail, not attachment) : recruitingtalents24@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]