[
  {
    "title": "Special Operations Officer Job at PPC Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/special-operations-officer-job-at-ppc-limited",
    "pubDate": "Tue, 08 Jul 2025 13:31:24 GMT",
    "source": "JobGurus",
    "keyword": "ppc limited",
    "duplicate": false,
    "classifications": [],
    "content": "PPC (formerly Phlips Project Centre) is a wjolly Nigerian-owned multi-compentency engineering and infrastructure development company. its core activites are primarily geered towards providing specialized end-to-end services for projects in ICT, Power, Healthcare, Transportation, Building Services and other utility sectors.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nCommencing operations in 1991 as Philips Projects Centre, an affiliate of Philips Electronics N.V. of the Netherlands. The PPC acronym was retained after a strategic management buyout of the Dutch parent company. Thus, with this strategic buyout, the old businessrs were retained, with the added advantage of the exclusive distributorship of the numerous professional Philips' products, and the provision of integrayed solutions based on cutting-edge technology.\n\nWe are recruiting to fill the position below:\n\nJob Position: Special Operations Officer\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nResponsibilities\n\n\n\tPerformance reporting and monitoring\n\tCompliance: Secure and enforce Quality standards\n\tSecure relevant certifications, professional/ corporate memberships, registration and renewals (including audits)\n\tInternal Customer Satisfaction: Co-ordinate performance review meeting with EC, MD, Heads of verticals and shared services + company’s legal representative\n\n\nRequirements\n\n\n\tEducation: Bsc, Msc\n\tProfessional Qualification Membership of relevant professional bodies – NIM, et\n\n\nKey Competencies Requirements:\n\n\n\tIT Savy, Analytical mind\n\tTeam Player, Ability to work under pressure & able to multitask.\n\n\nMethod of Application\nInterested and qualified candidates should send their Resume to: hr@ppcng.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]