[
  {
    "title": "Assistant Procurement Officer Job at HT-Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/assistant-procurement-officer-job-at-ht-limited-2",
    "pubDate": "Fri, 27 Jun 2025 11:13:38 GMT",
    "source": "JobGurus",
    "keyword": "ht-limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "HT-Limited is Business Management Consulting firm, offering support in business development, human resources management and administration. HT-Limited is a member of the Chartered Institute of Personnel Management in Nigeria, with offices in Lagos, Nigeria and Accra, Ghana. We provide customized HR consulting solutions for employers looking to reduce risks and overhead costs, so more time can be spent on revenue generating activities.\n\nWe are recruiting to fill the position below:\n\nJob Position: Assistant Procurement Officer\n\nJob Location: Ikoyi, Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Assistant Procurement Officer supports the Procurement Manager in sourcing, purchasing, and tracking the organization’s essential supplies and materials.\n\tThis role is critical in ensuring that procurement processes are efficient, cost-effective, and compliant with company policies.\n\n\nKey Responsibilities\n\n\n\tAssist in Sourcing and Purchasing\n\tVendor Relationship Management\n\tInventory and Stock Management\n\tDocumentation and Record-Keeping\n\tCompliance and Cost Management\n\tMarket Research and Analysis.\n\n\nQualifications\n\n\n\tBachelor’s Degree in Business Administration, Supply Chain Management, or a related field\n\tMinimum of 1-2 years of experience in procurement or supply chain management\n\tProficiency in Microsoft Office Suite and procurement software\n\tStrong negotiation, communication, and organizational skills\n\tAbility to multitask, prioritize, and manage time effectively.\n\n\nKey Competencies:\n\n\n\tAttention to Detail\n\tAnalytical Skills\n\tNegotiation and Persuasion\n\tRelationship Management\n\tAdaptability and Initiative.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV (must be in PDF) to: resumes@ht-limitedng.net using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "IT Executive Job at Ascentech Services Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/it-executive-job-at-ascentech-services-limited-1",
    "pubDate": "Fri, 27 Jun 2025 11:13:38 GMT",
    "source": "JobGurus",
    "keyword": "ascentech services limited",
    "duplicate": false,
    "classifications": [],
    "content": "Ascentech Services Limited is a full-fledged Human Resource Solution Provider incorporated in 2013 with its Head Office in Lagos, Nigeria. We are committed to forging long-term partnerships with our clients by creating and delivering robust and flexible services that address the changing needs of their business.\n\nWe are recruiting to fill the position below:\n\nJob Position: IT Executive\nJob Location: Ibefun, Ogun\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe're seeking an experienced IT Engineer to join our team. The successful candidate will be responsible for designing, implementing, and maintaining our IT infrastructure.\n\n\nKey Responsibilities\n\n\n\tNetwork Management: Design, implement, and manage network infrastructure.\n\tSystem Administration: Manage and maintain servers, databases, and applications.\n\tTroubleshooting: Identify and resolve technical issues.\n\tSecurity: Implement and maintain security measures.\n\tCollaboration: Work with teams to ensure IT solutions meet business needs.\n\n\nRequirements\n\n\n\tBachelor's degree in Computer Science, IT, or related field.\n\t2 - 3 years of experience in IT engineering.\n\tStrong knowledge of networking, system administration, and security.\n\tExcellent problem-solving and communication skills.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: cv@ascentech.com.ng using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Accountant / Accounts Officer Job at Elyon Global Shipping Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/accountant-accounts-officer-job-at-elyon-global-shipping-limited",
    "pubDate": "Fri, 27 Jun 2025 11:13:38 GMT",
    "source": "JobGurus",
    "keyword": "elyon global shipping limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Elyon Global Shipping Limited is a leading logistics and shipping company dedicated to providing tailored freight services that emphasize quick transit times, cost-cutting opportunities and continuous communication. With expertise in air and sea consolidation and forwarding, we offer individually customized solutions to meet the unique needs of our clients. Our team is committed to delivering exceptional service, ensuring seamless transactions and fostering long-term relationships with our partners and customers.\n\nWe are recruiting to fill the position below:\n\nJob Position: Accountant / Accounts Officer\n\nJob Location: Lagos\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tHandle daily financial transactions, ledger updates and reconciliations timely.\n\tPrepare and submit accurate monthly, quarterly and annual financial reports\n\tManage statutory filings such as VAT, PAYE and WHT\n\tMaintain proper accounts payable and receivable processes\n\tAssist in budgeting, forecasting and cost control\n\tEnsure adherence to accounting policies, financial regulations and audit requirements.\n\n\nRequirements\n\n\n\tBachelor’s Degree in Accounting, Finance, or a related discipline\n\t1 year of experience experience in an accounting role (logistics/maritime sector experience is an advantage), NYSC members are also encouraged to apply.\n\tProficient in accounting software such as QuickBooks, Sage, or Zoho Books and Microsoft Packages.\n\tStrong analytical, organizational and communication skills.\n\tICAN or ACCA certification is an added advantage.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hr@elyonship.com and copy info@elyonship.com using “Accountant / Accounts Officer” as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Digital Marketer Job at Aspom Travel Agency",
    "link": "https://www.jobgurus.com.ng/jobs/view/digital-marketer-job-at-aspom-travel-agency-1",
    "pubDate": "Fri, 27 Jun 2025 11:13:38 GMT",
    "source": "JobGurus",
    "keyword": "aspom travel agency",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Aspom Travel Agency was founded on the 2nd of February, 2012 and has remained at the top of its game providing visa assistants, hotels, holiday packages, tours and flight deals to her clients.\n\nWe are recruiting to fill the position below:\n\nJob Position: Digital Marketer\nJob Location: Lekki, Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe arelooking for an experienced Digital Marketing Specialist to join our team.\n\tIn this role, you will be responsible for developing, implementing, and managing online marketing strategies to increase brand awareness, drive traffic, and generate leads.\n\tThe ideal candidate has a strong background in digital marketing, SEO, social media, and analytics.\n\n\nKey Responsibilities\n\n\n\tDevelop and execute digital marketing campaigns across multiple platforms (Google Ads, social media, email, etc.).\n\tManage social media accounts, create content, and engage with followers.\n\tOptimize website content for SEO to improve organic search rankings.\n\tCreate and distribute engaging email marketing campaigns.\n\tConduct market research to identify trends and new marketing opportunities.\n\tPlan and execute paid advertising campaigns (PPC, social media ads, display ads).\n\tAnalyze campaign performance using tools like Google Analytics and provide insights for improvement.\n\tCollaborate with the content and design teams to create compelling marketing materials.\n\tStay updated on industry trends, tools, and best practices.\n\n\nQualifications & Skills\n\n\n\tBachelor’s degree in Marketing, Business, Communications, or a related field.\n\t2+ years of experience in digital marketing.\n\tProficiency in SEO, PPC, Google Ads, and social media marketing.\n\tExperience with marketing tools such as Google Analytics, SEMrush, HubSpot, or similar.\n\tStrong copywriting and content creation skills.\n\tAbility to analyze data and generate actionable insights.\n\tExcellent communication and project management skills.\n\tKnowledge of graphic design tools (Canva, Adobe Suite) is a plus.\n\tCertification in Google Ads, Facebook Blueprint, or HubSpot is an advantage.\n\n\nSalary\nN150,000 per month. \n\nBenefits:\n\n\n\tCompetitive salary with performance-based incentives.\n\tCareer growth and professional development opportunities.\n\tHealth and wellness benefits (if applicable).\n\tA creative and dynamic work environment.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Warehouse Associate Job at Alan & Grant",
    "link": "https://www.jobgurus.com.ng/jobs/view/warehouse-associate-job-at-alan-grant-2",
    "pubDate": "Fri, 27 Jun 2025 11:13:38 GMT",
    "source": "JobGurus",
    "keyword": "alan & grant",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Alan & Grant - Our client is a tech-led platform that connects informal retailers around Africa who retail in Kiosks and other similar retail outlets.\n\nThey are recruiting to fill the position below:\n\nJob Position: Warehouse Associate\n\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tThe ideal candidate will be responsible for fulfilling the logistics behind receiving, processing, and storing inventory according to purchase orders and store policy.\n\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tReceiving and processing incoming stock and materials,\n\tMaintaining and tracking inventory.\n\tFulfilling customer orders correctly.\n\tExamine incoming and outgoing products.\n\tOrganize warehouse space.\n\tProcess, package and ship orders accurately.\n\tOrganize stocks and maintain inventory.\n\tInspect products for defects and damages.\n\tReceive, unload and place incoming inventory items appropriately.\n\tCheck, verify and fill in customer invoices\n\n\nRequirements\n\n\n\t1-2 years of warehouse experience preferred.\n\tB.Sc/HND in any field\n\tExcellent organisational, communication, and teamwork skills.\n\tAbility to work in a fast-paced environment, meeting productivity standards.\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]