[
  {
    "title": "Wells Operations Manager Job at Wendernek Consulting Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/wells-operations-manager-job-at-wendernek-consulting-limited",
    "pubDate": "Fri, 04 Jul 2025 22:42:31 GMT",
    "source": "JobGurus",
    "keyword": "wendernek consulting limited",
    "duplicate": false,
    "classifications": [
      "Software Engineering"
    ],
    "content": "Wendernek Consulting Limited is a leading human resource outsourcing management solutions provider in Nigeria. Our purpose is to provide applied and bespoke solutions to our clients.\n\nWe are recruiting to fill the position below:\n\nJob Position: Wells Operations Manager\n\nJob Location: Port Harcourt, Rivers\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tTo lead, coordinate, and optimize all well-completion operations, ensuring technical excellence, operational efficiency, cost control, and safety compliance.\n\tThe Completion Operations Manager is responsible for planning and executing the installation of downhole equipment, validating completion programs, managing vendors, leading multidisciplinary teams, and ensuring that work scopes are delivered within budget and timeline, within corporate goals and regulatory requirements.\n\n\nKey Roles and Responsibilities\n\n\n\tDesign and implement fit-for-purpose completion-related activities and programs based on client information.\n\tWork with the main contractor to ensure the proper selection of completion techniques based on information from the client.\n\tAlign completion activities with drilling schedules, production forecasts, and asset development plans.\n\tForecast resources, logistics, and equipment required for execution.\n\tManage the end-to-end execution of well completions, including deployment of completion-related equipment.\n\tProvide technical input during critical operations filtration and wellbore cleaning, completion operations etc.\n\tEnsure all completion operations comply with local regulatory requirements, company standards, and international best practices (API, ISO, IADC).\n\tMaintain and review documentation, including programs, risk assessments, HAZOPs, and well files.\n\tChampion a strong HSE culture at all levels of the organization and activities.\n\tConduct and supervise safety drills, toolbox talks, hazard identification, and job safety analysis (JSA).\n\tEnsure permit-to-work and isolation procedures are enforced rigorously.\n\n\nQualifications and Experience\n\n\n\tBachelor’s Degree in Petroleum Engineering, Mechanical Engineering, or a related technical field.\n\t10+ years in Well Engineering, especially well completions, including at least 3 years in a supervisory or management role\n\tMaster’s degree or professional certifications in completions, project management, or HSE (e.g., PMP, IWCF, NEBOSH).\n\tDemonstrated expertise in most types of completions and technologies\n\tStrong track record and history of working in an international service company.\n\tAdvanced knowledge of completion systems.\n\tUnderstanding of reservoir-to-production interface\n\tFamiliarity with engineering software (e.g., WellCat, WELLCAT, Prosper, OpenWells, WellView).\n\n\nSalary\nN1,200,000 - N1,500,000 million naira per month.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: recruitment@wendernek.com using the Job Position as the subject of the email. \n\nNote: This is a hybrid role (Field and Office– with travel to well sites).    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Financial Analyst Job at Unified Payment Services Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/financial-analyst-job-at-unified-payment-services-limited",
    "pubDate": "Fri, 04 Jul 2025 22:42:31 GMT",
    "source": "JobGurus",
    "keyword": "unified payment services limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Unified Payment Services Limited is Nigeria’s premier Payments & Financial Technology company that operates as a shared infrastructure for the banking community in Nigeria and Payments Service Provider within and outside Nigeria, with a vision to be the most preferred e-payment service provider in Africa.\n\nWe are recruiting to fill the position below:\n\nJob Position: Financial Analyst\n\nJob Location: Victoria Island, Lagos\nEmployment Type: Full-time\n\nJob Objectives\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tTo ensure that UP settlement account is always adequately funded to accommodate merchant and stakeholders settlement daily.\n\tEnsure rendition of monthly Income Reports.\n\n\nDuties And Responsibilities\n\n\n\tDaily monitoring of Scheme Receivables - Amount due to UP as licensed Acquirer for both domestic and International transactions (Visa, MasterCard, Amex, CUP and Payattitude).\n\tDaily monitoring of amount due to UP from co-acquirers.\n\tDaily acquirer obligation to merchants.\n\tMonitoring and reporting of daily balances into receivables account for settlement from MasterCard Naira.\n\tMonitoring and reporting daily balances into receivables account for settlement from Visa Naira.\n\tMonitoring and reporting daily balances into receivables account for settlement from various scheme for Dollar transactions.\n\tMonitor and report accuracy of debits into the settlement account in favour of merchants, PTSP, PTO, domestic switches and PTSA.\n\tMonitor and report accuracy of debits into the settlement account in favour ATM settlement.\n\tRevenue Assurance: Recover PTSP and TO Income (Receivable) from Other Settlement Agents- (e.g ISW & Zenith Bank).\n\tReview of MSC charged to merchants and clients.\n\tRecomputation and Assurance of UP's transactional based revenues (PTSP, PTO, Switch, Processing Fee, Acquirer and Acquirer Margin) and other fees charged by UP and collected daily.\n\tManagement Accounts: To ensure that Management obtains timely and consistently relevant financial information for decision making and planning purposes.\n\tRendition of Income Reports to stakeholders in agreed format.\n\tDaily Income Analysis Report.\n\tGL Schedules: To ensure that errors are detected and corrected promptly for specific GL accounts.\n\tAccounting correctly in the GL for all schemes (local and international); Fees deductions prior to the Scheme Net Settlement.\n\tRendition of Receivable reports.\n\tFund recoveries of all single settlement and 2UP disputed merchant transactions.\n\tAccounting correctly in the GL for all Verve transactions scheme receivables.\n\tPreparation of disbursement schedule for social welfare scheme.\n\tAccounting correctly in the GL for revenue earned by UP for all social investment activities’ carried out.\n\tAccounting correctly in the GL for all payment of scheme receivables.\n\tAccounting correctly in the GL for UP as merchant receivables (PayArena) and daily tracker of sales against inventory.\n\tAccounting correctly in the GL for amount due to other PTSPs and PTO (different from UP).\n\tTreasury Function.\n\n\nKey Performance Indicators\n\n\n\t99% accuracy in settlement.\n\tTimeliness of Reports.\n\t100% Documentation\n\n\nJob Requirements\n\n\n\tEducation:First degree in Accounting or any numerate subject.\n\tExperience: 4 - 6 years of post NYSC.\n\tProfessional membership of ICAN/CIMA/ACCA or similar recognized professional accounting bodies - added advantage.\n\n\nKnowledge Knowledge:\n\n\n\tGood Microsoft Excel skills.\n\tPresentation skills.\n\n\nSkill / Competencies:\n\n\n\tComputer skills (Microsoft package).\n\tGood interpersonal skills.\n\tAttention to details.\n\tCritical reasoning and analytical abilities.\n\tGood writing and oral communication & presentation skills\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: judith.okolie@up-ng.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Senior Financial Accountant Job at Infinion Technologies",
    "link": "https://www.jobgurus.com.ng/jobs/view/senior-financial-accountant-job-at-infinion-technologies-1",
    "pubDate": "Fri, 04 Jul 2025 22:42:31 GMT",
    "source": "JobGurus",
    "keyword": "infinion technologies",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Infinion Technologies is a Microsoft certified partner, we offer custom solutions to Enterprise businesses for business automation using the latest and sophisticated technologies. \n\nWe are recruiting to fill the position below:\n\nJob Position: Senior Financial Accountant\n\nJob Location: Victoria Island, Lagos \nEmployment Type: Full-time\n\nAbout the Role\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Senior Financial Accountant will work closely with the CFO to manage and improve the company’s financial health.\n\tThis role requires strong technical accounting skills, attention to detail, and a proactive mindset to support decision-making across the business.\n\n\nKey Responsibilities\n\n\n\tPrepare accurate monthly, quarterly, and annual financial statements in accordance with IFRS.\n\tOversee all general ledger activities and ensure timely reconciliations.\n\tSupport budgeting, forecasting, and financial planning processes.\n\tEnsure compliance with all tax, regulatory, and statutory requirements.\n\tManage internal and external audits, including liaising with auditors and preparing audit documentation.\n\tMonitor cash flow, expenses, and financial performance, providing actionable insights.\n\tAssist in developing and maintaining internal controls, financial policies, and procedures.\n\tProvide support for financial analysis on key business initiatives and investments.\n\tCollaborate with other departments to improve financial processes and reporting.\n\n\nQualifications and Requirements\n\n\n\tBachelor’s Degree in Accounting, Finance, or related field.\n\tMinimum of 7–8 years of relevant experience, preferably in a high-growth or tech-driven environment.\n\tICAN, ACA, or ACCA certification is required.\n\tStrong knowledge of IFRS and local tax laws.\n\tAdvanced proficiency in accounting software (e.g., Sage, QuickBooks, Microsoft Dynamics) and Excel.\n\tExceptional analytical, problem-solving, and organizational skills.\n\tProven ability to work independently and as part of a team in a fast-paced environment.\n\n\nWhat We Offer\n\n\n\tCompetitive salary and performance-based incentives\n\tOpportunity to work in a high-impact, innovation-driven environment\n\tCareer growth and professional development\n\tA collaborative, inclusive company culture.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: careers@infinion.co using “Senior Financial Accountant\" as the subject of the email.\n\nNote: The role is 100% Onsite.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Electrical Engineer Job at Bakery Solutions Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/electrical-engineer-job-at-bakery-solutions-limited-1",
    "pubDate": "Fri, 04 Jul 2025 22:42:31 GMT",
    "source": "JobGurus",
    "keyword": "bakery solutions limited",
    "duplicate": false,
    "classifications": [],
    "content": "Bakery Solutions Limited (Bread Meal) is a bakery located around Ikeja close to Omole Phase 1 Area, its a bakery known for their kind of produts. It has a clean working enviroment and it is well organized.\n\nWe are recruiting to fill the position below:\n\nJob Position: Electrical Engineer\n\nJob Location: Ojodu Berger, Lagos\n\nResponsibilities\n\n\n\tElectrical Installation\n\tWiring\n\tDetecting of electrical fault.\n\tGeneral Maintenance work\n\n\nRequirements\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tInterested candidates should possess a Bachelor's Degree / HND or NCE qualification. \n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: okechukwu.ibem@breadmealng.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Petroleum Engineer III Job at Scruples Resources Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/petroleum-engineer-iii-job-at-scruples-resources-limited",
    "pubDate": "Fri, 04 Jul 2025 22:42:31 GMT",
    "source": "JobGurus",
    "keyword": "scruples resources limited",
    "duplicate": false,
    "classifications": [],
    "content": "Scruples Resources Limited (SRL) is a Premier Oil and Gas Support Services Provider. Established in Lagos, Nigeria, Scruples Resources Limited stands as a distinguished leader in the oil and gas industry. We specialize in delivering comprehensive support services, encompassing consultancy, logistics, procurement, engineering, manpower provisioning, and personnel training.\n\nWe are recruiting to fill the position below:\n\nJob Position: Petroleum Engineer III\nJob Location: Ikoyi, Lagos\nEmployment Type: Contract\n\nMain Functions\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tPetroleum Engineers are involved in the exploration, development and production of oil and gas.\n\tThey provide specialty expertise in oil and gas drilling and completions, reservoir management and production.\n\tRoles vary depending on the operating environment (e.g., land or offshore).\n\n\nTasks and Responsibilities\n\n\n\tEnsuring proper implementation of established reservoir management strategies and surveillance plans including short-term adjustments to cater for operational constraints without compromising longer-term reservoir recovery.\n\tEnsuring that wellbore hydraulic models are accurate, up to date and accessible to Asset Level Team (ALT) technical staff via defined repositories/locations.\n\tCollaborating with multi-functional teams to identify, execute opportunities and optimize well performance.\n\tIdentifying, validating, analysing and uploading pressure data including clarification/validation of Pressure-Volume-Temperature (PVT) assumptions for fluid density, downhole parameters and determination of missing parameters when required.\n\tRecognized as a leader or expert.\n\tInterprets & incorporates industry info and advances.\n\tSound knowledge of other skills & able to apply in several areas.\n\tResponsible for resolving entire complex problems.\n\n\nSkills and Qualifications\n\n\n\tBachelors of Engineering in Petroleum Engineering.\n\tExperience in the upstream / petrochemical / chemical / refinery or a similar industry.\n\tKnowledge of petroleum engineering operations and production methods for oil and natural gas recovery.\n\tKnowledgeable of Reservoir surveillance/modelling, wellbore performance modelling or practical reservoir pressure application such as field surveillance and optimization.\n\tUnderstanding of Production/Well optimization and Artificial Lift system and technology via practical experiences in troubleshooting/diagnostic/optimizing well performance.\n\tFamiliar with Reservoir surveillance, production or hydraulic modelling tools/applications, particularly Integrated Production Modelling (IPM) suite of applications.\n\tFamiliarity Pressure analysis tools/applications, e.g. Kappa Suite of Applications.\n\tAble to work independently in all situations within range of technical expertise.\n\tRecognized as a technical expert in one or more categories.\n\tAlso recognized for their business understanding and history of continuous high value contributions.\n\tApplies innovation broadly.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: info@scruplesresourceltd.com using the Job Position as the subject of the email.\n\nNote\n\n\n\tPlease carefully review the job requirements, skills, and job location before applying. Candidates whose CVs do not align with the job description will be disqualified from the recruitment process.It is essential to pay attention to the job description!\n\tAny candidate who submits their CV without following this instruction will be disqualified and not shortlisted.\n\tImportant: Candidates must have at least 3 years of experience in the oil and gas industry. Any candidates who apply without this experience will have their CVs rejected immediately.\n\tOnly qualified candidates who meet the requirements for this position will be contacted. Therefore, please ensure your CV aligns with the role before applying. Do not apply just for the sake of applying.\n\tTake your time, align your CV with the job requirements and specifications before submitting it. This is very important.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]