[
  {
    "title": "Accountant Job at New Healthway Company",
    "link": "https://www.jobgurus.com.ng/jobs/view/accountant-job-at-new-healthway-company-1",
    "pubDate": "Thu, 03 Jul 2025 11:14:06 GMT",
    "source": "JobGurus",
    "keyword": "new healthway company",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "New Healthway Company (Makers of the MOKO brand of Isopropyl Alchol, Mist Alba, Vitamin C Syrup, Mist Mag. Trisilicate) was incorporated in 1978.\n\nA leading, fully indigenous pharmaceutical company incorporated in Nigeria in 1972. The company started out as importers and distributors of products, before it began manufacturing its own brand of high quality pharmaceutical products under the ‘MOKO’ brand name.\n\nWe are recruiting to fill the position below:\n\nJob Position: Accountant\nJob Location: Nigeria\nEmployment Type: Full-time\n\nExperience and Qualification\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tHND / B.Sc. Degree in Accounting or Finance\n\tMinimum of 2 years experience in similar position with a reputable organization\n\tPossession of ACA or ACCA will be added advantage\n\tMust have working knowledge of Sage and other modern accounting Software\n\tExcellent analytical skills with attention to details.\n\tStrongtime management skills.\n\tAble to analyze details and summarize findings for higher Authorities.\n\tIntegrity, with an ability to handle confidential information.\n\n\nMethod of Application\nInterested and qualified candidates should send their Applications and Curriculum Vitae to: careers@newhealthway.com and copy: emmanuel_david96@yahoo.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Customer Service Representative Job at Myafrimall Logistics Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/customer-service-representative-job-at-myafrimall-logistics-limited-4",
    "pubDate": "Thu, 03 Jul 2025 11:14:06 GMT",
    "source": "JobGurus",
    "keyword": "myafrimall logistics limited",
    "duplicate": false,
    "classifications": [],
    "content": "Myafrimall Logistics Limited is an independent customs broker/customs intermediary dedicated to providing solutions to all customs clearance needs whether import or export.\n\nWe are recruiting to fill the position below:\n\nJob Position: Customer Service Representative\n\nJob Location: Ojodu Berger, Lagos\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tRespond to customer inquiries promptly, providing accurate and comprehensive information about our services.\n\tHandle high-level customer escalations with professionalism and empathy.\n\tContinuously improve service delivery through training, process improvement, and innovation.\n\tCollaborate with logistics, sales, and operations teams to ensure seamless service.\n\tDevelop and implement customer service policies, standards, and procedures.\n\n\nRequirements\n\n\n\tBachelor’s Degree in Business Administration, Logistics, or related field.\n\tMinimum of 2 years of experience in a customer service leadership role.\n\tProficient in customer service software, Microsoft Office Suite, and CRM tools.\n\tExcellent verbal and communication skills.\n\tStrong communication, conflict resolution, and people management skills.\n\tA customer-centric mindset with strong attention to detail.\n\n\nBenefits\n\n\n\tSalary N170,000 - N200,000 Monthly.\n\tA dynamic and fast-paced work environment.\n\tOpportunity to be part of a growing and innovative logistics brand.\n\tCompetitive salary and performance-based bonuses.\n\tProfessional development and growth opportunities.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hr@myafrimall.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Account Manager Job at International Flavors & Fragrances",
    "link": "https://www.jobgurus.com.ng/jobs/view/account-manager-job-at-international-flavors-fragrances-4",
    "pubDate": "Thu, 03 Jul 2025 11:14:06 GMT",
    "source": "JobGurus",
    "keyword": "international flavors & fragrances",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "International Flavors & Fragrances is an industry leader in food, beverage, health, biosciences and sensorial experiences, where science and creativity meet to create essential solutions for a better world – from global icons to unexpected innovations and experiences. With the beauty of art and the precision of science, we are an international collection of thinkers who partner with customers to bring scents, tastes, experiences, ingredients and solutions for products the world craves. Together, we will do more good for people and planet.\n\nWe are recruiting to fill the position below:\n\nJob Position: Account Manager\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Requisition ID: R9666\nJob Location: Lagos\nJob type: Full time (On-site)\n\nJob Summary\n\n\n\tResponsible for driving sustainable profitable sales and market share growth by identifying the customer needs and opportunities, establishing solid customer relationship, leading, coordinating and reporting IFF activities and promoting relevant solutions aligned with corporate strategy. For a defined territory, category, coordinated or global account:\n\tEnsure financial targets are met and business performance is constantly monitored and reported;\n\tDevelop and maintain sustainable relationships with internal and external customers; prepare account plan and report relevant market information;\n\tCollaborate with internal departments to explore innovations and new concepts related to customers’ products and on-going projects;\n\tMonitor market development in terms of competitors, products, and trends; partner with operation team to ensure customer satisfaction in terms of service, quality, and supply.\n\tUnderstand Food Ingredients market and customer ecosystem including activities, strategies, brands, markets\n\tDevelop multi-level cross-functional customer relationships with key customer decision makers/influencers\n\tContribute/lead commercial negotiations (e.g., core listing, annual pricing, payment terms, rebates/cost savings agreements, supply contracts)\n\tMaximize potential advantage to IFF while delivering optimal solutions to customer (GP improvement, catalogue optimization, complexity reduction, etc.)\n\tEnsure customer supply chain requirements, processes and KPIs are well communicated to IFF Operations to ensure we meet customer needs\n\tUnderstand customer regulatory requirements/changes\n\tActs as the main customer point of contact in all matters\n\tDemonstrate IFF Culture Principles and live our values\n\tInfluencing stakeholders to align on shared objectives\n\tLead projects through effective communication, and collaboration with key external and internal stakeholders\n\tEnsure objectives are aligned to the business and personal development plans are in place\n\tDevelop commercial strategy for allocated customer portfolio\n\tBuild and execute account plans successfully\n\tResponsible for setting clear commercial targets (Sales/GP/New Win/Grow Market share) with the Sales Leader\n\tAchieve new wins / grow market / market share aligned with account strategic plan\n\tDefine and suggest the required account resources, investment, and relevant service model to support the account\n\tEffectively communicate the account plans with stakeholders including internal and external team members\n\tReview/update the progress of account plans versus KPI targets\n\tEnsure accurate monthly sales forecast to allow for effective operations planning and financial analysis\n\tConduct retrospective reviews on projects wins and losses\n\tCollaborate and work closely with the Food Ingredients Technical team\n\tEffectively promote the most appropriate IFF product solutions / portfolio aligned with the brief\n\tCommunicate projects on SFDC and conduct retrospective reviews on projects wins and losses\n\tManage volumes/timing expectations and liaise with Operations to ensure supply chain readiness\n\tDefend and grow accounts whilst actively scouting for new customers, transforming leads into profitable business opportunities\n\tAccurately forecast and update sales forecast tool to capture performance vs budget, business risk & opportunities, new wins\n\tMonitor & Provide Account sales performance (monthly / quarterly / annually) and provide strategic project updates to Sales Leader\n\tImplement price increase in line with country/region strategy\n\n\nRequirements\nTraining / Certifications:\n\n\n\tEssential: Bachelor’s Degree / ND Food Technology / Food Science / B.Sc.\n\tAdded Advantage: Degree Business, Marketing\n\n\nExperience:\n\n\n\tApproximately +7 years of experience in sales in the Food Ingredients industry\n\tStrong track record in commercial\n\n\nSkills:\n\n\n\tCustomer centric with B2B management experience\n\tAnalytical with the ability to deal with financial concepts/processes(pricing/margin/forecasting)\n\tCreative and innovative thinking\n\tProject management with effective collaboration and orchestration skills\n\tStrong communication, presentation, storytelling, and negotiation skills\n\tEffective business English with a global mindset and ability to work with different cultures\n\tAbility to gather and leverage competitive market intelligence\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Marketing Operations Manager Job at Chellarams Nigeria Plc",
    "link": "https://www.jobgurus.com.ng/jobs/view/marketing-operations-manager-job-at-chellarams-nigeria-plc",
    "pubDate": "Thu, 03 Jul 2025 11:14:06 GMT",
    "source": "JobGurus",
    "keyword": "chellarams nigeria plc",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Chellarams Nigeria Plc is the pioneering group that brought KFC to Nigeria, brings another top retail brand to the country. Do you imagine working for a company that is one of the best, trusted and respected African retail brand? Now is your opportunity. \n\nWe are recruiting to fill the position below:\n\nJob Position: Marketing Operations Manager\nJob Location: Isolo, Lagos\nEmployment Type: Full-time\nDepartment: Marketing\nReports To: Head of Marketing\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a detail-oriented and highly organized Marketing Operations Manager to be a cornerstone of our newly reactivated marketing department. This role will be instrumental in the execution and optimization of B2B marketing initiatives specifically for Chellarams Plc, Dynamic Industries Limited, and United Technical & Allied Services Limited.\n\tYou will focus on building efficient processes, managing marketing technology, and ensuring the smooth operation of digital and traditional campaigns that contribute to brand awareness, lead generation, and overall marketing effectiveness across our diverse B2B product lines (Air Compressors, Material Handling, Chemicals, and Shrink/Stretch Wrap).\n\tThis is a foundational role, ideal for someone eager to build systems and contribute directly to establishing a robust marketing framework within a developing digital landscape.\n\n\nKey Responsibilities (Year 1 Focus)\n\n\n\tMarketing Infrastructure & Process Management: Assist the Head of Marketing in setting up and managing core marketing systems and processes (e.g., CRM integration, marketing automation workflows, and email templates). Ensure seamless operation and data flow across various marketing tools. Contribute to establishing best practices for digital asset management and campaign execution\n\tEmail Marketing Operations: Manage the end-to-end operational aspects of B2B email marketing campaigns (newsletters, promotional emails, product updates, event invitations). This includes list segmentation, deployment scheduling, and ensuring data accuracy and compliance within the newly established CRM. Monitor campaign performance (open rates, click-through rates, conversions) and provide detailed reports\n\tDigital Presence Management (B2B Focus): Take a lead role in the day-to-day management and optimisation of the company's LinkedIn Company Pages for B2B engagement, including rectifying the UTAS profile to a company page and establishing a presence for Dynamic Industries. Assist with content scheduling, performance tracking, and identifying opportunities for improvement across all B2B social media. Support content updates, maintenance, and basic SEO optimization of the company's B2B websites (Chellarams Plc, UTAS, and the new Dynamic Industries site).\n\tPromotional & Collateral Production: Coordinate the design, production, inventory, and distribution of B2B promotional items (e.g., brochures, flyers, giveaways, exhibition materials). Ensure all marketing collateral adheres to brand guidelines. Manage relationships with suppliers for printing and merchandise.\n\tEvent Logistical Support: Provide comprehensive logistical support for B2B events, trade shows, and webinars. This includes assisting with pre-event promotions, attendee registration, material preparation, and post-event follow-up.\n\tMarketing Data & Reporting: Track marketing expenses and budgets. Assist in gathering, analysing, and reporting on the performance of various B2B marketing campaigns and activities, contributing to the development of regular marketing performance reports for the Head of Marketing.\n\tAdministrative Support: Provide general administrative support to the Marketing Department as required, ensuring marketing calendars and deadlines are managed effectively.\n\n\nCurrent Digital Presence Landscape:\n\n\n\tWebsites: Chellarams Plc and United Technical & Allied Services (UTAS) currently maintain existing websites that need significant updates and optimisation. Dynamic Industries Limited, however, lacks a dedicated online presence, with only a rudimentary landing page hosted within the Chellarams Plc website; a new, standalone website is required for Dynamic Industries.\n\tSocial Media: The group's social media presence is inconsistent and requires substantial development.\n\tLinkedIn: While Chellarams Plc has an established company page with approximately 2,000 followers, UTAS's presence is limited to a personal profile that needs to be formally converted into an official company page. Dynamic Industries Limited currently has no official LinkedIn presence.\n\tInstagram: Only UTAS maintains an Instagram account, which is largely inactive, showing only six posts and three followers, with the last update dating back to August 2023.\n\tFacebook: The group has no official corporate presence on Facebook, with the only activity being related to the NCCES initiative (a CSR Foundation).\n\tWhatsApp Business: There are currently no official WhatsApp Business accounts established for any of the businesses within the group.\n\tCRM: A CRM solution for the three businesses is currently being selected and implemented; this role will assist with its integration and ongoing use from a marketing operations perspective.\n\tLead Generation: Existing lead generation is primarily through sales teams performing customer mapping and obtaining direct introductions through the corporate leadership team.\n\n\nQualification\nEssential:\n\n\n\tDiploma or Degree in Marketing, Business Administration or a related field, OR equivalent demonstrable professional experience.\n\t3-5 years of experience in a marketing support, coordinator, or operations role, preferably within a B2B environment, with experience in a developing or foundational marketing function.\n\tDemonstrable familiarity with digital marketing concepts (SEO, SEM, social media marketing, email marketing platforms).\n\tProficiency in Microsoft Office Suite (Word, Excel, PowerPoint).\n\n\nDesirable:\n\n\n\tExperience with specific CRM or marketing automation platforms (e.g., HubSpot, Salesforce).\n\tStrong analytical skills with experience in basic data reporting.\n\tExperience managing supplier relationships.\n\tUnderstanding of brand consistency principles.\n\n\nCore Competencies & Soft Skills:\n\n\n\tOrganisational Excellence: Highly organised with meticulous attention to detail, capable of managing multiple tasks and deadlines in a dynamic environment.\n\tProblem-Solving: Proactive in identifying and resolving operational challenges.\n\tCollaboration: Strong interpersonal skills with the ability to work effectively within a team and coordinate with various stakeholders.\n\tCommunication: Excellent written and verbal communication skills for clear internal and external interactions.\n\tAdaptability: Eager to learn and adapt to new technologies and processes in a developing department, comfortable with building systems from scratch.\n\tInitiative: A self-starter who can work independently and take ownership of tasks, demonstrating a proactive approach to operational improvements.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hr@chellaramsplc.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Senior Software Engineer - Packaging - Optimize Ubuntu Server Job at Canonical Nigeria",
    "link": "https://www.jobgurus.com.ng/jobs/view/senior-software-engineer-packaging-optimize-ubuntu-server-job-at-canonical-nigeria",
    "pubDate": "Thu, 03 Jul 2025 11:14:06 GMT",
    "source": "JobGurus",
    "keyword": "canonical nigeria",
    "duplicate": false,
    "classifications": [
      "Software Engineering"
    ],
    "content": "(adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\nCanonical - We deliver open source to the world faster, more securely, and more cost-effectively than any other company. We develop Ubuntu, the world’s most popular enterprise Linux from cloud to edge, together with a passionate global community of 200,000 contributors. Ubuntu means 'humanity to others. We chose it because it embodies the generosity at the heart of open source, the new normal for platforms and innovation. Together with a community of 200,000, we publish an operating system that runs from the tiny connected devices up to the world's biggest mainframes, the platform that everybody uses on the public cloud, and the workstation experience of the world's most productive developers. Secure and reliable, elegant and intuitive, and open for innovation - Ubuntu is the future of open source, which is why it's the fastest-growing Linux in the world despite already being the most widely deployed.\n\nWe are recruiting to fill the position below:\n\nJob Position: Senior Software Engineer - Packaging - Optimize Ubuntu Server\n\nJob Location: Lagos\nJob type: Full time\n\nThe role entails\n\n\n\tCollaborating proactively within a distributed team\n\tFostering a software ecosystem with seamless user experience for all Ubuntu users\n\tEvaluating contributions of other engineers to maintain high-quality software standards.\n\tPlaying a role in shaping the future of Ubuntu via both - new ideas in your areas of interest and advising on work being done elsewhere\n\tCollaborating with other teams in the Ubuntu and Debian communities, with upstream projects, and commercially supported customers\n\tOwning the maintenance of Ubuntu Server packages. Specifically but not limited to:\n\t\n\t\tTraditional server workloads (web servers, databases, network services, etc)\n\t\tVirtualisation and Containers\n\t\tPackage management and dependencies\n\t\tLanguage runtimes and toolchains\n\t\tWork from home with global travel 2 to 4 weeks for internal and external events\n\t\n\t\n\n\nWhat we are looking for in you\n\n\n\tYou have a Bachelor’s or equivalent in Computer Science, STEM or similar degree (or any higher) or equivalent professional experience (5+ years of professional experience).\n\tYou love technology and working with brilliant people\n\tYou are curious, flexible, articulate, and accountable\n\tYou value soft skills and are passionate, enterprising, thoughtful, and self-motivated\n\tInterest or experience in open source maintenance or contributions\n\tAble to replay complex workloads and systems. Able to write detailed test plans and reproducibility steps.\n\tFeel comfortable contributing and debugging many languages such as C/C++, Python, Rust, Go, Ruby, PHP\n\tExperience in packaging in one or more ecosystems. This could be language specific systems (Python wheels, Rust Crates, Go Modules, or other equivalent) or any distro package format (deb, rpm, NixOS, or other equivalent).\n\tExperience using and creating containers and virtual machines.\n\n\nWhat we offer colleagues\n\n\n\tWe consider geographical location, experience, and performance in shaping compensation worldwide.\n\tWe revisit compensation annually (and more often for graduates and associates) to ensure we recognise outstanding performance.\n\tIn addition to base pay, we offer a performance-driven annual bonus.\n\tWe provide all team members with additional benefits, which reflect our values and ideals.\n\tWe balance our programs to meet local needs and ensure fairness globally.\n\tDistributed work environment with twice-yearly team sprints in person\n\tPersonal learning and development budget of USD 2,000 per year\n\tAnnual compensation review\n\tRecognition rewards\n\tAnnual holiday leave\n\tMaternity and paternity leave\n\tEmployee Assistance Programme\n\tOpportunity to travel to new locations to meet colleagues\n\tPriority Pass, and travel upgrades for long haul company    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]