[
  {
    "title": "Director, Procurement Job at Federal Polytechnic, Bida.",
    "link": "https://www.jobgurus.com.ng/jobs/view/director-procurement-job-at-federal-polytechnic-bida",
    "pubDate": "Wed, 11 Jun 2025 12:32:44 GMT",
    "source": "JobGurus",
    "keyword": "federal polytechnic, bida.",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "Federal Polytechnic, Bida was established in 1977 following a decision of the Federal Government of Nigeria to move the institution to Bida. Before then, it was the Federal College of Technology, Kano.\n\nThe first academic session started in April, 1978 with a population of 211 students and 11 senior staff, and 33 junior staff. Federal Polytechnic, Bida is a Federal Government tertiary institution situated in Bida, Niger State, Nigeria. Currently, there are seven faculties in the institution.\n\nApplications are invited from suitably qualified candidates to fill the vacant position below:\n\nJob Position: Director, Procurement\n\nJob Location: Niger\n\nDuties\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tIn-charge of purchases and supplies in the Polytechnic, creating and implementing procurement policies and maintaining vendor relationships.\n\tOverseeing logistics, planning and purchasing to ensure the consistency, cost effectiveness, efficiency and adequacy of the procurement process\n\tResponsible for overseeing and facilitating the purchasing strategy, supervising teams of subordinates staff in purchasing and ensuring all employees and processes meet the standards and designations for work quality.\n\tNegotiating contracts and service agreements with suppliers\n\tForecasting price trends and prediction\n\tMaintaining in-depth knowledge of the market to ensure best value and practices are maintained.\n\tDeveloping a procurement plan and ensuring that it is clearly communicated\n\tForecasting ongoing demand for goods and services\n\tMonitor, review and analyze bids and quotes with suppliers, works and including the negotiation nof service agreement and contracts\n\tOversee sources for purchasing supplies\n\tMaintain budget and streamline costs.\n\n\nQualifications and Experience\n\n\n\tApplicant must possess good Bachelor's Degree/HND (minimum of second class lower/Lower Credit) in Business Administration, Accounting, Marketing, Purchasing and Supply/Procurement and Supply Chain, Quantity Surveying, Banking and Finance, Law, Insurance, Economics or any other relevant discipline with at least 18 years of post academic qualification cognate work experience or a Master's Degree with at least 15 years post academic qualification cognate work experience, and must have a Bureau of Public Procurement conversion/Induction Certificate.\n\tMust be a person of high integrity who demonstrates transparency in public and private lives and is expected to command the respect and loyalty of staff of the Polytechnic.\n\tHe/She must also be receptive to new ideas and willing to translate the them into action in line with the visions and missions of the Polytechnic.\n\tMust be a registered member of Institute of Public Procurement Practitioners and any other relevant professional bodies for a minimum of five (5) years.\n\tMust provide evidence of sustained professional practice and/or administrative leadership.\n\tMust be conversant with the business of Public Procurement Procedures and guidelines\n\tMust show evidence of involvement in construction and project management\n\tMust be able to work under pressure and meet short deadlines.\n\n\nTerms of Appointment and Conditions of Service\n\n\n\tThe appointment is for a single tenure of five years and no more.\n\tThe salary for the position is consolidated while other terms and conditions of appointment are as provided by the conditions of service of the Federal Polytechnics in Nigeria and as may be determined from time to time by the Federal Government of Nigeria or the Governing Council of the Polytechnic.\n\tThe appointee shall enjoy other benefits of office, as may be approved from time to time by the Federal government.\n\n\nMethod of Application\nInterest and qualified candidates should submit twenty (20) typewritten copies of their Curriculum Vitae, giving the details in the following order:\n\n\n\tFull Name\n\tPlace and Date of Birth\n\tState of Origin/Local Government Area\n\tNationality\n\tCurrent Postal Address\n\tE-Mail Address and Phone Number\n\tMarital Status\n\tEducational Institutions attended with dates\n\tAcademic Qualifications obtained with dates\n\tMembership of Professional bodies with dates\n\tPresent employer\n\tPositions held and dates\n\tExtra-curricular activities\n\tA statement of his or her own vision for the Polytechnic in the 21st Century.\n\tNames and addresses of three referees (Employer, Educational and Personal) who should be able to attest to the candidate's claim to high academics, managerial, leadership capabilities, and their notable uprightness.\n\n\nApplications are to be submitted in a sealed envelope and marked \"Application for the post of Director, Medical Services\" to:\nThe Registrar,\nThe Federal Polytechnic, Bida,\nP. M. B. 55,\nNiger State.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Human Resources Business Partner (HRBP) Job at JNO Integrated Services",
    "link": "https://www.jobgurus.com.ng/jobs/view/human-resources-business-partner-hrbp-job-at-jno-integrated-services",
    "pubDate": "Wed, 11 Jun 2025 12:32:44 GMT",
    "source": "JobGurus",
    "keyword": "jno integrated services",
    "duplicate": false,
    "classifications": [],
    "content": "JNO Integrated Services is a dynamic HR consultancy firm dedicated to helping businesses build strong, efficient, and compliant workforces. We specialize in providing tailored HR solutions, including talent acquisition, employee training, performance management, and HR advisory services. Our team of experts is committed to aligning HR strategies with business goals, ensuring that our clients have the right talent and systems in place to thrive in today’s competitive market.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nAt JNO Integrated Services, we understand the complexities of managing people and the importance of compliance with labor laws. We provide strategic guidance and operational support, empowering organizations to maximize employee potential and drive growth. Whether you’re a small business looking to scale or a large corporation seeking to streamline HR processes, we’re here to deliver results.\n\nWe are recruiting to fill the position below:\n\nJob Position: Human Resources Business Partner (HRBP)\n\nJob Location: Abuja (FCT)\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tThe HR Business Partner will act as a strategic advisor to management, championing HR initiatives that foster a productive, engaged, and compliant workplace.\n\tYou will support business leaders in workforce planning, talent management, performance development, employee relations, and organizational development.\n\n\nJob Description\n\n\n\tPartner with department heads to understand business objectives and develop tailored HR solutions\n\tLead talent acquisition efforts, ensuring timely and quality hires\n\tDrive performance management processes, including goal setting, feedback, and appraisals\n\tAnalyze HR metrics to influence data-driven decisions and continuous improvement\n\tProvide guidance on employee relations, conflict resolution, and disciplinary actions\n\tEnsure compliance with labor laws, HR policies, and best practices\n\tIdentify training and development needs and support implementation\n\tSupport change management and organizational design initiatives\n\n\nRequirements\n\n\n\tBachelor’s Degree in Human Resources, Business Administration, or a related field (Master’s degree is an advantage)\n\t5+ years of progressive HR experience, with at least 1 years in a business partnering role\n\tStrong knowledge of employment laws and HR best practices\n\tProven experience in talent management, employee relations, and performance development\n\tExcellent interpersonal, problem-solving, and communication skills\n\tAbility to work strategically while managing operational HR tasks.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: recruitment.jnoservices@gmail.com using \"HR Business Partner – Abuja\" as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Openings at Jules Construction",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-jules-construction",
    "pubDate": "Wed, 11 Jun 2025 12:32:44 GMT",
    "source": "JobGurus",
    "keyword": "jules construction",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Jules Construction Is a construction company with key speciality in home and office improvements/Renovation.With qualified and certified engineers in steel works as well as building construction we are determined to make the experience and process of building to be a memorable one\n\nWe are recruiting to fill the following positions below:\n\n1.) Office Manager\n\nJob Location: Shogunle, Lagos\nEmployment Type: Full-time\n\nResponsibilities\nServe as the point person for office manager duties including:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tMaintenance\n\tMailing\n\tSupplies\n\tEquipment\n\tBills\n\tErrands\n\tShopping\n\tSchedule meetings and appointments\n\tOrganize the office layout and order stationery and equipment\n\tMaintain the office condition and arrange necessary repairs\n\tPartner with HR to update and maintain office policies as necessary\n\tOrganize office operations and procedures\n\tCoordinate with IT department on all office equipment\n\tEnsure that all items are invoiced and paid on time\n\tManage contract and price negotiations with office vendors, service providers and office lease\n\tManage office G&A budget, ensure accurate and timely reporting\n\tProvide general support to visitors\n\n\nRequirements and Skills\n\n\n\tProven experience as an Office Manager, Front Office Manager or Administrative Assistant\n\tKnowledge of Office Administrator responsibilities, systems and procedures\n\tProficiency in MS Office (MS Excel and MS Outlook, in particular)\n\tExcellent time management skills and ability to multi-task and prioritize work\n\tAttention to detail and problem solving skills\n\tHands on experience with office machines (e.g. fax machines and printers)\n\tFamiliarity with email scheduling tools, like Email Scheduler and Boomerang\n\tExcellent written and verbal communication skills\n\tStrong organizational and planning skills in a fast-paced environment\n\tA creative mind with an ability to suggest improvements.\n\n\nSalary\nN150,000 - N250,000 / Month.\n\nApplication Closing Date: 20th June, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: portal.julesconst.net@gmail.com using the Job Position as the subject of the mail.\n\n \n\n \n\n2.) Administrative officer\n\nJob Location: Shogunle, Lagos\nEmployment Type: Full-time\n\nResponsibilities\n\n\n\tManage office supplies stock and place orders\n\tPrepare regular reports on expenses and office budgets\n\tMaintain and update company databases\n\tOrganize a filing system for important and confidential company documents\n\tAnswer queries by employees and clients\n\tDistribute and store correspondence (e.g. letters, emails and packages)\n\tPrepare reports and presentations with statistical data, as assigned\n\tUpdate office policies as needed\n\tMaintain a company calendar and schedule appointments\n\tBook meeting rooms as required\n\tArrange travel and accommodations\n\tSchedule in-house and external events\n\n\nRequirements and skills\n\n\n\tHigh school diploma; additional qualifications in Office Administration are a plus\n\tProven work experience as an Administrative Officer, Administrator or similar role\n\tSolid knowledge of office procedures\n\tExperience with office management software like MS Office (MS Excel and MS Word, specifically)\n\tStrong organization skills with a problem-solving attitude\n\tExcellent written and verbal communication skills\n\tAttention to detail\n\n\nSalary\nN100,000 - N150,000 / Month.\n\nApplication Closing Date: 20th June, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: portal.julesconst.net@gmail.com using the Job Position as the subject of the mail.\n\n \n\n3.) Civil Engineer\n\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tA Civil Engineer manages construction projects, conducts site investigations, assesses risks, and ensures safe project completion. \n\tThey collaborate with stakeholders, provide technical expertise, and oversee structure implementation. Strong project management, communication, and engineering skills are essential. Experience, a professional license\n\n\nResponsibilities\n\n\n\tManage, design, develop, create and maintain small-scale through to large-scale construction projects in a safe, timely and sustainable manner\n\tConduct on site investigations and analyze data (maps, reports, tests, drawings and other)\n\tCarry out technical and feasibility studies and draw up blueprints that satisfy technical specifications\n\tAssess potential risks, materials and costs\n\tProvide advice and resolve creatively any emerging problems/deficiencies\n\tOversee and mentor staff and liaise with a variety of stakeholders\n\tHandle over the resulting structures and services for use\n\tMonitor progress and compile reports in project status\n\tManage budget and purchase equipment/materials\n\tComply with guidelines and regulations including permits, safety etc and deliver technical files and other technical documentation as required.\n\n\nRequirements\n\n\n\tCandidates should possess an OND / HND / B.Sc Degree with 2 - 8 years of work experience.\n\n\nSalary\nN150,000 - N200,000 Monthly.\n\nApplication Closing Date: 14th June, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: portal.julesconst.net@gmail.com using the Job Position as the subject of the mail.\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]