[
  {
    "title": "Business Development Analyst Job at MacTay Consulting",
    "link": "https://www.jobgurus.com.ng/jobs/view/business-development-analyst-job-at-mactay-consulting",
    "pubDate": "Wed, 02 Jul 2025 15:42:54 GMT",
    "source": "JobGurus",
    "keyword": "mactay consulting",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "MacTay Consulting is one of the first and leading management consulting firms in Nigeria, providing HR services to our clients in Africa since 1982. We focus on adding value to organisations through customized solutions that meet our clients’ needs. We have a proven track record of providing excellent services that impact our clients’ businesses.\n\nWe are recruiting to fill the position below:\n\nJob Position: Business Development Analyst\n\nJob Location: Lagos \nEmployment Type: Full-time\nIndustry: Telecommunication\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWork closely with the Value Delivery Manager to drive Innovation by identifying and taking advantage of new business opportunities, e.g., by stimulating and encouraging new business opportunities, launch of products, product/process innovation, business model innovation etc.\n\tSet up and run the department’s execution engine from ideation to business case, through implementation and post-mortem assessment\n\tSupport strategic projects that will position the organization and provide new growth levers.\n\tEstablish effective project communication plans and ensure execution.\n\tUse relevant metrics and measures to routinely monitor progress against targets and propose appropriate strategies to drive ownership and accountability\n\tCollaborate with other business units in the development of business models for use in the organization and develop measurement strategies to support ongoing strategy development and project optimization.\n\tEnsure marketing roadmap and initiatives are aligned with overall commercial strategy and KPIs across departments\n\tProvide periodic high-level view/report on key projects and surface any barriers or management support required\n\tCollaborate with cross-functional teams to ensure that all parties are on track with project requirements, deadlines, and schedules\n\tNetwork and build solid relationships with internal units and relevant third parties (e.g. strategic investors, technical and finance partners, business consultants etc.) and develop a close working relationship with relevant information sources to provide an integrated service.\n\tDrive an increase in the organization’s Net Promoter Scorethrough Value Delivery\n\tMonitor and report on ongoing projects, identifying areas for improvement.\n\tStay up to date with industry trends, emerging technologies, and regulatory changes consistently evolving, and enhancing service integration strategies.\n\tAnalyze and track key performance indicators, including user engagement, revenue growth, and partner satisfaction, and presents findings to senior management for alignment and execution.\n\tPerform adhoc analysis as will be assigned by the line manager from time to time.\n\n\nRequirements\n\n\n\tBachelor’s Degree in a related field\n\t2 - 3 years of experience\n\tExcellent communication and interpersonal skills\n\tProficiency in data analysis and a good critical thinker.\n\n\nSalary\nN350,000 monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: recruitment@mactay.com using the Job Position as the subject of the mail.\n\nNote: Only qualified candidates will be contacted.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Purchasing Officer Job at Médecins Sans Frontières",
    "link": "https://www.jobgurus.com.ng/jobs/view/purchasing-officer-job-at-médecins-sans-frontières-5",
    "pubDate": "Wed, 02 Jul 2025 15:42:54 GMT",
    "source": "JobGurus",
    "keyword": "médecins sans frontières",
    "duplicate": false,
    "classifications": [],
    "content": "Customer Service Representative (B2B) Job at Pharmarun            \n        \n\n        \n            \n\n                        Pharmarun  \n            \n                         Customer Service  \n             \n                         Lagos\n                            \n        \n\n        Pharmarun is an on-demand platform providing fast and easy access to medication. We do this by finding, financing and delivering medication to users. We are recruiting to fill the position below: Job…\n    \n\n    \n        Apply\n        2nd July, 2025",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Customer Care Officer Job at Vixa Pharmaceutical Company Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/customer-care-officer-job-at-vixa-pharmaceutical-company-limited-2",
    "pubDate": "Wed, 02 Jul 2025 15:42:54 GMT",
    "source": "JobGurus",
    "keyword": "vixa pharmaceutical company limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Vixa Pharmaceutical Company Limited was founded by Chief Sir Ebuka Okafor, an entrepreneur with vast experience in the pharmaceutical industry. Vixa Pharmaceutical Co Ltd has come of age with an imposing record of over 10 years meeting the needs of sick and needy through a range of globally sourced, best-in-their-class life saving medicines. Our range of pharmaceutical products include critical care, super specialty products covering the categories of Anti-Malarial, Anti-Biotic, Anti-Fungal, Anti-Emetic, Steroid, NSAID drugs, Anti-Spasmodic, Anti-Hypertensive, Worm Expellant, Anti-Hastimine and Anti-Psychotic drugs.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nToday, Vixa Pharmaceutical Co Ltd. is a house hold name with diverse marketing activities all over Nigeria and with a staff strength of over 150. Our major partners are mainly from China and India and we have over 100 registered products with NAFDAC. We are poised for the future in the mission to be the leading pharmaceutical company in Nigeria through the provision of world class services to our customers and other stakeholders and the vision to be the largest manufacturer of drugs in the whole of West Africa.\n\nWe are recruiting to fill the position below:\n\nJob Position: Customer Care Officer \n\nJob Location: Abuja (FCT)\nEmployment Type: Full-time\n\nResponsibilities\n\n\n\tCustomer Support:\n\t\n\t\tRespond promptly and professionally to customer inquiries via phone, email, chat, or other communication channels.\n\t\tListen attentively to customer concerns, assess their needs, and provide accurate and helpful information or assistance.\n\t\tResolve customer issues or complaints efficiently and effectively, escalating complex issues to appropriate departments or supervisors as needed.\n\t\n\t\n\tProduct Knowledge and Education:\n\t\n\t\tDevelop a deep understanding of our products or services to provide knowledgeable support and guidance to customers.\n\t\tEducate customers on product features, usage, and troubleshooting techniques to enhance their experience and maximize product satisfaction.\n\t\tProvide product demonstrations or tutorials to assist customers in utilizing our offerings effectively.\n\t\n\t\n\tRelationship Building:\n\t\n\t\tBuild rapport and establish positive relationships with customers by demonstrating empathy, patience, and professionalism in every interaction.\n\t\tProactively engage with customers to gather feedback, address concerns, and identify opportunities to exceed expectations.\n\t\tFollow up with customers to ensure that their issues have been resolved satisfactorily and inquire about their overall satisfaction with our products or services.\n\t\n\t\n\tProcess Improvement:\n\t\n\t\tIdentify recurring customer issues or pain points and collaborate with internal teams to develop solutions and improve processes.\n\t\tContribute to the development of knowledge bases, FAQs, or self-service resources to empower customers to find answers independently.\n\t\tShare customer feedback and insights with relevant stakeholders to drive continuous improvement and innovation in our products, services, and customer support practices.\n\t\n\t\n\tQuality Assurance:\n\t\n\t\tMaintain high standards of service quality and adherence to established service level agreements (SLAs) and performance metrics.\n\t\tConduct quality assessments of customer interactions to ensure consistency, accuracy, and compliance with company policies and procedures.\n\t\tProvide feedback and coaching to team members to help them improve their customer service skills and performance.\n\t\n\t\n\n\nQualifications\n\n\n\tBachelor's Degree in Business Administration, Communications, Hospitality, or related field preferred.\n\tProven experience 2 years in customer service, preferably in a customer-facing role or call center environment.\n\tExcellent communication skills, both verbal and written, with the ability to convey information clearly, concisely, and professionally.\n\tStrong interpersonal skills and the ability to build rapport and connect with customers from diverse backgrounds.\n\tProblem-solving abilities and the capacity to remain calm and composed under pressure.\n\tProficiency in using customer relationship management (CRM) software and other relevant tools.\n\tFlexibility to work in a dynamic and fast-paced environment, including evenings, weekends, or holidays as needed.\n\tCommitment to delivering exceptional customer service and a passion for helping others.\n\n\nMethod of Application\nInterested and qualified candidates should forward their CV and Cover Letter to: pharmarecruitment2online@gmail.com using the Job Position as the subject of the email.\n\nNote: Only Shortlisted candidate will be reached.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Head of Service Management Job at Hoop Telecoms Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/head-of-service-management-job-at-hoop-telecoms-limited-1",
    "pubDate": "Wed, 02 Jul 2025 15:42:54 GMT",
    "source": "JobGurus",
    "keyword": "hoop telecoms limited",
    "duplicate": false,
    "classifications": [],
    "content": "Hoop Telecoms Limited was established in 2017 as a full Telecommunications Service provider. Since its formation, Hoop Telecoms has been growing rapidly and is emerging as a leading provider of telecommunication and business solutions. Our goal is to be the telecom company of choice for voice, video, and data for consumers in Nigeria, West Africa, Africa, and globally. Simply put; our vision is global.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nHOOPTEL is led by a strong management team with knowledge and extensive experience in the telecom industry, and other professionals with strong administrative skills and experience. We are primarily focused on delivering solutions to customers in Enterprise networks connectivity, Broadband internet services, Voice communication solutions, Video and secured data solutions, Data Centre and co-location services, managed cloud services, and other related telecommunication systems.\n\nWe are a company driven to provide our customers with solutions that are customized to fit their current needs, yet flexible enough to accommodate their growth plans, at the most competitive pricing on all service offerings, thus optimizing IT spend and future proofing of our solutions.\n\nWe are recruiting to fill the position below:\n\nJob Position: Head of Service Management\n\nJob Location: Ilupeju / Gbagada, Lagos\nEmployment Type: Part-time\nReports To: Managing Director\nCompany: Hoop Telecoms Limited\n\nJob Purpose\n\n\n\tTo provide strategic leadership and direction for the Service Management function, ensuring the delivery of high-quality services that meet customer expectations, align with business goals, and drive operational efficiency.\n\tThe role oversees customer experience, service delivery, incident management, change and problem management, and ensures adherence to SLAs across all technical and operational touchpoints.\n\n\nKey Responsibilities\nStrategic Leadership & Service Governance:\n\n\n\tDevelop and implement service management strategies aligned with corporate goals and customer expectations.\n\tDefine, monitor, and report on KPIs for service delivery, customer satisfaction, and operational efficiency.\n\tOversee the establishment and continuous improvement of ITIL-based service management processes.\n\tLead service reviews and governance forums with internal teams and clients.\n\n\nService Operations & Delivery:\n\n\n\tEnsure consistent and high-quality delivery of telecom services across voice, data, and enterprise products.\n\tOversee Incident, Problem, and Change Management to ensure prompt resolution and minimal disruption.\n\tManage SLA and OLA compliance with internal teams, vendors, and customers.\n\tLead the Service Delivery team to ensure accurate provisioning, monitoring, and troubleshooting of services.\n\n\nCustomer Experience & Relationship Management:\n\n\n\tAct as the escalation point for major service issues and customer complaints.\n\tDrive initiatives to enhance customer experience, service performance, and satisfaction.\n\tEstablish and maintain strong relationships with key enterprise clients, partners, and stakeholders.\n\n\nPerformance Monitoring & Reporting\n\n\n\tImplement and oversee real-time monitoring of network and service performance.\n\tDevelop dashboards and analytics to provide visibility into service health and trends.\n\tPrepare regular reports for the Managing Director and executive leadership on service performance.\n\n\nTeam Leadership & Development:\n\n\n\tLead, mentor, and manage the Service Management and Support teams.\n\tBuild a performance-driven culture focused on accountability, quality, and continuous improvement.\n\tConduct regular training and capacity-building for team members on industry best practices and tools.\n\n\nQualifications and Experience\n\n\n\tBachelor’s Degree in Telecommunications, Engineering, Computer Science, or related field. Master’s degree or MBA is an advantage.\n\tMinimum of 8 - 10 years of relevant experience in service management within the telecommunications industry, with at least 3 years in a leadership role.\n\tITIL Foundation or higher certification is required.\n\tProven track record of managing service operations, SLAs, and customer experience in telecoms.\n\tStrong understanding of telecom infrastructure (ISP, fiber, VoIP, B2B connectivity, etc.).\n\tExperience working with service desk software, monitoring tools, and CRM systems.\n\n\nKey Competencies:\n\n\n\tStrong leadership, interpersonal, and communication skills.\n\tStrategic thinker with the ability to translate strategy into execution.\n\tExcellent problem-solving and decision-making skills.\n\tCustomer-oriented with a passion for delivering quality service.\n\tAbility to thrive in a fast-paced and evolving environment.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hr@hooptelecoms.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Administrative Officer Job at Techdoctorinnovations",
    "link": "https://www.jobgurus.com.ng/jobs/view/administrative-officer-job-at-techdoctorinnovations",
    "pubDate": "Wed, 02 Jul 2025 15:42:54 GMT",
    "source": "JobGurus",
    "keyword": "techdoctorinnovations",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Techdoctorinnovations - Our client in a beauty and spa business, is recruiting to fill the position below:\n\nJob Position: Administrative Officer\n\nJob Location: Bonojo, Ijebu Ode - Ogun\nEmployment Type: Full-time\n\nKey Roles\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tSupervise day-to-day operations across all departments (spa service, retail, training, etc)\n\tOversee bookings, appointments and service delivery\n\tCoordinate staff, training, recruitment and ensure professional working environment\n\tPrepare reports, monitor finance and resources management\n\tMonitor sales targets and how to meet or exceed them.\n\n\nRequirements\n\n\n\tBachelor's Degree in any related field\n\tMinimum of 1 year of work experience\n\tLeadership skills and good communication skills\n\tKnowledge of skincare/spa/beauty trends is a plus\n\tFlexible to work on weekends or public holidays.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: Techdoctorinnovations@gmail.com using the Job Position as the subject of the email.\n\nNote: For inquiries, send a WhatsApp message to: +234 913 888 5064.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]