[
  {
    "title": "Head, Investment and Research Management Job at Maurice Xandra Solutions Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/head-investment-and-research-management-job-at-maurice-xandra-solutions-limited",
    "pubDate": "Tue, 01 Jul 2025 12:33:09 GMT",
    "source": "JobGurus",
    "keyword": "maurice xandra solutions limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Maurice Xandra Solutions Limited is a management consulting company that renders quality services in Human Resource, Management and Process improvement. MXS Limited was set up to provide high quality, up to date training, team management and process improvement services for its clients.\n\nWe are recruiting to fill the position below:\n\nJob Position: Head, Investment and Research Management\n\nJob Location: Lagos\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tTo provide leadership to the Company’s investment, research & portfolio management function, which encompasses investment research, portfolio strategy, construction and management.\n\tTo identify and evaluate investment opportunities across different asset classes, develop suitable investment strategies in accordance with investment objectives and manage investment portfolios for mutual funds, high net worth and institutional clients.\n\n\nKey Responsibilities\n\n\n\tLead the process of undertaking independent research of investment opportunities across multiple asset classes and analysis covering both global and local macroeconomic trends.\n\tPrepare and oversee the production of research reports/presentations, reflecting outcome of independent research/analysis.\n\tDevelop financial models and projections to support investment decision-making.\n\tPrepare investment policy statements for all investment portfolios managed by the Company.\n\tWork with business development executives to prepare investment management proposals for current and prospective clients.\n\tCollaborate with investment officers, operations officers, compliance and other relevant internal parties to coordinate trading and management of portfolios.\n\tActively contribute to the development and implementation of strategies geared towards the attainment of stated investment objectives of portfolios.\n\tImplement agreed and approved portfolio strategy for investment portfolios.\n\tRegularly monitor and review the investment portfolios against the investment objectives and mandates.\n\tRegularly meet with clients to discuss clients’ portfolios including portfolio strategy and outlook.\n\n\nQualifications, Experience and Attributes\n\n\n\tUndergraduate Degree in Accounting, Finance, Economics or related field with a strong academic record.\n\tA minimum of Eight (8) years of work experience in a similar role, with at least 4 years in a lead position\n\tProfessional certification(s) in Finance and/or Accounting from recognized professional bodies (e.g. CFA, ACA, ACCA,)\n\tDeep knowledge of and interest in the Financial Markets, as well as strong business and financial acumen.\n\tStrong quantitative and qualitative analysis skills.\n\tProven leadership, negotiating and influencing skills.\n\tStrong oral and written communication skills.\n\tExcellent networking skills, particularly relationship-building and interpersonal skills.\n\tStrong results orientation and high attention to details.\n\tAccountability and a demonstrable sense of personal responsibility and ownership mentality.\n\tHigh ethical standards and level of integrity.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hr@mauricexandra.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Branch Manager Job at Westfield Consulting Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/branch-manager-job-at-westfield-consulting-limited",
    "pubDate": "Tue, 01 Jul 2025 12:33:09 GMT",
    "source": "JobGurus",
    "keyword": "westfield consulting limited",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance"
    ],
    "content": "Westfield Consulting Limited - Our client in the Banking sector (One of the new generation banks) is looking for qualified and passionate candidates for the position below:\n\nJob Position: Branch Manager\n\nJob Locations: Abuja (FCT) and Warri, Delta\nEmployment Type: Full-time\nReports To: Head, Retail & SME Banking\nGrade: AM - DM \n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tResponsible for the effective management of the Bank branch, formulate and implement sales and marketing plans, ensure efficient operations, staff management, compliance with bank policies and procedures, other financial and administrative functions, and the profitability of the branch\n\n\nPrincipal Duties and Responsibilities\n\n\n\tFormulate and implement localized sales and marketing plans in line with the Bank’s policy.\n\tPlan and implement sales and marketing activities within the branch to grow the liabilities business and achieve sales targets.\n\tAllocate branch resources effectively, including manpower, operational costs, promotion budgets etc.\n\tFormulate directives of identifying business opportunities.\n\tDevelop and implement business and customer service strategies.\n\tDevelop quality loan portfolio to obtain the bank’s loan growth objectives.\n\tAccept, analyse, collect and review required documents to initiate the loan process.\n\tMonitor loan portfolio to correct loan document exceptions.\n\tManage operational risk, - identify, assess, mitigate, and control, ensure application of control measures to minimize risk exposure of the Bank.\n\tEnsure deposit growth to obtain the bank’s deposit growth objectives by promoting the Bank’s services.\n\tCommunicate and implement new ideas and marketing strategies within branch market area to improve sales, cross-sell, marketing, and staff development.\n\tProvide directives and guidance on all operational and personnel matters to employees in the branch.\n\tAchieve overall branch sales performance objectives and targets on individual products by monitoring subordinates.\n\tMonitor and review sales performance goals of individual sales and marketing staff, monitor, update, review and implement branch sales plan.\n\tProvide sales coaching and training to marketing staff of the branch to enhance their performance.\n\tMaintain a high level of employee morale to minimize turnover and maximize customer service satisfaction.\n\tImplement corporate culture through reinforcement of quality service and teamwork and maintain a high level of employee morale within the branch.\n\tMaintain efficient workdays, lead the personnel in the branch, ensure customer service relations to meet the branch's financial goals.\n\tEnsure branch compliance with audit and regulatory procedures.\n\tOversee the day-to-day duties of personnel, facilitate communication between departments and provide regular reports to top Management.\n\tManage the branch to achieve assigned performance targets.\n\n\nQualifications and Experience\n\n\n\tDegree in Finance, Accounting, Economics, or related discipline in a recognised university. A postgraduate qualification or relevant professional certification would be an added advantage.\n\tA minimum 7 years of continuous banking experience in sales and credit with at least 4 years in a supervisory role.\n\tGood knowledge of Basic Accounting and Financial Analysis, Business Law, Business/Financial Advisory services, Banking Operations, Leasing, Trade Services, Laws, and regulations relating to Banking.\n\tFamiliar with the bank’s core accounting system.\n\tKnowledge of personal computer and related word processing and spreadsheet software.\n\tCredit Risk Assessment and Analysis skills, relationship management and networking skills, excellent business writing and presentation skills.\n\n\nRemuneration\n\n\n\tVery Attractive.\n\n\nMethod of Application\nInterested and qualified candidates should send their recent CV to: victor.allu@westfield-consulting.com using the Job Position as the subject of the email.\n\nNote: The role is strictly for qualified candidates currently in the Banking Industry.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Restaurant Liaison Officer Job at FoodOnline Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/restaurant-liaison-officer-job-at-foodonline-limited-1",
    "pubDate": "Tue, 01 Jul 2025 12:33:09 GMT",
    "source": "JobGurus",
    "keyword": "foodonline limited",
    "duplicate": false,
    "classifications": [],
    "content": "FoodOnline is a dynamic food delivery and logistics tech company revolutionizing how Nigerians access meals. It connects users to their favorite restaurants and food vendors through a fast, user-friendly mobile app.\n\nWe are recruiting to fill the position below:\n\nJob Position: Restaurant Liaison Officer\nJob Locations: Jabi, Utako, Wuye, Wuse, Mabushi - Abuja (FCT)\nEmployment Type: Full-time\n\nDescription\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tJoin FoodOnline and help us deliver food faster and smarter!\n\tWe’re looking for smart, young, and organized individuals who can work with restaurants to ensure fast and correct orders.\n\n\nYour Role\n\n\n\tReceive order screenshot.\n\tBuy and confirm food from restaurant.\n\tLabel, seal, and hand over to the assigned rider.\n\tCommunicate delays or issues to the team.\n\n\nRequirements\n\n\n\tMinimum of an SSCE (WAEC, NECO, or equivalent).\n\tMust be at least 16 years old.\n\tMust live in or near Jabi, Utako, Wuye, Wuse, or Mabushi.\n\tPolite, smart, and presentable.\n\tOwn a smartphone with WhatsApp.\n\tKnows how to move fast and communicate clearly.\n\n\nSalary & Benefits\n\n\n\tSalary: N70,000 / Month.\n\tBonus tied to performance.\n\tGrowth opportunity in a fast-moving company.\n\tOn-the-job training.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Content Marketer Job at Health Connect 24x7",
    "link": "https://www.jobgurus.com.ng/jobs/view/content-marketer-job-at-health-connect-24x7",
    "pubDate": "Tue, 01 Jul 2025 12:33:09 GMT",
    "source": "JobGurus",
    "keyword": "health connect 24x7",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Health Connect 24x7 combines next-generation telemedicine, telemonitoring and home health to provide you with immediate access to highly trained and experienced doctors and wellness experts for healthy, acute and chronic condition management and advice via voice/ video calls, as well as on-site doctors and clinics. You can talk to our full-time doctors and wellness experts from anywhere in the world, whether you are at home, at the office, on a business trip or on vacation. Health Connect 24x7 provides consumers with a true 24x7 population health management. Our goal is to ensure appropriate balance between quality and cost, starting from the moment you access our physician helpline to the point of recovery.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Content Marketer\n\nJob Location: Yaba, Lagos\nEmployment Type: Full-time\nWork mode: hybrid (2days on-site)\n\nJob Description\n\n\n\tThe Content Marketer will undertake content marketing initiatives in alignment with the marketing strategy to achieve business targets.\n\n\nResponsibilities\n\n\n\tResearching HC-related topics (combining online sources)\n\tDevelop editorial calendar, delegate tasks and ensure deadlines are met\n\tWrite clear marketing copy to promote HC brand/services\n\tDeliver engaging content on a regular basis and inspire team members\n\tOptimize content considering SEO and Google Analytics\n\tIdentify customers’ needs and gaps in our content and recommend new topics\n\tCoordinate with marketing and design teams to illustrate articles\n\tUpdate website content as needed\n\tEnsure all-around consistency (style, fonts, images and tone)\n\tProofread the articles before publication\n\tGenerate ideas for new content composition, write engaging content and ensure that it adheres to SEO standards.\n\tCompose product description to promote HC brand and services\n\tWork together with different department to create innovative content ideas\n\tCreate content piece that appeal to our audience, attract customer and boost our brand awareness.\n\n\nRequirements\n\n\n\tEducation: BSc / HND\n\tRelevant trainings/ certification in content marketing Other requirements:\n\tAt least 6 month cognate experience.\n\tProficient in the use of Microsoft office suite Energetic\n\tDetail oriented\n\n\nSalary\nN150,000 / month.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: jobs@healthconnect247.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Receptionist Job at Century1 Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/receptionist-job-at-century1-limited",
    "pubDate": "Tue, 01 Jul 2025 12:33:09 GMT",
    "source": "JobGurus",
    "keyword": "century1 limited",
    "duplicate": false,
    "classifications": [],
    "content": "Century1 Limited is a pioneering force in the Energy sector, delivering sustainable and innovative solutions for businesses and communities. Since 2019, we have specialized in the sales, distribution, and technology-driven optimization of CNG, LPG, and LNG.\n\nWe are recruiting to fill the position below:\n\nJob Position: Receptionist\n\nJob Location: Lekki, Lagos\nEmployment Type: Full-time\n\nRequirements\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tMinimum of HND / Bachelor’s Degree\n\tExcellent communication and interpersonal skills\n\tProficient with Microsoft Office (Word, Excel, Outlook)\n\tMust be organized, neat, and detail-oriented\n\tPrevious receptionist or customer-facing experience is a plus.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: babajide.oloko@century1.one using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]