[
  {
    "title": "Job Openings at PZ Cussons",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-pz-cussons-1",
    "pubDate": "Wed, 25 Jun 2025 16:49:30 GMT",
    "source": "JobGurus",
    "keyword": "pz cussons",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "PZ Cussons is a dynamic consumer products group and innovator of some of the world's best known and loved brands. Calling on over 130 years of expertise, we operate internationally in carefully selected developed and emerging markets that present the greatest strategic potential for future growth. Our world-class supply chain and distribution networks enable us to meet our global consumer needs and deliver quality brands that add value and enhance everyday lives.\n\nWe are recruiting to fill the following positions below:\n\n1.) Tax Compliance Manager\n\nJob ID: JR002184\nJob Location: Head Office, Nigeria\nJob type: Full-time\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Responsibilities\n\n\n\tPreparing & reviewing Withholding tax returns(Federal and All States) as per statutory requirement for PZW/Wilmar entities in Nigeria by spooling monthly reports, verifying applicable rates, separating into applicable tax jurisdictions, reconciling WHT report against ledger balances and processing payments without any delays.\n\tPreparing & reviewing VAT returns as per statutory requirement for PZW/Wilmar entities in Nigeria by spooling monthly reports, verifying applicable rates, reconciling VAT report against ledger balances and processing payments without any delays.\n\tPreparing & reviewing monthly Corporate Tax computation by spooling monthly reports, verifying applicable rates.\n\tPreparing & reviewing PAYE returns (Federal and All States) as per statutory requirement for PZW/Wilmar entities in Nigeria by spooling monthly reports, verifying applicable rates, separating into applicable tax jurisdictions, reconciling WHT report against ledger balances and processing payments without any delays.\n\tProcess payments for all monthly taxes, final demand notice liabilities and every other undisputed tax liability\n\tPrepare initial draft responses to demand notices, queries and other correspondence from the FIRS and state boards.\n\tApply for and Obtain Tax clearance certificates for all entities every year\n\tReceive and record all correspondence from tax authorities\n\tMaintain correspondence tracker to ensure responses are filed within the stipulated timeline.\n\tHT credit note verification on B2B Customer purchases.\n\n\nQualifications & Experience\n\n\n\tA Bachelor's Degree in Accounting, Finance, or a related field, with a minimum of a Second Class Upper division including in a multinational corporate environment, with exposure to following areas:\n\t\n\t\tPreparation of various statutory returns – Corporate Tax, WHT,VAT,PAYE etc.\n\t\tHandling various audit (FIRS/state tax authorities / Internal / external audit etc.)\n\t\n\t\n\t3 - 4 years of relevant experience\n\t\n\t\n\t\n\tProfessional Qualified ACA/ ACCA or /and member of The Chartered Institute of Taxation of Nigeria\n\tCandidates with working experience in Audit / Assurance function with Big Assurance function are preferred.\n\n\nApplication Closing Date: 20th July, 2025.\n\nClick here to apply online\n\n \n\n2.) Head of Category - Personal Care\n\nJob ID: JR002140\nJob Location: Head Office, Nigeria\nJob type: Full-time\n\nKey Accountabilities\n\n\n\tCreate and develop category/brand strategies to grow the category/brands market share volume/value and profitability.\n\tSupport the delivery of overall budgeted profitability of the Category by developing solid brand strategies that grow and sustain brand performance. Monitor and report the regional category performance through brand health indicators (NNS, GM, MC) and key consumer KPIs (awareness, trial, attribute rating etc.).\n\tExplore & exploit new growth opportunities for the category. Lead the NPD process ensuring that its requirements are managed and delivered according to targets with clear hand over to CBUs at Gate 2.\n\tCollate regional consumer insights and output from research plans to feed into the development of the brand strategy.\n\tDefine pricing policy for products within the category/brand portfolio in the Region.\n\tEnsure development of regional communication material aligned to the category/brand strategy and that support the delivery of CBU brand plans.\n\tParticipate actively in company-wide initiatives as required – e.g. Margin Improvement Proactively identify sources and resource needs to support brand growth.\n\n\nQualification, Experience & Competencies\n\n\n\tBachelor`s Degree\n\tOver 7 years of demonstrated experience in Brand Management\n\tProfessional Qualification in Marketing is essential\n\tPost graduate degree is desirable\n\tIT savvy including the use of MS Office Suite of Applications.\n\n\nJob Context & Special Features\nMay require:\n\n\n\tSignificant in-country and regional travel\n\tInternational travel\n\tFlexibility to work on weekends.\n\n\nCapabilities/Technical skills\nConsumer Champion:\n\n\n\tInsight generation (Proven strength)\n\tCommunication (Mastery)\n\tDigital (Proven strength).\n\n\nBrand Champion:\n\n\n\tBrand propositions (Proven strength)\n\tStrategy (Proven strength).\n\n\nProfit and Growth Champion:\n\n\n\tCommercial delivery (Mastery)\n\tRTM (Mastery).\n\n\nInnovation Champion:\n\n\n\tInnovation (Proven strength)\n\tNPD and PLM (Mastery).\n\n\nBusiness Leader:\n\n\n\tPersonal leadership (Proven strength)\n\tPersonal drive (Proven strength)\n\tTalent development (Proven strength).\n\n\nSignificant Relationships (Internal & external):\n\n\n\tRegional Marketing team\n\tBrand Activation team\n\tCross-functional teams from Finance, Commercial, Supply Chain, HR, NPD, Consumer Insight, Digital\n\tAdvertising agencies & Service providers.\n\n\nApplication Closing Date: 30th June, 2025.\n\nClick here to apply online\n\n \n\n \n\n3.) Finance Officer - Treasury\n\nJob Requisition ID: JR002163\nJob Location: PZ Wilmar Factory, Lagos\n\nResponsibilities\n\n\n\tAssist the Finance Controller in preparing regular reporting and month end process.\n\tChecking daily sales invoice for its accuracy and special pricing, if any\n\tAssist in checking various rebates / sales claims.\n\tLiaise with auditors, tax consultants, and other external stakeholders as required.\n\tRasing journals in outsmart with required approvals & supporting\n\tEnsure compliance with financial regulations and internal policies.\n\tContribute to process improvements and the implementation of financial systems and controls.\n\tProvide administrative support to the finance department as needed and as advised by Finance Controller.\n\n\nApplication Closing Date: 27th June, 2025.\n\nClick here to apply online\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Vacancies at FactBase Consulting Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancies-at-factbase-consulting-limited-1",
    "pubDate": "Wed, 25 Jun 2025 16:49:30 GMT",
    "source": "JobGurus",
    "keyword": "factbase consulting limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "FactBase Consulting Limited - Our clients in various sectors are currently recruiting suitably qualified candidates to fill the following positions below:\n\n1.) Management Trainee (HRM)\n\nJob Location: Lagos\n\nJob Description (in Summary)\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are a medium-sized and professionally-run HR consulting firm, located in Lagos, with a keen interest in developing young, brilliant, diligent and honest graduates to becoming HRM professionals starting as Management Trainees [HRM].\n\tAttend and coordinate various training programmes.\n\tPlan and execute various recruitment projects.\n\tPlan and implement various HR consulting projects.\n\tResearch, write and implement various proposals and projects.\n\n\nMajor Requirements\n\n\n\tDegree / HND (Minimum of 2.1/Upper Credit) in OTM, or any Management, Social, Physical, Life Sciences, Humanities or Education.\n\tAge: 25 years (max).\n\tComfortable skills in MS Office Suite.\n\tNo post-NYSC experience is required.\n\n\nReward System\n\n\n\tSalary is N100,000 per month.\n\tTremendous and continuous practical training.\n\tSame-gender portable two-bedroom flat ; [candidates outside Lagos may be given preference].\n\tEncouragement to prepare for and write CIPMN exams.\n\n\nApplication Closing Date: 28th June, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CVs to: factbaseconsulting@gmail.com using the Job Position and current location (e.g. Ibadan, Akure) as the subject of the e-mail.\n\nNote\n\n\n\tOnly shortlisted candidates will be contacted, please.\n\tIkeja Office (no provision for accommodation)\n\tAjah Office (there is a provision for accommodation).\n\n\n \n\n \n\n2.) Branch Manager\n\nJob Location: Alaba, Lagos\nEmployment Type: Full-time\n\n\n\n\nJob Description\n\n\n\tWe are seeking the services of result-oriented, diligent and honest individuals to join its growing team in Alaba as a Branch Manager.\n\tCandidates will oversee daily operations of the branch, ensuring smooth and efficient service delivery to clients.\n\tDevelop and implement strategies to achieve branch targets in terms of creation of deposits, loans, and other financial products.\n\tEnsure the effective management of branch resources, including cash, security, and other operational assets.\n\n\nQualifications\n\n\n\tCandidates should possess a B.Sc/B.Tech/HND in any numerate disciplines.\n\tMinimum of four years of experience in a similar role, preferably in an MFB/MFI or commercial bank.\n\tACA/MCIB/ACIB or a higher degree may be a plus.\n\tProven track record of managing branch operations, achieving financial targets, and leading teams to success.\n\tStrong proficiency in MS Office Suite.\n\n\nSalary\nN600,000 / Month.\n\nApplication Closing Date: 10th July, 2025.\n\nMethod of Application\nInterested and qualified candidates should send CV to: factbaseconsulting@gmail.com using the Job Position as the subject of the email.\n\nNote: Only shortlisted candidates will be contacted.\n\n \n\n \n\n3.) Brand Builder\n\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\n\nJob Description (in Summary)\n\n\n\tDevelop and manage strong relationships with on-trade accounts.\n\tExecute brand-building activities.\n\tWork closely with marketing for promotions and activations.\n\n\nRequirements\n\n\n\tDegree/ HND in Business Administration, Marketing, Economics, Social/Physical/ Life Sciences, Humanities or Education.\n\tMinimum of six years of experience in a similar role, with at least three years in on-trade and luxury account management.\n\tStrong skills in MS Office Suite.\n\n\nSalary\nN300,000 - N350,000 / Month.\n\nApplication Closing Date: 11th July, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: factbaseconsulting@gmail.com using the Job Position and preferred location as the subject of the mail.\n\nNote: Only shortlisted candidates will be contacted, please.\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Accountant Job at Duob Recruitment",
    "link": "https://www.jobgurus.com.ng/jobs/view/accountant-job-at-duob-recruitment-2",
    "pubDate": "Wed, 25 Jun 2025 16:49:30 GMT",
    "source": "JobGurus",
    "keyword": "duob recruitment",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Duob Recruitment, a recruitment firm, is recruiting to fill the position below:\n\nJob Position: Accountant\nJob Location: Eti Osa, Lagos\nEmployment Type: Full-time (Fully Onsite)\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are looking for an experienced and organized accountant to join our finance team.\n\tThe ideal candidate will have a solid understanding of accounting principles and be responsible for managing financial transactions, preparing reports, performing reconciliations, and ensuring compliance with relevant regulations.\n\tThis role requires accuracy, attention to detail, and the ability to manage multiple tasks efficiently.\n\n\nResponsibilities\n\n\n\tPrepare accurate and timely financial statements, including income statements, balance sheets, and cash flow statements.\n\tPrepare monthly, quarterly, and annual financial reports for management review.\n\tReconcile bank accounts, credit card statements, and other financial accounts.\n\tProvide financial insights to senior management to assist in strategic decision-making.\n\tOversee and maintain accurate general ledger entries, ensuring that all financial transactions are recorded appropriately.\n\tStay updated on tax law changes and advise management on potential impacts.\n\tSupport external auditors during the audit process and provide necessary documentation.\n\tOffer recommendations for improving financial performance, cost-saving measures, and revenue generation strategies.\n\tWork closely with cross-functional teams, including HR, operations, and procurement, to ensure smooth financial operations.\n\n\nQualifications and Requirements\n\n\n\tBachelor's degree in accounting, finance, or a related field.\n\tMinimum of 4 years of experience in accounting or finance, preferably in a corporate or public accounting environment.\n\tProfessional certification such as ICAN, ACCA, or equivalent (Compulsory)\n\tStrong knowledge of accounting principles, financial regulations, and tax laws.\n\tProficient in accounting software (ZOHO) and other accounting software and Microsoft Office Suite (Excel, Word, PowerPoint).\n\tExceptional analytical skills and attention to detail.\n\tAbility to communicate complex financial information to non-financial stakeholders.\n\tExcellent organizational skills with the ability to manage multiple priorities and meet deadlines.\n\tMust not be from a Yoruba-speaking tribe\n\tA female is needed (For Gender Equality)\n\tProximity to the island\n\tMust be available to resume within 1 week – 2 Weeks.\n\n\nBenefits\n\n\n\tCompetitive salary\n\tProfessional development and growth opportunities\n\tCommunication allowances.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hrdamilolaasoata@outlook.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Branch Manager Job at the Changeroom",
    "link": "https://www.jobgurus.com.ng/jobs/view/branch-manager-job-at-the-changeroom-1",
    "pubDate": "Wed, 25 Jun 2025 16:49:30 GMT",
    "source": "JobGurus",
    "keyword": "the changeroom",
    "duplicate": false,
    "classifications": [],
    "content": "Changeroom was established in 2012 with a vision to produce quality human resource solutions. We plan to achieve this by partnering with our clients to provide highly specialized consulting services in the areas of human resources development and business management services. Our partnership approach affords us the opportunity of working with you to find the most efficient and appropriate solutions to meet your short, medium and long-term goals. In partnering with your organization, we make it our business to understand your business, embrace its values, aims and objectives.\n\nWe are recruiting to fill the position below:\n\nJob Position: Branch Manager\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Locations: Adamawa, Cross River, Delta, Edo & Oyo\nEmployment Type: Full-time\n\nRequirements\n\n\n\tCandidates should possess a Bachelor's Degree in Social Sciences / Insurance / Accounting with at least 5 years of insurance sector experience.\n\n\nMethod of Application\nInterested and qualified candidates should send their Application to: bola@changeroom.ng or augustina@changeroom.ng or info.changeroom@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]