[
  {
    "title": "Data Center Administrator Job at Unified Payment Services Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/data-center-administrator-job-at-unified-payment-services-limited",
    "pubDate": "Sat, 07 Jun 2025 16:17:22 GMT",
    "source": "JobGurus",
    "keyword": "unified payment services limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Unified Payment Services Limited is Nigeria’s premier Payments & Financial Technology company that operates as a shared infrastructure for the banking community in Nigeria and Payments Service Provider within and outside Nigeria, with a vision to be the most preferred e-payment service provider in Africa.\n\nWe are recruiting to fill the position below:\n\nJob Position: Data Center Administrator\n\nJob Location: Lagos\n\nJob Objectives\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe DBA will be responsible for the implementation, configuration, maintenance, and performance of critical ORACLE, POSTGRESQL and SQL Server RDBMS systems and in some case, additional database types like MySQL, to ensure the availability and consistent performance of our corporate applications. This is a “hands-on” position requiring solid technical skills, as well as excellent interpersonal and communication skills.\n\tStaff will be responsible for the development and sustainment of the database and data Warehouse, ensuring its operational readiness (security, health and performance), executing data loads, and performing data modeling in support of multiple development teams. The data warehouse supports an enterprise application suite of program management tools. Must be capable of working independently and collaboratively.\n\n\nDuties & Responsibilities\n\n\n\tManage ORACLE, POSTGRESQL and SQL Server databases through multiple product lifecycle environments, from development to mission-critical production systems.\n\tConfigure and maintain database servers and processes, including monitoring of system health and performance, to ensure high levels of performance, availability, and security.\n\tApply data modelling techniques to ensure development and implementation support efforts meet integration and performance expectations\n\tIndependently analyze, solve, and correct issues in real time, providing problem resolution end-to-end.\n\tRefine and automate regular processes, track issues, and document changes\n\tAssist developers with complex query tuning and schema refinement.\n\tProvide 24x7 support for critical production systems.\n\tPerform scheduled maintenance and support release deployment activities after hours.\n\tShare domain and technical expertise, providing technical mentorship and cross-training to other peers and team members.\n\n\nJob Requirements\nQualifications:\n\n\n\tA minimum of Bachelor’s Degree in Computer Science or its equivalent (Higher Dip./B.Eng/B.Tech/BSc. in Computer Science/Information Technology\n\tExperience: 2-6 years of post NYSC experience.\n\n\nKey Competencies:\n\n\n\tGood knowledge of ORACLE, POSTGRESQL and MS SQL Server Administration experience required.\n\tExperience with Performance Tuning and Optimization (PTO), using native monitoring and troubleshooting tools.\n\tExperience with backups, restores and recovery models.\n\tKnowledge of High Availability (HA) and Disaster Recovery (DR) options for SQL Server.\n\tKnowledge of Oracle data guard technology and role switching operations.\n\tKnowledge of PostgreSQL replication and failover process data guard technology and role switching operations.\n\tExperience working with Windows server, including Active Directory.\n\tExperience working with Oracle Linux operating system.\n\tExcellent written and verbal communication.\n\tFlexible, team player, “get-it-done” personality.\n\tAbility to organize and plan work independently.\n\tAbility to work in a rapidly changing environment.\n\tAbility to multi-task and context-switch effectively between different activities and teams.\n\tGood knowledge of scripting.\n\tBasic knowledge of storage and its operation ability.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: ademuyiwa.adetunji@up-ng.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Group General Manager Job at Portrec Resourcing",
    "link": "https://www.jobgurus.com.ng/jobs/view/group-general-manager-job-at-portrec-resourcing",
    "pubDate": "Sat, 07 Jun 2025 16:17:22 GMT",
    "source": "JobGurus",
    "keyword": "portrec resourcing",
    "duplicate": false,
    "classifications": [],
    "content": "Portrec Resourcing is one of Nigria's top leading recruitment and HR consulting firm. A hub where recruiters meets their ideal talents to ensure somooth and healthy labour force. Portrec has helped organizations across various industries to recruit and hire skilledtalents helping businesses and organizations thrive on all front.\n\nWe are recruiting to fill the position below:\n\nJob Position: Group General Manager\n\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tOversee the daily operations across both companies, ensuring alignment with strategic goals.\n\tDevelop and implement scalable operational processes and policies to support growth.\n\tLead and coordinate cross-functional teams including IT service, project delivery, sales, and business development.\n\tLead recruitment, onboarding, and training processes in coordination with HR.\n\tDrive process improvements, risk management, and business continuity initiatives.\n\tCollaborate with the senior leadership team to translate strategic objectives into executable operational plans.\n\tEnsure that all client projects, support services, and internal operations are delivered on time, within budget, and to a high standard.\n\tMonitor performance through KPIs, dashboards, and reporting tools.\n\tSupport the integration and usage of digital tools and platforms (CRM, Service Desk, ERP).\n\tServe as a key escalation point for critical issues and service failures.\n\tEnsure regulatory, compliance, and contractual obligations are met in both regions.\n\n\nRequired Skills & Experience\n\n\n\t5+ years of experience in a senior operations leadership role, preferably within the IT or Tech services sector.\n\tStrong track record of managing distributed teams and multi-country operations.\n\tDeep understanding of IT service management (ITSM), CRM systems, and workflow automation platforms.\n\tExcellent analytical, planning, and reporting abilities.\n\tSkilled in SharePoint, Microsoft Teams, GoHighLevel, Jira, or similar platforms.\n\tExceptional interpersonal, communication, and negotiation skills.\n\tExperience working in start-up or growth environments is highly desirable.\n\tKnowledge of both UK and Nigerian business cultures and operational environments is an added advantage.\n\tAbility to work flexible hours, including evenings and weekends when necessary.\n\n\nCore Attributes:\n\n\n\tStrategic thinker with the ability to execute tactically\n\tSelf-starter with a high level of initiative\n\tCalm under pressure and solutions-oriented\n\tStrong leadership presence and emotional intelligence\n\tA passion for improving systems and developing team.\n\n\nWhy Work with Us?\n\n\n\tSalary: N7,500,000 Annually\n\tYou’ll be joining two ambitious companies with a shared vision for impact, innovation, and international growth.\n\tWe offer an empowering environment where you’ll directly influence how we scale and succeed.\n\tYou’ll work closely with visionary leadership and have a seat at the table.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV in PDF to: jobs@portrec.ng using the Job Positoin as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Flutter Developer Job at Elizabeth Maddeux LImited",
    "link": "https://www.jobgurus.com.ng/jobs/view/flutter-developer-job-at-elizabeth-maddeux-limited",
    "pubDate": "Sat, 07 Jun 2025 16:17:22 GMT",
    "source": "JobGurus",
    "keyword": "elizabeth maddeux limited",
    "duplicate": false,
    "classifications": [
      "Software Engineering",
      "Finance"
    ],
    "content": "Elizabeth Maddeux LImited provides a range of human resources solutions designed to empower your workforce, enhance technical proficiency, refine soft skills, and accelerateorganizational growth for better impacts by enhancing organizational dynamics through a well-rounded and robust human resource intervention.\n\nWe are recruiting to fill the position below:\n\nJob Position: Flutter Developer\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a highly motivated and skilled Flutter Developer to join our client’s technology team, a leading financial service provider.\n\tIn this role, you will be responsible for developing and maintaining secure, scalable, and high-performance mobile applications that support the digital financial services.\n\tYou will play a critical role in improving the customers' mobile banking experience.\n\n\nResponsibilities\n\n\n\tDesign and build advanced cross-platform mobile applications using Flutter.\n\tCollaborate with cross-functional teams (product, design, backend, QA) to define, design, and ship new features.\n\tTranslate UI/UX designs into functional and visually appealing mobile interfaces.\n\tIntegrate mobile apps with APIs, payment gateways, and internal banking systems.\n\tEnsure the security of financial transactions and sensitive customer data through encryption and secure coding practices.\n\tConduct unit, integration, and user acceptance testing to ensure the app meets business requirements.\n\tMonitor app performance and troubleshoot issues across different devices and platforms.\n\tOptimize application performance, responsiveness, and battery usage.\n\tMaintain documentation for app features, architecture, and technical decisions.\n\tMentor junior developers or interns (if applicable), and contribute to the knowledge-sharing culture within the tech team.\n\tResearch new technologies and recommend improvements to enhance app functionality and user experience.\n\tParticipate in sprint planning, standups, and reviews as part of an Agile development team.\n\tEnsure compliance with regulatory and banking standards in app functionality and data handling.\n\tProvide post-release support, updates, and enhancements as required.\n\tStrong understanding of mobile app architecture and state management (e.g., Provider, Bloc, Riverpod).\n\tFamiliarity with RESTful APIs, JSON, and mobile UI/UX design principles.\n\tExperience with Firebase, SQLite, or other mobile databases.\n\tFamiliar with version control tools like Git and deployment to Google Play and Apple App Store.\n\tKnowledge of security protocols, data protection, and compliance in financial applications is an added advantage.\n\n\nRequirements\n\n\n\tBachelor's Degree in Computer Science, Software Engineering, or a related field (or equivalent experience).\n\tMinimum of 3 - 4 years of hands-on experience in mobile application development using Flutter.\n\tStrong knowledge of Dart programming language and Flutter SDK.\n\tProven experience with integrating RESTful APIs and third-party libraries\n\tExperience with CI/CD tools for automated build and deployment.\n\tAbility to debug performance bottlenecks and optimize for speed, responsiveness.\n\tSolid understanding of mobile application architecture and state management.\n\tProximity to the location.\n\n\nSalary\nN400,000 - N450,000 / Month.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: careers@elizabethmaddeux.com using “Flutter Developer\" as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Land Property Investigation Officer Job at Nine Stars Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/land-property-investigation-officer-job-at-nine-stars-limited-1",
    "pubDate": "Sat, 07 Jun 2025 16:17:22 GMT",
    "source": "JobGurus",
    "keyword": "nine stars limited",
    "duplicate": false,
    "classifications": [],
    "content": "At nine stars limited, weprovide an industrial platform to foster sustainable growth across Africa through diverse rangeofservices. From agriculture to real estate, Energy and mining to hospitality and security we bring sustainable innovation and excellence to every sector we touch. Our mission is to leverage innovation and sustainability to create lasting value in Agriculture, Energy, Mining, Real estate, Hospitality and Security while maintaining cordial relationship amongst our Clients, host Communities and Government.\n\nWe are recruiting to fill the position below:\n\nJob Position: Land Property Investigation Officer\n\nJob Location: Ode-Remo, Ogun\nEmployment Type: Full-time\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Summary\n\n\n\tWe are seeking a detail-oriented and highly analytical Land Property Investigation Officer to join our team. \n\tThe successful candidate will be responsible for conducting thorough investigations into land ownership, title verification, boundary disputes, illegal encroachments, and other land-related issues.\n\tThis role is vital in ensuring lawful land transactions, resolving disputes, and upholding property rights in accordance with relevant laws and regulations.\n\n\nKey Responsibilities\n\n\n\tInvestigate and verify land ownership claims, titles, and historical records.\n\tConduct field inspections and site visits to assess and gather relevant data on land parcels.\n\tCollect and analyze land documentation, including deeds, cadastral maps, lease agreements, and survey plans.\n\tMaintain accurate and organized records of all investigations and case files.\n\tIdentify and document instances of land encroachment, fraud, illegal occupation, or boundary disputes.\n\tCollaborate with legal teams, surveyors, and relevant government agencies to resolve land disputes.\n\tPrepare comprehensive investigation reports, findings, and recommendations for internal and legal use.\n\tAttend court sessions, tribunals, or dispute resolution meetings when required, serving as an expert witness if necessary.\n\tProvide guidance on land compliance issues and contribute to the development of land management policies.\n\tSupport the digitization and modernization of land records where applicable.\n\n\nRequirements and Qualifications\nEducation & Experience:\n\n\n\tBachelor’s Degree in Land Management, Law, Surveying, Real Estate, Geography, Urban Planning, or a related field.\n\t3 - 5 years of relevant experience in land investigations, land administration, or a similar role.\n\tExperience working with government land registries, survey offices, or legal institutions is an added advantage.\n\n\nSkills & Competencies:\n\n\n\tStrong knowledge of land laws, property rights, registration processes, and dispute resolution.\n\tProficiency in reading and interpreting land maps, cadastral plans, and legal documents.\n\tExcellent analytical, investigative, and problem-solving skills.\n\tStrong communication skills (both verbal and written) with the ability to produce detailed reports.\n\tHigh level of integrity, discretion, and ethical conduct.\n\tAbility to work independently and under pressure, with good time management.\n\tFamiliarity with GIS and land record systems is a plus.\n\tUnderstand and interact in the indigenous language (Yoruba)\n\n\nSalary\nN150,000 - N400,000 monthly.\n\nMethod of Application\nInterested and qualified candidates should send their Resume to: ninestars.recruitment@yahoo.com using the Job Position as the subject of the email.\n\nNote: For more inquiries, Call: 08167711717, WhatsApp: 08135113490.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Civil Engineer Job at Nine Stars Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/civil-engineer-job-at-nine-stars-limited-1",
    "pubDate": "Sat, 07 Jun 2025 16:17:22 GMT",
    "source": "JobGurus",
    "keyword": "nine stars limited",
    "duplicate": false,
    "classifications": [],
    "content": "Nine Stars Limited is a dynamic and innovative agricultural and real estate company committed to transforming Nigeria’s real estate market landscape. Based in Ode-Remo, Sagamu in Ogun State, our company aims to provide unparalleled real estate solutions, offering a wide range of services that cater to the diverse needs of individuals and businesses alike.\n\nWe are recruiting to fill the position below:\n\nJob Position: Civil Engineer\nJob Location: Ode-Remo, Ogun\nEmployment Type: Full-time\n\nPosition Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Civil Engineer will oversee and manage all civil engineering aspects of building construction projects, from concept through completion. The ideal candidate will bring a wealth of experience in erecting various building types across multiple stages, from foundation to finish.\n\tA key part of the role will involve the accurate interpretation of architectural and structural drawings, coordination with contractors, and leading on-site teams to deliver projects safely, on time, and within budget.\n\n\nKey Responsibilities\n\n\n\tProject Oversight: Lead and supervise construction activities across various sites, ensuring compliance with structural and architectural designs, specifications, and timelines.\n\tDrawing Interpretation: Accurately interpret and implement architectural, structural, and MEP drawings and ensure alignment with construction execution on-site.\n\tConstruction Management: Oversee the erection of different types of buildings including residential estates, high-rise towers, commercial complexes, and mixed-use developments.\n\tSite Leadership: Provide strong leadership to site supervisors, foremen, and laborers; allocate tasks effectively and ensure optimal team performance.\n\tQuality Assurance: Enforce rigorous quality control procedures and monitor construction standards to ensure delivery of top-tier developments.\n\tVendor/Contractor Coordination: Liaise with subcontractors, suppliers, consultants, and government authorities to facilitate smooth project execution.\n\tProblem Solving: Proactively identify and resolve site issues, engineering challenges, and project delays with practical, cost-effective solutions.\n\tBudget & Resource Management: Work closely with the project manager and QS team to monitor project budgets, timelines, and resource allocations.\n\tHealth & Safety Compliance: Ensure that all on-site activities adhere strictly to health and safety standards, building codes, and environmental regulations.\n\tReporting: Provide regular project progress reports, site logs, and technical documentation to management and stakeholders.\n\n\nRequirements\n\n\n\tEducation: Bachelor’s degree in Civil Engineering or related field\n\tExperience: 5–10 years in building construction with proven experience in real estate development or construction companies.\n\tProfessional Certification: COREN registration required; PMP or relevant construction certifications are an advantage.\n\tLeadership: Demonstrated ability to lead large teams on complex projects with excellent people management and coordination skills.\n\tAnalytical Skills: Strong problem-solving, critical thinking, and decision-making abilities.\n\tCommunication: Excellent verbal and written communication skills; able to collaborate effectively across disciplines.\n\tAdaptability: Must be willing to work in dynamic environments and be flexible with working hours as project needs dictate.\n\n\nTechnical Proficiency:\n\n\n\tStrong knowledge of construction methods, materials, and legal regulations.\n\tProficiency in AutoCAD, Revit, Civil 3D, MS Project, and other relevant engineering software.\n\n\nSalary\nN200,000 - N600,000 monthly.\n\nMethod of Application\nInterested and qualified candidates should send their Resume to: ninestars.recruitment@yahoo.com using the Job Position as the subject of the email.\n\nNote: For more information call: 08167711717 or WhatsApp: 08135113490.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]