[
  {
    "title": "Head of Procurement Job at FairMoney",
    "link": "https://www.jobgurus.com.ng/jobs/view/head-of-procurement-job-at-fairmoney-1",
    "pubDate": "Fri, 27 Jun 2025 10:17:36 GMT",
    "source": "JobGurus",
    "keyword": "fairmoney",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "FairMoney is building the leading mobile bank for emerging markets. We started with a digital microcredit application on Android, and currently roll out additional financial services (current account, savings, debit card) while expanding the product to Western Africa and South-East Asia.\n\nWe are recruiting to fill the position below:\n\nJob Position: Head of Procurement\n\nJob Location: Lagos\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Head of Procurement will be responsible for developing and implementing procurement strategies to optimize costs, ensure supplier quality, and drive operational efficiency.\n\tThis role involves overseeing all procurement activities, managing vendor relationships, ensuring compliance with regulatory requirements, and aligning procurement functions with the company's strategic objectives.\n\n\nKey Responsibilities\nStrategic Procurement Management:\n\n\n\tDevelop and implement procurement policies, procedures, and strategies to optimize spending and enhance operational efficiency.\n\tAlign procurement activities with FairMoney's financial and business objectives, ensuring cost savings and value creation.\n\tLead negotiations with suppliers to secure the best terms, pricing, and service levels.\n\tIdentify and mitigate procurement-related risks, including supplier reliability, regulatory compliance, and market fluctuations.\n\n\nVendor and Supplier Management:\n\n\n\tEstablish and manage strong relationships with key suppliers and vendors to ensure the timely and cost-effective delivery of goods and services.\n\tEvaluate and categorize suppliers based on strategic importance, quality, and risk exposure.\n\tImplement supplier performance management processes, including key performance indicators (KPIs) and regular assessments.\n\n\nOperational and Compliance Oversight:\n\n\n\tEnsure that procurement processes comply with internal policies, financial controls, and regulatory requirements.\n\tCollaborate with Finance and Legal teams to review and approve contracts, ensuring transparency and risk mitigation.\n\tDevelop and oversee procurement budgets and spending forecasts, ensuring cost-effective purchasing decisions.\n\n\nTeam Leadership and Development:\n\n\n\tBuild, train, and manage a high-performing procurement team, fostering a culture of efficiency and continuous improvement.\n\tProvide guidance and coaching to procurement staff, ensuring alignment with business priorities and best practices.\n\tPromote ethical procurement practices and adherence to corporate governance policies.\n\n\nTechnology and Process Optimization:\n\n\n\tLeverage procurement technology and automation tools to improve procurement efficiency and reporting.\n\tMonitor industry trends and emerging best practices to enhance FairMoney's procurement strategy.\n\tImplement and maintain supplier management and e-procurement systems for streamlined operations.\n\n\nRequirements\n\n\n\tBachelor's degree in Procurement, Supply Chain Management, Business Administration, Finance, or a related field.\n\tMinimum of 5 years of experience in procurement\n\tProfessional certification (e.g., CIPS, CPSM, PMP) is a strong advantage.\n\tExperience in the financial services or banking sector is preferred.\n\tStrong knowledge of procurement best practices, contract negotiation, and supplier management.\n\tProficiency in procurement software and ERP systems (NetSuite experience is a plus).\n\tExcellent leadership, negotiation, and stakeholder management skills.\n\n\nKey Competencies:\n\n\n\tCost management and budgeting\n\tRisk assessment and mitigation\n\tRelationship management and negotiation skills\n\tRegulatory compliance and governance\n\tStrong analytical and problem-solving abilities.\n\n\nBenefits\n\n\n\tPrivate Health Insurance\n\tPension Plan\n\tPaid Time Off\n\tTraining & Development.\n\n\nRecruitment Process\n\n\n\tA screening interview with one of the members of the Talent Acquisition team\n\tTechnical Interview with the Chief Financial Officer.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Digital Media Marketer Job at Edazytech Integrated Services",
    "link": "https://www.jobgurus.com.ng/jobs/view/digital-media-marketer-job-at-edazytech-integrated-services",
    "pubDate": "Fri, 27 Jun 2025 10:17:36 GMT",
    "source": "JobGurus",
    "keyword": "edazytech integrated services",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Edazytech Integrated Services is a group of digital content provider and seasoned programmers whose passion and desire is to create business solutions, softwares for organizations, schools management software, Point of Sales applications, EMR system, etc. Edazytech focuses on reducing manual and paper works by introducing automated solutions tailor-made to suit peculiar needs. We are a team of professionals that cut accross every areas of website creation and development. We work closely with client to understand their needs.\n\nWe are recruiting to fill the position below:\n\nJob Position: Digital Media Marketer\nJob Location:  Remote\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are searching for a highly-creative Digital Marketer, to handle all aspects of our online marketing activities.\n\tIt is a remote work, and while submitting your form indicate the state to handle your activities.\n\n\nJob Description\n\n\n\tWe are searching for a highly-creative Digital Marketer, to handle all aspects of our marketing operations, with the goal to help grow out brand influence both locally and internationally while also increasing brand loyalty and awareness\n\tThe ideal candidate's duties will include planning, implementing, and monitoring our digital marketing campaigns across all digital networks\n\tApplicant must be experienced in social media management marketing.\n\n\nJob Responsibilities\n\n\n\tDesign and monitor all aspects of our digital marketing department including our marketing database and display advertising campaigns.\n\tPlan and manage our social media platforms.\n\tDevelop and monitor our campaign budget.\n\tCoordinate with advertising and media experts to improve marketing results.\n\tWork with your team to develop new and innovative growth strategies.\n\tPrepare accurate reports on our marketing campaign's overall performance.\n\tEvaluate important metrics that reflect progress relating to website traffic, service quotas, and target audience.\n\tIdentify the latest trends and technologies affecting our industry. (Stay up-to-date knowledge of technologies).\n\tOversee and manage all contests, and other digital projects\n\n\nRequirements\n\n\n\tIn-depth knowledge of various social media platforms, best practices, and website analytics.\n\tEfficient written and verbal communication skills.\n\tStrong creative and analytical abilities.\n\tSocial media inclination.\n\tA strong inclination towards teamwork and collaboration.\n\n\nSalary\nN100,000 - N300,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: edazytechpaul@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Unit Accountant Job at Sundry Foods",
    "link": "https://www.jobgurus.com.ng/jobs/view/unit-accountant-job-at-sundry-foods-4",
    "pubDate": "Fri, 27 Jun 2025 10:17:36 GMT",
    "source": "JobGurus",
    "keyword": "sundry foods",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Sundry Foods is an integrated food services company founded in 2003 and operating in major cities in Nigeria. We are bringing our now trademark great tasting ready-to-eat food and quality services to thousands of people and institutions daily through its chain and network of restaurants, bakeries and other catering facilities.\n\nWe are proud to own and operate one of Africa’s best restaurant and bakery chains and we pride ourselves on our ability to consistently deliver original food and service solutions whether in workplaces, schools and colleges, hospitals, joining even remote sites and different cultural environments using our team of young seasoned professionals and an entire workforce with a passion to deliver nothing but the best to every customer.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Unit Accountant\n\nJob Locations: Abuja, Enugu, Umuahia - Abia, Ibadan - Oyo, Ilesha - Osun, Port Harcourt - Rivers, Lekki - Lagos, Asaba - Delta and Owerri - Imo\nJob Type: Full-Time\n\nResponsibilities\n\n\n\tTo represent the accounting and treasury functions at the unit level and safeguarding the company’s current assets as well as work that may be assigned to you by the Manager responsible for your primary assignment.\n\n\nRequirements\n\n\n\tRequired Qualification: First Degree in Accounting or Banking and Finance (B.Sc or HND) with a second class at a minimum\n\tExtras: Working knowledge of an Accounting Software or ERP is an added advantage.\n\tStrong positive attitude. Resilient. Self-led and self-motivated.\n\tRequired Skill: Microsoft Excel Skills.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "IT Site Support Manager Job at PZ Cussons",
    "link": "https://www.jobgurus.com.ng/jobs/view/it-site-support-manager-job-at-pz-cussons",
    "pubDate": "Fri, 27 Jun 2025 10:17:36 GMT",
    "source": "JobGurus",
    "keyword": "pz cussons",
    "duplicate": false,
    "classifications": [],
    "content": "PZ Cussons is a dynamic consumer products group and innovator of some of the world's best known and loved brands. Calling on over 130 years of expertise, we operate internationally in carefully selected developed and emerging markets that present the greatest strategic potential for future growth. Our world-class supply chain and distribution networks enable us to meet our global consumer needs and deliver quality brands that add value and enhance everyday lives.\n\nWe are recruiting to fill the position below:\n\nJob Position: IT Site Support Manager\n\nJob ID: JR002133\nJob Location: Ikorodu, Lagos\nJob type: Full-time\n\nJob Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tTimely support of IT related issues across the factory\n\tProvide desktop/Laptop immediate support for all the users both on/off site\n\tSupport TWMS system within the business warehouse\n\tSupport WBNET System across the site\n\tProvide level-0 Support to PZW SAP across the site\n\tWork closely with the Local service desk to priorities and mange open calls related to PZ Wilmar factory\n\tProvide Support for Handheld terminals, Printers, Label printers and other devices across the site\n\tIdentify LAN/WAN related issues, log calls and work closely with PZ Staffs to resolve incidents\n\tTest and evaluate New IT technology\n\tSupport facilities across Meeting room, Access Controls and CCTVs on site\n\tSupport Avaya system, MTR, and any other communication technology across the site\n\tWork closely with approved Service Provider (WAN and LAN) to Support and resolve related LAN and WAN issues across Nigeria\n\tSupport the investigation of Network related issues across other PZ & Wilmar operating Units outside Nigeria especially during service outage\n\tProvide appropriate Support for new users across the site\n\tMonitor all IT related equipment on site and report any abnormality\n\tAlign with global team and vendors to execute Network Projects, Services Improvement plan and Operations across Nigeria\n\tEnsure incident management are aligned with PZC and Wilmar standard operating procedures.\n\n\nKnowledge / Skills / Qualifications / Technical / Professional experience\nKnowledge / Qualifications:\n\n\n\tEducated to Bachelor’s Degree / HND at least degree level in an IT-related field.\n\t3+ years of IT experience within retail or an FMCG.\n\tExperience of working in a matrix organization.\n\tExperience of successfully working in cross functional teams\n\tExperience of initiating and creating business process improvements with IT\n\tAbility to demonstrate planning and organizational skills\n\tAbility to demonstrate creative problem solving\n\tStrong team player, able to work closely with other IT employees in the Global and Regional teams.\n\tSelf-motivated.\n\tExcellent communication skills.\n\tFluent in English\n\tInternational mind set\n\tEngaging and collaborative style\n\tGood influencing skills.\n\tGood planning and organizational skills\n\tAnalytical and data literate\n\tPositive outlook\n\tGood Project Management skill.\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]