[
  {
    "title": "Head, Financial Operations and Tax Job at ipNX Nigeria Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/head-financial-operations-and-tax-job-at-ipnx-nigeria-limited",
    "pubDate": "Thu, 12 Jun 2025 12:31:54 GMT",
    "source": "JobGurus",
    "keyword": "ipnx nigeria limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "ipNX is one of Nigeria’s fastest growing Information and Communications Technology companies, serving a multitude of needs across enterprises, small businesses and residents with innovative, world-class services. Our ability to identify, satisfy and exceed today’s market needs is a testament to over a decade of experience, our commitment, drive and passion realized through highly skilled and well seasoned professionals.\n\nWe are recruiting to fill the position below:\n\nJob Position: Head, Financial Operations and Tax\nJob Location: Lagos\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe HOD, Financial Operations & Tax is responsible for developing and monitoring finance policies, processes, and ensure compliance with IFRS, related standards and ensuring seamless implementation of the finance operations flows from fixed assets accounting, payables, inventory, etc.\n\tHe/She will work with the unit head and under the supervision of the Chief Financial Officer, to develop and execute processes and plans that align with the overall strategic objectives of ipNX.\n\tTo ensure efficiency in the finance operations of the company through the provision of effective support services covering the management of financial and administrative systems, to contribute to the delivery of the company’s overall commercial objectives.\n\n\nResponsibilities\n\n\n\tPrepare and present monthly, quarterly, half yearly and annual reports that are free from errors for management decision making.\n\tDrive initiatives to support the Divisions and Corporate Centre with financial information to aid decision-making.\n\tManaging Inventories, Fixed assets (Project to Assets), payables and GL analysis.\n\tAccurate presentation of annual reports for audit in line IFRS requirements for audit certification\n\tManaging all Taxes (VAT, WHT,CIT etc), Tax audit and all the related compliances\n\tTimely closure on projects and accurate recognition\n\tDrive accounting system automations\n\tConstantly review processes for standard and compliance\n\tDrive compliance and accounting treatment in line with the IFRS provisions\n\tManage and reconcile all General Ledger/Sub- ledger Accounts filtering into Income statement, Balance Sheet and Cashflow.\n\tEnsuring all the schedules are inline with the posting\n\n\nQualifications & Experience\n\n\n\tBachelor’s degree in Accounting / Economics / Banking and Finance or related field from a reputable institution. (2.1/Upper Credit Minimum)\n\tMinimum of 10 years post-qualification experience.\n\tMaster’s degree in Accounting, Finance or Business is an added advantage.\n\tProfessional qualification such as ICAN, ACA, ACCA.\n\tExperience In Implementing ERP System is an added advantage.\n\tMust have had a good experience working within fast growing companies in developing markets – Telecoms sector would be an added advantage.\n\tMust be technologically savvy with working knowledge of ERP\n\tIndustry experience: Banking, Corporate Financial Services, Investment Management.\n\tWorking knowledge of processes, reporting, management accounting and corporate finance.\n\tKnowledge of Financial management systems, accounting policies and standards (IFRS, GAAP) and costing accounting etc.\n\tStrong working knowledge of advance Excel\n\tStrong work ethics.\n\n\n \n\nNote: Only shortlisted candidates will be contacted.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Wordpress Theme Developer Job at Splantom Technolgies",
    "link": "https://www.jobgurus.com.ng/jobs/view/wordpress-theme-developer-job-at-splantom-technolgies",
    "pubDate": "Thu, 12 Jun 2025 12:31:54 GMT",
    "source": "JobGurus",
    "keyword": "splantom technolgies",
    "duplicate": false,
    "classifications": [
      "Software Engineering"
    ],
    "content": "Splantom Technolgies is an ICT firm located in Abuja that specializes in software development and trianings.\n\nWe are recruiting to fill the position below:\n\nJob Position: Wordpress Theme Developer\nJob Location: Lugbe, Abuja (Remote)\nEmployment Type: Contract\n\nDescription\n\n\n\tYou will develop a standard Ecommerce themes(sleak and fancy designs).\n\tIf you are a wordpress developer and you are also good at designs, you can apply for this role. It is 100% Remote.\n\n\nRequirements\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tA Wordpress Theme Developer who is very goot at the following: Javascript, php,css,mysql, UI/UX, Figma etc.\n\n\nMethod of Application\nInterested and qualified candidates should send their resume to: developers@splantom.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Logistics Officer Job at Gas Tech International Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/logistics-officer-job-at-gas-tech-international-limited",
    "pubDate": "Thu, 12 Jun 2025 12:31:54 GMT",
    "source": "JobGurus",
    "keyword": "gas tech international limited",
    "duplicate": false,
    "classifications": [],
    "content": "Gas Tech International Limited is an emerging Compressed and Natural Gas organisation situated along the Sagamu-Ore expressway in Ilisan, Ikenne local government area, Ogun State. We are looking to enhance our team with additional talent.\n\nWe are recruiting to fill the position below:\n\nJob Position: Logistics Officer\n\nJob Location: Ilisan Remo, Ogun\nEmployment Type: Full-time\nDepartment: Logistics\nReports to: Logistics Manager\n\nPosition Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Logistics Officer is responsible for coordinating, monitoring, and reporting on the movement, condition, and documentation of trucks, skids, and CNG delivery activities.\n\tThis role ensures that logistics operations are carried out safely, timely manner, and in compliance with industry and regulatory standards, while supporting the overall efficiency of CNG dispatch to customers.\n\n\nTasks and Activities of the Role\n\n\n\tAbility to inspect trucks and skids upon arrival\n\tEnsure truck and skid cleanliness before dispatch\n\tConfirm the validity of truck documents, driver’s license, and tire pressure.\n\tAbility to monitor truck movement using the GPS tracker\n\tMonitor customer gas flow rate and plan dispatch timing accordingly.\n\tAbility to report all the logistics activities\n\tEnsure PPE compliance.\n\n\nRequired Skills and Qualifications\n\n\n\tCandidates should possess an HND / Bachelor’s Degree in Logistics, Transport Management, or related technical field.\n\tMinimum of 4 years of experience in gas plant or logistics operations (CNG preferred)\n\tFamiliarity with GPS tracking and ERP/logistics systems.\n\tUnderstanding of truck maintenance basics and CNG safety standards.\n\tStrong interpersonal and communication skills.\n\tBasic computer literacy (Excel, email, data entry, MS suites or packages).\n\tAbility to work in shifts, including weekends and holidays.\n\tKnowledge of HSE principles, fire safety, and incident reporting.\n\n\nCompensation and Benefits\nWe offer a competitive compensation package, including:\n\n\n\tA competitive Salary\n\tHealth Maintenance Organisation (HMO) Plan\n\tAnnual Leave allowance\n\tStatutory Pension Contributions\n\tOpportunities for training and Growth.\n\n\nMethod of Application\nInterested and qualified candidates should send their Applications to: hrjobs@gastechltd.com using the Job Position as the subject of the email.\n\nNote: Only qualified candidates will be contacted.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Project Management Executive Job at Globalclique Resources",
    "link": "https://www.jobgurus.com.ng/jobs/view/project-management-executive-job-at-globalclique-resources",
    "pubDate": "Thu, 12 Jun 2025 12:31:54 GMT",
    "source": "JobGurus",
    "keyword": "globalclique resources",
    "duplicate": false,
    "classifications": [],
    "content": "Globalclique HR - Our client, is a leading independent real estate firm of Estate Surveyors and Valuers, duly registered and regulated by the Estate Surveyors and Valuers Registration Board of Nigeria (ESVARBON) and the Royal Institution of Chartered Surveyors (RICS), London. We are also a member of the Nigerian Institution of Estate Surveyors and Valuers (NIESV). With over 22 years of excellence and innovation in real estate services, and as a Collaboratory firm of Andersen Global, USA, we are committed to investing in our people—our greatest asset.\n\nThey are recruiting to fill the position below:\n\nJob Position: Project Management Executive\n\nJob Location: Lagos\nEmployment Type: Full-time\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Description\n\n\n\tTo support our continued growth and expanding client base, we are seeking a proficient and experienced Project Management Executive to join our dynamic team at our Head Office in Lagos.\n\tWe are seeking a Project Management Executive to join our Development Consultancy and Management team. The ideal candidate will be responsible for managing the end-to-end process of real estate product development—from concept to market launch—while collaborating with cross-functional teams to ensure the successful execution of strategic projects.\n\n\nKey Responsibilities\n\n\n\tDefine project scope, goals, deliverables, and success criteria.\n\tDevelop comprehensive project plans, schedules, and budgets.\n\tAssign tasks, coordinate internal teams, and manage external vendors or partners.\n\tProvide regular updates on project progress, challenges, and milestones.\n\tOrganize and lead project meetings, presentations, and reviews.\n\tDevelop risk mitigation strategies and contingency plans.\n\tOversee day-to-day project operations to ensure progress and quality.\n\tMonitor project budgets and control expenses to avoid overruns.\n\tIdentify cost-saving opportunities without compromising quality.\n\tEnsure deliverables meet required standards and client expectations.\n\tMaintain comprehensive project documentation including reports, meeting minutes, and plans.\n\tEnsure compliance with organizational policies, industry standards, and legal regulations.\n\n\nRequirements\n\n\n\tInterested candidates should possess a B.Sc / B.Eng. in Engineering, Estate Management, Quantity Surveying, Building or Architecture or a related field.\n\tMinimum of five (5) years of experience in a similar role, with proven experience managing medium to large-scale projects.\n\tMembership of relevant professional bodies (e.g., NSE, NIESV, NIQS).\n\tCertification in Project Management from a recognized institution (e.g., PMP, PRINCE2).\n\tProficiency in Microsoft Office Suite, Helioscope software, CAD, or other relevant engineering/project design tools.\n\tStrong verbal and written communication skills.\n\tAbility to lead, influence, and manage cross-functional teams.\n\tStrong analytical skills and a data-driven, solution-oriented mindset.\n\tExcellent time management and ability to handle multiple projects simultaneously.\n\tHighly organized, proactive, and adaptable personality.\n\n\nWhat We Offer\n\n\n\tCompetitive salary and benefits\n\tOfficial car\n\t13th-month salary\n\tPension support\n\tNSITF contributions\n\tHealthcare allowance\n\tOpportunities for career growth and professional development\n\tCollaborative and innovation-driven work environment\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hr@globalclique.net using \"Project Management Executive\" as the subject of the email.\n\nNote: Only shortlisted candidates will be contacted.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Accounts and Finance Manager Job at Globalclique Resources",
    "link": "https://www.jobgurus.com.ng/jobs/view/accounts-and-finance-manager-job-at-globalclique-resources",
    "pubDate": "Thu, 12 Jun 2025 12:31:54 GMT",
    "source": "JobGurus",
    "keyword": "globalclique resources",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Globalclique HR - Our client, is a leading independent real estate firm of Estate Surveyors and Valuers, duly registered and regulated by the Estate Surveyors and Valuers Registration Board of Nigeria (ESVARBON) and the Royal Institution of Chartered Surveyors (RICS), London. We are also a member of the Nigerian Institution of Estate Surveyors and Valuers (NIESV). With over 22 years of excellence and innovation in real estate services, and as a Collaboratory firm of Andersen Global, USA, we are committed to investing in our people—our greatest asset.\n\nThey are recruiting to fill the position below:\n\nJob Position: Accounts and Finance Manager\n\nJob Location: Lagos\nEmployment Type: Full-time\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Description\n\n\n\tTo support our continued growth and expanding client base, we are seeking a proficient and experienced Accounts and Finance Manager to join our dynamic team at our Head Office in Lagos.\n\tWe are looking for a reliable Accounts and Finance Manager to lead the finance and accounts operations of the firm's real estate professional and business services.\n\tThe ideal candidate will be responsible for regular communication of financial status and risks of the firm's operations.\n\tAct as the financial advisor, responsible for the preparation of financial statements. High level of due diligence, competence for the generation of, and respect for all accounting standards, including FRCN are required for this position.\n\n\nKey Responsibilities\n\n\n\tDevelop and implement financial strategies aligned with the company’s goals.\n\tProvide financial insights and recommendations to management for decision-making.\n\tOversee day-to-day accounting activities including general ledger, accounts payable/receivable, payroll, and bank reconciliations.\n\tMaintain accurate and timely financial records in accordance with accounting standards.\n\tEnsure compliance with relevant tax laws, regulatory requirements, and financial policies.\n\tMonitor departmental spending to ensure adherence to budget limits.\n\tPrepare monthly, quarterly, and annual financial statements and management reports.\n\tManage cash disbursements, bank relationships, and treasury functions.\n\tSupervise the preparation of cash flow projections and funding requirements.\n\tEnsure the team complies with internal control policies and procedures.\n\tIdentify and mitigate financial risks through proper internal controls and insurance.\n\n\nRequirements\n\n\n\tCandidates should possess an HND / B.Sc Degree in Accounting Finance, Economics, or a related field (mandatory).\n\t5 years of cognate experience (real estate company experience may be an advantage).\n\tACA, (MBA, CITN, ACCA would be an asset).\n\tStrong knowledge of accounting principles, financial regulations, and tax laws (e.g., IFRS, GAAP).\n\tProficiency in accounting software (e.g., Sage, QuickBooks, Tally, SAP, or Oracle ERP).\n\tAdvanced Microsoft Excel skills and competency in other MS Office tools.\n\tStrong communication and problem-solving abilities.\n\tAbility to explain complex financial concepts to non-finance stakeholders.\n\tAbility to work independently with minimal supervision.\n\n\nWhat We Offer\n\n\n\tCompetitive salary and benefits\n\t13th-month salary\n\tPension support\n\tNSITF contributions\n\tHealthcare allowance\n\tOpportunities for career growth and professional development\n\tCollaborative and innovation-driven work environment.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hr@globalclique.net using \"Accounts and Finance Manager\" as the subject of the email.\n\nNote: Only shortlisted candidates will be contacted.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]