[
  {
    "title": "Finance Officer Job at Addosser Investment Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/finance-officer-job-at-addosser-investment-limited",
    "pubDate": "Fri, 13 Jun 2025 12:32:03 GMT",
    "source": "JobGurus",
    "keyword": "addosser investment limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Addosser Investment Limited is a Group of Company with different subsidiaries that renders Financial Solutions Services for Individual, Business owners and Corporate Institutions.\n\nWe are recruiting to fill the position below:\n\nJob Position: Finance Officer\n\nJob Location: Lagos \nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDaily Reconciliation of Correspondence Bank Account Positions.\n\tRaising Journal Entries to update inflow and outflow of funds within all Correspondent Banks.\n\tLiquidity managment.\n\tPreparation of Monthly Depreciation Schedule of the Banks’ Fixed Assets and monthly amortization of outstanding prepared expenses.\n\tTo produce monthly, quarterly, half yearly financial reports of the organisation.\n\tMonthly remittances of Tax deductions for both Federal and Lagos State Tax Authorities.\n\tMaintenance of all Financial Documents.\n\tMonitor budget preparation and ensure proper monitor of performance and report any derivation from plan.\n\tEvaluate financial reporting systems, accounting procedures and investment activities.\n\tPreparation of Month End Reconciliation of Correspondent Bank Account Positions.\n\tKeeping Track of Banks’ Investments in Treasury Bills, Time Deposits and Call Deposits and ensurring approval is obtained from the Head, Finance for either rollover or liquidation at Maturity.\n\tDaily Review of General Ledgers.\n\tInvolved in budget preparation and implementation.\n\n\nRelevant Skills, Qualification, Attributes & Experience\n\n\n\tHND / University Degree in Banking & Finance or Accounting\n\tMinimum of 2 years of experience in financial services\n\tStudent Member of Professional body e.g. ACCA, ICAN , ANAN\n\tIFRS experience strongly desired\n\tKnowledge of the banking regulations and laws\n\tProficiency in Computer Applications Excel /Microsoft Office/Banking Application\n\tGood written and oral communication\n\tHighly attentive to detail with excellent organizational and documentation skills\n\tProven analytical skills and problem solving ability paired with meticulous attention to detail\n\tDesire to work in a fast-paced environment, consistently adhering to deadlines and evolving priorities.\n\tCandidate must be between 24 – 30 years of age (age should be clearly stated on cv)\n\tDetail-oriented and strong planning and organizing skills\n\tExcellent interpersonal, numerical and analytical skills\n\tUnquestionable integrity and high level of commitment.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: careers@addosser.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Investment Analyst Job at HB Oneira Nigeria Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/investment-analyst-job-at-hb-oneira-nigeria-limited",
    "pubDate": "Fri, 13 Jun 2025 12:32:03 GMT",
    "source": "JobGurus",
    "keyword": "hb oneira nigeria limited",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "HB Oneira Nigeria Limited is an investment company focusing on fund raising, equity investment and venture capital.\n\nWe are recruiting to fill the position below:\n\nJob Position: Investment Analyst\nJob Location: Port Harcourt, Rivers\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe ideal candidate will perform research, analysis, and reporting to support investment decisions and evaluate investment opportunities, conduct financial modelling, and prepare reports for internal and external stakeholders.\n\tHe/she may also contribute to deal structuring, due diligence, and portfolio monitoring.\n\n\nKey Responsibilities\nResearch and Analysis:\n\n\n\tConduct thorough research on companies, industries, and markets to identify potential investment opportunities.\n\tAnalyze financial statements, industry trends, and macroeconomic factors to assess company valuations and risks.\n\tDevelop and maintain financial models to forecast performance and evaluate investment proposals.\n\n\nDue Diligence:\n\n\n\tConduct due diligence on potential investments, including financial, operational, and legal reviews.\n\tVerify facts and figures, and contribute to the invest/don't invest decision.\n\n\nDeal Structuring and Negotiation:\n\n\n\tAssist in structuring investment deals, including term sheets, funding documentation, and security documents.\n\tNegotiate terms and conditions with company management and other stakeholders.\n\n\nReporting and Presentation:\n\n\n\tPrepare investment memoranda, reports, and presentations for internal stakeholders, including the Investment Committee.\n\tCommunicate investment recommendations and findings to clients and investors.\n\n\nPortfolio Monitoring:\n\n\n\tMonitor the performance of portfolio companies, tracking key metrics and providing insights to management.\n\tAssist portfolio companies on hiring, networking, and filling gaps.\n\n\nFundraising:\n\n\n\tSupport the fundraising efforts of the investment company, including identifying potential investors and preparing investment materials.\n\n\nGeneral PR:\n\n\n\tContribute to the investment company's PR/marketing activities, such as writing blog posts, speaking at conferences, and using social media.\n\n\nEducational Qualifications\nBachelor’s Degree (Essential):\n\n\n\tFields: Finance, Accounting, Economics, Business Administration, Mathematics, or related disciplines.\n\tStrong academic background, especially in quantitative or analytical subjects.\n\n\nMaster’s Degree (Optional but advantageous):\n\n\n\tOften in Finance, Economics, or an MBA with a finance concentration.\n\n\nProfessional Certifications (Highly Valued or Sometimes Required):\n\n\n\tCFA (Chartered Financial Analyst) – Most recognized globally.\n\tDemonstrates deep knowledge in investment analysis, portfolio management, and ethical standards.\n\n\nKey Skills & Competencies\n\n\n\tAnalytical & Quantitative Skills: Ability to interpret complex data and market trends.\n\tFinancial Modelling & Valuation: Proficiency in Excel, financial projections, DCF, etc.\n\tResearch Skills: Both qualitative (industry research, management analysis) and quantitative.\n\tKnowledge of Financial Markets: Understanding of equity, debt, derivatives, and alternative investments.\n\tReport Writing & Communication: Ability to explain complex investment concepts clearly.\n\tSoftware Proficiency: Bloomberg, Excel, PowerPoint, SQL, or other analytical tools.\n\n\nSalary\nN150,000 / Month.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hboneirang@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Hotel Purchasing Officer Job at Venmac Resources Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/hotel-purchasing-officer-job-at-venmac-resources-limited",
    "pubDate": "Fri, 13 Jun 2025 12:32:03 GMT",
    "source": "JobGurus",
    "keyword": "venmac resources limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Venmac Resources Limited is a hotel management company with an unmatched experience in the hospitality Industry. Over the years, we have worked with reputable 3-5 star hotels across the nation providing business solutions in the hospitality industry and we have earned ourselves as one of the emerging hospitality management company committed to seeing our clients satisfied, hence our slogan ‘Thinking Beyond Boundaries.’\n\nWe are recruiting to fill the position below:\n\nJob Position: Hotel Purchasing Officer\n\nJob Location: Abuja\nEmployment Type: Full-time\n\nDuties and Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tImplement sound purchasing policies, systems and procedures in accordance with Company standards.\n\tMonitor vendors for quality, service and price through standard purchasing specifications.\n\tObtain competitive quotations for hotel requirements and ensure that the best product is sourced and purchased.\n\tCalls for quotations for any items costing more than a certain amount (As per company policy) and inquire into prices from various suppliers. \n\tA minimum of three independent genuine quotations must be obtained.\n\tEstablish contracts to ensure reduced pricing for all operating areas of the hotel.\n\tReceives market list from the Executive Chef on a daily basis and arranges for delivery of those items daily.\n\tEnsures that all orders receiving dates are updated by the buyers according to the suppliers promised delivery dates.\n\tEnsures that all authorised or approved purchase orders are sent to their respective suppliers/vendors for delivery purposes on a daily basis.\n\tEnsures & verifies that quotations are regularly updated and supplier’s new current price lists are maintained.\n\tOn a daily basis prepare the list of to be cancelled orders and sent to accounts for deletion, with appropriate reasons.\n\tIssues regularly slow-moving item lists. \n\tApproves all storeroom re-order requests, verifying quantities within the established Min/Max stock levels.\n\tResponsible for all administrative functions of the Materials Department, staffing, training and execution of other related duties. \n\tChecks, explain if needed and approves delivered items discrepancy report issued by cost control regarding price and quantity order variances.\n\tApproves all additional requests for new storeroom items, checking correct item description, unit, packing, category and establishes Min/Max estimated stock levels.\n\tVerify the ‘pending orders’ report on a daily basis, and all pending orders are checked and verified regularly.\n\tResponsible for all purchasing functions, quotations, quality and availability.\n\tResponsible for physical control of all store items until issued, fully documented under strict control procedures (key control, timing schedule, authorised issue requests). \n\tResponsible for maintaining logical storeroom inventory levels operationally needed.\n\tSpot checks storeroom requests if properly maintained, verifies quantity requested and issued, proper items received by signatories & ID availability.\n\tSpot-checks entered system quotations, period validity quotes locked by, etc.\n\tEnsures that the suppliers follow the rules relating to the hygiene of goods delivered.\n\tKeeps all records in a way that they can be checked at any time for information or audit purposes.\n\tWilling to work a flexible schedule in order to accomplish all major responsibilities and tasks.\n\n\nRequirements\n\n\n\tCandidates should possess an HND / B.Sc Degree\n\t5-10 years of work experience.\n\n\nSalary\nN50,000 - N100,000 monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: venmachospitality@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Junior Data Analyst Job at Sproutly Inc.",
    "link": "https://www.jobgurus.com.ng/jobs/view/junior-data-analyst-job-at-sproutly-inc",
    "pubDate": "Fri, 13 Jun 2025 12:32:03 GMT",
    "source": "JobGurus",
    "keyword": "sproutly inc.",
    "duplicate": false,
    "classifications": [
      "Software Engineering"
    ],
    "content": "Sproutly Inc. is a Delaware C Corp with operations address at 1309 Coffeen Ave STE 1200, Sheridan Wyoming 82801, USA. The company is operational in Nigeria with operations service hub address at Charis Ultimo, 42/44 Kusenla Road, Lekki, Lagos. Sproutly offers financial services to schools and families in Africa through collections, financial managements and credits. Sproutly's  biggest ambition is to service the entirety of Africa and beyond and this ambition has been put into a plan we want to achieve over the next 5 years.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe’ve worked hard to create a community of forward-thinking people that are personally and professionally invested in Sproutly’s mission. Our teams bring together experienced talent and inspirational new voices to build a collaborative space to learn and grow.\n\nWe are  recruiting suitable candidates to fill the position below:\n\nJob Position: Junior Data Analyst\n\nJob Location: Lagos\nEmployment type: Full time\nWork mode: Hybrid\n\nRole Summary\n\n\n\tWe are seeking to employ Junior Data Analyst to support its education research and credit impact tracking. You’ll work closely with the Senior Analyst to gather, clean, and analyze data on school operations, student progress, and family financial behavior.\n\n\nKey Responsibilities\n\n\n\tAssist in field data collection and school-level research\n\tClean and prepare datasets on schools, fees, and student outcomes\n\tTrack and categorize private schools by income level and registration status\n\tSupport quarterly reporting and presentation of findings\n\tRun simple dashboards and summary reports using Excel or BI tools\n\n\nRequirements\n\n\n\t1–2 years of experience in data analysis or research support\n\tProficiency in Excel and basic SQL; familiarity with Python/R is a plus\n\tDetail-oriented with strong documentation habits\n\tInterest in education, financial access, or development research.\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Accounts Assistant Job at  Amy Consulting",
    "link": "https://www.jobgurus.com.ng/jobs/view/accounts-assistant-job-at-amy-consulting-1",
    "pubDate": "Fri, 13 Jun 2025 12:32:03 GMT",
    "source": "JobGurus",
    "keyword": " amy consulting",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "At Amy Consulting, we’re experts at providing outsourced HR services and advisory to SMEs and start-ups based anywhere in Nigeria.\n\nWe are recruiting to fill the position below:\n\nJob Position: Accounts Assistant\nJob Location: Osborne, Victoria Island, Lagos\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tRecord day-to-day financial transactions including purchases, expenses, sales, and receipts\n\tPrepare and maintain accounting documents and records\n\tReconcile bank statements and ensure accuracy in financial transactions\n\tSupport financial audits and ensure compliance with accounting standards and regulations\n\tProcess invoices, track payments, and manage accounts payable and receivable\n\tManage petty cash transactions and maintain proper records\n\tAssist in the preparation of monthly, quarterly, and annual financial reports\n\tFollow up on outstanding payments and ensure timely collection\n\tEnsure compliance with relevant accounting standards and regulations.\n\n\nRequirements\n\n\n\tBachelor’s degree in Accounting, Finance, or a related field preferred\n\tMinimum of 3 years of relevant work experience in accounting\n\tICAN certification in progress or partially completed is mandatory\n\tProficiency in MS Office Suite (especially Excel) and accounting software\n\tStrong attention to detail and accuracy in data entry and financial reporting\n\tGood organizational and time management skills\n\tExcellent verbal and written communication skills\n\tMust live within close proximity to Osborne, V.I.\n\n\nBenefits\n\n\n\tCompetitive salary (N200,000 - N250,000 Monthly)\n\tOpportunity to work in a structured and professional environment\n\tProfessional development and training opportunities.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and cover letter to: recruitment@amyconsulting.com.ng using \"Accounts Assistant - Osborne, V.I.\" as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]