[
  {
    "title": "Job Vacancies at JMG Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancies-at-jmg-limited",
    "pubDate": "Tue, 24 Jun 2025 09:43:18 GMT",
    "source": "JobGurus",
    "keyword": "jmg limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "JMG is a diversified solution provider with a broad portfolio in power generation, electrical infrastructures, industrial equipment, elevators & escalators and HVAC solutions. With 20 years of experience in Africa and strong partnerships with some of the world’s leading brands, JMG combines global technologies and regional expertise to fulfill the development needs of the African market.\n\nWe are recruiting to fill the following positions below:\n\n1.) Logistics Assistant \n\nJob Location: Port Harcourt, Rivers\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tJMG is currently recruiting a Logistics Assistant to join our Port Harcourt operations. We are looking for a reliable and detail-oriented professional with strong logistics and inventory management experience.\n\n\nRequirements\n\n\n\tA Degree in Accounting, Business Administration, or a related field\n\t3–5 years of experience in logistics, storekeeping, inventory control, and record-keeping\n\tMale candidates preferred\n\tResponsibilities:\n\tSupport daily logistics and inventory operations\n\tMaintain accurate records of goods and stock levels\n\tEnsure proper documentation of inventory movement\n\tAssist in storekeeping and dispatch coordination\n\n\nApplication Closing Date: 1st July, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: career@jmglimited.com using the Job Position and Location as mail subject.\n\n \n\n \n\n2.)  Account Officer\n\nJob Location: Port Harcourt, Rivers\nEmployment Type: Full-time\n\nRequirements\n\n\n\tHND or B.Sc. in Accounting\n\tMinimum of 2 years of experience as an Account Officer or Cashier.\n\n\nApplication Closing Date: 1st July, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their Application to: career@jmglimited.com using the Job Position as the subject to the mail.\n\n \n\n \n\n3.) Inventory Audit Officer\n\nJob Location: Gbagada, Lagos\nEmployment Type: Full-time\n\nBrief Description\n\n\n\tResponsible for conducting thorough audits, reconciling stock levels, investigating discrepancies, and collaborating with teams.\n\n\nDuties\n\n\n\tAuditing stock Sampling on daily basis.\n\tAuditing assets when required.\n\tAttending to any sudden Audit Nationwide.\n\tFiling and Posting Audit when required.\n\tQuarterly full stock count.\n\tAll Showrooms Audit twice a month.\n\tTake up IMS responsibilities such as reporting unsafe act, condition or procedure in the workplace, participating in fire or emergency drill at work, participating in incident reporting and investigation when necessary and adherence to Company policies.\n\n\nMinimum Requirements\n\n\n\tB.Sc / HND qualification in any related field.\n\t3 - 5 years of proven working experience as an Inventory Audit Officer.\n\n\nCompetencies:\n\n\n\tFamiliarity with modern warehousing practices and methods.\n\tGood organizational and time management skills.\n\tAbility to lift heavy objects.\n\tAbility to work under pressure.\n\tAnalytical Skills.\n\tExcellent physical condition and coordination.\n\n\nApplication Closing Date: 25th July, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: F.esawe@jmglimited.com using the Job Position as the subject to the mail.\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Procurement / F&B Supervisor Job at Stardom Lounge",
    "link": "https://www.jobgurus.com.ng/jobs/view/procurement-fb-supervisor-job-at-stardom-lounge",
    "pubDate": "Tue, 24 Jun 2025 09:43:18 GMT",
    "source": "JobGurus",
    "keyword": "stardom lounge",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Stardom Lounge is created to provide luxury lifestyle, entertainment and variety of tasty cuisines. We also thrive in providing employees comfortable work environment and opportunity for career growth.\n\nWe are recruiting to fill the position below:\n\nJob Position: Procurement / F&B Supervisor\n\nJob Location: Surulere, Lagos\nEmployment Type: Full-time\n\nJob Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tSource and procure food and beverages from approved suppliers.\n\tNegotiate prices and terms with suppliers.\n\tManage inventory levels to ensure adequate stock and minimize waste.\n\tImplement cost control measures to minimize waste and optimize profitability.\n\tConduct regular audits to ensure compliance with company policies and procedures.\n\tSupervise food and beverage staff to ensure efficient and effective service delivery.\n\tMonitor food quality and presentation to ensure compliance with company standards.\n\tMaintain high levels of customer satisfaction through prompt and courteous service.\n\n\nPreferred Qualifications\n\n\n\tCertification in procurement, hospitality, or related field.\n\tExperience with inventory management software and excellent knowlegde in microsoft office use (Excel)\n\tKnowledge of food safety and hygiene regulations.\n\n\nSalary\nN250,000 - N400,000 / month. \n\nMethod of Application\nInterested and qualified candidates should send their CV to: Recruitdv8@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Customer Service Officer Job at TeamAce Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/customer-service-officer-job-at-teamace-limited-2",
    "pubDate": "Tue, 24 Jun 2025 09:43:18 GMT",
    "source": "JobGurus",
    "keyword": "teamace limited",
    "duplicate": false,
    "classifications": [],
    "content": "TeamAce Limited - Our client, a Culinary company, is recruiting to fill the position below:\n\nJob Position: Customer Service Officer\nJob Location: Ikoyi, Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAs our customer service officer, you will act as the point of contact for customers and provide information by responding to customers' queries and requests.\n\tYou are to ensure customer satisfaction and provide support to customers.\n\tYou must also ensure customer orders are taken appropriately, confirmed, and communicated to the appropriate department using the company’s approved process.\n\n\nResponsibilities\n\n\n\tEnsure timely responses to customer inquiries and complaints, ensuring customer satisfaction at every step.\n\tUpdate the production and logistics schedules to meet clients’ demands.\n\tManage delivery schedules, coordinating with drivers and logistics partners to ensure on-time, efficient deliveries.\n\tAddress any customer complaints or issues directly, ensuring problems are resolved swiftly and to the customer’s satisfaction.\n\n\nRequirements\n\n\n\tBSc / HND in a business-related field.\n\tMinimum of 2 to 3 years of relevant experience in Customer Service management, preferably in retail or food manufacturing.\n\n\nSalary\nN200,000 Monthly (Gross).\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "IT Support Officer Job at TeamAce Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/it-support-officer-job-at-teamace-limited",
    "pubDate": "Tue, 24 Jun 2025 09:43:18 GMT",
    "source": "JobGurus",
    "keyword": "teamace limited",
    "duplicate": false,
    "classifications": [],
    "content": "TeamAce Limited - Our client, a leading Frozen Distribution firm, is recruiting to fill the position below:\n\nJob Position: IT Support Officer\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tAs the IT Officer, you will be responsible for daily IT functions, troubleshooting hardware/software issues, and assisting with inventory systems and warehouse-related technologies.\n\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tProvide technical support for hardware, software, and networking issues across the organization.\n\tInstall, configure, and maintain computer systems and networks.\n\tMonitor and maintain company systems, including inventory and warehouse management software.\n\tSupport the implementation and smooth operation of warehouse technology, including barcode scanners, printers, and inventory tracking tools.\n\tAssist in managing backups, data recovery, and security protocols.\n\tCollaborate with warehouse staff to troubleshoot and resolve system-related challenges in inventory processes.\n\n\nRequirements\n\n\n\tBachelor's degree or HND in Computer Science, Information Technology, or a related field.\n\tMinimum of 2 years of experience in an IT support role.\n\tBasic knowledge of warehousing operations and inventory management systems.\n\n\nSalary\nN250,000 - N300,000 Monthly.\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]