[
  {
    "title": "Job Openings at Ganfeng Lithium Industry Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-ganfeng-lithium-industry-limited",
    "pubDate": "Fri, 17 Oct 2025 14:15:19 GMT",
    "source": "JobGurus",
    "keyword": "ganfeng lithium industry limited",
    "duplicate": false,
    "classifications": [],
    "content": "Ganfeng Lithium Industry Limited is a leading mining and mineral processing company based in Nigeria, with a core focus on the exploration, extraction, and processing of lithium.\n\nWith operational branches strategically located in Lagos, Abuja, and Nasarawa, Ganfeng Lithium Industry Limited ensures efficient coordination across exploration sites, processing facilities, and administrative functions. The company is committed to sustainable and responsible mining practices, working closely with local communities, regulatory agencies, and industry stakeholders to ensure environmental compliance and socio-economic development.\n\nWe are recruiting to fill the following positions below:\n\n1.) Domestic Staff\n     \n\n            \n    \n\n\n\nJob Location: Abuja (FCT)\nEmployment Type: Full-time\n\nDescription\n\n\n\tWe are looking for a reliable and hardworking Domestic Staff to join our team.\n\tThe ideal candidate must be responsible, well-organized, and able to handle multiple duties with minimal supervision.\n\n\nResponsibilities\n\n\n\tMust be technically handy and can fix things.\n\tRun errands as assigned.\n\tClean and maintain the pool area.\n\tWater and care for flowers and plants.\n\tIron and properly care for clothes.\n\tCarry out other domestic tasks as assigned without complaint.\n\n\nRequirements\n\n\n\tCandidates should possess relevant qualifications.\n\tMust have experience in domestic work.\n\tBasic knowledge of gardening/plant care.\n\tAbility to work diligently and follow instructions.\n\tMust be respectful, honest, and proactive.\n\n\nSalary\nN70,000 / Month.\n\nApplication Closing Date: 18th November, 2025.\n\nMethod of Application \nInterested and qualified candidates should send their CV to: ganfenglithiumindustrylimited1@gmail.com using the Job Position as the subject of the email.\n\n \n\n \n\n2.) Driver\n\nJob Location: Katampe Extension, Abuja (FCT)\nEmployment Type: Full-time\n\nJob Description\n\n\n\tThe Driver will be responsible for safely transporting company staff, goods, and materials to designated destinations. The role requires strict adherence to traffic laws, maintenance of assigned vehicles in good condition, and ensuring timely delivery of all transportation-related duties.\n\n\nKey Responsibilities\n\n\n\tDrive company vehicles safely and efficiently to transport staff, goods, and materials as assigned.\n\tMaintain a clean and well-functioning vehicle at all times.\n\tConduct routine checks on vehicle condition and report any faults or maintenance needs promptly.\n\tEnsure proper documentation of vehicle use, including fuel logs and trip records.\n\tComply with all road and traffic regulations.\n\tEnsure the security of passengers and company property while in transit.\n\tMaintain punctuality and adhere to the daily work schedule.\n\tPerform any other duties as may be assigned by management.\n\n\nRequirements\n\n\n\tMinimum of SSCE or equivalent qualification.\n\tValid driver’s license and clean driving record.\n\tProven experience as a driver (minimum of [2–5] years preferred).\n\tGood knowledge of local routes and road networks.\n\tAbility to communicate effectively and follow instructions.\n\tMust be punctual, responsible, and trustworthy.\n\tWilling to stay in the company premises.\n\n\nSalary\nN80,000 - N100,000 / Month.\n\nApplication Closing Date: 20th October, 2025.\n\nMethod of Application \nInterested and qualified candidates should send their CV to: ganfenglithiumindustrylimited1@gmail.com using the Job Position as the subject of the of the email.\n\n \n\n \n\n3.) Laboratory Assistant\n\nJob Location: Keffi, Nasarawa\nEmployment Type: Full-time\n\nSummary\n\n\n\tWe are looking for a reliable and hardworking Lab Assistant to join our team.\n\tThe successful candidate will be responsible for picking and handling samples and assisting with general laboratory activities.\n\n\nRequirements\n\n\n\tMinimum of O’Level qualification\n\tMust be detail-oriented, organized, and punctual\n\tAbility to follow instructions and work efficiently\n\tPrevious experience will be an added advantage.\n\n\nBenefits\n\n\n\tSalary: N70,000 – N90,000 monthly\n\tAccommodation provided\n\tAttendance bonus\n\tPerformance bonus.\n\n\nApplication Closing Date: 20th October, 2025.\n\nMethod of Application\nInterested and qandidates candidates should send their CV to: ganfenglithiumindustrylimited1@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Openings at Rockshield Asset Protection Company Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-rockshield-asset-protection-company-limited",
    "pubDate": "Fri, 17 Oct 2025 14:15:19 GMT",
    "source": "JobGurus",
    "keyword": "rockshield asset protection company limited",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance"
    ],
    "content": "Rockshield Asset Protection Company Limited is a registered security outsourcing services provider in Nigeria. We deliver innovative, tailored security solutions in Asset Protection, Loss Prevention, Private Guarding, Corporate Protocol, Vetting, Background Checking, and Civil Concierge Services. Our goal is to safeguard the assets and interests of our diverse clientele with professionalism and precision.\n\nWe are recruiting to fill the following positions below:\n\n1.) Business Development Manager\n\nJob Location: Lagos \n\nJob Description\n     \n\n            \n    \n\n\n\n\n\tThe Business Development Manager will lead the business development, sales, and marketing functions to drive revenue growth, enhance market presence, and ensure the company achieves its strategic objectives.\n\tThe role involves developing and executing commercial strategies, building long-term partnerships, and optimizing business operations to deliver sustained profitability and competitive advantage thereby ensuring the company’s sustained growth and market leadership strategic business development, innovative sales strategies, and effective marketing execution.\n\n\nKey Responsibilities\nCommercial Strategy & Business Development:\n\n\n\tDevelop and implement the company's commercial strategy in alignment with overall business objectives.\n\tIdentify and pursue new business opportunities, partnerships, and market segments to drive revenue growth.\n\tLead market analysis and feasibility studies to identify trends, emerging markets, and competitive positioning.\n\tEstablish and nurture relationships with key stakeholders, including clients, partners, and industry bodies.\n\n\nSales Leadership:\n\n\n\tSet and achieve sales targets, budgets, and key performance indicators (KPIs) to ensure revenue growth.\n\tOversee the entire sales cycle, from lead generation and negotiation to contract closure and after-sales service.\n\tMentor and manage the sales team to enhance productivity, professionalism, and client acquisition skills.\n\tImplement effective sales forecasting and pipeline management processes.\n\n\nMarketing Management:\n\n\n\tDevelop and execute marketing strategies to promote the company's services and enhance brand visibility.\n\tOversee the creation of marketing materials, campaigns, and promotional activities.\n\tManage digital marketing initiatives, including website optimization, social media, and email campaigns.\n\tMonitor and analyze the performance of marketing activities and adjust strategies accordingly.\n\n\nRevenue Optimization:\n\n\n\tNegotiate contracts, pricing, and terms to maximize profitability and ensure client satisfaction.\n\tCollaborate with finance and operations teams to optimize pricing models and manage costs effectively.\n\tMonitor revenue streams, identify risks, and develop strategies for sustained profitability.\n\n\nCustomer Relationship Management:\n\n\n\tBuild and maintain strong relationships with existing and potential clients to foster loyalty and repeat business.\n\tImplement and manage a robust CRM system to track customer interactions and opportunities.\n\tAddress client concerns and ensure prompt resolution to maintain high levels of satisfaction.\n\n\nTeam Leadership:\n\n\n\tLead, motivate, and develop the business development, sales, and marketing teams.\n\tFoster a culture of accountability, collaboration, and innovation within the department.\n\tProvide training and professional development opportunities for team members.\n\n\nPerformance Reporting:\n\n\n\tProvide regular reports on commercial performance, including sales, marketing, and revenue metrics, to the executive team.\n\tUtilize data and analytics to inform decision-making and strategy adjustments.\n\tMonitor competitor activities and adjust strategies to maintain a competitive edge.\n\n\nRequirements\n\n\n\tInterested candidates should possess a Bachelor's Degree with 3 - 7 years of experience.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: protection@rockshieldprotection.com using the Job Position as the subject of the email.\n\n \n\n \n\n2.) Vetting/Investigation Officer\n\nJob Location: Lagos\n\nJob Summary\n\n\n\tThe Vetting Officer is responsible for conducting thorough background checks, verification, and screening of all security personnel and staff to ensure compliance with company standards and client requirements.\n\tThe role ensures that only qualified, credible, and trustworthy individuals are deployed to client sites, thereby maintaining the company’s integrity, professionalism, and reputation for delivering reliable security services.\n\n\nKey Responsibilities\nBackground Verification & Screening\n\n\n\tConduct comprehensive background checks on prospective employees including address verification, guarantor verification, criminal record checks, and employment history.\n\tVerify authenticity of submitted documents such as identification cards, certificates, and references.\n\tLiaise with relevant authorities (e.g., police, previous employers, local community leaders) to validate information.\n\n\nVetting Documentation & Record Management:\n\n\n\tMaintain accurate and up-to-date vetting records for all personnel.\n\tPrepare vetting reports with clear recommendations for employment or rejection.\n\tEnsure compliance with data protection and confidentiality standards.\n\tMaintain a centralized vetting database for easy retrieval and audit purposes.\n\n\nCompliance & Policy Enforcement:\n\n\n\tEnsure vetting procedures align with company policies, client requirements, and statutory obligations.\n\tIdentify risks related to personnel integrity and escalate findings to management.\n\tSupport HR and Operations in enforcing company disciplinary and compliance standards.\n\n\nCoordination & Communication:\n\n\n\tWork closely with the recruitment and deployment teams to ensure timely completion of the vetting process before posting personnel to client sites.\n\tCommunicate effectively with applicants, guarantors, and relevant authorities during verification.\n\tParticipate in staff audits and re-vetting exercises to ensure continued compliance.\n\n\nReporting & Continuous Improvement:\n\n\n\tPrepare and submit regular reports on vetting activities, trends, and risks identified.\n\tRecommend improvements to the vetting process for greater efficiency and reliability.\n\tSupport investigations into incidents involving staff integrity issues or client complaints.\n\n\nQualifications & Experience\n\n\n\tMinimum of OND / HND / B.Sc.in Criminology, Security Studies, Psychology, Sociology, or any related field.\n\t2 - 4 years of experience in background screening, investigation, or a related role (preferably in a security firm or law enforcement environment).\n\tKnowledge of security operations, risk assessment, and background verification procedures.\n\tStrong analytical, observational, and communication skills.\n\tProficiency in MS Office (Word, Excel, Outlook)and report writing.\n\n\nKey Competencies & Attributes:\n\n\n\tHigh sense of integrity and confidentiality.\n\tAttention to detail and accuracy.\n\tStrong interpersonal and investigative skills.\n\tAbility to work independently and under pressure.\n\tEthical judgment and professionalism.\n\tExcellent record-keeping and organizational ability.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: protection@rockshieldprotection.com using the Job Position as the subject of the email.\n\n \n\n \n\n3.) Specialized Security Manager\n\nJob Location: Lagos\n\nJob Description\n\n\n\tAs a Specialized Security Manager, you will play a pivotal role in driving business growth by leading allied security teams such as vetting, risk management, training etc, Ensuring provision of fit for purpose security solutions to clients across the Country.\n\n\nResponsibilities\nIntelligence / Risk Management:\n\n\n\tDevelop, implement and commercialize creative intelligence products and services, including security reports, threat assessments at site, country and regional levels , security risk assessments, industry articles and security briefs.\n\tGather, evaluate and analyse security information from various sources to support intelligence-based decision-making and services\n\tMaintain an in-depth and current knowledge of Nigeria and Africa's political and security environment.\n\n\nKYC / Due diligence/ Investigations:\n\n\n\tDevelop, implement and commercialize services around KYC, Customer Due Diligence (CDD) and Enhanced Due Diligence (EDD) etc\n\tGrow the capacity of Vetting and Background checks units\n\tDevelop specialized investigative services for different clients segments such as contractor/vendor vetting, corporate investigations, digital forensics etc.\n\n\nSecurity Consulting and Advisory:\n\n\n\tDevelop and commercialize specialised security/safety training curriculum such as HEAT, DD, EP etc\n\tDrive security consulting services in areas such as risk management, Business continuity, threat assessment, design and implementation of security systems etc\n\tDrive qualitative security risk services such as advisories, travel advisory and management etc.\n\n\nRequirements\nQualification:\n\n\n\tBachelor's Degree in Humanities , social sciences or related fields\n\tBackground in Government security forces is essential ( DSS, CID or DMI)\n\tMembership of Background screeners Association is preferrable\n\tMembership of relevant security Associations such as ASIS would be an added advantage.\n\n\nThe successful candidate will require:\n\n\n\tIndepth understanding of country, regional and global security landscape\n\tRisk management and business continuity competencies\n\tExperience in Corporate security management\n\tExperience leading high performing sales-focused teams\n\tUnderstanding country's intelligence community and law enforcement liaison.\n\n\nMethod of Application \nInterested and qualified candidates should send their CV to: protection@rockshieldprotection using the Job Position as the subject of the email.\n\n     \n\n    \n\n        Click here to Apply",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Fleet / Logistics Officer Job at Cen Global Services Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/fleet-logistics-officer-job-at-cen-global-services-limited-2",
    "pubDate": "Fri, 17 Oct 2025 14:15:19 GMT",
    "source": "JobGurus",
    "keyword": "cen global services limited",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing",
      "Software Engineering"
    ],
    "content": "(function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){\n        (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),\n        m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)\n    })(window,document,'script','//www.google-analytics.com/analytics.js','ga');\n\n    ga('create', 'UA-43112273-1', 'jobgurus.com.ng');\n    ga('send', 'pageview');\n\n\n\n\n    \n        \n    Home\n    Jobs\n    Free Aptitude Test Practice\n    Employer? Post a Job\n            Register\n        Sign in\n        Contact us\n    \n\n    \n\n        \n    \n        \n\n            \n\n                \n\n                    \n                        Toggle navigation\n                        \n                        \n                        \n                    \n\n                    \n                \n            \n\n            \n                \n\n\tJobs\n\tJob Seekers\n\tAptitude Test\n\tScholarships\n\n            \n\n            \n                \n\n                                            Register\n                        Sign in\n                    \n                    Employer? Post a Job\n                \n            \n\n        \n\n    \n\n        \n        \n            \n            \n                 \n    \n        \n     \n\n\n                            \n                    \n        \n                        CLICK HERE TO JOIN OUR WHATSAPP CHANNEL \n                    \n    \n\n    \n                                \n                    \n\n                        \n                            \n                        \n\n                        \n                            \n                                Any Specialization\n                                                                    Accounting / Audit / Finance\n                                                                    Administration/ Office/ Operations\n                                                                    Advertising/ Social Media/ Marketing/ PR\n                                                                    Agriculture / Agro Allied\n                                                                    Analyst/ Quality Control\n                                                                    Automotive/ Car Services\n                                                                    Aviation / Airline\n                                                                    Banking / Insurance\n                                                                    Building Design / Architecture\n                                                                    Construction / Mining\n                                                                    Consulting / Business Strategy/ Planning\n                                                                    Craftsmen / Artisans\n                                                                    Creatives (Arts, Design, Fashion)\n                                                                    Customer Service\n                                                                    Domestic / Janitorial Services\n                                                                    Driving / Haulage\n                                                                    Education / Teaching / Training\n                                                                    Engineering / Technical\n                                                                    Executive / Management\n                                                                    Freelance / Data Entry\n                                                                    Government Agencies / Public Sector\n                                                                    Graduates / Freshers\n                                                                    Grants /  Scholarships\n                                                                    Hospitality / Food Services\n                                                                    HSE / Safety Management\n                                                                    Human Resources / Recruitment\n                                                                    Information Technology / ICT\n                                                                    Internship/ Industrial Training\n                                                                    Legal / Law\n                                                                    Logistics / Transportation/ Supply\n                                                                    Manufacturing / Production\n                                                                    Maritime Services / Shipping\n                                                                    Media / Art / Entertainment\n                                                                    Medical/ Healthcare / Pharmaceutical\n                                                                    Military / Para-Military\n                                                                    NGO / Community Services\n                                                                    Oil & Gas / Energy\n                                                                    Procurement/ Purchasing\n                                                                    Project Management\n                                                                    Real Estate / Property / Surveying\n                                                                    Research / Survey\n                                                                    Risk Management / Compliance\n                                                                    Sales / Business Development\n                                                                    Secretarial / PA\n                                                                    Security / Intelligence\n                                                                    Software/ Programming / Web development\n                                                                    Sports / Fitness\n                                                                    Supply Chain/ Store\n                                                                    Technicians\n                                                                    Telecommunications\n                                                                    Tourism / Travels\n                                                                    Vocational Trade and Services\n                                                            \n                        \n\n                        \n                            \n                                Any Work Level\n                                                                    Entry Level (Trainee)\n                                                                    Executive (Director, Head of Dept)\n                                                                    Experienced (Non-Manager)\n                                                                    Internship\n                                                                    Manager (Staff Supervisor)\n                                                                    Senior Executive (MD, CEO, COO)\n                                                                    Vocational (Skilled/Unskilled Labour)\n                                                            \n                        \n\n                        \n                            \n                                 Search\n                            \n                        \n                    \n                \n                            \n            \n\n\n\n\n\n\n            \n\n                \n                                        \n                    \n                                        \n                    \n                    \n\n                    \n                        \n                        \n\n{\n  \"@context\": \"https://schema.org\",\n  \"@type\": \"JobPosting\",\n  \"title\": \"Fleet / Logistics Officer\",\n  \"description\": \"Cen Global Services Limited (&amp;ldquo;Cen Global&amp;rdquo;) is proudly a Nigerian registered company with broad specialization in Shipping &amp;amp; Marine, Recruitment &amp;amp; Manpower Supply, Procurement &amp;amp; Engineering Services, and Consultancy Services. Cen Global was incorporated in March, 2010.\n\nOur business sustainable approach is to understand the needs of our clients and subsequently create a uniquely structured service process tailored towards meeting or exceeding expectations.\nOur Corporate Head office is located in Port Harcourt, Rivers State, Nigeria but we have developed a robust network around the country to effectively deliver products and services across Nigeria at a very short notice\n\nWe are recruiting to fill the position below:\n\nJob Position: Fleet / Logistics Officer\nJob Location:&amp;nbsp;Port Harcourt, Rivers\nEmployment Type: Full-time\n\nDescription\n\n\n\tWe are seeking a dependable and detail-oriented Fleet / Logistics Officer to manage day-to-day transportation and logistics operations in Onitsha and Port Harcourt, Rivers State.\n\tThe ideal candidate is proactive, organized, and committed to ensuring the smooth and cost-effective movement of people, goods, and services within and outside the state.\n\n\nKey Responsibilities\n\n\n\tCoordinate and monitor all fleet and logistics activities to ensure efficiency and cost-effectiveness.\n\tMaintain accurate documentation of all company vehicles, drivers, and logistics activities.\n\tSchedule and dispatch vehicles and drivers to ensure timely deliveries and pickups.\n\tTrack and monitor vehicle movement using GPS or fleet management tools.\n\tManage fuel usage, trip records, and driver performance reports.\n\tEnsure all vehicles comply with transportation regulations, insurance, and company safety policies.\n\tCollaborate with vendors, clients, and internal departments to support seamless logistics operations.\n\tProvide periodic reports on fleet performance, maintenance, and operational costs.\n\n\nRequirements\n\n\n\tBachelor&amp;rsquo;s Degree in Logistics, Supply Chain Management, Business Administration, or a related field.\n\tMinimum of 2 years of proven experience in a fleet, transport, or logistics operations role.\n\tStrong understanding of route planning, vehicle tracking systems, and transportation regulations.\n\tWorking knowledge of relevant transport and compliance standards in Nigeria.\n\tExcellent organizational, communication, and problem-solving skills.\n\n\nMethod of Application&amp;nbsp;\nInterested and qualified candidates should send their CV to:&amp;nbsp;careers@cenglobalservices.com&amp;nbsp;using&amp;nbsp;&amp;ldquo;Fleet / Logistics Officer&amp;quot; as the subject of the email.\",\n  \"datePosted\": \"2025-10-17\",\n  \"validThrough\": \"2025-11-15\",\n  \"employmentType\": \"Full-Time\",\n  \"hiringOrganization\": {\n    \"@type\": \"Organization\",\n    \"name\": \"Cen Global Services Limited\"\n    \n  },\n  \"jobLocation\": {\n    \"@type\": \"Place\",\n    \"address\": {\n      \"@type\": \"PostalAddress\",\n       \"postalCode\": \". \",\n       \"addressRegion\": \". \",\n       \"streetAddress\": \". \",\n      \"addressLocality\": \"Rivers (PH)\",\n      \"addressCountry\": \"NG\"\n     \n      \n    }\n  },\n  \"identifier\": {\n    \"@type\": \"PropertyValue\",\n    \"name\": \"\",\n    \"value\": \"188982\"\n  },\n  \"baseSalary\": {\n    \"@type\": \"MonetaryAmount\",\n    \"currency\": \"NGN\",\n    \"value\": {\n      \"@type\": \"QuantitativeValue\",\n      \"minValue\": 0,\n      \"maxValue\": 0,\n      \"unitText\": \"MONTH\"\n    }\n  }\n}\n\n\n\nFleet / Logistics Officer Job at Cen Global Services Limited\n\n\n\n\n        \n    \n\n        \n        Cen Global Services Limited (“Cen Global”) is proudly a Nigerian registered company with broad specialization in Shipping & Marine, Recruitment & Manpower Supply, Procurement & Engineering Services, and Consultancy Services. Cen Global was incorporated in March, 2010.\n\nOur business sustainable approach is to understand the needs of our clients and subsequently create a uniquely structured service process tailored towards meeting or exceeding expectations.\nOur Corporate Head office is located in Port Harcourt, Rivers State, Nigeria but we have developed a robust network around the country to effectively deliver products and services across Nigeria at a very short notice\n     \n\n            \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Fleet / Logistics Officer\nJob Location: Port Harcourt, Rivers\nEmployment Type: Full-time\n\nDescription\n\n\n\tWe are seeking a dependable and detail-oriented Fleet / Logistics Officer to manage day-to-day transportation and logistics operations in Onitsha and Port Harcourt, Rivers State.\n\tThe ideal candidate is proactive, organized, and committed to ensuring the smooth and cost-effective movement of people, goods, and services within and outside the state.\n\n\nKey Responsibilities\n\n\n\tCoordinate and monitor all fleet and logistics activities to ensure efficiency and cost-effectiveness.\n\tMaintain accurate documentation of all company vehicles, drivers, and logistics activities.\n\tSchedule and dispatch vehicles and drivers to ensure timely deliveries and pickups.\n\tTrack and monitor vehicle movement using GPS or fleet management tools.\n\tManage fuel usage, trip records, and driver performance reports.\n\tEnsure all vehicles comply with transportation regulations, insurance, and company safety policies.\n\tCollaborate with vendors, clients, and internal departments to support seamless logistics operations.\n\tProvide periodic reports on fleet performance, maintenance, and operational costs.\n\n\nRequirements\n\n\n\tBachelor’s Degree in Logistics, Supply Chain Management, Business Administration, or a related field.\n\tMinimum of 2 years of proven experience in a fleet, transport, or logistics operations role.\n\tStrong understanding of route planning, vehicle tracking systems, and transportation regulations.\n\tWorking knowledge of relevant transport and compliance standards in Nigeria.\n\tExcellent organizational, communication, and problem-solving skills.\n\n\nMethod of Application \nInterested and qualified candidates should send their CV to: careers@cenglobalservices.com using “Fleet / Logistics Officer\" as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n\n\n\n        \n        \n\n            \n    \n\n\n\n\n   \n\n\n    \n        Similar Jobs\n    \n\n    \n        \n                        Fleet / Logistics Officer Job at Cen Global Services Limited\n                        Logistics / Operations Trainee Job at White Soul Group\n                        Logistics Support Officer Job at Bluepeak Consulting\n                        Logistics Analyst Job at NoemDek Limited\n                        Fleet Officer Job at Sahara Group\n                        Visa Officer Job at Elders Group\n                        Logistics / Delivery Driver - Bus Job at  Busivel Group\n                        Delivery Personnel Job at Lvtopsun New Energy Company Limited\n                        FINANCE LIAISON OFFICER\n                        Logistics Assistant Job at Flour Mills of Nigeria Plc\n                    \n    \n\n\n\n                        \n                    \n\n                    \n                        \n\n\n\n    \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n\n\n\n\n\n          \n\n\n    \n\n        Hottest Jobs\n\n        \n        \n            \n\n                Apply Before November 24 and Become a Software Developer\n\n               \n            \n        \n            \n\n                Job Vacancies at AXA Mansard Insurance Plc\n\n               \n            \n        \n            \n\n                Bank Teller Job at Workforce Group\n\n               \n            \n        \n            \n\n                Bank Teller Job at kimberly Ryan Limited\n\n               \n            \n        \n            \n\n                Job Openings at Oando Plc\n\n               \n            \n        \n            \n\n                2026 GZI Industries Graduate Trainee Programme\n\n               \n            \n        \n            \n\n                FINANCE LIAISON OFFICER\n\n               \n            \n        \n            \n\n                Data Entry Officer Job at Cola Solar\n\n               \n            \n        \n            \n\n                Assistant Administrative Officer Job at Westfield Consulting\n\n               \n            \n        \n            \n\n                Administrative Officer (Facility Management) Job at Petrogap Oil and Gas Limited\n\n               \n            \n        \n        \n\n    \n\n\n\n\n        \n        \n   \n\n\n                    \n                            \n            \n        \n        \n        \n\n        \n\n    \n\n        \n\n            \n\n                \n\n                    Job Seekers\n\n                    \n\n                        Search for Jobs\n                         Featured Jobs\n                         Jobs by Specialization\n                         Jobs by Industry\n                         Jobs by Location\n                         \n                        Companies Currently Hiring\n\n                        Upload CV\n\n                        Free Aptitude Test Practice\n                        \n                        Scholarships and Financial Aid\n\n                        Testimonies\n                    \n\n                \n\n                \n\n                    Employers\n\n                    \n\n                        Post A Job\n\n                        Search Resumes/Profiles\n\n                        Create Employer Account\n\n                        Advertise\n\n                        Pricing\n\n                    \n\n                \n\n                \n\n                    Tools & Resources\n\n                    \n\n                        Contact us\n                        \n                        Our Blog\n\n                        Job XML/RSS Feeds\n \n                        Free Aptitude Test Practice\n\n                        Bank Details\n\n                        FAQ & Support\n\n                    \n\n                \n\n                \n\n                    Connect with us\n\n                    \n\n                        \n\n                            \n\n                            \n\n                        \n\n                        \n\n                            \n\n                            \n\n                        \n\n                \n\n                        \n\n                            \n\n                            \n\n                        \n\n                    \n\n\n\n                    \n\n                        Customer Care\n\n                        09134259221 \n\n                        (9am - 5pm) weekdays\n\n                         info [at] jobgurus.com.ng\n\n                    \n\n\n\n                \n\n            \n\n        \n\n    \n\n\n\n    \n\n        \n\n\n\n            \n\n                Privacy Policy\n\n                Terms & Conditions\n\n                Sitemap\n                \n                About us\n\n            \n\n\n\n            Copyright © 2025 Jobgurus.com.ng - Latest Jobs in Nigeria 2025. All right reserved.",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]