[
  {
    "title": "Reservation Executive Job at Club Concierge Africa",
    "link": "https://www.jobgurus.com.ng/jobs/view/reservation-executive-job-at-club-concierge-africa-1",
    "pubDate": "Tue, 08 Jul 2025 14:43:37 GMT",
    "source": "JobGurus",
    "keyword": "club concierge africa",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Club Concierge Africa is recruiting suitably qualified candidates to fill the position below:\n\nJob Position: Reservation Executive\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Reservation Executive will be responsible for managing customer bookings and travel reservations for flights, hotels, tours, and other travel-related services.\n\tThis role involves providing excellent customer service, ensuring accuracy in reservation details, maintaining up-to-date knowledge of travel products and services, and supporting the sales and operations teams in delivering a seamless travel experience.\n\n\nKey Responsibilities\n\n\n\tHandle and process customer travel inquiries and reservations via phone, email, or online platforms.\n\tBook flights, accommodation, tour packages, transfers, and other travel services.\n\tCoordinate with travel vendors, airlines, hotels, and internal departments to confirm bookings.\n\tResolve booking-related issues, cancellations, amendments, and rebookings.\n\tMaintain high levels of customer satisfaction and provide post-booking support as required.\n\tProvide customers with travel options, pricing, and booking recommendations based on their needs.\n\tIssue tickets, vouchers, and travel documentation accurately and in a timely manner.\n\tEnsure all bookings are accurately documented and updated in the reservation system.\n\tKeep up-to-date with industry trends, airline fare rules, and promotional offers.\n\tSupport sales and marketing campaigns with reservation logistics and data reporting.\n\n\nMethod of Application\nInterested and qualified candidates should send their Application / CV to: career@clubconcierge.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Content & PR Associate Job at Club Concierge Africa",
    "link": "https://www.jobgurus.com.ng/jobs/view/content-pr-associate-job-at-club-concierge-africa",
    "pubDate": "Tue, 08 Jul 2025 14:43:37 GMT",
    "source": "JobGurus",
    "keyword": "club concierge africa",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Club Concierge Africa is an African travel and hospitality conglomerate specializing in packaged travel and resort destinations across Africa, Europe, and the Americas.\n\nWe are recruiting to fill the position below:\n\nJob Position: Content & PR Associate\n\nJob Location: Lagos\n\nResponsibilities\nContent Development and Strategy:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tContent Creation: Develop high-quality, engaging, and on-brand content for blogs, social media, newsletters, press releases, website pages, and marketing collateral.\n\tEditorial Calendar Management: Maintain a consistent content publishing schedule aligned with marketing campaigns and key brand moments.\n\tStorytelling: Craft compelling narratives that communicate our value proposition, customer stories, and brand experience across multiple channels.\n\n\nPublic Relations and Media Outreach:\n\n\n\tPR Strategy Execution: Develop and execute PR plans that align with business goals and position Club Concierge and associated companies as thought leaders in the premium travel and concierge services space.\n\tMedia Relations: Build and maintain strong relationships with journalists, bloggers, influencers, and media houses across relevant sectors.\n\tPress Materials: Write and distribute press releases, media kits, and briefing documents to secure coverage in premium publications and online platforms.\n\tMonitoring & Reporting: Track media coverage and report on PR outcomes, including reach, engagement, and sentiment analysis.\n\n\nBrand Communications:\n\n\n\tMessaging Consistency: Ensure brand tone, messaging, and voice remain consistent across all communications and channels.\n\tInternal Communications: Support internal communications efforts, such as company announcements, employee spotlights, and newsletters.\n\tPartnership Support: Develop content to support brand collaborations, influencer partnerships, and cross-promotional campaigns.\n\n\nSocial and Digital Content Collaboration:\n\n\n\tSocial Content Support: Collaborate with the digital marketing team to repurpose PR stories into engaging social media content.\n\tSEO Alignment: Incorporate SEO best practices into all written content to maximize search discoverability and organic reach.\n\n\nMarket and Audience Insights:\n\n\n\tAudience Understanding: Leverage data and feedback to tailor content and messaging to different audience segments.\n\tIndustry Trends: Stay up to date with lifestyle, travel, and hospitality trends to inform content strategy and uncover media opportunities.\n\n\nRequirements\n\n\n\tCandidates should possess relevant qualifications with 3 - 5 years of experience.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: career@clubconcierge.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Project Manager Job at Club Concierge Africa",
    "link": "https://www.jobgurus.com.ng/jobs/view/project-manager-job-at-club-concierge-africa",
    "pubDate": "Tue, 08 Jul 2025 14:43:37 GMT",
    "source": "JobGurus",
    "keyword": "club concierge africa",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Club Concierge Africa is recruiting suitably qualified candidates to fill the position below:\n\nJob Position: Project Manager\n\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a dynamic and detail-oriented Project Manager to lead and oversee strategic initiatives across our travel and hospitality operations.\n\tThe ideal candidate will have a strong background in project management, exceptional organizational skills, and a passion for travel and customer experience.\n\tThis role requires cross-functional coordination, clear communication, and a results-driven approach to ensure timely and cost-effective delivery of high-quality services.\n\n\nKey Responsibilities\n\n\n\tPlan, execute, and monitor projects across departments including operations, marketing, product development, and client services.\n\tDefine project scope, goals, timelines, and deliverables in collaboration with stakeholders.\n\tCoordinate internal resources and third-party vendors for seamless execution of travel and hospitality initiatives.\n\tIdentify and mitigate potential risks and issues that may impact project success.\n\tCommunicate project status, updates, and potential roadblocks to senior management and stakeholders.\n\tDevelop detailed project plans, track progress, and adjust plans as needed to meet goals.\n\tEnsure compliance with budget, quality, and schedule expectations.\n\tConduct post-project evaluations and implement continuous improvement strategies.\n\tFoster a collaborative environment and ensure client satisfaction remains a core focus throughout all project phases.\n\n\nRequirements\n\n\n\tCandidates should possess a Bachelor's Degree with at least 5 years of experience.\n\n\nMethod of Application\nInterested and qualified candidates should send their Applications / CV to: career@clubconcierge.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]