[
  {
    "title": "Operations Lead / Manager Job at GIVO Africa",
    "link": "https://www.jobgurus.com.ng/jobs/view/operations-lead-manager-job-at-givo-africa",
    "pubDate": "Thu, 19 Jun 2025 09:17:16 GMT",
    "source": "JobGurus",
    "keyword": "givo africa",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "GIVO Africa is a circular economy company, leveraging the use of technology to collect, process, and upcycle plastic waste into valuable goods. We are a network of tech-enabled recycling centres with a manufacturing arm, where we make consumer and industrial products out of recyclables\n\nWe are recruiting to fill the position below:\n\nJob Position: Operations Lead / Manager\nJob Location: Lagos\nEmployment Type: Full-time\nReports to: CEO\nManages: All Operations Employees\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a proactive and detail-oriented Operations Lead to oversee daily activities across our recycling operations and ensure alignment with our mission to drive circular economy solutions in Africa.\n\tThe Operations Lead will manage facility workflows, coordinate logistics, supervise staff, and implement process improvements to enhance efficiency, safety, and sustainability..\n\n\nKey Responsibilities\n\n\n\tOversee daily operations of recycling processes, including collection, sorting, processing, and disposal.\n\tEnsure smooth and efficient workflow across departments (e.g., collection teams, sorting line, processing units).\n\tMonitor and track production metrics to meet operational targets.\n\tIdentify inefficiencies and implement strategies for improving the recycling process.\n\tStreamline workflows to reduce downtime and improve overall productivity.\n\tImplement sustainable practices and reduce the company’s environmental footprint.\n\tLead and manage a team of operations staff including supervisors, machine operators, and logistics personnel.\n\tProvide training and support to team members to improve efficiency and safety.\n\tSet up centers in line with Givo requirements and operations systems.\n\tEnsure all operations comply with environmental regulations, health, and safety standards.\n\tConduct regular safety checks and ensure that the facility meets all local and federal regulations regarding waste disposal and recycling.\n\tLead initiatives to enhance employee safety and reduce work-related accidents.\n\tMonitor inventory levels of raw materials and ensure the timely procurement of necessary resources.\n\tOversee maintenance of equipment and facilities, coordinating repairs as needed.\n\tEnsure proper waste disposal methods for materials that cannot be recycled.\n\tBuild and maintain relationships with waste collection partners, suppliers, and clients.\n\tLiaise with government agencies and regulators to ensure compliance with environmental laws.\n\tCollaborate with other departments such as finance, sales, and HR to align operations with broader company goals.\n\tPrepare operational reports and present them to upper management.\n\tMaintain accurate records of recycling output, inventory levels, and staff performance.\n\tDevelop and monitor KPIs to track operational performance and make data-driven decisions.\n\tPerform other duties as assigned.\n\n\nQualifications\n\n\n\tBachelor’s degree in Operations Management, Environmental Science, Engineering, or a related field\n\t3–5 years of relevant experience in operations or supply chain, preferably in recycling, manufacturing, or sustainability-focused sectors\n\tStrong administrative, leadership and organizational skills\n\tProficiency in Microsoft Excel or Google Sheets; experience with operations tools/software is a plus\n\tExcellent problem-solving and communication skills\n\tPassion for sustainability and circular economy principles\n\n\nKey Behavioral Competencies:\n\n\n\tLeadership and People Management\n\tCustomer Focus and Stakeholder Management\n\tCommunication Skills\n\tProblem Solving and Decision making\n\tSustainability and Environmental Responsibility.\n\n\nSalary\nN600,000 - N800,000 per month.\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Social Media Manager Job at Raphael Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/social-media-manager-job-at-raphael-group-3",
    "pubDate": "Thu, 19 Jun 2025 09:17:16 GMT",
    "source": "JobGurus",
    "keyword": "raphael group",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Raphael Group - A professional virtual assistant service that connects employers with skilled remote assistants. We offer a wide range of services to support individuals and businesses, including scheduling, email management, research, and more. We take the hassle out of finding and hiring qualified virtual assistants, allowing you to focus on growing your business.\n\nWe are recruiting to fill the position below:\n\nJob Position: Social Media Manager\nJob Locations: Abuja (FCT) and Lagos\nEmployment Type: Full-time\n\nDescription\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are a dynamic and forward-thinking company seeking a dedicated and experienced Social Media Manager to join our team.\n\tIf you are proactive, creative, and have a proven track record of managing successful social media campaigns, we would love to hear from you.\n\n\nKey Responsibilities\n\n\n\tDevelop, implement, and manage social media strategies across various platforms (Facebook, Instagram, Twitter, LinkedIn, etc.).\n\tCreate engaging multimedia content and manage social media accounts, ensuring brand consistency and voice.\n\tAnalyze social media metrics and derive actionable insights to optimize performance.\n\tCollaborate with other departments to align social media strategies with overall marketing goals.\n\tStay up-to-date with the latest social media best practices and technologies.\n\tMonitor SEO and web traffic metrics to assess campaign effectiveness.\n\tManage social media advertising campaigns, including budget allocation and performance tracking.\n\n\nRequirements\n\n\n\tInterested candidates should possess an HND / Bachelor's Degree\n\tMinimum of 5 years of experience in social media management, with a strong portfolio of successful campaigns.\n\tClear proof of work, including case studies or examples of past projects.\n\tProficiency in social media management tools (e.g., Hootsuite, Buffer, Sprout Social).\n\tStrong understanding of social media KPIs and analytics tools (Google Analytics, Facebook Insights, etc.).\n\tExcellent communication, writing, and editing skills.\n\tCreative thinker with the ability to develop innovative and engaging content.\n\tStrong organizational and multitasking skills with the ability to manage multiple projects simultaneously.\n\tExperience with graphic design tools (e.g., Adobe Creative Suite, Canva) is a plus.\n\tMust be really good with CapCut.\n\n\nDesired Attributes:\n\n\n\tHighly motivated and proactive with a passion for social media and digital marketing.\n\tStrong analytical skills and attention to detail.\n\tAbility to work independently and as part of a team.\n\tExcellent time management and organizational skills.\n\tAbility to stay calm under pressure and meet tight deadlines.\n\tPositive attitude and strong work ethic.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]