[
  {
    "title": "JavaScript Developer (Freelance) Job at AtlanticRide",
    "link": "https://www.jobgurus.com.ng/jobs/view/javascript-developer-freelance-job-at-atlanticride",
    "pubDate": "Mon, 09 Jun 2025 15:41:37 GMT",
    "source": "JobGurus",
    "keyword": "atlanticride",
    "duplicate": false,
    "classifications": [
      "Software Engineering"
    ],
    "content": "AtlanticRide is a dynamic and informative blog focused on sharing business, career, and education knowledge. It also has a consultant section where we leverage advanced AI and machine learning to proffer solutions to real world problems for our clients. We are passionate about providing valuable content to our readers.\n\nWe are recruiting to fill the position below:\n\nJob Position: JavaScript Developer (Freelance)\n\nJob Location:  Nigeria\nEmployment Type: Contract\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe're looking for a skilled Freelance JavaScript Developer to help us with a few important fixes and enhancements on our existing web application. This is a short-term, intensive project with an estimated duration of one week.\n\n\nAbout the Project\n\n\n\tOur application needs immediate attention in a few key areas. You'll be working to resolve existing issues and implement minor feature improvements to optimize performance and user experience. We'll provide you with detailed documentation and direct access to our team for any questions.\n\n\nProject Duration\n\n\n\tThis is a one-week contract position. We're looking for someone who can hit the ground running and dedicate their full attention to this project for the duration. Depending on the outcome, we can extend the contract.\n\n\nYour Responsibilities\n\n\n\tIdentifying and fixing bugs within the existing JavaScript codebase.\n\tImplementing minor feature enhancements as specified.\n\tEnsuring the stability and performance of the application.\n\tCommunicating progress and any challenges encountered.\n\n\nRequirements\nWhat We're Looking For:\n\n\n\tProven experience with JavaScript development.\n\tStrong debugging and problem-solving skills.\n\tAbility to work independently and efficiently.\n\tExcellent communication skills to collaborate effectively.\n\tA strong portfolio or examples of previous JavaScript projects.\n\n\nMethod of Application\nInterested and qualified candidates should send their Resume to: contact@atlanticride.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "General Manager Job at Espritsor Enterprises",
    "link": "https://www.jobgurus.com.ng/jobs/view/general-manager-job-at-espritsor-enterprises",
    "pubDate": "Mon, 09 Jun 2025 15:41:37 GMT",
    "source": "JobGurus",
    "keyword": "espritsor enterprises",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Espritsor - An HR and recruitment service company duly registered with CAC, is recruiting to fill the position below:\n\nJob Position: General Manager\nJob Location: Kado, Abuja (FCT) \nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe are seeking a seasoned General Manager to lead our rapidly growing real estate firm in Abuja. This is an exceptional opportunity for a creative, meticulous, and results-driven leader to transform ambitious ideas into tangible success.\n\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tStrategic & Operational Leadership: Drive business objectives through meticulous planning, operational excellence, and effective management of real estate acquisitions, development, and sales.\n\tSales & Business Development: Lead high-value negotiations, ensure successful deal closures, and identify new business opportunities to expand our market presence.\n\tAdministrative & Financial Oversight: Manage comprehensive administrative functions, including budgeting, financial oversight, and regulatory compliance.\n\tInnovation & Technology Adoption: Champion the use of modern applications, including AI tools, social media strategies, and advanced administration/financial software.\n\tTeam & Event Management: Lead and mentor a diverse team, fostering a culture of collaboration, and expertly plan and execute high-impact real estate events.\n\n\nRequired Qualifications & Experience\n\n\n\tEducation: Bachelor's degree in Real Estate, Business Administration, Marketing, or a related field; Master's degree or relevant certifications preferred.\n\tExtensive Real Estate Experience: Proven track record in real estate management, business operations, and regulatory compliance.\n\tSales & Negotiation Expertise: Demonstrated success in sales negotiation and closing deals.\n\tStrategic & Meticulous Planner: Highly organized with the ability to execute flawlessly.\n\tProblem-Solving & Digital Literacy: Exceptional creative problem-solver, highly conversant with modern applications, including AI and social media.\n\tResidency: Must be currently resident in Abuja, FCT.\n\n\nSalary\nN400,000 - N550,000 per month.\n\nMethod of Application\nInterested and qualified candidates should send their comprehensive CV and a cover letter detailing their relevant experience and why they are the ideal candidate for this role to espritsorng@gmail.com using the Job Position as the subject of the email.\n\nNote: Only shortlisted candidates will be contacted.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Openings at Express Resource Connect",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-express-resource-connect-1",
    "pubDate": "Mon, 09 Jun 2025 15:41:37 GMT",
    "source": "JobGurus",
    "keyword": "express resource connect",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Express Resource Connect was launched in 2020 as a response to developing a home grown business management solution simplified enough to be used by an owner manager of any business or an enterprise with multiple business processes and employees. We offer a comprehensive business management solution, empowering smal, mid-size, and large enterprises to automate, digitise, and seamlessly manage al their business operations in one integrated platform.\n\nWe are recruiting to fill the following positions below:\n\n1.) Pastry Chef\n\nJob Location: Ibadan, Oyo\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a passionate and diligent Pastry Chef to join our team! This role is ideal for someone in their 20s, preferably female, who is enthusiastic about baking and delivering great customer service.\n\tWhile prior expertise in pastries is not required, a willingness to learn and a strong work ethic are essential.\n\n\nKey Responsibilities\n\n\n\tAssist in preparing a variety of pastries, baked goods, and desserts\n\tMaintain cleanliness and hygiene in the kitchen and work area\n\tGreet and serve customers courteously and professionally\n\tFollow recipes and instructions with attention to detail\n\tCollaborate with team members to ensure smooth kitchen operations\n\tUphold the values of honesty, diligence, and responsibility.\n\n\nRequirements\n\n\n\tCandidates should possess relevant qualifications with 0 - 1 year of experience.\n\tFemale (Preferred), aged in 20s\n\tBasic knowledge or interest in baking (training can be provided)\n\tExcellent customer service and communication skills\n\tHardworking, trustworthy, and reliable\n\tWillingness to work Monday to Saturday.\n\n\nWhat We Offer\n\n\n\tOn-the-job training in pastry and dessert preparation\n\tSupportive and friendly work environment\n\tOpportunities to grow your skills in the culinary space.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: recruitment@express-resource.com using the Job Position as the subject of the email.\n\n \n\n2.) Chef (Line Cook / Sous Chef)\n\nJob Location: Ibadan, Oyo\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe are hiring skilled and passionate chefs for a dynamic and fast-growing reputable food service team.\n\tYou’ll be responsible for preparing meals according to our set recipes and standards, maintaining cleanliness and food safety, and ensuring efficient kitchen operations in a fast-paced environment.\n\n\nKey Responsibilities\n\n\n\tPrepare and cook meals based on the daily menu (includes breakfast bowls, sandwiches, rice bowls, shawarma, fries, wraps, lunch, finger foods and more) gourmet style.\n\tEnsure portions, plating, and food presentation are consistent with brand standards.\n\tMaintain cleanliness of the kitchen and adhere to hygiene regulations.\n\tMonitor stock levels and communicate low inventory to management.\n\tSupport food prep, storage, and kitchen organization.\n\tMaintain speed and accuracy during rush hours.\n\tAssist with menu development and specials where needed.\n\n\nRequirements\n\n\n\tInterested candidates should possess relevant qualifications\n\tMinimum 2 years of experience in a professional kitchen or fast-casual restaurant.\n\tKnowledge of food safety, health standards, and kitchen best practices.\n\tAbility to work under pressure and in a team.\n\tCulinary training or relevant certification is a plus.\n\tGood communication and time management skills.\n\tPassion for food, consistency, and quality.\n\n\nWhat We Offer\n\n\n\tCompetitive pay and performance-based incentives.\n\tOn-the-job training and career development opportunities.\n\tA vibrant, team-oriented work environment.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: recruitment@express-resource.com using the Job Position as the subject of the email.\n\n \n\n \n\n3.) Operations Associate\n\nJob Location: Ibadan, Oyo\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe are looking for smart, energetic, and reliable Operations Associates to support the daily front-of-house and back-of-house activities at our campus location.\n\tYou will rotate across different duties including order handling, packaging, inventory support, and customer engagement, ensuring smooth, fast, and friendly service throughout the day.\n\n\nRoles & Responsibilities\nOrder:\n\n\n\tGreet customers warmly and guide them through the menu.\n\tTake customer orders accurately via POS or mobile platforms.\n\tProcess payments (cash, card, digital).\n\tConfirm orders with the kitchen and update customers on wait times.\n\n\nPackaging:\n\n\n\tAssemble and package meals for dine-in, takeaway, and delivery.\n\tEnsure correct order items and quality checks before handing off.\n\tLabel, bag, and dispatch orders neatly and efficiently.\n\tMaintain cleanliness of the packaging station.\n\n\nInventory:\n\n\n\tTrack and report packaging, disposables, and drink stock daily.\n\tRestock service stations and prep areas as needed.\n\tAlert management to low or missing inventory items.\n\tSupport receiving and organizing weekly stock deliveries.\n\n\nCustomer Experience:\n\n\n\tMonitor dining and pickup areas for cleanliness and customer needs.\n\tHandle basic customer complaints or escalate them to supervisors.\n\tCollect customer feedback and assist with surveys or loyalty efforts.\n\tHelp set up promotional materials or display new menu items.\n\n\nRequirements\n\n\n\t1–2 years of experience in a food service, retail, or customer-facing role.\n\tStrong communication and teamwork skills.\n\tFriendly and respectful attitude toward students and staff.\n\tAbility to multitask and stay organized during peak hours.\n\tTech-savvy (POS, order apps); training will be provided.\n\tSSCE or ND minimum; undergraduate students may apply if available during assigned shifts.\n\tWillingness to work weekends and rotating shifts.\n\n\nWhat We Offer\n\n\n\tCompetitive pay and performance-based incentives.\n\tOn-the-job training and career development opportunities.\n\tA vibrant, team-oriented work environment.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: recruitment@express-resource.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Administrative Assistant Job at Uptitek Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/administrative-assistant-job-at-uptitek-limited",
    "pubDate": "Mon, 09 Jun 2025 15:41:37 GMT",
    "source": "JobGurus",
    "keyword": "uptitek limited",
    "duplicate": false,
    "classifications": [
      "Software Engineering"
    ],
    "content": "Uptitek Limited is a leading software company specializing in the development and implementation of Enterprise Resource Planning (ERP) and Government Resource Planning (GRP) solutions. With a diverse portfolio of over 50 custom-built applications, we cater to the needs of businesses, governments, and other organizations worldwide.\n\nAt Uptitek, we take pride in our role as product owners, driving innovation and efficiency through cutting-edge software solutions. Our team of skilled developers and industry experts collaborate closely with clients to understand their unique requirements and deliver tailored solutions that streamline operations, enhance productivity, and drive growth.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Administrative Assistant\nJob Location: Owerri, Imo\nEmployment Type: Full-time\n\nJob Description\n\n\n\tAs an Administrative Assistant, you will play a crucial role in supporting our company’s operations by handling all administrative tasks that do not involve coding or software development.\n\tYour work will enable our technical and management teams to focus on their core responsibilities by ensuring efficient office and administrative management.\n\n\nKey Responsibilities\n\n\n\tManage daily administrative operations including scheduling meetings, organizing calendars, and coordinating appointments.\n\tHandle correspondence such as emails, phone calls, and mail on behalf of the management and teams.\n\tMaintain and organize company records, files, and documentation both physical and digital.\n\tAssist in preparing reports, presentations, and documentation as needed.\n\tSupport onboarding and offboarding processes for employees.\n\tOrganize company events, meetings, and travel arrangements.\n\tCoordinate office supplies inventory and procurement.\n\tLiaise with vendors, clients, and internal teams to facilitate smooth communication.\n\tAssist with basic bookkeeping and expense tracking.\n\tEnsure compliance with company policies and procedures in administrative tasks.\n\n\nQualifications\n\n\n\tProven experience as an administrative assistant or in a similar administrative role.\n\tExcellent organizational and multitasking skills with keen attention to detail.\n\tStrong verbal and written communication abilities.\n\tProficient in Microsoft Office Suite (Word, Excel, PowerPoint, Outlook) and general office software.\n\tAbility to handle confidential information with discretion.\n\tSelf-motivated, proactive, and able to work independently or as part of a team.\n\tExperience in a tech or software environment is a plus but not required.\n\n\nMethod of Application\nInterested and qualified candidates should forward their CV and Cover Letter to: contactus@uptitek.com using the Job Position as the subject of the mail.\n\nNote: Only candidates residing in Owerri, Imo State will be considered.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Human Resource Manager Job at Flavours Master Restaurant",
    "link": "https://www.jobgurus.com.ng/jobs/view/human-resource-manager-job-at-flavours-master-restaurant",
    "pubDate": "Mon, 09 Jun 2025 15:41:37 GMT",
    "source": "JobGurus",
    "keyword": "flavours master restaurant",
    "duplicate": false,
    "classifications": [],
    "content": "Flavours Master Restaurant is a vibrant and rapidly expanding restaurant brand, distinguished as a true culinary destination. We pride ourselves on offering an unparalleled dining experience, featuring a meticulously crafted menu that journeys from the sophisticated tastes ofcontinental cuisine to the rich, authentic flavours of Africana dishes, complemented by an array of delightful snacks. Our commitment extends beyond the plate; we are dedicated to fostering a culture of operational excellence, continuous innovation, and outstanding customer satisfaction. Joining Flavours Master means becoming part of a passionate team poised for significant growth and impact in the dynamic hospitality sector.\n\nWe are recruiting to fill the position below:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Position: Human Resource Manager\n\nJob Location: Lagos\n\nAbout the Role\n\n\n\tWe are seeking a dedicated and organized Human Resources Manager to join our organization. The ideal candidate will be a detail-oriented individual with strong organizational and communication skills.\n\n\nResponsibilities\n\n\n\tCoordinate recruitment and onboarding processes, including screening resumes, scheduling interviews, and conducting background checks.\n\tMaintain accurate employee records, including personnel files, attendance records, and performance evaluations.\n\tProcess payroll and benefits administration.\n\tCoordinate employee training and development programs.\n\tAssist with employee relations and resolving employee concerns.\n\tProvide administrative support to the MD, including scheduling meetings, preparing reports, and managing correspondence.\n\n\nQualifications\n\n\n\tCandidates should possess a Degree in Human Resources or similar course\n\tStrong organizational and time management skills.\n\tExcellent communication and interpersonal skills.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: susaneze5@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]