[
  {
    "title": "Job Openings at Neveah Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-neveah-limited-1",
    "pubDate": "Wed, 07 Jan 2026 09:48:46 GMT",
    "source": "JobGurus",
    "keyword": "neveah limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Neveah Limited is a leading commodities trading company essentially dealing in the export of solid minerals and agricultural products.\n\nThe company was established in 2014 with five operational offices in different states and her head office in Abuja, Nigeria. Our services are centered around sourcing the finest, solid minerals and the healthiest agricultural products from the local market and exporting them to meet the demands of our customers at international markets.\n\nWe are recruiting to fill the following positions below:\n\n1.) Treasury Officer\n     \n\n            \n    \n\n\n\nJob Location: Mowe (Lagos–Ibadan Expressway), Ogun\nEmployment Type: Full-time\nDepartment / Unit: Finance & Accounts\nDirectly Reports to: Finance Manager, MD/CEO\nInternal Interactions: Production, Procurement, Stores, Business Development HR, and Admin\n\nRole Overview\n\n\n\tTo manage the company’s cash flow, banking relationships, funding, foreign exchange exposure, and payment obligations in support of efficient recycling operations, raw material procurement, production continuity, and sales revenue optimization.\n\n\nKey Responsibilities\nCash & Liquidity Management:\n\n\n\tMonitor daily cash positions across all bank accounts and currencies.\n\tEnsure adequate liquidity for raw material purchases (scrap aluminum, copper, dross), logistics, fuel, and plant operations.\n\tPrepare daily, weekly, and monthly cash flow forecasts.\n\tOptimize cash utilization and minimize idle funds.\n\n\nBanking & Funding Management:\n\n\n\tManage relationships with commercial banks, microfinance banks, and financial institutions.\n\tNegotiate banking charges, loan terms, overdrafts, and credit facilities.\n\tCoordinate short-term working capital financing for high-volume scrap purchases.\n\tEnsure timely repayment of loans, overdrafts, and interest obligations.\n\n\nPayments & Collections Oversight:\n\n\n\tOversee timely processing of supplier payments, especially scrap dealers, transporters, utilities, and contractors.\n\tCoordinate collections from customers, exporters, and local buyers of aluminum ingots, copper cathodes, and dross by-products.\n\tMonitor receivables aging and escalate overdue accounts.\n\n\nForeign Exchange (FX) & Trade Transactions:\n\n\n\tManage FX exposure related to importation of equipment, spare parts, consumables, and export sales (where applicable).\n\tExecute FX purchases and conversions in line with approved policies.\n\tSupport export documentation, repatriation of proceeds, and trade finance instruments (LCs, Form NXP, etc.).\n\tMonitor FX rates and advise management on timing of conversions.\n\n\nTreasury Controls & Compliance:\n\n\n\tEnsure compliance with internal treasury policies, approval limits, and segregation of duties.\n\tMaintain proper documentation for all treasury transactions.\n\tSupport audit processes by providing treasury schedules, bank confirmations, and reconciliations.\n\tEnsure compliance with CBN, tax, and regulatory requirements.\n\n\nReporting & Management Support:\n\n\n\tPrepare treasury reports:\n\t\n\t\tDaily cash position\n\t\tWeekly cash forecast\n\t\tMonthly bank reconciliation summaries\n\t\tFX exposure reports\n\t\n\t\n\tProvide financial insights to management for procurement, production planning, and capital expenditure decisions.\n\tSupport budgeting and financial planning processes.\n\n\nRisk Management:\n\n\n\tIdentify and mitigate liquidity, FX, interest rate, and counterparty risks.\n\tMonitor exposure to scrap suppliers and large customers.\n\tRecommend hedging or risk-mitigation strategies where applicable.\n\n\nKey Performance Indicators (KPIs)\n\n\n\tAccuracy of cash flow forecasts\n\tTimeliness of supplier and loan payments\n\tReduction in bank charges and FX losses\n\tImprovement in cash conversion cycle\n\tCompliance and audit outcomes\n\tEffective management of working capital.\n\n\nQualifications & Experience\n\n\n\tBachelor’s degree in Accounting, Finance, Economics, or related field\n\t5–7 years of treasury or finance experience (manufacturing, metals, recycling, or commodity-based industry preferred)\n\tProfessional certification (ICAN, ACCA, CFA – added advantage)\n\tStrong knowledge of banking operations, FX, and cash management\n\n\nSkills & Competencies:\n\n\n\tStrong analytical and numerical skills\n\tExcellent understanding of cash-intensive operations\n\tHigh integrity and attention to detail\n\tStrong negotiation and relationship management skills\n\tProficiency in ERP systems and Microsoft Excel\n\tAbility to work under pressure in a fast-paced plant environment.\n\n\nApplication Closing Date: 21st January, 2026.\n\nMethod of Application \nInterested and qualified candidates should send their updated CV saved in their full name to: careers@neveah.com.ng using “TREASURY OFFICER - MOWE” as the subject of the mail.\n\nNote: Only properly submitted applications and qualified candidates will be considered.\n\n \n\n \n\n2.)  Inventory Accountant\n\nJob Location: Mowe, Ogun\nEmployment Type: Full-time\n\nRole Overview\n\n\n\tThe Inventory Accountant will be responsible for monitoring, valuing, and reconciling inventory movements to ensure accurate financial reporting and strong internal control of stock.\n\tThe role requires close collaboration with storekeepers, procurement, operations, and finance teams to ensure inventory integrity across all processes.\n\n\nKey Responsibilities\n\n\n\tMaintain and reconcile inventory records in ERP and accounting systems.\n\tTrack all stock movements (receipts, issues, transfers, and adjustments).\n\tPerform monthly stock counts and variance analysis in collaboration with storekeepers.\n\tMonitor inventory valuation methods (FIFO, Weighted Average, etc.) to ensure compliance with IFRS.\n\tReview and report slow-moving, obsolete, or damaged stock.\n\tLiaise with procurement and operations teams to ensure inventory accuracy.\n\tSupport cost accounting in preparing COGS and production-related reports.\n\tEnforce internal control procedures for material receipt, storage, and issuance.\n\tPrepare periodic inventory and consumption reports for management decision-making.\n\tAssist auditors during stock audits and year-end reviews.\n\n\nSMART KPIs:\n\n\n\tInventory Reconciliation Accuracy: Maintain ≥ 99% accuracy in stock reconciliation.\n\tStock Variance: Ensure monthly stock variance does not exceed ≤ 1%.\n\tReporting Timeliness: Submit monthly inventory reports within 3 working days after month-end.\n\tAudit Compliance: Achieve ≥ 95% compliance rating during internal and external stock audits.\n\tObsolete Stock Monitoring: Identify and report ≥ 100% of slow-moving and obsolete stock within reporting timelines.\n\n\nQualifications & Experience\n\n\n\tBachelor’s degree in Accounting, Finance, or related field with a minimum of 5 years post-graduate experience, with at least 3 years in a manufacturing environment.\n\tMust be a Chartered Accountant (ICAN, ACCA, or equivalent).\n\tMust reside in Lagos or Ogun State, within proximity to Mowe.\n\n\nSkills & Competencies:\n\n\n\tStrong knowledge of inventory accounting, controls, and reconciliation.\n\tProficiency in MS Excel and ERP/accounting software.\n\tStrong analytical and problem-solving skills.\n\tHigh attention to detail and accuracy.\n\tAbility to work under pressure and meet tight deadlines.\n\tExcellent communication and collaboration skills.\n\n\nApplication Closing Date: 20th January, 2026.\n\nMethod of Application \nInterested and qualified candidates should send their updated CV saved in their full name to: careers@neveah.com.ng using the Job Position as the subject of the mail.\n\nNote: Only properly submitted applications and qualified candidates will be considered.\n\n \n\n3.) Health, Safety, and Environment (HSE) Officer\n\nJob Location: Ogun\nEmployment Type: Full-time\n\nJob Purpose\n\n\n\tThe HSE Officer is responsible for ensuring compliance with health, safety, and environmental regulations and policies at the aluminium and copper recycling plant.\n\tThe role involves implementing and monitoring safety programs, conducting risk assessments, and promoting a culture of safety and environmental responsibility within the organization.\n\n\nKey Responsibilities\nHealth and Safety Management:\n\n\n\tDevelop, implement, and maintain the plant’s health and safety policies and procedures.\n\tConduct regular safety inspections, audits, and risk assessments to identify potential hazards and implement corrective actions.\n\tInvestigate accidents, incidents, and near-misses, and prepare detailed reports with recommendations to prevent recurrence.\n\tOrganize and conduct health and safety training programs for employees and contractors.\n\tMonitor the proper use of personal protective equipment (PPE) by all employees.\n\tEnsure compliance with local and international health and safety regulations.\n\n\nEnvironmental Management:\n\n\n\tMonitor and enforce environmental compliance, including waste management, pollution control, and recycling practices.\n\tEnsure the plant adheres to environmental laws, standards, and permits.\n\tWork with operations to minimize environmental impact and promote sustainability initiatives.\n\tConduct regular environmental impact assessments and recommend improvements.\n\n\nEmergency Preparedness:\n\n\n\tDevelop and update emergency response plans and procedures.\n\tConduct emergency drills and simulations to ensure preparedness among employees.\n\tAct as the point of contact for external agencies during emergencies, audits, and inspections.\n\n\nReporting and Documentation:\n\n\n\tMaintain accurate records of safety inspections, audits, incident investigations, and training activities.\n\tPrepare and submit periodic HSE performance reports to management.\n\tEnsure documentation aligns with regulatory requirements and company standards.\n\n\nContinuous Improvement:\n\n\n\tProactively identify opportunities to improve HSE performance and implement best practices.\n\tCollaborate with other departments to integrate HSE considerations into operational processes.\n\n\nQualifications and Skills\nEducation:\n\n\n\tBachelor’s Degree in Environmental Science, Occupational Health and Safety, Engineering, or a related field.\n\n\nCertifications:\n\n\n\tNEBOSH International General Certificate (or equivalent).\n\tISO 45001 and ISO 14001 certification knowledge is an advantage.\n\n\nExperience:\n\n\n\tMinimum of 5-7 years of HSE experience in a manufacturing or recycling environment.\n\tFamiliarity with aluminium and copper processing operations is highly desirable.\n\n\nSkills and Competencies:\n\n\n\tStrong knowledge of local and international HSE regulations and standards.\n\tExcellent risk assessment and incident investigation skills.\n\tProficient in Microsoft Office Suite and HSE management software.\n\tStrong communication and interpersonal skills to effectively train and engage employees.\n\tAbility to work independently and as part of a team.\n\n\nApplication Closing Date: 21st January, 2026.\n\nMethod of Application\nInterested candidates should submit their Resume detailing their experience and qualifications to: careers@neveah.com.ng using \"Health, Safety, and Environment (HSE) Officer\" as the subject of the mail.\n\nNote: Only shortlisted candidates will be contacted.\n\n     \n\n    \n\n        Click here to Apply",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]