[
  {
    "title": "Job Openings at Shulifang Biotechnology",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-shulifang-biotechnology-2",
    "pubDate": "Mon, 09 Jun 2025 10:45:16 GMT",
    "source": "JobGurus",
    "keyword": "shulifang biotechnology",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Shulifang Biotechnology is a Chinese company located in the lekki free zone Lagos Nigeria. which produces and manages household daily necessities, such as dishwashing liquid, powder detergent, edible oil, etc\n\nWe are recruiting to fill the following positions below:\n\n1.) Sales Officer\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob  Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe're seeking a results-driven Sales Officer to join our dynamic team. As a Sales Officer, you'll be responsible for driving sales growth, building customer relationships, and expanding our market presence.\n\n\nKey Responsibilities\n\n\n\tSales Growth: Meet and exceed sales targets through effective customer engagement and relationship-building.\n\tCustomer Relationship Management: Develop and maintain strong relationships with existing and potential customers.\n\tMarket Research: Stay up-to-date on market trends, competitor activity, and customer needs.\n\tProduct Knowledge: Develop and maintain in-depth knowledge of our products/services.\n\n\nRequirements\n\n\n\tSales experience, preferably in a similar industry.\n\tExcellent communication and interpersonal skills.\n\tStrong negotiation and closing skills.\n\tAbility to work independently and as part of a team.\n\n\nWhat We Offer\n\n\n\tSalary: N150,000 - N200,000 monthly.\n\tCompetitive salary and commission structure.\n\tOpportunity to grow with a dynamic company.\n\tProfessional development and training opportunities.\n\n\nApplication Closing Date: 30th June, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their Resume to: nigeriaslf.btf@gmail.com using the Job Position as the subject of the email.\n\n \n\n \n\n2.) Product Marketer - Cosmetic Products\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nDescription \n\n\n\tWe're a leading cosmetic company seeking a creative and results-driven Product Marketer to join our team. \n\tAs a Product Marketer, you'll develop and execute marketing strategies to drive sales and brand awareness for our cosmetic products.\n\n\nKey Responsibilities\n\n\n\tDevelop marketing campaigns to promote cosmetic products.\n\tConduct market research to stay updated on trends and consumer behavior.\n\tCollaborate with cross-functional teams to launch new products.\n\tManage product positioning and messaging.\n\tAnalyze sales data to optimize marketing strategies.\n\n\nRequirements\n\n\n\tBachelor's Degree in Marketing, Business, or related field.\n\t2+ years of experience in product marketing, preferably in the cosmetic industry.\n\tStrong creative and analytical skills.\n\tExcellent communication and project management skills.\n\n\nWhat We Offer\n\n\n\tSalary: N150,000 - N200,000 monthly.\n\tCompetitive salary and benefits.\n\tOpportunity to work with a leading cosmetic brand.\n\tProfessional growth and development opportunities.\n\tCollaborative and dynamic work environment.\n\n\nApplication Closing Date: 20th June, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their Resume to: nigeriaslf.btf@gmail.com using the Job Position as the subject of the email.\n\nNote: If you're a motivated and creative marketer, Apply!\n\n \n\n \n\n3.) Sales Executive (Vegetable Oil / Soybean Oil)\n\nJob Locations: Kaduna, Ore - Ondo, Makurdi - Benue, Uromi - Edo, Lagos and Abeokuta - Ogun\nEmployment Type: Full-time\n\nDescription \n\n\n\tWe're a leading manufacturer / distributor of high-quality vegetable oils, including soybean oil. We're seeking an experienced Sales Executive to drive sales growth and expand our customer base in the above locations.\n\n\nKey Responsibilities\n\n\n\tDevelop and execute sales strategies to achieve targets.\n\tBuild and maintain relationships with existing and potential customers.\n\tIdentify new business opportunities and expand customer base.\n\tConduct market research to stay updated on industry trends.\n\tCollaborate with internal teams to ensure seamless customer experience.\n\n\nRequirements\n\n\n\tBachelor's Degree in Business, Marketing, or related field.\n\t2+ years of experience in sales, preferably in the FMCG/food industry.\n\tStrong communication and negotiation skills.\n\tAbility to work independently and meet sales targets.\n\n\nWhat We Offer\n\n\n\tCompetitive salary and commission structure.\n\tOpportunity to work with a leading brand.\n\tProfessional growth and development opportunities.\n\tCollaborative and dynamic work environment.\n\n\nApplication Closing Date: 10th June, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their Resume to: nigeriaslf.btf@gmail.com using the Job Position as the subject of the email.\n\nNote: We look forward to hearing from you!\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Content Marketing Manager Job at Innov8 Hub",
    "link": "https://www.jobgurus.com.ng/jobs/view/content-marketing-manager-job-at-innov8-hub",
    "pubDate": "Mon, 09 Jun 2025 10:45:16 GMT",
    "source": "JobGurus",
    "keyword": "innov8 hub",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Innov8 Hub is an Innovation Startup driven organisation with a mandate to groom generations of Innovators, Inventors, and Researchers across the board. Innov8 is a focal point for Innovation Startup Incubation, Technology Transfer, Knowledge and Skill Impartation, Prototype Development, and Fabrication. We strategically aid organizations and individuals seeking to transform their ideas into inventions, inventions into solutions, and solutions into enterprises.\n\nWe are recruiting to fill the position below:\n\nJob Position: Content Marketing Manager\n\nJob Location: Abuja\nJob Type: Full-time\n\nJob Summary \n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are looking for an experienced content and marketing Manager who will work collaboratively across the business function and with key internal and external stakeholders to develop, oversee and implement content marketing and consumer communications strategies and deliver profile-raising campaigns while leading a marketing team.\n\tThis role will drive awareness, interest, and excitement for our mission, services, projects and products through proactive communications, content and events efforts.\n\n\nJob Responsibilities\n\n\n\tContent and Communication Strategy: develop the consumer-oriented, lifestyle media and content strategy to deliver omnichannel communications campaigns which address key business, consumer segment and brand needs.\n\tContent Creation and Deployment: own and lead the deployment of consumer-facing content and communications campaigns to maximize reach and improve ROI.\n\tContent Calendar: collaborate with the brand team to create a content and communications calendar that is aligned to the annual brand calendar\n\tSecures Opportunities: Identifies, partners with/curate unique opportunities and events to profile our clients'/partners' products in an experiential way to generate exposure for Innov8.\n\tMedia Engagement: cultivate, oversee and expand relationships with consumer-facing media to achieve brand profiling and desired positioning.\n\tMedia Plan Deployment: prepare media plans and draft stories/narrative/press releases to address communication priorities and achieve desired brand positioning. This includes planning, buying and deployment of media amplification.\n\tDigital communications: Work and liaise closely with internal teams to ensure correct news and regular content updates.\n\tUtilize the website as a key communication tool to support content marketing. Utilize SEO, amplification and programmatic, within regulatory parameters, to improve website traffic generation leading to improved awareness and understanding of metrics and website lead generation.\n\tReporting: Record and analyze data to track progress against key metrics and prepare relevant reports.\n\tBudget Management: Manage the content marketing and communications budget to deliver the business KPIs.\n\n\nRequired Qualifications & Skills\n\n\n\tDegree or equivalent in Brand Marketing, Communications or relevant study.\n\tExperience in Brand / Digital / Content Marketing, Communications / PR, Account management/ Program Management at an agency or in a corporate setting\n\tIn-depth experience in managing brands and executing communications campaigns across different channels.\n\tFamiliar with B2B and B2C marketing.\n\tSkilled in writing campaign plans for short- and medium-range programs to engage journalists, bloggers and broadcast media in co-creation of stories with solid experience of creative storytelling, developing, pitching and securing stories.\n\tFamiliar with harnessing traditional and social media outlets to promote consumer messages for products and brands.\n\tAbility to work cross-functionally and with external agencies to build strong working relationships and manage/deliver communications campaigns.\n\tProficiency in English with superior written and oral communication skills.\n\t5 years of experience as a manager in Content Production or Marketing Communications.\n\tExcellent storytelling and verbal communication skills.\n\tKnowledge of CRM software and social media monitoring tools.\n\n\nApplication Closing Date\n16th June, 2025.\n\nMethod of Application\nInterested and qualified candidates should submit their CV and Cover Letter to: hr@innov8hub.ng using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Customer Service Officer Job at Tyonex Nigeria Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/customer-service-officer-job-at-tyonex-nigeria-limited-1",
    "pubDate": "Mon, 09 Jun 2025 10:45:16 GMT",
    "source": "JobGurus",
    "keyword": "tyonex nigeria limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Tyonex Nigeria Limited is a group of registered companies, with an operational base throughout Nigeria and Corporate Head Offices in Lagos, Nigeria. Established in September 1997, Tyonex is a member of the Pharmaceutical Manufacturing and Marketing Companies in Nigeria.\n\nWe are recruiting to fill the position below:\n\nJob Position: Customer Service Officer\nJob Location: Igando, Lagos\nEmployment Type: Full-time\n\nRequirements\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\t2-3 years of experience in this role\n\tStrong communication and interpersonal skills.\n\tAbility to handle customer complaints with patience and professionalism.\n\tProblem-solving and critical thinking abilities.\n\tBasic computer skills and familiarity with CRM software.\n\n\nMethod of Application\nInterested and qualified candidates should send their Applications to: tnlrecruitment01@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Account Officer Job at AllFlavors Supreme Foods",
    "link": "https://www.jobgurus.com.ng/jobs/view/account-officer-job-at-allflavors-supreme-foods-1",
    "pubDate": "Mon, 09 Jun 2025 10:45:16 GMT",
    "source": "JobGurus",
    "keyword": "allflavors supreme foods",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "AllFlavors Supreme Foods manufactures premium snacks with high quality ingredients, using top quality machines and advanced techniques to reach and maintain our products' premium quality. We are ISO 9001 and 22000 certified.\n\nWe are recruiting to fill the position below:\n\nJob Position: Account Officer\nJob Location: Isolo, Lagos\nEmployment Type: Full-time\nIndustry: FMCG\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe seek a detail-oriented and reliable Account Officer to support our finance department and ensure efficient financial operations.\n\tThe ideal candidate brings experience in cost accounting, budgeting for production processes, and financial oversight in a manufacturing environment\n\n\nKey Responsibilities\n\n\n\tMaintain accurate and up-to-date financial records\n\tPrepare and review financial statements and reports\n\tManage accounts payable and receivable\n\tEnsure compliance with financial regulations and internal controls\n\tReconcile bank statements and ledgers\n\tAssist in budgeting and forecasting activities\n\tProcess invoices, payments, and staff reimbursements\n\tLiaise with internal departments and external auditors as needed\n\n\nEducation, Qualifications and Experience\n\n\n\tBachelor’s degree in Accounting, Finance, or a related field.\n\tMinimum 3 years of experience in accounting roles, preferably in the manufacturing sector.\n\tProfessional qualification will be considered a plus.\n\tWorking knowledge of all statutory legislation and regulations.\n\tStrong understanding of accounting principles and practices.\n\tProficiency in accounting software (e.g., SAP, Odoo, QuickBooks) and MS Excel.\n\n\nSkills and attributes:\n\n\n\tA solid understanding of financial statistics and accounting principles.\n\tExcellent analytical and problem-solving skills.\n\tHigh level of accuracy and attention to detail.\n\tStrong organizational and time-management abilities.\n\tEffective communication and interpersonal skills.\n\tAbility to work under pressure and meet tight deadlines.\n\n\nWhat we offer\n\n\n\tCompetitive salary and benefits package\n\tA dynamic and collaborative work environment.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: fin@allflavor.odoo.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Business Development Manager Job at Pyfinest Resources",
    "link": "https://www.jobgurus.com.ng/jobs/view/business-development-manager-job-at-pyfinest-resources",
    "pubDate": "Mon, 09 Jun 2025 10:45:16 GMT",
    "source": "JobGurus",
    "keyword": "pyfinest resources",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Pyfinest Resources - Our client is a leading provider of innovative solar power systems, CCTV, and access control solutions in Nigeria, specializing in sustainable energy and advanced security technologies.\n\nThey are recruiting to fill the position below:\n\nJob Position: Business Development Manager\nJob Location: Port Harcourt, Rivers\nEmployment Type: Full-time\n\nRole Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAs a highly motivated Business Development Manager, you will spearhead client acquisition, revenue growth, and market penetration in the renewable energy and security tech sectors.\n\tThe ideal candidate will combine technical knowledge with proven sales expertise to develop strategic partnerships and exceed targets.\n\n\nKey Responsibilities\nBusiness Growth & Strategy:\n\n\n\tIdentify and pursue new business opportunities in solar energy, CCTV, and access control markets.\n\tDevelop and execute sales strategies to meet quarterly revenue targets.\n\tAnalyze market trends, competitor activity, and customer needs to refine offerings.\n\n\nClient & Stakeholder Management:\n\n\n\tBuild and maintain strong relationships with B2B clients, contractors, and government entities.\n\tLead high-value negotiations and close deals with corporate clients and project developers.\n\tRepresent the company at industry events, exhibitions, and networking forums.\n\n\nSales Performance & Reporting:\n\n\n\tManage the full sales cycle from prospecting to contract signing.\n\tMaintain accurate records in CRM systems and provide weekly sales reports.\n\tCollaborate with technical teams to design customized solutions for clients.\n\n\nMarket Intelligence:\n\n\n\tStay updated on Nigerian energy policies, incentives, and compliance standards.\n\tLeverage knowledge of solar financing models (e.g., PAYG, leasing) to drive sales.\n\n\nRequirements\n\n\n\tEducation: Bachelor’s degree in Business, Marketing, Engineering, or related field.\n\tExperience: Minimum 3+ years in B2B sales/business development, preferably in solar, security tech, or construction.\n\n\nSkills:\n\n\n\tExceptional negotiation, communication, and presentation skills.\n\tProficiency in CRM software (e.g., Salesforce), Microsoft Office, and data analysis.\n\tTechnical understanding of solar PV systems, CCTV, and access control solutions.\n\tAttributes: Self-driven, adaptable, and results-oriented with a proven sales track record.\n\n\nWhy Apply?\n\n\n\tLucrative Earnings: Base salary + commissions (top performers earn significantly above industry standards).\n\tCareer Growth: Opportunity to lead a high-impact team in a rapidly growing sector.\n\tImpact: Contribute to Nigeria’s sustainable energy and security infrastructure.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and a 1-page cover letter (addressing their fit for the role) to: pyfinest.hr@gmail.com using the Job Position and their name as the subject of the email.\n\nNote: Only shortlisted candidates will be contacted.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]