[
  {
    "title": "Senior Accountant Job at Brenhazy Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/senior-accountant-job-at-brenhazy-limited",
    "pubDate": "Thu, 05 Jun 2025 13:28:57 GMT",
    "source": "JobGurus",
    "keyword": "brenhazy limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Brenhazy Limited is a privately owned Nigerian company incorporated in 2014 to provide Manpower Services, Engineering, Procurement, and Construction (EPC) services to companies in line with standard requirements and global best practices.\n\nWe are recruiting to fill the position below:\n\nJob Position: Senior Accountant\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Description\n\n\n\tManaging thecompany's financial activities such as: Audit support, Financial reporting, Budgeting and Forecasting, Internal controls, Data Analysis, Accounting Operations,Compliance, etc.\n\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tCandidate will be saddled with the responsibilities of managing / Processing Payroll, Inventory, work with regulatory agencies, develop and impliment new accounting systems or processes, make Financial decisions, posting and reconcile accounts payable and receivables, producing error free accounting reports and representing results, maintain accurate records of financial statements of the company.\n\n\nEducational Qualification and Experience\n\n\n\tCandidates should possess a Bachelor's Degree in Accounting or Finance.\n\tCertified Public Accounting (CPA) or other relevant accounting certification is required.\n\tMinimum of 3 years of Experience is required for this role.\n\n\nSkills:\n\n\n\tExtensive knowledge of Accounting principles and Practices.\n\tStrong analytical and Problem Solving Skills.\n\tExcellent Communication and interpersonal skills.\n\tProficiency in Accounting software and spreadsheets.\n\tExperience with Financial reporting and analysis.\n\tExperience with Budget Management and Forecasting.\n\tExperience with Audit procedures.\n\tExperience with internal controls.\n\tExperience with Regulatory compliance.\n\n\nRemuneration\nN200,000 - N300,000 / Month.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: recruitment@brenhazy.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Tax Manager Job at Zipline",
    "link": "https://www.jobgurus.com.ng/jobs/view/tax-manager-job-at-zipline",
    "pubDate": "Thu, 05 Jun 2025 13:28:57 GMT",
    "source": "JobGurus",
    "keyword": "zipline",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Zipline - Do you want to change the world? Zipline uses drones to deliver critical and life-saving medicine to thousands of hospitals serving millions of people in multiple countries. Our mission is to provide every human on Earth with instant access to vital medical supplies. Join Zipline and help us make this a reality for billions of people.\n\nWe are recruiting to fill the position below:\n\nJob Position: Tax Manager, Africa\n\nJob Location: Lagos\nJob Schedule: Full-time\n\nAbout You and The Role  \n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are looking for a hands-on, motivated Tax Manager to manage all African country taxes. We are located in Cote D’Ivoire, Ghana, Kenya, Nigeria, and Rwanda. You will manage all taxes (excluding payroll taxes) in these countries to ensure they’re accurately and timely filed. You will collaborate with the Accounting and Finance team to ensure tax-related accounts are correctly reflected in the financials. \n\tYou will perform reviews of the income tax provision for statutory financial reporting and corporate income tax returns. \n\tYou will collaborate with local Accounting and Finance leads on tax audits. \n\tAs our key tax person, you will continue to look for ways to increase efficiency in the tax processes without sacrificing quality while looking for ways to minimize our taxes through thoughtful tax planning ideas. \n\tThe Africa Tax Manager will report to the Head of Tax with a dotted line to African Country Controller. The Africa Tax Manager will serve as the Tax Lead for all African countries. \n\n\nWhat You'll Do\nThe Africa Tax Manager will perform the following duties:\n\n\n\tPrepare VAT and other indirect tax returns for all African countries\n\tPrepare monthly tax account reconciliations\n\tPrepare audit ready tax workpapers and documentation\n\tPrepare and manage quarterly Corporate Income Tax (CIT) tax declarations and any required payments\n\tReview and monitor intercompany transactions for tax implications\n\tManage African countries tax calendar to ensure timely filing of all tax returns and declarations\n\tCollaborate with local accounting and finance leads to manage tax audits \n\tGather documentation and manage all (CIT) returns to ensure returns are accurately and timely filed by external tax preparers\n\tReview annual income tax provision calculations\n\tAssist in preparing and reviewing transfer pricing calculations\n\tCollaborate with the Accounting and Finance teams to address all tax related matters\n\tProvide tax consultation and training to other business functions\n\tProvide tax development and updates to the Head of Tax and other business functions\n\tLiaise and manage relationship with outside tax advisors\n\tCollaborate with Head of Tax to develop and implement tax planning ideas\n\tContinue to enhance and improve internal control in the tax area\n\tSupport other countries outside of Africa as needed\n\n\nRequirements\nWhat You'll Bring:\n\n\n\tCandidates should a Bachelor's Degree Bachelor’s Degree in Accounting, Finance, or related field\n\tAt least 7 years of tax experience working with a multinational company with operations in various African countries and/or similar experience from an international public accounting firm\n\tGraduate degree or professional certification is a plus \n\tStrong analytical, problem-solving and organizational skills\n\tExcellent communication (oral and written) and interpersonal skills\n\tAbility to work in a fast-paced environment and willing to work outside of business hours with colleagues overseas primarily in the USA\n\tProficient with software such as Microsoft Officer Suite and/or Google G Suite specifically Excel and Google Sheet.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "HSE Officer Job at Fave Consulting",
    "link": "https://www.jobgurus.com.ng/jobs/view/hse-officer-job-at-fave-consulting",
    "pubDate": "Thu, 05 Jun 2025 13:28:57 GMT",
    "source": "JobGurus",
    "keyword": "fave consulting",
    "duplicate": false,
    "classifications": [],
    "content": "Fave Consulting - Our client, a leading FMCG Manufacturing company, is recruiting to fill the position below:\n\nJob Position: HSE Officer\n\nJob Location: Kano\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tA leading FMCG manufacturing company in Kano is seeking a highly competent Health, Safety & Environment (HSE) Officer to drive compliance, enforce HSE policies, and ensure a safe, healthy, and environmentally responsible workplace.\n\tThis role demands a proactive professional with strong regulatory knowledge and field experience in industrial environments.\n\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDevelop, implement, and continuously improve HSE policies, procedures, and programs.\n\tConduct regular risk assessments and ensure effective implementation of preventive measures.\n\tCollaborate with cross-functional teams to embed safety into all operations.\n\tInvestigate incidents, determine root causes, and implement corrective actions.\n\tEnsure full compliance with all relevant HSE regulations and industry standards.\n\tLead safety induction and training programs to strengthen the safety culture.\n\tMaintain accurate HSE records and reports; engage with regulatory bodies as needed.\n\tSupport environmental management efforts including waste reduction and sustainability initiatives.\n\n\nRequirements\n\n\n\tDegree in Safety, Environmental Science, or a related discipline (mandatory).\n\t5 - 10 years of HSE experience in a reputable FMCG or industrial setting.\n\tStrong grasp of occupational health and safety laws and risk management practices.\n\tProven ability to lead safety initiatives and drive continuous improvement.\n\tProficient in Microsoft Office; knowledge of safety information systems is a plus.\n\tExcellent communication, coordination, and reporting skills.\n\n\nSalary\nN200,000 - N300,000 / Month.\n\nMethod of Application\nInterested and qualified candidates should send their CV and Cover Letter in PDF to: recruitment@faveconsulting.com using \"HSE Officer\" as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Senior iOS Engineer Job at Revent Technologies Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/senior-ios-engineer-job-at-revent-technologies-limited",
    "pubDate": "Thu, 05 Jun 2025 13:28:57 GMT",
    "source": "JobGurus",
    "keyword": "revent technologies limited",
    "duplicate": false,
    "classifications": [
      "Software Engineering"
    ],
    "content": "Revent Technologies Limited is a technology solutions provider for dynamic organisations, providing bespoke software design and development, developer outsourcing and technology advisory, etc.\n\nWe recruiting to fill the position below:\n\nJob Position: Senior iOS Engineer\n\nJob Location: Lagos\n\nRoles and Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDesign and build applications for the iOS platform\n\tEnsure the performance, quality, and responsiveness of applications\n\tCollaborate with cross-functional teams to define, design, and ship new features\n\tIdentify and correct bottlenecks and fix bugs\n\tHelp maintain code quality, organization, and automatization\n\n\nRequirements\n\n\n\tBachelor's Degree in Computer Science or a related field or equivalent experience\n\t5+ years of industry experience (ideally working in a start-up or scale-up)\n\tProficient with Swift Packet Manager and Cocoa Touch\n\tProficiency with UIKit/SwiftUI in building user interfaces\n\tExperience with iOS frameworks such as Core Data, Core Animation\n\tExperience with offline storage, threading, and performance tuning\n\tFamiliarity with RESTful APIs to connect iOS applications to back-end services\n\tKnowledge of other web technologies and UI/UX standards\n\tUnderstanding of Apple’s design principles and human interface guidelines\n\tKnack for benchmarking and optimization\n\tExperience with performance and memory management tools such as Profile Instruments\n\tFamiliarity with cloud message APIs and push notifications\n\tProficient understanding of code versioning tools\n\tFamiliar with CI/CD.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and Portfolio to: hr@reventtechnologies.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Backend Developer Job at Revent Technologies Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/backend-developer-job-at-revent-technologies-limited",
    "pubDate": "Thu, 05 Jun 2025 13:28:57 GMT",
    "source": "JobGurus",
    "keyword": "revent technologies limited",
    "duplicate": false,
    "classifications": [
      "Software Engineering"
    ],
    "content": "Revent Technologies Limited is a technology solutions provider for dynamic organisations, providing bespoke software design and development, developer outsourcing and technology advisory services, etc.\n\nWe are recruiting to fill the position below:\n\nJob Position: Backend Developer\n\nJob Location: Lagos\nEmployment type: Full Time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAs a Software Engineer specializing in back-end development, you will build new product features from start to finish (e.g. develop & deploy new demand models served into production systems).\n\tYou will also have the opportunity to review & influence the engineering design, architecture & technology stack across multiple products, outside your immediate focus.\n\tYou will work on a DevOps software engineering team dedicated to building enterprise applications with the latest and greatest cloud-first technology to enable key parts of our business.\n\tFrom contributing to new applications to enhancing existing products, you will work amongst a team of passionate software engineers, facilitated by a scrum master, with work prioritized by product owners.\n\n\nAs a SDE you will work at the intersection of:\n\n\n\tApplication of machine learning/deep learning solutions.\n\tBest in class cloud technology & micro-services architecture.\n\tUse DevOps best practices that include model serving, data & code versioning.\n\n\nResponsibilities\n\n\n\tYou will work on building code that will deploy into production, using code design & stylestandards.\n\tYou will document your thought process & create artefact on team repo/wiki that can be used to share with business & engineering for sign off.\n\tMust be able to manage applications currently in Production Environment\n\tYou will also develop internal tools/utils that improve productivity of entire team.\n\tYou will collaborate with other team members to advance team’s ability to ship high quality code, fast!\n\tYou will review code quality, design developed by your peers.\n\tYou will significantly improve the performance & reliability of our code that create high quality & reproducible results.\n\tYou should be able to mentor/coach junior team members to continuously upskill them.\n\tYou will maintain basic developer hygiene that includes but not limited to, writing tests, using loggers.\n\n\nRequirements\n\n\n\tBachelor's Degree in Computer Science, related field or equivalent experience\n\t3+ years of professional software development real-world experience to develop scalable & high-quality software.\n\tExcellent understanding of Node JS, mySql, MSSQL, PostgreSQL\n\tExperience in backend related Azure cloud components such as Web app, Functions is a plus\n\tKnowledge of front end technology is an added advantage\n\tIn depth understand of docker, git, GitHub & GitHub actions.\n\tExperience in debugging and profiling applications, and improving their efficiency, scalability, and stability\n\tGood foundation in data structures & algorithms.\n\tStrong experience in code versioning using Git (or alike), maintaining one modularized code base for multiple deployments, automation using CI/CD pipelines.\n\tStrong relationship management, communication and collaboration skills: effectively working with both technical and non-technical audiences\n\tA true self-starter, who dreams big, and is motivated by a challenging and fast-paced environment.\n\n\nMethod of Application\nInterested and qualified candidates should send their Cv to: hr@reventtechnologies.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]