[
  {
    "title": "Job Vacancies at International Breweries Plc",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancies-at-international-breweries-plc-1",
    "pubDate": "Thu, 22 Jan 2026 09:34:00 GMT",
    "source": "JobGurus",
    "keyword": "international breweries plc",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Software Engineering"
    ],
    "content": "International Breweries Plc - Our Dream is to bring people together for a better world. Beer, the original social network, has been bringing people together for thousands of years. We are committed to building great brands that stand the test of time and to brewing the best beers using the finest natural ingredients.\n\nOur diverse portfolio of well over 400 beer brands includes global brands Budweiser, Corona and Stella Artois; multi-country brands Beck’s, Castle, Castle Lite, Hoegaarden, and Leffe; and local champions such as Aguila, Bud Light, Jupiler, Klinskoye, Modelo Especial, Quilmes, Skol, and Victoria.\n\nWe are recruiting to fill the following positions below:\n\n1.) Planning Analyst\n     \n\n            \n    \n\n\n\nJob Requisition ID: 30092300\nJob Location: Nigeria\nJob Type: Full-time\n\nKey Purpose\n\n\n\tThe key purpose of this role is to gather, analyze, and interpret data to provide insights and recommendations that contribute to informed decision-making, requiring a detail-oriented individual with strong analytical skills and collaborate effectively with cross-functional teams.\n\n\nKey Roles and Responsibilities\n\n\n\tPartner with colleagues to implement enhancements for increase efficiency, accuracy, and effectiveness of planning reports using Power Bi & other analytical tools.\n\tAnalyse raw data to identify patterns, trends, and key insights relevant to the planning process.\n\tWork closely with our NoCC and Solutions functions to optimize and automate reporting across all planning areas.\n\tCollaborate with MRP Planners, SNP Planner, RetPack Specialist, Warehousing & Logistics teams in reconciling any discrepancies observed in Materials & Empties Opening Stock, Material Usages, Production, Injection & RTI across all sites. Schedule & follow through on dispatches of materials to the various plants from local and international suppliers.\n\tIdentify deviations from planned deliveries and investigate root causes.\n\tGenerate & follow through the approval process for all Purchase Requisitions raised & oversee the timely GRN of all materials delivered to sites.\n\tAssist to follow up with suppliers & T1 team in coordinating the delivery, pickup, and maintenance of returnable packaging assets.\n\tTrack and review Obsolete & Near Expiry Materials with the Material Planning team for decision taking.\n\n\nMinimum Requirements\n\n\n\tBachelor’s Degree in Computer Science, Information Management, Statistics, or a similar field\n\tPrior experience in data analysis or related areas considered advantageous.\n\tPossess a robust grasp of statistics and hands-on proficiency in statistical tools like Excel, along with expertise in data analysis languages such as SQL and Python.\n\n\nKey Attributes and Competencies:\n\n\n\tExcellent communication skills with the ability to present complex information in a clear and concise manner.\n\tAbility to work effectively in a fast-paced, dynamic environment and manage multiple priorities.\n\n\nAdditional Information:\n\n\n\t\n\tBand: VIII.\n\t\n\n\nApplication Closing Date: 28th January, 2026.\n\nClick here to apply online\n\n \n\n \n\n2.) Packaging Lab Specialist\n\nJob Requisition ID: 30092454\nJob Location: Onitsha, Anambra\nEmployment Type: Full-time\n\nKey Purpose\n\n\n\t\n\tThe key purpose of this role is to manage and co-ordinate brewery quality control and to ensure quality analysis is conducted in compliance with the company standards and specifications for the transformation into information.\n\t\n\n\nKey Roles and Responsibilities\nQuality Management:\n\n\n\tEnsure the functional and data integrity of the various quality systems, and identify and resolve problems\n\tAudit compliance to the various quality systems by both the laboratory team and shift based production teams\n\tLiaise with Central Office around quality, and take part in regional and divisional \n\n\nQuality Control and Analysis:\n\n\n\tChecking and verifying that team members are carrying out quality checks and analyses and recording the information on the appropriate systems\n\tVerifies that the quality systems are working properly and that data integrity and information accuracy is being maintained\n\tResponsible for ensuring that laboratory equipment is operating optimally and to identify problems or opportunities timeously\n\tEnsures that COT standards have been adapted to take into account regional specificity, where necessary\n\tInteracts with COT through various MDT fora as required, ensuring that regional complexities and requirements are properly understood\n\n\nTeam Leadership:\n\n\n\tEnsuring that team members understands and adheres to the operational, quality and process standards, work instructions and calibration schedules and performance target\n\tMentoring, supporting and coaching team members in the correct execution of their tasks\n\tDevelop subordinates and ensure training needs are met by carrying out training needs analysis\n\n\nSafety and Housekeeping:\n\n\n\tEnsure that the engineering team apply proper safety and housekeeping procedures, and adhere to all legal requirements when carrying out their tasks\n\tEnsure implementation of the appropriate ABInBev and legislative policies (such as OSH act) on safety and housekeeping\n\tEnsure that safety and housekeeping receive appropriate focus through regular checks and safety audits\n\tResponsible for correcting unsafe work practices identified\n\n\nProfile\nEducation:\n\n\n\t\n\tMin – Bachelor of Science in Analytical Chemistry, Food Technology/ Microbiology or equivalent\n\t\n\n\nExperience:\n\n\n\t2-3 Years in Laboratory, Brewing or Packaging operation\n\tAnalytical\n\tInterpretative\n\tManagement Planning, Organising, Leading and Controlling\n\tNumeracy (budgets, statistical analysis)\n\tCommunication. Innovation. Problem Solving. Team Leadership\n\n\nAdditional Information:\n\n\n\t\n\tBand: VII.\n\t\n\n\nClick here to apply online\n\n \n\n3.) Warehouse Controller\n\nJob Requisition ID: 30092703\nJob Location: Ilesa, Osun \nEmployment Type: Full-time\n\nKey Purpose\n\n\n\tThe key purpose of this role is to implement and uphold ABInBev safety standards.\n\tManage the Inventory and Warehousing function so that customer service levels can be optimized and that benchmarked productivity standards are met. Implement standard operating processes in line with DPO standards. Manage VLC, ZBB and FLC budgets in line with annual flexed targets.\n\n\nKey Roles and Responsibilities\n\n\n\tInsure compliance to 5's Standard within and around Warehouse Operation and show results evolution\n\tCascade all Global policies and insure compliance to them\n\tImplement and design the management cycle e.g. Business Descriptions, SLA's, Process Maps, kPI Indicators and ensure compliance with all warehouse staff and show results evolution\n\tDevelop and continuously validate SOP's through management routines by using tools and ensure understanding by all warehouse employees (LnA,SCL OWD)\n\tTeam rooms managed and updated through routine meetings to solve problems and drive performance\n\tDevelop and maintain MCRS/MCL routines and track adherence there off\n\tUse problem solving tools e.g. 5 WHY, Abnormality Reports, SIC, OPLs, RACI's, OWD's, PDCA's, etc. to develop action plans to show improvement on PI's and KPI’s\n\tCascade KPI's and PI's to individual warehouse employee level, standardize the KPI/PI achievements and monitor individual targets\n\tInsure adherence to best practice generation process and execute approved projects and show result evolution\n\tMake use of GOP's linked to warehouse KPI's and insure 75% score is achieved\n\tUtilize GAPA and PDCA for chronic abnormality's and execute actions derived from analysis\n\n\nInventory:\n\n\n\tInsure daily compliance of inventory counts\n\tInsure compliance to inventory policy and use management tools to close gaps\n\tInsure compliance to Quality Policy and use management tools to close gaps\n\tManage the process on how to destroy and write off obsolete product in compliance with legal/environmental requirements\n\tIdentify the root cause of inventory count variances and put action plans in place through problem solving tools to improve the Inventory accuracy KPI\n\tReduce Supply Chain Overheads through the utilization of problem solving tools and management of stock age KPI’s\n\tTrack and trend all operating variances within in the warehouse and utilize management tools to improve results\n\n\nLayout Implementation:\n\n\n\tEnsure adherence to the layout in line of certain warehouse activities e.g. Empties zone; Refusal zone; Order Picking zone; Repack zone; Finished Goods zone\n\tTrack and manage warehouse management tools to ensure ABC compliance\n\tTrough MCL routine track compliance to all safety related processes within the warehouse\n\tTrack and trend ABC compliance to realize warehouse efficiencies , Time and Motion studies and show Results evolution\n\n\nImprove Quality Standards:\n\n\n\tManage, track and trend 1. warehouse cleanliness, 2. pest control schedule adherence, 3. cross contamination from non-food grade chemicals, 4. daily temperature control andb5. product exposure • Ensure 75% Compliance to the Global Warehouse GOP\n\tImplement and adhere to a Location-Based Inventory System to identify stored product\n\tExecute Action Plan to address the Stock Age Index KPI • Track and trend %HL near to be blocked as a PI\n\tEnsure adherence to blocking standards on non-conforming inventory\n\tTrack, trend and manage sorting processes to reduce MBFU% and to improve sorting productivity by utilizing management tools\n\tTrack and trend broken cases by operator, picker and sorter to develop action plan to improve total breakage costs\n\tCreate a quality induction programme and ensure 100% compliance on training to warehouse staff\n\tTrack, trend and manage the distribution returns policy to ensure alignment with the quality policy\n\tTrack, trend and manage repacking operation to conform to quality standards and to improve repacking productivity\n\n\nPicking Standards:\n\n\n\tEnsure adherence to the standardized picking process and ensure compliance through management routines that ensure a safe and productive process\n\tInsure Picking area has a productive ergonomic layout that allows zero-man machine interactions\n\tCreate and monitor picking KPI's/Pi's Cas/Per man Hour, Replenishment adherence\n\n\nSorting Standards:\n\n\n\tSorting Guideline adherence & targets met - Sorting resources planned, trained & quality bottle sorting performed. Random bottle sorting inspection performed daily, gaps • Identified & action plans implemented\n\tEnsure sorting area has a productive ergonomic layout that allows zero man machine interactions\n\tCreate and monitor sorting KPI's/Pi's CA's/Per man Hour ,show positive brewery MBFU evolution\n\n\nProductivity & Capacity Managed:\n\n\n\tEnsure 75% Compliance to the Warehouse Labour Productivity GOP to improve the KPI\n\tDesign and maintain sizing simulator to address optimal labour and equipment resourcing\n\tAllocate and assign labour activities utilizing the SKAP tool\n\tDevelop and Manage the Warehouse Capacity Utilization model to improve Warehouse efficiency\n\tImplement and manage waste plan and recycling operation by type of material: paper/carton, plastic by type: PET, PS, PP etc., metal – aluminum, iron, etc., glass, food remains, other types, unrecyclable\n\tManage TCT and there are actions plans visible to improve it and it is also measured in Loading/Unloading and Replenishment\n\n\nSafe Warehouse Practices:\n\n\n\t\n\tEnsure & maintain a safe warehouse operation driving awareness and compliance to all the relevant safety blocks\n\t\n\n\nMinimum Requirements\n\n\n\t3 years of relevant Diploma / Degree\n\t3+ years of Warehouse and or logistics experience advantageous\n\tHighly level computer user (MS Office, Oasis, Handheld devices)\n\tSAP proficient.\n\n\nKey Attributes and Competencies:\n\n\n\tGood interpersonal skills / builds good relationships\n\tSuperior planning ability\n\tAbility to work under pressure\n\tGood verbal and communication skills\n\tGood self-management practices\n\tStrong achievement orientation\n\tAbility to adapt to and implement change effectively\n\tExcellent coaching capability\n\n\nAdditional Information:\n\n\n\t\n\tBand: VII.\n\t\n\n\nApplication Closing Date: 29th January, 2026.\n\nClick here to apply online\n\n     \n\n    \n\n        Click here to Apply",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Graphics Designer Job at Nile University of Nigeria",
    "link": "https://www.jobgurus.com.ng/jobs/view/graphics-designer-job-at-nile-university-of-nigeria",
    "pubDate": "Thu, 22 Jan 2026 09:34:00 GMT",
    "source": "JobGurus",
    "keyword": "nile university of nigeria",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance"
    ],
    "content": "(function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){\n        (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),\n        m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)\n    })(window,document,'script','//www.google-analytics.com/analytics.js','ga');\n\n    ga('create', 'UA-43112273-1', 'jobgurus.com.ng');\n    ga('send', 'pageview');\n\n\n\n\n    \n        \n    Home\n    Jobs\n    Free Aptitude Test Practice\n    Employer? Post a Job\n            Register\n        Sign in\n        Contact us\n    \n\n    \n\n        \n    \n        \n\n            \n\n                \n\n                    \n                        Toggle navigation\n                        \n                        \n                        \n                    \n\n                    \n                \n            \n\n            \n                \n\n\tJobs\n\tJob Seekers\n\tAptitude Test\n\tScholarships\n\n            \n\n            \n                \n\n                                            Register\n                        Sign in\n                    \n                    Employer? Post a Job\n                \n            \n\n        \n\n    \n\n        \n        \n            \n            \n                 \n    \n                    \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n        \n     \n\n\n                            \n                    \n        \n                        CLICK HERE TO JOIN OUR WHATSAPP CHANNEL \n                    \n    \n\n    \n                                \n                    \n\n                        \n                            \n                        \n\n                        \n                            \n                                Any Specialization\n                                                                    Accounting / Audit / Finance\n                                                                    Administration/ Office/ Operations\n                                                                    Advertising/ Social Media/ Marketing/ PR\n                                                                    Agriculture / Agro Allied\n                                                                    Analyst/ Quality Control\n                                                                    Automotive/ Car Services\n                                                                    Aviation / Airline\n                                                                    Banking / Insurance\n                                                                    Building Design / Architecture\n                                                                    Construction / Mining\n                                                                    Consulting / Business Strategy/ Planning\n                                                                    Craftsmen / Artisans\n                                                                    Creatives (Arts, Design, Fashion)\n                                                                    Customer Service\n                                                                    Domestic / Janitorial Services\n                                                                    Driving / Haulage\n                                                                    Education / Teaching / Training\n                                                                    Engineering / Technical\n                                                                    Executive / Management\n                                                                    Freelance / Data Entry\n                                                                    Government Agencies / Public Sector\n                                                                    Graduates / Freshers\n                                                                    Grants /  Scholarships\n                                                                    Hospitality / Food Services\n                                                                    HSE / Safety Management\n                                                                    Human Resources / Recruitment\n                                                                    Information Technology / ICT\n                                                                    Internship/ Industrial Training\n                                                                    Legal / Law\n                                                                    Logistics / Transportation/ Supply\n                                                                    Manufacturing / Production\n                                                                    Maritime Services / Shipping\n                                                                    Media / Art / Entertainment\n                                                                    Medical/ Healthcare / Pharmaceutical\n                                                                    Military / Para-Military\n                                                                    NGO / Community Services\n                                                                    Oil & Gas / Energy\n                                                                    Procurement/ Purchasing\n                                                                    Project Management\n                                                                    Real Estate / Property / Surveying\n                                                                    Research / Survey\n                                                                    Risk Management / Compliance\n                                                                    Sales / Business Development\n                                                                    Secretarial / PA\n                                                                    Security / Intelligence\n                                                                    Software/ Programming / Web development\n                                                                    Sports / Fitness\n                                                                    Supply Chain/ Store\n                                                                    Technicians\n                                                                    Telecommunications\n                                                                    Tourism / Travels\n                                                                    Vocational Trade and Services\n                                                            \n                        \n\n                        \n                            \n                                Any Work Level\n                                                                    Entry Level (Trainee)\n                                                                    Executive (Director, Head of Dept)\n                                                                    Experienced (Non-Manager)\n                                                                    Internship\n                                                                    Manager (Staff Supervisor)\n                                                                    Senior Executive (MD, CEO, COO)\n                                                                    Vocational (Skilled/Unskilled Labour)\n                                                            \n                        \n\n                        \n                            \n                                 Search\n                            \n                        \n                    \n                \n                            \n            \n\n\n\n\n\n\n            \n\n                \n                                        \n                    \n                                        \n                    \n                    \n\n                    \n                        \n                        \n\n{\n  \"@context\": \"https://schema.org\",\n  \"@type\": \"JobPosting\",\n  \"title\": \"Graphics Designer\",\n  \"description\": \"Nile University of Nigeria, founded in 2009, Nile University is a private multidisciplinary university based in Abuja, and a proud member of Honoris United Universities since 2020. Nile University currently has over 40 undergraduate programmes and more than 50 postgraduate programmes spread across eight best- in-class faculties, in the College of Health Sciences, Law, Science, Computing Studies, Engineering, Environmental Sciences, Management Sciences, and Arts &amp;amp; Social Sciences.\n\nWe are recruiting to fill the position below:\n\nJob Position: Graphics Designer\n\nJob Location:&amp;nbsp;Jabi Airport Road, Abuja (FCT)&amp;nbsp;\nEmployment Type: Full-time\n\nJob&amp;nbsp;Description\n\n\n\tWe are currently looking to engage a highly competent and result-oriented Graphics Designer, with strong personal &amp;amp; professional integrity to join our dynamic team.\n\n\nResponsibilities\n\n\n\tThe Graphics Designer, will be responsible for providing full graphic design support to Nile University of Nigeria and to create brand awareness, as well as the development of various communication products for both screen and print media.\n\n\nHe/she is expected to;\n\n\n\tBe responsible for graphically designing and producing brochures, annual reports, posters, research reports, stewardship reports, advertisements, programmes in line with guidelines of Nile University of Nigeria.\n\tDesigns web banners and other special web promotional buttons.\n\tConceptualizing visuals, prepare rough drafts and present designs based on requirement Creating images &amp;amp; layouts using design software whilst ensuring the appropriate use of colors for each graphics.\n\tWork with various departments for design content review and amend designs after feedback.\n\tTest graphics across various media platform (both screen and print media)\n\tEnsure final graphics and layouts are visually appealing and on-brand\n\tLiaises with procurement and printers for printing of promotional, marketing, and informational materials.\n\tCo-ordinates planning, production and distribution of faculty and college newsletters, magazines, and bulletins.\n\tContributes to the overall success of Media/Graphics Unit by performing other essential duties and responsibilities as assigned by the principal/line manager.\n\tThe Graphics Designer will all be responsible for designing &amp;amp; generating handbooks, All Event/Seminar Communication Products, ID cards, business cards, Signage, Voucher and Jersey designs\n\tThe Graphic Designer also handles Confidential Assets Such as office stamps, Signature(s) digital copy, letterhead designs.\n\n\nQualification &amp;amp; Experience\n\n\n\tRelevant University Degree or its equivalent.\n\tMinimum of 3+ years of working experience as a Graphic Designer, Illustrator, or a related role in the Design Department.\n\tProfessional certifications in Illustrator, Photoshop, Computer-aided design (CAD) or InDesign training course will be preferred.\n\tHands-on experience in image editing tools and graphic design software like InDesign, Adobe Illustrator, etc.\n\n\nNote\n\n\n\tOnly shortlisted candidates will be contacted.\n\tDisclaimer: Nile University is an equal opportunity employer and will never demand payment from candidates for employment. We caution all applicants to be vigilant against fraudulent solicitations. Legitimate job openings are exclusively advertised through official channels and reputable job boards. If you encounter any suspicious activity, please report it to: humanr@nileuniversity.edu.ng immediately.\n\",\n  \"datePosted\": \"2026-01-22\",\n  \"validThrough\": \"2026-01-29\",\n  \"employmentType\": \"Full-Time\",\n  \"hiringOrganization\": {\n    \"@type\": \"Organization\",\n    \"name\": \"Nile University of Nigeria\"\n    \n  },\n  \"jobLocation\": {\n    \"@type\": \"Place\",\n    \"address\": {\n      \"@type\": \"PostalAddress\",\n       \"postalCode\": \". \",\n       \"addressRegion\": \". \",\n       \"streetAddress\": \". \",\n      \"addressLocality\": \"Abuja\",\n      \"addressCountry\": \"NG\"\n     \n      \n    }\n  },\n  \"identifier\": {\n    \"@type\": \"PropertyValue\",\n    \"name\": \"\",\n    \"value\": \"193371\"\n  },\n  \"baseSalary\": {\n    \"@type\": \"MonetaryAmount\",\n    \"currency\": \"NGN\",\n    \"value\": {\n      \"@type\": \"QuantitativeValue\",\n      \"minValue\": 0,\n      \"maxValue\": 0,\n      \"unitText\": \"MONTH\"\n    }\n  }\n}\n\n\n\nGraphics Designer Job at Nile University of Nigeria\n\n\n\n\n        \n    \n\n        \n        Nile University of Nigeria, founded in 2009, Nile University is a private multidisciplinary university based in Abuja, and a proud member of Honoris United Universities since 2020. Nile University currently has over 40 undergraduate programmes and more than 50 postgraduate programmes spread across eight best- in-class faculties, in the College of Health Sciences, Law, Science, Computing Studies, Engineering, Environmental Sciences, Management Sciences, and Arts & Social Sciences.\n\nWe are recruiting to fill the position below:\n\nJob Position: Graphics Designer\n\nJob Location: Jabi Airport Road, Abuja (FCT) \nEmployment Type: Full-time\n\nJob Description\n     \n\n            \n    \n\n\n\n\n\tWe are currently looking to engage a highly competent and result-oriented Graphics Designer, with strong personal & professional integrity to join our dynamic team.\n\n\nResponsibilities\n\n\n\tThe Graphics Designer, will be responsible for providing full graphic design support to Nile University of Nigeria and to create brand awareness, as well as the development of various communication products for both screen and print media.\n\n\nHe/she is expected to;\n\n\n\tBe responsible for graphically designing and producing brochures, annual reports, posters, research reports, stewardship reports, advertisements, programmes in line with guidelines of Nile University of Nigeria.\n\tDesigns web banners and other special web promotional buttons.\n\tConceptualizing visuals, prepare rough drafts and present designs based on requirement Creating images & layouts using design software whilst ensuring the appropriate use of colors for each graphics.\n\tWork with various departments for design content review and amend designs after feedback.\n\tTest graphics across various media platform (both screen and print media)\n\tEnsure final graphics and layouts are visually appealing and on-brand\n\tLiaises with procurement and printers for printing of promotional, marketing, and informational materials.\n\tCo-ordinates planning, production and distribution of faculty and college newsletters, magazines, and bulletins.\n\tContributes to the overall success of Media/Graphics Unit by performing other essential duties and responsibilities as assigned by the principal/line manager.\n\tThe Graphics Designer will all be responsible for designing & generating handbooks, All Event/Seminar Communication Products, ID cards, business cards, Signage, Voucher and Jersey designs\n\tThe Graphic Designer also handles Confidential Assets Such as office stamps, Signature(s) digital copy, letterhead designs.\n\n\nQualification & Experience\n\n\n\tRelevant University Degree or its equivalent.\n\tMinimum of 3+ years of working experience as a Graphic Designer, Illustrator, or a related role in the Design Department.\n\tProfessional certifications in Illustrator, Photoshop, Computer-aided design (CAD) or InDesign training course will be preferred.\n\tHands-on experience in image editing tools and graphic design software like InDesign, Adobe Illustrator, etc.\n\n\nNote\n\n\n\tOnly shortlisted candidates will be contacted.\n\tDisclaimer: Nile University is an equal opportunity employer and will never demand payment from candidates for employment. We caution all applicants to be vigilant against fraudulent solicitations. Legitimate job openings are exclusively advertised through official channels and reputable job boards. If you encounter any suspicious activity, please report it to: humanr@nileuniversity.edu.ng immediately.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n\n\n\n        \n        \n\n            \n    \n\n\n\n\n   \n\n\n    \n        Similar Jobs\n    \n\n    \n        \n                        Content Creator (NYSC) Job at Doxix Consults\n                        Graphics - UI / UX Designer Job at JxWorx Software and Automation Limited\n                        Job Openings at Thirstify.ng\n                        Content Creator Job at Msmetics\n                        Content Creator (Corper) Job at Doxix Consults\n                        Content Creator Job at Dews and Petals Limited\n                        Graphics Designer Job at Lance Trend Limited\n                        Production & Creative Project Manager Job at A27 Global Services Limited\n                        Content Creator Job at Zoom36 Dental Care\n                        Female Content Creator (Social Media) / Admin Officer Job at Kimberlys Group\n                    \n    \n\n\n\n                        \n                    \n\n                    \n                        \n\n\n\n    \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n\n\n\n\n\n          \n\n\n    \n\n        Hottest Jobs\n\n        \n        \n            \n\n                Job Openings at J3 Holdings\n\n               \n            \n        \n            \n\n                Job Vacancies at Nirvana Synergy\n\n               \n            \n        \n            \n\n                Job Openings at OIC Partners\n\n               \n            \n        \n            \n\n                Palmpay Recruitment for Graduate Trainee\n\n               \n            \n        \n            \n\n                Secretary (Entry Level) Job at WhiteSpace Integrated Services Limited\n\n               \n            \n        \n            \n\n                Job Vacancies at Food Concepts Plc\n\n               \n            \n        \n            \n\n                Front Desk Officer Job at Kursi Group\n\n               \n            \n        \n            \n\n                Social Media Officer (Remote) Job at Zael Business Management & Consulting\n\n               \n            \n        \n            \n\n                Secretary / Personal Assistant to the CEO Job at Residency Hotel Limited\n\n               \n            \n        \n            \n\n                Customer Service Officer Job at Westfield Consulting Limited\n\n               \n            \n        \n        \n\n    \n\n\n\n\n        \n        \n   \n\n\n                    \n                            \n            \n        \n        \n        \n\n        \n\n    \n\n        \n\n            \n\n                \n\n                    Job Seekers\n\n                    \n\n                        Search for Jobs\n                         Featured Jobs\n                         Jobs by Specialization\n                         Jobs by Industry\n                         Jobs by Location\n                         \n                        Companies Currently Hiring\n\n                        Upload CV\n\n                        Free Aptitude Test Practice\n                        \n                        Scholarships and Financial Aid\n\n                        Testimonies\n                    \n\n                \n\n                \n\n                    Employers\n\n                    \n\n                        Post A Job\n\n                        Search Resumes/Profiles\n\n                        Create Employer Account\n\n                        Advertise\n\n                        Pricing\n\n                    \n\n                \n\n                \n\n                    Tools & Resources\n\n                    \n\n                        Contact us\n                        \n                        Our Blog\n\n                        Job XML/RSS Feeds\n \n                        Free Aptitude Test Practice\n\n                        Bank Details\n\n                        FAQ & Support\n\n                    \n\n                \n\n                \n\n                    Connect with us\n\n                    \n\n                        \n\n                            \n\n                            \n\n                        \n\n                        \n\n                            \n\n                            \n\n                        \n\n                \n\n                        \n\n                            \n\n                            \n\n                        \n\n                    \n\n\n\n                    \n\n                        Customer Care\n\n                        09134259221 \n\n                        (9am - 5pm) weekdays\n\n                         info [at] jobgurus.com.ng\n\n                    \n\n\n\n                \n\n            \n\n        \n\n    \n\n\n\n    \n\n        \n\n\n\n            \n\n                Privacy Policy\n\n                Terms & Conditions\n\n                Sitemap\n                \n                About us\n\n            \n\n\n\n            Copyright © 2026 Jobgurus.com.ng - Latest Jobs in Nigeria 2025. All right reserved.",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Content Creator (NYSC) Job at Doxix Consults",
    "link": "https://www.jobgurus.com.ng/jobs/view/content-creator-nysc-job-at-doxix-consults",
    "pubDate": "Thu, 22 Jan 2026 09:34:00 GMT",
    "source": "JobGurus",
    "keyword": "doxix consults",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance"
    ],
    "content": "(function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){\n        (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),\n        m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)\n    })(window,document,'script','//www.google-analytics.com/analytics.js','ga');\n\n    ga('create', 'UA-43112273-1', 'jobgurus.com.ng');\n    ga('send', 'pageview');\n\n\n\n\n    \n        \n    Home\n    Jobs\n    Free Aptitude Test Practice\n    Employer? Post a Job\n            Register\n        Sign in\n        Contact us\n    \n\n    \n\n        \n    \n        \n\n            \n\n                \n\n                    \n                        Toggle navigation\n                        \n                        \n                        \n                    \n\n                    \n                \n            \n\n            \n                \n\n\tJobs\n\tJob Seekers\n\tAptitude Test\n\tScholarships\n\n            \n\n            \n                \n\n                                            Register\n                        Sign in\n                    \n                    Employer? Post a Job\n                \n            \n\n        \n\n    \n\n        \n        \n            \n            \n                 \n    \n                    \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n        \n     \n\n\n                            \n                    \n        \n                        CLICK HERE TO JOIN OUR WHATSAPP CHANNEL \n                    \n    \n\n    \n                                \n                    \n\n                        \n                            \n                        \n\n                        \n                            \n                                Any Specialization\n                                                                    Accounting / Audit / Finance\n                                                                    Administration/ Office/ Operations\n                                                                    Advertising/ Social Media/ Marketing/ PR\n                                                                    Agriculture / Agro Allied\n                                                                    Analyst/ Quality Control\n                                                                    Automotive/ Car Services\n                                                                    Aviation / Airline\n                                                                    Banking / Insurance\n                                                                    Building Design / Architecture\n                                                                    Construction / Mining\n                                                                    Consulting / Business Strategy/ Planning\n                                                                    Craftsmen / Artisans\n                                                                    Creatives (Arts, Design, Fashion)\n                                                                    Customer Service\n                                                                    Domestic / Janitorial Services\n                                                                    Driving / Haulage\n                                                                    Education / Teaching / Training\n                                                                    Engineering / Technical\n                                                                    Executive / Management\n                                                                    Freelance / Data Entry\n                                                                    Government Agencies / Public Sector\n                                                                    Graduates / Freshers\n                                                                    Grants /  Scholarships\n                                                                    Hospitality / Food Services\n                                                                    HSE / Safety Management\n                                                                    Human Resources / Recruitment\n                                                                    Information Technology / ICT\n                                                                    Internship/ Industrial Training\n                                                                    Legal / Law\n                                                                    Logistics / Transportation/ Supply\n                                                                    Manufacturing / Production\n                                                                    Maritime Services / Shipping\n                                                                    Media / Art / Entertainment\n                                                                    Medical/ Healthcare / Pharmaceutical\n                                                                    Military / Para-Military\n                                                                    NGO / Community Services\n                                                                    Oil & Gas / Energy\n                                                                    Procurement/ Purchasing\n                                                                    Project Management\n                                                                    Real Estate / Property / Surveying\n                                                                    Research / Survey\n                                                                    Risk Management / Compliance\n                                                                    Sales / Business Development\n                                                                    Secretarial / PA\n                                                                    Security / Intelligence\n                                                                    Software/ Programming / Web development\n                                                                    Sports / Fitness\n                                                                    Supply Chain/ Store\n                                                                    Technicians\n                                                                    Telecommunications\n                                                                    Tourism / Travels\n                                                                    Vocational Trade and Services\n                                                            \n                        \n\n                        \n                            \n                                Any Work Level\n                                                                    Entry Level (Trainee)\n                                                                    Executive (Director, Head of Dept)\n                                                                    Experienced (Non-Manager)\n                                                                    Internship\n                                                                    Manager (Staff Supervisor)\n                                                                    Senior Executive (MD, CEO, COO)\n                                                                    Vocational (Skilled/Unskilled Labour)\n                                                            \n                        \n\n                        \n                            \n                                 Search\n                            \n                        \n                    \n                \n                            \n            \n\n\n\n\n\n\n            \n\n                \n                                        \n                    \n                                        \n                    \n                    \n\n                    \n                        \n                        \n\n{\n  \"@context\": \"https://schema.org\",\n  \"@type\": \"JobPosting\",\n  \"title\": \"Content Creator (NYSC)\",\n  \"description\": \"Doxix Consults -&amp;nbsp;We are a Team of Chartered Accountants, Economists, Tax Experts and Lawyers Registered and Licensed in Nigeria to provide professional Tax Services. As Tax Planners, we engage in a conscious effort on the part of our clients who are potential taxpayers, to help organize their financial transactions in such a way that legitimately minimizes tax liabilities at every point in time, and takes maximum advantage of available Tax Incentives both to organization and staff alike.\n\nWe are recruiting to fill the position below:\n\nJob Position: Content Creator (NYSC)\n\nJob Location:&amp;nbsp;Jabi, Abuja (FCT)&amp;nbsp;\nEmployment Type: Nysc\n\nJob Summary&amp;nbsp;\n\n\n\tThe Content Creator is responsible for developing engaging, high-quality content that promotes the company&amp;rsquo;s brand, products, and services across digital and offline platforms.\n\tThis role involves content ideation, creation, editing, and publishing in line with the company&amp;rsquo;s branding and marketing objectives.\n\n\nKey Responsibilities\n\n\n\tCreate original content for social media, website, blogs, and marketing campaigns\n\tDevelop written, visual, and video content aligned with brand guidelines\n\tPlan and execute content calendars and posting schedules\n\tCollaborate with marketing, design, and sales teams to support campaigns\n\tResearch industry trends and audience preferences to improve content performance\n\tEdit and proofread content to ensure accuracy and consistency\n\tMonitor content performance and engagement metrics\n\tAssist in photo and video shoots, including basic editing\n\tEnsure timely delivery of content projects.\n\n\nRequirements &amp;amp; Qualifications\n\n\n\tMinimum of SSCE / OND / HND / Bachelor&amp;rsquo;s degree in Mass Communication, Marketing, Media, or related field (added advantage)\n\tProven experience as a Content Creator or similar role\n\tStrong writing and storytelling skills\n\tBasic knowledge of photography, videography, and content editing tools\n\tFamiliarity with social media platforms (Instagram, TikTok, Facebook, X, LinkedIn).\n\n\nSkills &amp;amp; Competencies:\n\n\n\tCreativity and originality\n\tAttention to detail\n\tTime management and ability to meet deadlines\n\tGood communication and teamwork skills\n\tAdaptability and willingness to learn.\n\n\nMethod of Application&amp;nbsp;\nInterested and qualified candidates should send their CV to:&amp;nbsp;human.resources@doxixconsults.com&amp;nbsp;using the Job Position as the subject of the mail.\",\n  \"datePosted\": \"2026-01-22\",\n  \"validThrough\": \"2026-02-01\",\n  \"employmentType\": \"Full-Time\",\n  \"hiringOrganization\": {\n    \"@type\": \"Organization\",\n    \"name\": \"Doxix Consults\"\n    \n  },\n  \"jobLocation\": {\n    \"@type\": \"Place\",\n    \"address\": {\n      \"@type\": \"PostalAddress\",\n       \"postalCode\": \". \",\n       \"addressRegion\": \". \",\n       \"streetAddress\": \". \",\n      \"addressLocality\": \"Abuja\",\n      \"addressCountry\": \"NG\"\n     \n      \n    }\n  },\n  \"identifier\": {\n    \"@type\": \"PropertyValue\",\n    \"name\": \"\",\n    \"value\": \"193370\"\n  },\n  \"baseSalary\": {\n    \"@type\": \"MonetaryAmount\",\n    \"currency\": \"NGN\",\n    \"value\": {\n      \"@type\": \"QuantitativeValue\",\n      \"minValue\": 0,\n      \"maxValue\": 0,\n      \"unitText\": \"MONTH\"\n    }\n  }\n}\n\n\n\nContent Creator (NYSC) Job at Doxix Consults\n\n\n\n\n        \n    \n\n        \n        Doxix Consults - We are a Team of Chartered Accountants, Economists, Tax Experts and Lawyers Registered and Licensed in Nigeria to provide professional Tax Services. As Tax Planners, we engage in a conscious effort on the part of our clients who are potential taxpayers, to help organize their financial transactions in such a way that legitimately minimizes tax liabilities at every point in time, and takes maximum advantage of available Tax Incentives both to organization and staff alike.\n\nWe are recruiting to fill the position below:\n\nJob Position: Content Creator (NYSC)\n\nJob Location: Jabi, Abuja (FCT) \nEmployment Type: Nysc\n\nJob Summary \n     \n\n            \n    \n\n\n\n\n\tThe Content Creator is responsible for developing engaging, high-quality content that promotes the company’s brand, products, and services across digital and offline platforms.\n\tThis role involves content ideation, creation, editing, and publishing in line with the company’s branding and marketing objectives.\n\n\nKey Responsibilities\n\n\n\tCreate original content for social media, website, blogs, and marketing campaigns\n\tDevelop written, visual, and video content aligned with brand guidelines\n\tPlan and execute content calendars and posting schedules\n\tCollaborate with marketing, design, and sales teams to support campaigns\n\tResearch industry trends and audience preferences to improve content performance\n\tEdit and proofread content to ensure accuracy and consistency\n\tMonitor content performance and engagement metrics\n\tAssist in photo and video shoots, including basic editing\n\tEnsure timely delivery of content projects.\n\n\nRequirements & Qualifications\n\n\n\tMinimum of SSCE / OND / HND / Bachelor’s degree in Mass Communication, Marketing, Media, or related field (added advantage)\n\tProven experience as a Content Creator or similar role\n\tStrong writing and storytelling skills\n\tBasic knowledge of photography, videography, and content editing tools\n\tFamiliarity with social media platforms (Instagram, TikTok, Facebook, X, LinkedIn).\n\n\nSkills & Competencies:\n\n\n\tCreativity and originality\n\tAttention to detail\n\tTime management and ability to meet deadlines\n\tGood communication and teamwork skills\n\tAdaptability and willingness to learn.\n\n\nMethod of Application \nInterested and qualified candidates should send their CV to: human.resources@doxixconsults.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n\n\n\n        \n        \n\n            \n    \n\n\n\n\n   \n\n\n    \n        Similar Jobs\n    \n\n    \n        \n                        Graphics Designer Job at Nile University of Nigeria\n                        Graphics - UI / UX Designer Job at JxWorx Software and Automation Limited\n                        Job Openings at Thirstify.ng\n                        Content Creator Job at Msmetics\n                        Content Creator (Corper) Job at Doxix Consults\n                        Content Creator Job at Dews and Petals Limited\n                        Graphics Designer Job at Lance Trend Limited\n                        Production & Creative Project Manager Job at A27 Global Services Limited\n                        Content Creator Job at Zoom36 Dental Care\n                        Female Content Creator (Social Media) / Admin Officer Job at Kimberlys Group\n                    \n    \n\n\n\n                        \n                    \n\n                    \n                        \n\n\n\n    \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n\n\n\n\n\n          \n\n\n    \n\n        Hottest Jobs\n\n        \n        \n            \n\n                Job Openings at J3 Holdings\n\n               \n            \n        \n            \n\n                Job Vacancies at Nirvana Synergy\n\n               \n            \n        \n            \n\n                Job Openings at OIC Partners\n\n               \n            \n        \n            \n\n                Palmpay Recruitment for Graduate Trainee\n\n               \n            \n        \n            \n\n                Secretary (Entry Level) Job at WhiteSpace Integrated Services Limited\n\n               \n            \n        \n            \n\n                Job Vacancies at Food Concepts Plc\n\n               \n            \n        \n            \n\n                Front Desk Officer Job at Kursi Group\n\n               \n            \n        \n            \n\n                Social Media Officer (Remote) Job at Zael Business Management & Consulting\n\n               \n            \n        \n            \n\n                Secretary / Personal Assistant to the CEO Job at Residency Hotel Limited\n\n               \n            \n        \n            \n\n                Customer Service Officer Job at Westfield Consulting Limited\n\n               \n            \n        \n        \n\n    \n\n\n\n\n        \n        \n   \n\n\n                    \n                            \n            \n        \n        \n        \n\n        \n\n    \n\n        \n\n            \n\n                \n\n                    Job Seekers\n\n                    \n\n                        Search for Jobs\n                         Featured Jobs\n                         Jobs by Specialization\n                         Jobs by Industry\n                         Jobs by Location\n                         \n                        Companies Currently Hiring\n\n                        Upload CV\n\n                        Free Aptitude Test Practice\n                        \n                        Scholarships and Financial Aid\n\n                        Testimonies\n                    \n\n                \n\n                \n\n                    Employers\n\n                    \n\n                        Post A Job\n\n                        Search Resumes/Profiles\n\n                        Create Employer Account\n\n                        Advertise\n\n                        Pricing\n\n                    \n\n                \n\n                \n\n                    Tools & Resources\n\n                    \n\n                        Contact us\n                        \n                        Our Blog\n\n                        Job XML/RSS Feeds\n \n                        Free Aptitude Test Practice\n\n                        Bank Details\n\n                        FAQ & Support\n\n                    \n\n                \n\n                \n\n                    Connect with us\n\n                    \n\n                        \n\n                            \n\n                            \n\n                        \n\n                        \n\n                            \n\n                            \n\n                        \n\n                \n\n                        \n\n                            \n\n                            \n\n                        \n\n                    \n\n\n\n                    \n\n                        Customer Care\n\n                        09134259221 \n\n                        (9am - 5pm) weekdays\n\n                         info [at] jobgurus.com.ng\n\n                    \n\n\n\n                \n\n            \n\n        \n\n    \n\n\n\n    \n\n        \n\n\n\n            \n\n                Privacy Policy\n\n                Terms & Conditions\n\n                Sitemap\n                \n                About us\n\n            \n\n\n\n            Copyright © 2026 Jobgurus.com.ng - Latest Jobs in Nigeria 2025. All right reserved.",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Markets Business Manager Job at Standard Chartered Bank",
    "link": "https://www.jobgurus.com.ng/jobs/view/markets-business-manager-job-at-standard-chartered-bank",
    "pubDate": "Thu, 22 Jan 2026 09:34:00 GMT",
    "source": "JobGurus",
    "keyword": "standard chartered bank",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance"
    ],
    "content": "(function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){\n        (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),\n        m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)\n    })(window,document,'script','//www.google-analytics.com/analytics.js','ga');\n\n    ga('create', 'UA-43112273-1', 'jobgurus.com.ng');\n    ga('send', 'pageview');\n\n\n\n\n    \n        \n    Home\n    Jobs\n    Free Aptitude Test Practice\n    Employer? Post a Job\n            Register\n        Sign in\n        Contact us\n    \n\n    \n\n        \n    \n        \n\n            \n\n                \n\n                    \n                        Toggle navigation\n                        \n                        \n                        \n                    \n\n                    \n                \n            \n\n            \n                \n\n\tJobs\n\tJob Seekers\n\tAptitude Test\n\tScholarships\n\n            \n\n            \n                \n\n                                            Register\n                        Sign in\n                    \n                    Employer? Post a Job\n                \n            \n\n        \n\n    \n\n        \n        \n            \n            \n                 \n    \n                    \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n        \n     \n\n\n                            \n                    \n        \n                        CLICK HERE TO JOIN OUR WHATSAPP CHANNEL \n                    \n    \n\n    \n                                \n                    \n\n                        \n                            \n                        \n\n                        \n                            \n                                Any Specialization\n                                                                    Accounting / Audit / Finance\n                                                                    Administration/ Office/ Operations\n                                                                    Advertising/ Social Media/ Marketing/ PR\n                                                                    Agriculture / Agro Allied\n                                                                    Analyst/ Quality Control\n                                                                    Automotive/ Car Services\n                                                                    Aviation / Airline\n                                                                    Banking / Insurance\n                                                                    Building Design / Architecture\n                                                                    Construction / Mining\n                                                                    Consulting / Business Strategy/ Planning\n                                                                    Craftsmen / Artisans\n                                                                    Creatives (Arts, Design, Fashion)\n                                                                    Customer Service\n                                                                    Domestic / Janitorial Services\n                                                                    Driving / Haulage\n                                                                    Education / Teaching / Training\n                                                                    Engineering / Technical\n                                                                    Executive / Management\n                                                                    Freelance / Data Entry\n                                                                    Government Agencies / Public Sector\n                                                                    Graduates / Freshers\n                                                                    Grants /  Scholarships\n                                                                    Hospitality / Food Services\n                                                                    HSE / Safety Management\n                                                                    Human Resources / Recruitment\n                                                                    Information Technology / ICT\n                                                                    Internship/ Industrial Training\n                                                                    Legal / Law\n                                                                    Logistics / Transportation/ Supply\n                                                                    Manufacturing / Production\n                                                                    Maritime Services / Shipping\n                                                                    Media / Art / Entertainment\n                                                                    Medical/ Healthcare / Pharmaceutical\n                                                                    Military / Para-Military\n                                                                    NGO / Community Services\n                                                                    Oil & Gas / Energy\n                                                                    Procurement/ Purchasing\n                                                                    Project Management\n                                                                    Real Estate / Property / Surveying\n                                                                    Research / Survey\n                                                                    Risk Management / Compliance\n                                                                    Sales / Business Development\n                                                                    Secretarial / PA\n                                                                    Security / Intelligence\n                                                                    Software/ Programming / Web development\n                                                                    Sports / Fitness\n                                                                    Supply Chain/ Store\n                                                                    Technicians\n                                                                    Telecommunications\n                                                                    Tourism / Travels\n                                                                    Vocational Trade and Services\n                                                            \n                        \n\n                        \n                            \n                                Any Work Level\n                                                                    Entry Level (Trainee)\n                                                                    Executive (Director, Head of Dept)\n                                                                    Experienced (Non-Manager)\n                                                                    Internship\n                                                                    Manager (Staff Supervisor)\n                                                                    Senior Executive (MD, CEO, COO)\n                                                                    Vocational (Skilled/Unskilled Labour)\n                                                            \n                        \n\n                        \n                            \n                                 Search\n                            \n                        \n                    \n                \n                            \n            \n\n\n\n\n\n\n            \n\n                \n                                        \n                    \n                                        \n                    \n                    \n\n                    \n                        \n                        \n\n{\n  \"@context\": \"https://schema.org\",\n  \"@type\": \"JobPosting\",\n  \"title\": \"Markets Business Manager\",\n  \"description\": \"Standard Chartered Bank - We&amp;#39;re an international bank, nimble enough to act, big enough for impact. For more than 160 years, we&amp;#39;ve worked to make a positive difference for our clients, communities, and each other. We question the status quo, love a challenge and enjoy finding new opportunities to grow and do better than before. As a leading international bank, we strive to help people and businesses prosper across Asia, Africa and the Middle East.\n\nWe are recruiting to fill the position below:\n\nJob Position:&amp;nbsp;Markets Business Manager\n\nRequisition Number: 47656\nJob Location:&amp;nbsp;Lagos\nEmployment Type: Permanent\nWork Type: Office Working\n\nKey Responsibilities\n\n\n\tTo provide operational excellence and business enablement support for the Head of&amp;nbsp; Markets, Nigeria, and the Regional&amp;nbsp;team.\n\tThis includes the implementation and ongoing maintenance of the Operational Risk Framework (ORF), governance, conduct and supervision.&amp;nbsp;\n\tTo act as a trusted advisor in supporting the Markets Country Head in managing and running the Markets business in-country\n\n\nStrategy:\n\n\n\tUnderstand and support the implementation of the Nigeria and West Africa cluster Markets strategy and local business initiatives in alignment with the Global Markets&amp;nbsp;strategy&amp;nbsp;\n\tUnderstand the group&amp;rsquo;s business strategy and its implications for the Markets business in risk management, business enablement and advisory support &amp;nbsp;\n\tArticulation of business performance and underperformance to stakeholders&amp;nbsp;\n\tSupervision of Markets, and oversight of Treasury Markets and Capital Markets Product Sales (CMPS) in the Nigeria dealing room, in line with the Markets/TM/CMPS MoU. &amp;nbsp;\n\tBe aware of and understand the Group&amp;rsquo;s business strategy for Financial Markets and understand its implications on operational risk &amp;nbsp;\n\tBusiness budgeting and forecasting where required&amp;nbsp;\n\tDriving and management of a prudent cost and risk culture.&amp;nbsp;\n\n\nBusiness:\n\n\n\tPartner with global and local stakeholders and partners to agree priorities for execution&amp;nbsp;\n\tIdentification and unblocking of business issues&amp;nbsp;\n\tPromote awareness and understanding of the regulatory framework in which the Group operates, and the regulatory requirements and expectations relevant to the role&amp;nbsp;\n\tAssist in the delivery of the management agenda &amp;ndash; drive initiatives designed to improve financial performance, operating efficiency, risk and people management.&amp;nbsp;\n\tResponsible for challenging and questioning business strategy in application of operational risk appetite, seek to optimise the business risk-return profile&amp;nbsp;\n\tRepresent the business when interacting with the support functions.&amp;nbsp;\n\tImprove communication across business, function, and geographies.&amp;nbsp;\n\tRecommend and drive continuous improvements in the business, i.e., identify and executing ad-hoc improvements to business processes, policies, structure, and roles.&amp;nbsp;\n\n\nProcesses:\n\n\n\tResponsible for coordinating internal and external audit reviews &amp;ndash; liaising with stakeholders to ensure timely / accurate information is provided. Review audit findings and key themes, assisting the business to achieve timely resolution of action plans. &amp;nbsp;\n\tResponsible for supporting the business in minimizing operational risks and losses, and ensure material operational losses are investigated to prevent recurrence per group policy. Root Cause Analysis to be carried out where required and ensure any findings are remediated. &amp;nbsp;\n\tResponsible for being the go-to person for the business for all operational risk related incidents and queries that arise, and becoming a business end-to-end subject matter expert in all Financial Markets products offered by the Bank in this market&amp;nbsp;\n\tResponsible for coordinating with stakeholders in the country and with other Markets operational risk managers to increase transparency and share key learnings and best practices&amp;nbsp;\n\tResponsible for ensuring quality of information recorded in risk tracking system , as well as ensuring accuracy, completeness of data, and timely resolution of actions&amp;nbsp;\n\tResponsible for identifying knowledge gaps, facilitate development of training, arrange relevant business training on Operational Risk&amp;nbsp;\n\tContinuously seek out process simplification and re-engineering opportunities to improve operational efficiency.&amp;nbsp;\n\n\nPeople &amp;amp; Talent:\n\n\n\tResponsible for driving appropriate culture and values within the team. Setting appropriate tone and expectations for the team, work in collaboration with risk and control partners across all functions&amp;nbsp;\n\tFor team Leads, responsible for building and developing/growing the team&amp;nbsp;\n\n\n&amp;nbsp;&amp;nbsp;Risk Management:\n\n\n\tAssess the effectiveness of the Group&amp;rsquo;s arrangements to deliver effective governance, oversight and controls in the business. Challenge processes, procedures, and policy if there is opportunity for improvement&amp;nbsp;\n\tAccountable for the development of control enhancements to ensure any known risks are controlled within acceptable boundaries &amp;nbsp;\n\tAccountable for the identification of operational risk for new products and new business, regulatory and thematic risks, and the implementation of appropriate controls to mitigate these risks&amp;nbsp;\n\tFacilitate and drive the monthly cluster NFRF/BRF&amp;nbsp;\n\tResponsible for managing the Markets Nigeria &amp;amp;&amp;nbsp;&amp;nbsp;Non-Financial Risk Forum (NFRF).\n\tEnsure adequate governance and oversight over operational risk, through the escalation and appropriate resolution of relevant risk exposures to Regional Non-Financial Risk Committee (Regional NFRC) and Markets Business Risk Forum as required.&amp;nbsp;\n\tResponsible for the implementation and execution of the Control Sample Testing (CST) process, sampling and testing the population of controls to ensure compliance with agreed control standards and facilitating the monitoring/collection of any Key Risk Indicators (KRIs). &amp;nbsp;With the process owner ensure\n\n\nRegulatory &amp;amp; Business Conduct:\n\n\n\tDisplay exemplary conduct and live by the Group&amp;rsquo;s Values and Code of Conduct.&amp;nbsp;\n\tTake personal responsibility for embedding the highest standards of ethics, including regulatory and business conduct, across Standard Chartered Bank. This includes understanding and ensuring compliance with, in letter and spirit, all applicable laws, regulations, guidelines and the Group Code of Conduct.\n\tEffectively and collaboratively identify, escalate, mitigate and resolve risk, conduct and compliance matters.\n\n\nKey stakeholders:\n\n\n\tHead, Markets, (Nigeria)&amp;nbsp;\n\tHead of Treasury Markets Nigeria&amp;nbsp;\n\tHead of CMPS&amp;nbsp;\n\tSenior Operational Risk Officer(s) (SORO)&amp;nbsp;\n\tRegional COO&amp;nbsp;\n\tMarkets Product COOs&amp;nbsp;\n\tCountry Compliance\n\tMarkets CFCC Advisory &amp;nbsp;\n\tInternal Audit&amp;nbsp;\n\tExternal Audit&amp;nbsp;\n\tMarkets Operations&amp;nbsp;\n\tLocal Finance and Markets Business Finance Partner.\n\n\nOther Responsibilities:\n\n\n\tEmbed Here for good and Group&amp;rsquo;s brand and values in Nigeria Markets COO team; Perform other responsibilities assigned under Group, Country, Business or Functional policies and procedures; Multiple functions (double hats); [List all responsibilities associated with the role]\n\n\nQualifications\n\n\n\tEducation: University Degree &amp;nbsp; &amp;nbsp;&amp;nbsp;\n\tCertifications: Certification in Financial Markets e. g ACI Certification, Risk Management and Compliance will be added advantage.&amp;nbsp;\n\n\nSkills and Experience:\n\n\n\tEffective Communication&amp;nbsp;\n\tInfluencing thorough Expertise&amp;nbsp;\n\tProject management\n\tPlanning: Tactical, Strategic&amp;nbsp;\n\tBusiness Development&amp;nbsp;\n\tOrganizational Governance.\n\",\n  \"datePosted\": \"2026-01-22\",\n  \"validThrough\": \"2026-02-02\",\n  \"employmentType\": \"Full-Time\",\n  \"hiringOrganization\": {\n    \"@type\": \"Organization\",\n    \"name\": \"Standard Chartered Bank\"\n    \n  },\n  \"jobLocation\": {\n    \"@type\": \"Place\",\n    \"address\": {\n      \"@type\": \"PostalAddress\",\n       \"postalCode\": \". \",\n       \"addressRegion\": \". \",\n       \"streetAddress\": \". \",\n      \"addressLocality\": \"Lagos\",\n      \"addressCountry\": \"NG\"\n     \n      \n    }\n  },\n  \"identifier\": {\n    \"@type\": \"PropertyValue\",\n    \"name\": \"\",\n    \"value\": \"193369\"\n  },\n  \"baseSalary\": {\n    \"@type\": \"MonetaryAmount\",\n    \"currency\": \"NGN\",\n    \"value\": {\n      \"@type\": \"QuantitativeValue\",\n      \"minValue\": 0,\n      \"maxValue\": 0,\n      \"unitText\": \"MONTH\"\n    }\n  }\n}\n\n\n\nMarkets Business Manager Job at Standard Chartered Bank\n\n\n\n\n        \n    \n\n        \n        Standard Chartered Bank - We're an international bank, nimble enough to act, big enough for impact. For more than 160 years, we've worked to make a positive difference for our clients, communities, and each other. We question the status quo, love a challenge and enjoy finding new opportunities to grow and do better than before. As a leading international bank, we strive to help people and businesses prosper across Asia, Africa and the Middle East.\n\nWe are recruiting to fill the position below:\n\nJob Position: Markets Business Manager\n\nRequisition Number: 47656\nJob Location: Lagos\nEmployment Type: Permanent\nWork Type: Office Working\n\nKey Responsibilities\n     \n\n            \n    \n\n\n\n\n\tTo provide operational excellence and business enablement support for the Head of  Markets, Nigeria, and the Regional team.\n\tThis includes the implementation and ongoing maintenance of the Operational Risk Framework (ORF), governance, conduct and supervision. \n\tTo act as a trusted advisor in supporting the Markets Country Head in managing and running the Markets business in-country\n\n\nStrategy:\n\n\n\tUnderstand and support the implementation of the Nigeria and West Africa cluster Markets strategy and local business initiatives in alignment with the Global Markets strategy \n\tUnderstand the group’s business strategy and its implications for the Markets business in risk management, business enablement and advisory support  \n\tArticulation of business performance and underperformance to stakeholders \n\tSupervision of Markets, and oversight of Treasury Markets and Capital Markets Product Sales (CMPS) in the Nigeria dealing room, in line with the Markets/TM/CMPS MoU.  \n\tBe aware of and understand the Group’s business strategy for Financial Markets and understand its implications on operational risk  \n\tBusiness budgeting and forecasting where required \n\tDriving and management of a prudent cost and risk culture. \n\n\nBusiness:\n\n\n\tPartner with global and local stakeholders and partners to agree priorities for execution \n\tIdentification and unblocking of business issues \n\tPromote awareness and understanding of the regulatory framework in which the Group operates, and the regulatory requirements and expectations relevant to the role \n\tAssist in the delivery of the management agenda – drive initiatives designed to improve financial performance, operating efficiency, risk and people management. \n\tResponsible for challenging and questioning business strategy in application of operational risk appetite, seek to optimise the business risk-return profile \n\tRepresent the business when interacting with the support functions. \n\tImprove communication across business, function, and geographies. \n\tRecommend and drive continuous improvements in the business, i.e., identify and executing ad-hoc improvements to business processes, policies, structure, and roles. \n\n\nProcesses:\n\n\n\tResponsible for coordinating internal and external audit reviews – liaising with stakeholders to ensure timely / accurate information is provided. Review audit findings and key themes, assisting the business to achieve timely resolution of action plans.  \n\tResponsible for supporting the business in minimizing operational risks and losses, and ensure material operational losses are investigated to prevent recurrence per group policy. Root Cause Analysis to be carried out where required and ensure any findings are remediated.  \n\tResponsible for being the go-to person for the business for all operational risk related incidents and queries that arise, and becoming a business end-to-end subject matter expert in all Financial Markets products offered by the Bank in this market \n\tResponsible for coordinating with stakeholders in the country and with other Markets operational risk managers to increase transparency and share key learnings and best practices \n\tResponsible for ensuring quality of information recorded in risk tracking system , as well as ensuring accuracy, completeness of data, and timely resolution of actions \n\tResponsible for identifying knowledge gaps, facilitate development of training, arrange relevant business training on Operational Risk \n\tContinuously seek out process simplification and re-engineering opportunities to improve operational efficiency. \n\n\nPeople & Talent:\n\n\n\tResponsible for driving appropriate culture and values within the team. Setting appropriate tone and expectations for the team, work in collaboration with risk and control partners across all functions \n\tFor team Leads, responsible for building and developing/growing the team \n\n\n  Risk Management:\n\n\n\tAssess the effectiveness of the Group’s arrangements to deliver effective governance, oversight and controls in the business. Challenge processes, procedures, and policy if there is opportunity for improvement \n\tAccountable for the development of control enhancements to ensure any known risks are controlled within acceptable boundaries  \n\tAccountable for the identification of operational risk for new products and new business, regulatory and thematic risks, and the implementation of appropriate controls to mitigate these risks \n\tFacilitate and drive the monthly cluster NFRF/BRF \n\tResponsible for managing the Markets Nigeria &  Non-Financial Risk Forum (NFRF).\n\tEnsure adequate governance and oversight over operational risk, through the escalation and appropriate resolution of relevant risk exposures to Regional Non-Financial Risk Committee (Regional NFRC) and Markets Business Risk Forum as required. \n\tResponsible for the implementation and execution of the Control Sample Testing (CST) process, sampling and testing the population of controls to ensure compliance with agreed control standards and facilitating the monitoring/collection of any Key Risk Indicators (KRIs).  With the process owner ensure\n\n\nRegulatory & Business Conduct:\n\n\n\tDisplay exemplary conduct and live by the Group’s Values and Code of Conduct. \n\tTake personal responsibility for embedding the highest standards of ethics, including regulatory and business conduct, across Standard Chartered Bank. This includes understanding and ensuring compliance with, in letter and spirit, all applicable laws, regulations, guidelines and the Group Code of Conduct.\n\tEffectively and collaboratively identify, escalate, mitigate and resolve risk, conduct and compliance matters.\n\n\nKey stakeholders:\n\n\n\tHead, Markets, (Nigeria) \n\tHead of Treasury Markets Nigeria \n\tHead of CMPS \n\tSenior Operational Risk Officer(s) (SORO) \n\tRegional COO \n\tMarkets Product COOs \n\tCountry Compliance\n\tMarkets CFCC Advisory  \n\tInternal Audit \n\tExternal Audit \n\tMarkets Operations \n\tLocal Finance and Markets Business Finance Partner.\n\n\nOther Responsibilities:\n\n\n\tEmbed Here for good and Group’s brand and values in Nigeria Markets COO team; Perform other responsibilities assigned under Group, Country, Business or Functional policies and procedures; Multiple functions (double hats); [List all responsibilities associated with the role]\n\n\nQualifications\n\n\n\tEducation: University Degree     \n\tCertifications: Certification in Financial Markets e. g ACI Certification, Risk Management and Compliance will be added advantage. \n\n\nSkills and Experience:\n\n\n\tEffective Communication \n\tInfluencing thorough Expertise \n\tProject management\n\tPlanning: Tactical, Strategic \n\tBusiness Development \n\tOrganizational Governance.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n\n\n\n        \n        \n\n            \n    \n\n\n\n\n   \n\n\n    \n        Similar Jobs\n    \n\n    \n        \n                        Digital Marketer and Content Creator Job at Kayode Obembe Properties Limited\n                        Social Media Manager Job at Luxsit Integration\n                        Marketing & Sales Personnel Job at Doheney Services Limited\n                        Social Media Manager Job at Flutterwave\n                        Social Media Manager Job at Givanas Group\n                        Content Marketing Specialist Job at Gradely\n                        Social Media Manager Job at Associates Consulting Limited\n                        Job Vacancies at Phillips Outsourcing Limited\n                        Social Media Manager Job at the Vault Recruitment (TVR)\n                        Business Development Manager Job at Trinity Financials\n                    \n    \n\n\n\n                        \n                    \n\n                    \n                        \n\n\n\n    \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n\n\n\n\n\n          \n\n\n    \n\n        Hottest Jobs\n\n        \n        \n            \n\n                Job Openings at J3 Holdings\n\n               \n            \n        \n            \n\n                Job Vacancies at Nirvana Synergy\n\n               \n            \n        \n            \n\n                Job Openings at OIC Partners\n\n               \n            \n        \n            \n\n                Palmpay Recruitment for Graduate Trainee\n\n               \n            \n        \n            \n\n                Secretary (Entry Level) Job at WhiteSpace Integrated Services Limited\n\n               \n            \n        \n            \n\n                Job Vacancies at Food Concepts Plc\n\n               \n            \n        \n            \n\n                Front Desk Officer Job at Kursi Group\n\n               \n            \n        \n            \n\n                Social Media Officer (Remote) Job at Zael Business Management & Consulting\n\n               \n            \n        \n            \n\n                Secretary / Personal Assistant to the CEO Job at Residency Hotel Limited\n\n               \n            \n        \n            \n\n                Customer Service Officer Job at Westfield Consulting Limited\n\n               \n            \n        \n        \n\n    \n\n\n\n\n        \n        \n   \n\n\n                    \n                            \n            \n        \n        \n        \n\n        \n\n    \n\n        \n\n            \n\n                \n\n                    Job Seekers\n\n                    \n\n                        Search for Jobs\n                         Featured Jobs\n                         Jobs by Specialization\n                         Jobs by Industry\n                         Jobs by Location\n                         \n                        Companies Currently Hiring\n\n                        Upload CV\n\n                        Free Aptitude Test Practice\n                        \n                        Scholarships and Financial Aid\n\n                        Testimonies\n                    \n\n                \n\n                \n\n                    Employers\n\n                    \n\n                        Post A Job\n\n                        Search Resumes/Profiles\n\n                        Create Employer Account\n\n                        Advertise\n\n                        Pricing\n\n                    \n\n                \n\n                \n\n                    Tools & Resources\n\n                    \n\n                        Contact us\n                        \n                        Our Blog\n\n                        Job XML/RSS Feeds\n \n                        Free Aptitude Test Practice\n\n                        Bank Details\n\n                        FAQ & Support\n\n                    \n\n                \n\n                \n\n                    Connect with us\n\n                    \n\n                        \n\n                            \n\n                            \n\n                        \n\n                        \n\n                            \n\n                            \n\n                        \n\n                \n\n                        \n\n                            \n\n                            \n\n                        \n\n                    \n\n\n\n                    \n\n                        Customer Care\n\n                        09134259221 \n\n                        (9am - 5pm) weekdays\n\n                         info [at] jobgurus.com.ng\n\n                    \n\n\n\n                \n\n            \n\n        \n\n    \n\n\n\n    \n\n        \n\n\n\n            \n\n                Privacy Policy\n\n                Terms & Conditions\n\n                Sitemap\n                \n                About us\n\n            \n\n\n\n            Copyright © 2026 Jobgurus.com.ng - Latest Jobs in Nigeria 2025. All right reserved.",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Senior Accountant Job at Montaigne Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/senior-accountant-job-at-montaigne-limited",
    "pubDate": "Thu, 22 Jan 2026 09:34:00 GMT",
    "source": "JobGurus",
    "keyword": "montaigne limited",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "(function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){\n        (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),\n        m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)\n    })(window,document,'script','//www.google-analytics.com/analytics.js','ga');\n\n    ga('create', 'UA-43112273-1', 'jobgurus.com.ng');\n    ga('send', 'pageview');\n\n\n\n\n    \n        \n    Home\n    Jobs\n    Free Aptitude Test Practice\n    Employer? Post a Job\n            Register\n        Sign in\n        Contact us\n    \n\n    \n\n        \n    \n        \n\n            \n\n                \n\n                    \n                        Toggle navigation\n                        \n                        \n                        \n                    \n\n                    \n                \n            \n\n            \n                \n\n\tJobs\n\tJob Seekers\n\tAptitude Test\n\tScholarships\n\n            \n\n            \n                \n\n                                            Register\n                        Sign in\n                    \n                    Employer? Post a Job\n                \n            \n\n        \n\n    \n\n        \n        \n            \n            \n                 \n    \n                    \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n        \n     \n\n\n                            \n                    \n        \n                        CLICK HERE TO JOIN OUR WHATSAPP CHANNEL \n                    \n    \n\n    \n                                \n                    \n\n                        \n                            \n                        \n\n                        \n                            \n                                Any Specialization\n                                                                    Accounting / Audit / Finance\n                                                                    Administration/ Office/ Operations\n                                                                    Advertising/ Social Media/ Marketing/ PR\n                                                                    Agriculture / Agro Allied\n                                                                    Analyst/ Quality Control\n                                                                    Automotive/ Car Services\n                                                                    Aviation / Airline\n                                                                    Banking / Insurance\n                                                                    Building Design / Architecture\n                                                                    Construction / Mining\n                                                                    Consulting / Business Strategy/ Planning\n                                                                    Craftsmen / Artisans\n                                                                    Creatives (Arts, Design, Fashion)\n                                                                    Customer Service\n                                                                    Domestic / Janitorial Services\n                                                                    Driving / Haulage\n                                                                    Education / Teaching / Training\n                                                                    Engineering / Technical\n                                                                    Executive / Management\n                                                                    Freelance / Data Entry\n                                                                    Government Agencies / Public Sector\n                                                                    Graduates / Freshers\n                                                                    Grants /  Scholarships\n                                                                    Hospitality / Food Services\n                                                                    HSE / Safety Management\n                                                                    Human Resources / Recruitment\n                                                                    Information Technology / ICT\n                                                                    Internship/ Industrial Training\n                                                                    Legal / Law\n                                                                    Logistics / Transportation/ Supply\n                                                                    Manufacturing / Production\n                                                                    Maritime Services / Shipping\n                                                                    Media / Art / Entertainment\n                                                                    Medical/ Healthcare / Pharmaceutical\n                                                                    Military / Para-Military\n                                                                    NGO / Community Services\n                                                                    Oil & Gas / Energy\n                                                                    Procurement/ Purchasing\n                                                                    Project Management\n                                                                    Real Estate / Property / Surveying\n                                                                    Research / Survey\n                                                                    Risk Management / Compliance\n                                                                    Sales / Business Development\n                                                                    Secretarial / PA\n                                                                    Security / Intelligence\n                                                                    Software/ Programming / Web development\n                                                                    Sports / Fitness\n                                                                    Supply Chain/ Store\n                                                                    Technicians\n                                                                    Telecommunications\n                                                                    Tourism / Travels\n                                                                    Vocational Trade and Services\n                                                            \n                        \n\n                        \n                            \n                                Any Work Level\n                                                                    Entry Level (Trainee)\n                                                                    Executive (Director, Head of Dept)\n                                                                    Experienced (Non-Manager)\n                                                                    Internship\n                                                                    Manager (Staff Supervisor)\n                                                                    Senior Executive (MD, CEO, COO)\n                                                                    Vocational (Skilled/Unskilled Labour)\n                                                            \n                        \n\n                        \n                            \n                                 Search\n                            \n                        \n                    \n                \n                            \n            \n\n\n\n\n\n\n            \n\n                \n                                        \n                    \n                                        \n                    \n                    \n\n                    \n                        \n                        \n\n{\n  \"@context\": \"https://schema.org\",\n  \"@type\": \"JobPosting\",\n  \"title\": \"Senior Accountant\",\n  \"description\": \"Montaigne Limited is Nigeria&amp;rsquo;s leading luxury beauty and personal care retail company, representing prestigious international brands across skincare, fragrance, cosmetics, and lifestyle categories. We are committed to delivering premium customer experiences, operational excellence, and continuous staff development to uphold our reputation as a foremost name in luxury retail.\n\nWe are recruiting to fill the position below:\n\nJob Position: Senior Accountant\n\nJob Location:&amp;nbsp;Victoria Island, Lagos\nEmployment Type: Full-time\n\nJob Description\nJob Brief\n\n\n\tWe are looking for an experienced Senior Accountant to oversee general accounting operations by controlling and verifying our financial transactions.\n\tAs a Senior accountant your responsibilities include reconciling account balances and bank statements, maintaining general ledger and preparing month-end close procedures.\n\tThe ideal candidate has also experience collaborating and/or managing a team of Accountants and Junior Accountants.\n\tSenior Accountant duties also include ensuring accuracy and effectiveness in all of our accounting tasks.\n\n\nResponsibilities\n\n\n\tVerify, allocate, post and reconcile accounts payable and receivable\n\tProduce error-free accounting reports and present their results\n\tAnalyze financial information and summarize financial status\n\tSpot errors and suggest ways to improve efficiency and spending\n\tProvide technical support and advice on Management Accountant\n\tReview and recommend modifications to accounting systems and procedures\n\tManage accounting assistants and bookkeepers\n\tParticipate in financial standards setting and in forecast process\n\tProvide input into department&amp;rsquo;s goal setting process\n\tPrepare financial statements and produce budget according to schedule\n\tAssist with tax audits and tax returns\n\tDirect internal and external audits to ensure compliance\n\tPlan, assign and review staff&amp;rsquo;s work\n\tSupport month-end and year-end close process\n\tDevelop and document business processes and accounting policies to maintain and strengthen internal controls\n\tEnsure compliance with GAAP principles\n\tLiaise with our Financial Manager and Accounting Manager to improve financial procedures.\n\n\nRequirements and Skills\n\n\n\tBS Degree in Accounting, Finance or relevant\n\tICAN Certification is a MUST\n\tProven experience as a Financial Controller, Accounting Supervisor, chief or senior accountant\n\tThorough knowledge of basic accounting procedures\n\tIn-depth understanding of Generally Accepted Accounting Principles (GAAP)\n\tAwareness of business trends\n\tFamiliarity with financial accounting statements.\n\n\nSalary\nN700,000 - N850,000 per month.\",\n  \"datePosted\": \"2026-01-22\",\n  \"validThrough\": \"2026-02-04\",\n  \"employmentType\": \"Full-Time\",\n  \"hiringOrganization\": {\n    \"@type\": \"Organization\",\n    \"name\": \"Montaigne Place\"\n    \n  },\n  \"jobLocation\": {\n    \"@type\": \"Place\",\n    \"address\": {\n      \"@type\": \"PostalAddress\",\n       \"postalCode\": \". \",\n       \"addressRegion\": \". \",\n       \"streetAddress\": \". \",\n      \"addressLocality\": \"Lagos\",\n      \"addressCountry\": \"NG\"\n     \n      \n    }\n  },\n  \"identifier\": {\n    \"@type\": \"PropertyValue\",\n    \"name\": \"\",\n    \"value\": \"193368\"\n  },\n  \"baseSalary\": {\n    \"@type\": \"MonetaryAmount\",\n    \"currency\": \"NGN\",\n    \"value\": {\n      \"@type\": \"QuantitativeValue\",\n      \"minValue\": 600000,\n      \"maxValue\": 900000,\n      \"unitText\": \"MONTH\"\n    }\n  }\n}\n\n\n\nSenior Accountant Job at Montaigne Limited\n\n\n\n\n        \n    \n\n        \n        Montaigne Limited is Nigeria’s leading luxury beauty and personal care retail company, representing prestigious international brands across skincare, fragrance, cosmetics, and lifestyle categories. We are committed to delivering premium customer experiences, operational excellence, and continuous staff development to uphold our reputation as a foremost name in luxury retail.\n\nWe are recruiting to fill the position below:\n\nJob Position: Senior Accountant\n\nJob Location: Victoria Island, Lagos\nEmployment Type: Full-time\n\nJob Description\nJob Brief\n     \n\n            \n    \n\n\n\n\n\tWe are looking for an experienced Senior Accountant to oversee general accounting operations by controlling and verifying our financial transactions.\n\tAs a Senior accountant your responsibilities include reconciling account balances and bank statements, maintaining general ledger and preparing month-end close procedures.\n\tThe ideal candidate has also experience collaborating and/or managing a team of Accountants and Junior Accountants.\n\tSenior Accountant duties also include ensuring accuracy and effectiveness in all of our accounting tasks.\n\n\nResponsibilities\n\n\n\tVerify, allocate, post and reconcile accounts payable and receivable\n\tProduce error-free accounting reports and present their results\n\tAnalyze financial information and summarize financial status\n\tSpot errors and suggest ways to improve efficiency and spending\n\tProvide technical support and advice on Management Accountant\n\tReview and recommend modifications to accounting systems and procedures\n\tManage accounting assistants and bookkeepers\n\tParticipate in financial standards setting and in forecast process\n\tProvide input into department’s goal setting process\n\tPrepare financial statements and produce budget according to schedule\n\tAssist with tax audits and tax returns\n\tDirect internal and external audits to ensure compliance\n\tPlan, assign and review staff’s work\n\tSupport month-end and year-end close process\n\tDevelop and document business processes and accounting policies to maintain and strengthen internal controls\n\tEnsure compliance with GAAP principles\n\tLiaise with our Financial Manager and Accounting Manager to improve financial procedures.\n\n\nRequirements and Skills\n\n\n\tBS Degree in Accounting, Finance or relevant\n\tICAN Certification is a MUST\n\tProven experience as a Financial Controller, Accounting Supervisor, chief or senior accountant\n\tThorough knowledge of basic accounting procedures\n\tIn-depth understanding of Generally Accepted Accounting Principles (GAAP)\n\tAwareness of business trends\n\tFamiliarity with financial accounting statements.\n\n\nSalary\nN700,000 - N850,000 per month.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n\n\n\n        \n        \n\n            \n    \n\n\n\n\n   \n\n\n    \n        Similar Jobs\n    \n\n    \n        \n                        Accountant Job at Zaventra Solutions\n                        Bursar Job at Ritman University\n                        Accountant I Job at Ritman University\n                        Manager - Treasury Operations, Finance Job at MTN Nigeria\n                        Head, Revenue Assurance Job at Unified Payment Services Limited\n                        Field Collection Officer Job at Flexi Microfinance Bank Limited\n                        Job Openings at Sonora Capital and Investment Limited\n                        Chief Financial Officer Job at Koins Microfinance Bank Limited\n                        Finance Officer Job at D.light Energy Limited\n                        Audit Specialist Job at Unified Payment Services Limited\n                    \n    \n\n\n\n                        \n                    \n\n                    \n                        \n\n\n\n    \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n\n\n\n\n\n          \n\n\n    \n\n        Hottest Jobs\n\n        \n        \n            \n\n                Job Openings at J3 Holdings\n\n               \n            \n        \n            \n\n                Job Vacancies at Nirvana Synergy\n\n               \n            \n        \n            \n\n                Job Openings at OIC Partners\n\n               \n            \n        \n            \n\n                Palmpay Recruitment for Graduate Trainee\n\n               \n            \n        \n            \n\n                Secretary (Entry Level) Job at WhiteSpace Integrated Services Limited\n\n               \n            \n        \n            \n\n                Job Vacancies at Food Concepts Plc\n\n               \n            \n        \n            \n\n                Front Desk Officer Job at Kursi Group\n\n               \n            \n        \n            \n\n                Social Media Officer (Remote) Job at Zael Business Management & Consulting\n\n               \n            \n        \n            \n\n                Secretary / Personal Assistant to the CEO Job at Residency Hotel Limited\n\n               \n            \n        \n            \n\n                Customer Service Officer Job at Westfield Consulting Limited\n\n               \n            \n        \n        \n\n    \n\n\n\n\n        \n        \n   \n\n\n                    \n                            \n            \n        \n        \n        \n\n        \n\n    \n\n        \n\n            \n\n                \n\n                    Job Seekers\n\n                    \n\n                        Search for Jobs\n                         Featured Jobs\n                         Jobs by Specialization\n                         Jobs by Industry\n                         Jobs by Location\n                         \n                        Companies Currently Hiring\n\n                        Upload CV\n\n                        Free Aptitude Test Practice\n                        \n                        Scholarships and Financial Aid\n\n                        Testimonies\n                    \n\n                \n\n                \n\n                    Employers\n\n                    \n\n                        Post A Job\n\n                        Search Resumes/Profiles\n\n                        Create Employer Account\n\n                        Advertise\n\n                        Pricing\n\n                    \n\n                \n\n                \n\n                    Tools & Resources\n\n                    \n\n                        Contact us\n                        \n                        Our Blog\n\n                        Job XML/RSS Feeds\n \n                        Free Aptitude Test Practice\n\n                        Bank Details\n\n                        FAQ & Support\n\n                    \n\n                \n\n                \n\n                    Connect with us\n\n                    \n\n                        \n\n                            \n\n                            \n\n                        \n\n                        \n\n                            \n\n                            \n\n                        \n\n                \n\n                        \n\n                            \n\n                            \n\n                        \n\n                    \n\n\n\n                    \n\n                        Customer Care\n\n                        09134259221 \n\n                        (9am - 5pm) weekdays\n\n                         info [at] jobgurus.com.ng\n\n                    \n\n\n\n                \n\n            \n\n        \n\n    \n\n\n\n    \n\n        \n\n\n\n            \n\n                Privacy Policy\n\n                Terms & Conditions\n\n                Sitemap\n                \n                About us\n\n            \n\n\n\n            Copyright © 2026 Jobgurus.com.ng - Latest Jobs in Nigeria 2025. All right reserved.",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]