[
  {
    "title": "HR Manager Job at LD&D Consulting",
    "link": "https://www.jobgurus.com.ng/jobs/view/hr-manager-job-at-ldd-consulting-1",
    "pubDate": "Wed, 02 Jul 2025 18:49:36 GMT",
    "source": "JobGurus",
    "keyword": "ld&d consulting",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "At LD&D Consulting, we are a leading recruiting company in Nigeria and beyond. We offer top-notch Staffing Solutions, Recruitment, HR Outsourcing and Payroll services across various industries including Telecoms, IT, Construction, Transportation, Energy, Sports, Finance, Environmental and Health care, in both private and public sectors.\n\nWe are recruiting to fill the position below:\n\nJob Position: HR Manager\n\nJob Location: Utako, Abuja (FCT) \nEmployment Type: Full-time\nCompany Type: Finance & Cleaning Services\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a dynamic and experienced HR Officer to join our team and support the HR functions across our finance and cleaning services divisions.\n\tThe ideal candidate will be responsible for managing recruitment, onboarding, employee relations, performance management, and compliance with labor laws.\n\n\nKey Responsibilities\n\n\n\tCoordinate end-to-end recruitment processes for both the finance and cleaning units.\n\tManage employee onboarding, orientation, and documentation.\n\tMaintain accurate employee records and HR documentation.\n\tOversee attendance, leave, and payroll administration.\n\tSupport management in disciplinary and grievance issues.\n\tImplement and monitor HR policies, procedures, and best practices.\n\tOrganize staff training and development programs.\n\tEnsure compliance with labor laws and organizational policies.\n\tSupport in performance appraisal coordination and staff engagement activities.\n\tServe as the point of contact for employee concerns and HR queries.\n\n\nRequirements\n\n\n\tBachelor’s Degree in Human Resources, Business Administration, or related field.\n\t3+ years of proven HR experience (experience in multi-sector HR is an advantage).\n\tStrong knowledge of Nigerian labor laws and HR best practices.\n\tExcellent interpersonal and communication skills.\n\tStrong organizational and problem-solving abilities.\n\tProficiency in MS Office and HR software/tools.\n\tAbility to manage HR processes across diverse service sectors.\n\tDiscreet, ethical, and trustworthy.\n\tAdaptable and able to work in a fast-paced environment.\n\n\nSalary\nN300,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: sarah@ldd-consulting.com using “HR Officer” as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Training And Development Assistant Job at Redswitch Collections",
    "link": "https://www.jobgurus.com.ng/jobs/view/training-and-development-assistant-job-at-redswitch-collections",
    "pubDate": "Wed, 02 Jul 2025 18:49:36 GMT",
    "source": "JobGurus",
    "keyword": "redswitch collections",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Redswitch Collections is a dynamic and innovative consultancy firm that specializes in providing strategic advice and tailored solutions across a wide array of industries. With a focus on enhancing business performance and solving complex challenges, we collaborate closely with our clients to deliver measurable results that drive growth and sustainability. Whether it’s optimizing operations, improving financial performance, or navigating industry-specific challenges, we help organizations reach their full potential.\n\nWe are recruiting to fill the position below:\n\nJob Position: Training And Development Assistant\nJob Location:  Abuja (FCT) \n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a proactive Training & Development Assistant to support training operations, proposal formatting, outreach, and logistics coordination.\n\n\nKey Responsibilities\n\n\n\tCoordinate training/event logistics and facilitator schedules\n\tFormat and assemble client proposals and presentations\n\tSupport marketing campaigns (calls, WhatsApp, digital outreach)\n\tAssist with branding, Canva designs, and basic content editing\n\tConduct cold calling and digital prospecting for business leads\n\n\nRequirements\n\n\n\tOND/HND/B.Sc. in Business Admin, Education, Marketing, or related fields\n\t1–2 years of relevant experience (training, admin, proposal support, or fieldwork)\n\tSkills in Canva, proposal writing, or digital marketing are a strong advantage\n\tStrong communication, attention to detail, and ability to multitask.\n\n\nSalary\nN100,000 per month. \n\nMethod of Application\nInterested and qualified candidates should send their CV to: patrickpatrick1001@gmail.com using “Training & Development Assistant – Abuja” as the subject of the email.\n\nNote: Apply as soon as possible. Shortlisting is ongoing.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Internal Audit Officer Job at Distritech Distribution",
    "link": "https://www.jobgurus.com.ng/jobs/view/internal-audit-officer-job-at-distritech-distribution",
    "pubDate": "Wed, 02 Jul 2025 18:49:36 GMT",
    "source": "JobGurus",
    "keyword": "distritech distribution",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Distritech Distribution has been in System Integration & Business Continuity since 1994. What Distritech envisages: The right mix of Products, services, People, infrastructure, and technical expertise Today, We have invested Millions of Naira in establishing core service and delivery infrastructure and developing a specialized Technology Consulting Team across Pan Nigeria for better services and reachability to our valued customers.\n\nWe are recruiting to fill the position below:\n\nJob Position: Internal Audit Officer\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDistritech Distribution Limited is seeking a diligent and detail-oriented Internal Audit Officer to join our team.\n\tAs an Internal Audit Officer, you will play a crucial role in evaluating the effectiveness of internal controls, risk management processes, and compliance with policies and procedures.\n\n\nResponsibilities\n\n\n\tConduct internal audits of the company's financial, operational, and administrative processes to assess compliance with established policies and procedures.\n\tDevelop risk-based audit plans and programs to address key areas of concern and ensure adequate coverage of internal controls.\n\tPerform audit tests and procedures to identify weaknesses, deficiencies, or irregularities in internal control systems and operational processes.\n\tDocument audit findings, observations, and recommendations in clear and concise audit reports.\n\tCommunicate audit results and recommendations to management and stakeholders, and collaborate with them to develop action plans to address identified issues.\n\tFollow up on the implementation of audit recommendations and verify that corrective actions have been effectively implemented.\n\tAssist in the development and maintenance of internal control frameworks, policies, and procedures to enhance the effectiveness of internal controls and risk management processes.\n\tStay updated on changes in laws, regulations, and industry standards relevant to internal audit practices, and ensure compliance with applicable requirements.\n\tConduct special investigations or ad-hoc reviews as directed by management to address specific concerns or incidents.\n\n\nRequirements\n\n\n\tBachelor's Degree in Accounting, Finance, Business Administration, or a related field.\n\tProven experience in internal auditing, preferably in a retail or e-commerce environment.\n\tKnowledge of auditing standards, principles, and practices, including risk assessment and control evaluation techniques.\n\tStrong analytical and problem-solving skills with attention to detail.\n\tExcellent communication and interpersonal skills, with the ability to effectively communicate audit findings and recommendations to management and stakeholders.\n\tAbility to work independently and collaboratively in a dynamic and fast-paced environment.\n\tProficiency in using audit tools and software applications for data analysis and documentation.\n\tProfessional certification such as Certified Internal Auditor (CIA), Certified Public Accountant (CPA), or Certified Information Systems Auditor (CISA) will be an advantage.\n\n\nAbility to Commute / Relocate:\n\n\n\tLagos: Reliably commute or planning to relocate before starting work (Required).\n\n\nSalary\nN100,000 / Month.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: retentionrecruitment01@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "HSE Coordinator Job at Nigeria Sinotruck Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/hse-coordinator-job-at-nigeria-sinotruck-limited",
    "pubDate": "Wed, 02 Jul 2025 18:49:36 GMT",
    "source": "JobGurus",
    "keyword": "nigeria sinotruck limited",
    "duplicate": false,
    "classifications": [],
    "content": "Nigeria Sinotruck Limited is a commercial automotive company that is interested in starting a vendor leasing desk.\n\nWe are recruiting to fill the position below:\n\nJob Position: HSE Coordinator\n\nJob Location: Sagamu, Ogun\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tProvides field HSE support and guidance throughout all activities.\n\tCompliance:\n\t\n\t\tEnsure compliance with local regulatory HSE requirements.\n\t\tEnsure compliance with contract HSE requirements.\n\t\n\t\n\tAssists in the development and delivery of Operational Processes safely.\n\tEnforces company policies and procedures.\n\tAssists teams to deliver an exemplary HSE performance.\n\tPerformance Measurement:\n\t\n\t\tIdentifies potential and actual areas of improvement and assists in setting and formulating goals and tools for their achievement;\n\t\tProvides input to leading and lagging HSE performance measures;\n\t\n\t\n\tLiaises with all stakeholders in order to be aware and educate the workforce on HSE news & updates.\n\tLessons Learnt: Provides input to the collection of Lessons Learnt for all activities;\n\tHazard Identification and Risk Assessment: Assists teams in identifying hazards, assessing risks, and identifying relevant controls to manage and reduce these risks to ALARP;\n\tFosters a safe culture by being informed, mindful, learning, fair and respectful.\n\tBehaviour Based Safety (BBS):\n\t\n\t\tOwns BBS tools and processes;\n\t\tPromotes and coaches the workforce in Behavioral Based Safety;\n\t\n\t\n\tAssurance:\n\t\n\t\tPerform audits to measure the level of safety culture;\n\t\tCarries out or facilitates safety audits and inspections as per audit plan;\n\t\tProvides HSE input to HSE Management System Reviews;\n\t\n\t\n\tIncident Management:\n\t\n\t\tEnsures Incidents are recorded & reported;\n\t\tPrepares initial incident reports;\n\t\tCarries out immediate Incident & Near Miss investigation;\n\t\tFacilitates & participates in High-Level Incident investigations;\n\t\n\t\n\tTraining & Coaching:\n\t\n\t\tEnsures that the company safety expectations are communicated to the workforce;\n\t\tProvides training sessions as per Training Plan & Competency development requirements;\n\t\tEducates workforce on Lessons Learnt from previous & industry incidents;\n\t\n\t\n\tContingency Management:\n\t\n\t\tProvide immediate response in emergency situations;\n\t\tReviews contingency drills to maintain and increase staff competency;\n\t\tTo assist in setting up an effective emergency response organization on site;\n\t\n\t\n\tTraining & Coaching: Coaches teams on HSE and conducts HSE engagement sessions with them;\n\tEnvironment:\n\t\n\t\tMeasures required environmental parameters;\n\t\tEnsures Waste Segregation is observed;\n\t\n\t\n\tWorking Environment: Carry out and follow up on workplace assessments;\n\tQuality Control: Monitor the quality of data entered in the reporting & action tracking tools;\n\tContractor Management: Manages contractor and consultants in all aspects of health and safety;\n\tDocument control.\n\n\nQualifications\n\n\n\tInterested candidates should possess a Bachelor’s Degree with 6 - 10 years of work experience.\n\tMaintains full awareness of all existing applicable legislative and assurance requirements.\n\n\nSoft Skills:\n\n\n\tDemonstrates Safety leadership.\n\n\nComputer Literacy:\n\n\n\tMicrosoft Office\n\tSAP, complimentary.\n\tAction Tracking Software.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: recruitment@sinotrucknigeria.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Office Manager Job at the Changeroom",
    "link": "https://www.jobgurus.com.ng/jobs/view/office-manager-job-at-the-changeroom",
    "pubDate": "Wed, 02 Jul 2025 18:49:36 GMT",
    "source": "JobGurus",
    "keyword": "the changeroom",
    "duplicate": false,
    "classifications": [],
    "content": "Changeroom was established in 2012 with a vision to produce quality human resource solutions. We plan to achieve this by partnering with our clients to provide highly specialized consulting services in the areas of human resources development and business management services. Our partnership approach affords us the opportunity of working with you to find the most efficient and appropriate solutions to meet your short, medium and long-term goals. In partnering with your organization, we make it our business to understand your business, embrace its values, aims and objectives.\n\nWe are recruiting to fill the position below:\n\nJob Position: Office Manager\n\nJob Location: Lagos\nEmployment Type: Full-time\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nResponsibilities\n\n\n\tOversee daily office operations to ensure efficiency and productivity.\n\tManage administrative processes and support company operations.\n\tLiaise with internal teams and external partners.\n\tMaintain records and ensure compliance with company policies.\n\n\nQualifications\n\n\n\tMinimum of a B.Sc. Degree in Insurance, Social Sciences, Accounting, or any related field.\n\tMinimum of 2 years of Experience (experience in an Insurance or Microfinance sector will be an added advantage)\n\tBetween ages 25 – 35 years.\n\tStrong organizational, communication, and administrative skills.\n\n\nMethod of Application\nInterested and qualified candidates should send their Application to: bola@changeroom.ng or info.changeroom@gmail.com using “Office Manager” as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]