[
  {
    "title": "Head of Procurement Job at FairMoney",
    "link": "https://www.jobgurus.com.ng/jobs/view/head-of-procurement-job-at-fairmoney",
    "pubDate": "Fri, 06 Jun 2025 16:20:04 GMT",
    "source": "JobGurus",
    "keyword": "fairmoney",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "FairMoney is building the leading mobile bank for emerging markets. We started with a digital microcredit application on Android, and currently roll out additional financial services (current account, savings, debit card) while expanding the product to Western Africa and South-East Asia.\n\nWe are recruiting to fill the position below:\n\nJob Position: Head of Procurement \n\nJob Location: Lagos\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Head of Procurement will be responsible for developing and implementing procurement strategies to optimize costs, ensure supplier quality, and drive operational efficiency.\n\tThis role involves overseeing all procurement activities, managing vendor relationships, ensuring compliance with regulatory requirements, and aligning procurement functions with the company's strategic objectives.\n\n\nKey Responsibilities\nStrategic Procurement Management:\n\n\n\tDevelop and implement procurement policies, procedures, and strategies to optimize spending and enhance operational efficiency.\n\tAlign procurement activities with FairMoney's financial and business objectives, ensuring cost savings and value creation.\n\tLead negotiations with suppliers to secure the best terms, pricing, and service levels.\n\tIdentify and mitigate procurement-related risks, including supplier reliability, regulatory compliance, and market fluctuations.\n\n\nVendor and Supplier Management:\n\n\n\tEstablish and manage strong relationships with key suppliers and vendors to ensure the timely and cost-effective delivery of goods and services.\n\tEvaluate and categorize suppliers based on strategic importance, quality, and risk exposure.\n\tImplement supplier performance management processes, including key performance indicators (KPIs) and regular assessments.\n\n\nOperational and Compliance Oversight:\n\n\n\tEnsure that procurement processes comply with internal policies, financial controls, and regulatory requirements.\n\tCollaborate with Finance and Legal teams to review and approve contracts, ensuring transparency and risk mitigation.\n\tDevelop and oversee procurement budgets and spending forecasts, ensuring cost-effective purchasing decisions.\n\n\nTeam Leadership and Development:\n\n\n\tBuild, train, and manage a high-performing procurement team, fostering a culture of efficiency and continuous improvement.\n\tProvide guidance and coaching to procurement staff, ensuring alignment with business priorities and best practices.\n\tPromote ethical procurement practices and adherence to corporate governance policies.\n\n\nTechnology and Process Optimization:\n\n\n\tLeverage procurement technology and automation tools to improve procurement efficiency and reporting.\n\tMonitor industry trends and emerging best practices to enhance FairMoney's procurement strategy.\n\tImplement and maintain supplier management and e-procurement systems for streamlined operations.\n\n\nRequirements\n\n\n\tBachelor's degree in Procurement, Supply Chain Management, Business Administration, Finance, or a related field.\n\tMinimum of 5 years of experience in procurement\n\tProfessional certification (e.g., CIPS, CPSM, PMP) is a strong advantage.\n\tExperience in the financial services or banking sector is preferred.\n\tStrong knowledge of procurement best practices, contract negotiation, and supplier management.\n\tProficiency in procurement software and ERP systems (NetSuite experience is a plus).\n\tExcellent leadership, negotiation, and stakeholder management skills.\n\n\nKey Competencies:\n\n\n\tCost management and budgeting\n\tRisk assessment and mitigation\n\tRelationship management and negotiation skills\n\tRegulatory compliance and governance\n\tStrong analytical and problem-solving abilities.\n\n\nBenefits\n\n\n\tPrivate Health Insurance\n\tPension Plan\n\tTraining & Development\n\tHybrid work\n\tPaid Time Off.\n\n\nRecruitment Process\n\n\n\tA screening interview with one of the members of the Talent Acquisition team\n\tTechnical Interview with the Chief Financial Officer.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Marketing Executive Job at LMV Nigeria",
    "link": "https://www.jobgurus.com.ng/jobs/view/marketing-executive-job-at-lmv-nigeria",
    "pubDate": "Fri, 06 Jun 2025 16:20:04 GMT",
    "source": "JobGurus",
    "keyword": "lmv nigeria",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "LMV Nigeria is a dynamic, multi-sector company dedicated to building sustainable infrastructures, providing energy solutions, and enhancing healthcare services.\n\nWe are recruiting to fill the position below:\n\nJob Position: Marketing Executive\n\nJob Locations: Lugbe - Abuja (FCT), Ughelli and Asaba - Delta\n\nResponsibilities\n\n\n\tDevelop, execute, and manage marketing strategies to promote a company's products or services.\n\n\nRequirements\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tA Degree in Marketing, Business Administration, Communications, or a related field.\n\tExcellent written and verbal communication, including strong presentation skills and the ability to effectively communicate with both internal and external stakeholders.\n\tAbility to analyze market data, track campaign performance, and identify trends.\n\tMust have a team spirit.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and cover letter to: lixpharmacy@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Relationship Manager Job at FairMoney",
    "link": "https://www.jobgurus.com.ng/jobs/view/relationship-manager-job-at-fairmoney-2",
    "pubDate": "Fri, 06 Jun 2025 16:20:04 GMT",
    "source": "JobGurus",
    "keyword": "fairmoney",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "FairMoney is building the leading mobile bank for emerging markets. We started with a digital microcredit application on Android, and currently roll out additional financial services (current account, savings, debit card) while expanding the product to Western Africa and South-East Asia.\n\nWe are recruiting to fill the position below:\n\nJob Position: Relationship Manager\n\nJob Location: Nigeria\n\nRoles and Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tS/he will be responsible for driving the business of Merchant acquiring in the different merchant sectors (Supermarket, Pharmacies, Filling Stations, Eateries & Restaurants, Lounge and Bar and Hotels), within the Region, and developing; deploring strategies to increase sales revenue\n\tDeveloping plans and strategic initiatives for growing the Merchant Acquisition business and achieving the companys sales goals;\n\tHit target quotas for set KPIs for the Region(Transaction value, volume, and revenue)\n\tMonitoring market trends and providing regular competitor feedback to the Merchant Acquisition Manager\n\tManaging and leading the Merchant acquisition team within the Region, to deliver profitable growth\n\tDaily, Weekly, and Monthly monitoring of the KPI of the Merchant team within the assigned Region, ensuring all targets are met and exceeded consistently\n\tDrive the KAMs to ensure they hit all KPIs for the individual teams\n\tHave a good understanding of the business's products or services and be able to advise others about them\n\tFollow up with Merchants and ensure active and inactive merchants are visited and if need be, mobilize retrieval of POS from inactive business partners within the region\n\n\nRequirements\n\n\n\tBachelor's Degree in Sales and Marketing or related fields\n\t6 to 8 years of experience in the Merchant business\n\tMust have an Android phone\n\tProven experience managing a high-performance sales team\n\tAbility to motivate a team of Sales Managers for performance\n\tExtremely flexible, result-oriented, and hardworking with a strong track record of success\n\tAbility to self-motivate and manage self\n\tGood communication and interpersonal skills\n\tCustomer orientation and ability to adapt/respond to different characters,\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]