[
  {
    "title": "Senior .NET Developer Job at Tek Experts",
    "link": "https://www.jobgurus.com.ng/jobs/view/senior-net-developer-job-at-tek-experts",
    "pubDate": "Wed, 04 Jun 2025 14:13:17 GMT",
    "source": "JobGurus",
    "keyword": "tek experts",
    "duplicate": false,
    "classifications": [
      "Software Engineering",
      "Finance"
    ],
    "content": "Tek Experts provides the services of a uniquely passionate and expert workforce that takes intense pride in helping companies manage their business operations. We care about the work we do, the companies we partner with and the customers they serve.\n\nWe are recruiting to fill the position below:\n\nJob Position: Senior .NET Developer\n\nJob ID: 2025-16479\nJob Location: Victoria Island, Lagos\nJob Type: Full-time\nCategory: Information Technology\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDevelop IT software solutions including APIs and microservices\n\tParticipate in and support the Agile framework roles of planning, programming, testing, and analysis\n\tProvide ongoing level 2 support for IT software solutions\n\tParticipate in technical workshops and learning sessions with IT support stakeholders to ensure the continued stability and availability of developed software solutions\n\tDefine and implement detailed specifications in line with business requirements as informed by company and client needs\n\tTroubleshoot obstacles and errors quickly and effectively in a scalable fashion\n\tActively seek out and implement improvements to process and development practices\n\tFulfill additional tasks as required by direct management\n\n\nQualifications\n\n\n\tBachelor’s Degree in Computer Science, Engineering, or another related field\n\tAt least 4 years of direct programming experience\n\tMust have completed the compulsory 1-year NYSC or have an exemption certificate\n\tDeep understanding of the software development lifecycle\n\tStrong analytical and problem-solving skills\n\tExcellent organizational skills as well as an ability to manage, prioritize, and execute multiple projects simultaneously and to a deadline\n\tProven success as a .NET developer\n\tComprehensive understanding of the ASP.NET framework, SQL server, and design/architectural patterns (e.g., CLEAN Architecture) and grasp of different architecture styles/APIs including REST and RPC\n\tExperience in the finance or fintech sector is a plus\n\tExcellent communication skills and impeccable attention to detail\n\tProfessional fluency in English is vital, both written and spoken.\n\n\nWhy You’ll Enjoy It Here\n\n\n\tBe Part of Something Big – A growing company where your contributions matter.\n\tMake an Immediate Impact – Support groundbreaking technologies with real-world results.\n\tWork on Cutting-Edge Tech – AI, cybersecurity, and next-gen digital solutions.\n\tThrive in an Inclusive Team – A culture built on trust, collaboration, and respect.\n\tWe Care – Integrity, empathy, and purpose guide every decision.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Network Engineer Job at Presto integrated Solutions",
    "link": "https://www.jobgurus.com.ng/jobs/view/network-engineer-job-at-presto-integrated-solutions",
    "pubDate": "Wed, 04 Jun 2025 14:13:17 GMT",
    "source": "JobGurus",
    "keyword": "presto integrated solutions",
    "duplicate": false,
    "classifications": [],
    "content": "Presto integrated Solutions is an information technology development company reputed for its service excellence in contemporary design and implementation of IT based solutions for our everyday needs; from the public/government setting, educational institutions, academic terrains, NGOs, corporate entities, right down to individuals.\n\nWe are recruiting to fill the position below:\n\nJob Position: Network Engineer\nJob Location: Ibadan, Oyo\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a talented and experienced Network Engineer with a strong background in MikroTik equipment to join our team.\n\tAs a Network Engineer, you will be responsible for designing, implementing, and maintaining network infrastructures that utilize MikroTik devices.\n\tYour expertise in MikroTik equipment will be crucial in ensuring the efficient and secure operation of our clients' networks\n\n\nResponsibilities\n\n\n\tDesign, configure, and deploy network solutions using MikroTik routers, switches, and wireless devices.\n\tInstall and maintain MikroTik RouterOS and related software on network devices.\n\tConduct network assessments and provide recommendations for network optimizations and improvements.\n\tStay up-to-date with the latest trends and advancements in MikroTik technologies, and assess their suitability for implementation within our clients' networks.\n\tProvide technical expertise and guidance to clients and internal teams regarding MikroTik equipment and network configurations.\n\tTroubleshoot and resolve networking and connectivity issues related to MikroTik devices.\n\tMonitor network performance and proactively identify potential bottlenecks or vulnerabilities.\n\tCollaborate with cross-functional teams, such as software developers and system administrators, to ensure seamless integration of MikroTik equipment within larger network infrastructures.\n\tDocument network designs, configurations, and troubleshooting procedures for future reference.\n\n\nRequirements\n\n\n\tBachelor's degree in Computer Science, Information Technology, or a related field (or equivalent work experience).\n\tProven experience as a Network Engineer, specifically working with MikroTik equipment.\n\tIn-depth knowledge of MikroTik RouterOS and associated networking protocols (e.g., OSPF, BGP, VLANs).\n\tStrong understanding of network security principles and best practices pertaining to MikroTik devices.\n\tExperience in designing and implementing complex network infrastructure projects.\n\tExcellent problem-solving and troubleshooting skills.\n\tStrong communication and interpersonal skills to effectively collaborate with clients and internal teams.\n\tIndustry certifications, such as MikroTik Certified Network Associate (MTCNA) or MikroTik Certified Routing Engineer (MTCRE), are highly desirable.\n\tFamiliarity with other networking technologies and equipment (Cisco, Juniper, etc.) is a plus.\n\tIf you are a skilled Network Engineer with expertise in MikroTik equipment and are passionate about building robust and secure network infrastructures, we would love to hear from you. Join our dynamic team and contribute to delivering exceptional network solutions to our valued clients.\n\n\nSalary\nN90,000 - N100,000 per month. \n\nMethod of Application\nInterested and qualified candidates should send their CV and Cover Letter to: prestonigeria@gmail.com using the Job Position as the subject of the mail.\n\nNote: For more enquires, text; 07051336668.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Administrative Officer Job at Chelis Bookazine Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/administrative-officer-job-at-chelis-bookazine-limited-1",
    "pubDate": "Wed, 04 Jun 2025 14:13:17 GMT",
    "source": "JobGurus",
    "keyword": "chelis bookazine limited",
    "duplicate": false,
    "classifications": [],
    "content": "Chelis Bookazine Limited is Nigeria’s leading educational supplier, supplying top quality international educational books, resources and services to Nigeria’s education industry. Chelis has completely revolutionized the school supply industry in Nigeria because of the passion, creativity, total commitment and dedication we bring into our business to achieve our vision of contributing significantly to the provision of top quality, world class education in Nigeria.\n\nWe are recruiting to fill the position below:\n\nJob Position: Administrative Officer \n\nJob Location: Lekki, Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tYour role will encompass managing administrative tasks, handling financial transactions, and ensuring regulatory compliance.\n\n\nRequirements\n\n\n\tB.Sc. Degree / HND in Accounting, Business Administration, or a related field\n\tMinimum of 2 years of post NYSC work experience in administrative and accounting roles\n\tProficiency in accounting software and Microsoft Office suite\n\tAbility to work independently and collaboratively in a fast-paced environment\n\tDriving skill with a valid driving license\n\tStrong attention to detail and accuracy in financial data management\n\tExcellent organizational and multitasking abilities\n\tClose proximity or within reasonable commuting distance to Lekki phase 1 Admiralty Road is a plus\n\tThe position entails working two Saturdays per month.\n\n\nSalary\nN110,000 - N130,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their application and detailed CV to: chelisrecruitment@gmail.com using \"Admin Officer - Lekki\" as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "IT Officer Job at Interrand Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/it-officer-job-at-interrand-group",
    "pubDate": "Wed, 04 Jun 2025 14:13:17 GMT",
    "source": "JobGurus",
    "keyword": "interrand group",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Interrand Group is a group of companies registered and incorporated with the Corporate Affairs Commission with over the years’ experience in the fields of Construction, Engineering, Real Estate Development, Infrastructure, Property management / Consultancy and Facilities management. Interrand Engineering Ltd and Interrand Homes and Properties Ltd are the key players in the development of a large well well-balanced property portfolio ranging from residential, commercial and mixed-use properties across Nigeria. Our primary aim is to provide affordable luxury homes to our numerous valued and esteemed clients in Nigeria and the diaspora by acquiring genuine and suitable lands, designing and building functional and livable houses.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: IT Officer\n\nJob Location: Gudu, Abuja (FCT)\nEmployment Type: Full-time\n\njob Summary\n\n\n\tWe are seeking a proactive and skilled IT Officer to join our team. The successful candidate will be responsible for managing and maintaining the organization's IT infrastructure, providing technical support, and ensuring the smooth operation of all computer systems and networks.\n\n\nResponsibilities\n\n\n\tInstall, configure, and maintain hardware, software, and network systems.\n\tProvide technical support to staff on IT-related issues (onsite and remote).\n\tEnsure data backup, recovery, and security measures are in place.\n\tTroubleshoot and resolve system and network problems efficiently.\n\tMonitor system performance and maintain IT documentation.\n\tCoordinate with vendors for procurement and maintenance of IT assets.\n\tEnsure all systems and software are up-to-date with the latest patches and updates.\n\tSupport in setting up workstations, email accounts, and user access control.\n\tSupport the marketing team with digital tools such as websites, email systems, and cloud storage.\n\tMaintain hardware (computers, printers, routers) and ensure smooth functioning of all systems.\n\tManage and troubleshoot real estate software platforms, listing tools, and CRM systems.\n\tEnsure cybersecurity protocols are followed to protect company data and client information.\n\tPerform regular data backups and disaster recovery processes.\n\tOversee internet connectivity and troubleshoot network issues.\n\tLiaise with external IT vendors for maintenance, upgrades, and purchases.\n\n\nRequirements\n\n\n\tDiploma or Bachelor’s Degree in Computer Science, Information Technology, or a related field.\n\tMinimum 2 years of experience in IT support or network administration.\n\tStrong understanding of Windows OS, networking, and cloud-based tools (e.g., Microsoft 365, Google Workspace).\n\tExperience with real estate CRMs, listing portals, or ERP software is a strong advantage.\n\tKnowledge of basic website maintenance and digital marketing tools is a plus.\n\tStrong troubleshooting, communication, and interpersonal skills.\n\tStrong knowledge of Windows and/or Linux operating systems, networking, and troubleshooting.\n\tFamiliarity with firewalls, antivirus, and cybersecurity practices.\n\tExcellent communication and problem-solving skills.\n\n\nPreferred Certifications:\n\n\n\tCompTIA A+ / Network+\n\tMicrosoft Certified: Modern Desktop Administrator or similar\n\tBasic knowledge of digital security tools.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and Cover Letter to: hr@interrandgroup.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Cashier Job at Tivana Workforce",
    "link": "https://www.jobgurus.com.ng/jobs/view/cashier-job-at-tivana-workforce",
    "pubDate": "Wed, 04 Jun 2025 14:13:17 GMT",
    "source": "JobGurus",
    "keyword": "tivana workforce",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Tivana Workforce is a workforce solutions company that provides services that unlock the full potential of human capital to drive business excellence and growth in an ever-evolving marketplace. Our Services include Staffing and Recruitment, Workforce Management, Training and Development, Technology Solutions, HR Consulting, Team Retreat Planning and Specialized services.\n\nWe are recruiting to fill the position below:\n\nJob Position: Cashier\nJob Location: Abuja (FCT)\nEmployment Type: Full-time\n\nRequirements\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tCandidates should possess relevant qualifications in a related field.\n\tAt least 2 years of experience in a similar role.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and Photograph to: tivanaworkforce@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]