[
  {
    "title": "Secretary Job at Amy Consulting",
    "link": "https://www.jobgurus.com.ng/jobs/view/secretary-job-at-amy-consulting-1",
    "pubDate": "Mon, 23 Jun 2025 19:12:38 GMT",
    "source": "JobGurus",
    "keyword": "amy consulting",
    "duplicate": false,
    "classifications": [],
    "content": "Amy Consulting - Our client, a law firm located in Ikeja, Lagos, is recruiting to fill the position below:\n\nJob Position: Secretary\n\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\n\nSummary\n\n\n\tOur client is currently looking for a legal secretary to join their busy team.\n\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tPreparing court statements and forms\n\tDictating Lawyers’ audio files and written notes\n\tCollecting and delivering documents\n\tManaging records, projects and calendars to make sure everything functions smoothly\n\tTranscribing and proofreading legal documents\n\tIndexing and updating pleadings and discovery binders\n\tManaging diaries and making travel arrangements for one or more Lawyers\n\tSupporting legal research and communicating with vendors, experts, Lawyers, opposing counsel and other staff.\n\n\nKey Requirements\n\n\n\tInterested candidates should possess a Bachelor's Degree\n\tMinimum of 5 years of previous experience in a similar role.\n\n\nMethod of Application\nInterested and qualified candidates should send their most up-to-date résumé to: recruitment@amyconsulting.com.ng using \"Secretary\" as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Restaurant Supervisor Job at Greystone Consulting Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/restaurant-supervisor-job-at-greystone-consulting-limited",
    "pubDate": "Mon, 23 Jun 2025 19:12:38 GMT",
    "source": "JobGurus",
    "keyword": "greystone consulting limited",
    "duplicate": false,
    "classifications": [],
    "content": "Greystone Consulting Limited - Our client, a fast growing restaurant looking at expanding their team is recruiting to fill the position below:\n\nJob Position: Restaurant Supervisor\n\nJob Location: Ejigbo, Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a dedicated and experienced Restaurant Supervisor to oversee daily operations and ensure exceptional customer service in our establishment. The ideal candidate will be responsible for managing staff, maintaining quality standards, and ensuring a smooth and efficient workflow throughout the restaurant.\n\tKey responsibilities include supervising front-of-house operations, assisting with staff training and scheduling, handling customer inquiries and complaints, monitoring inventory, and supporting the management team in achieving operational goals.\n\tThe Restaurant Supervisor plays a vital role in creating a welcoming dining experience and maintaining a positive and productive team environment.\n\n\nKey Responsibilities\n\n\n\tSupervise and coordinate the activities of restaurant staff to ensure high-quality service.\n\tSupport the hiring, training, and development of team members.\n\tEnsure compliance with health, safety, and hygiene standards.\n\tHandle customer concerns and provide effective resolutions.\n\tMonitor staff performance and provide feedback to improve efficiency and service.\n\n\nQualifications\n\n\n\tCandidates should possess an HND / B.Sc Degree\n\t2 years of experience as a Restaurant Supervisor.\n\tStrong leadership, communication, and interpersonal skills.\n\tAbility to multitask and work efficiently under pressure.\n\tKnowledge of restaurant operations, POS systems, and food safety regulations.\n\tHigh school diploma or equivalent; additional hospitality or management training is a plus.\n\n\nPreferred Skills:\n\n\n\tTime Management\n\tAttention to Detail\n\tKnowledge of Food Safety & Hygiene\n\n\nMethod of Application\nInterested and qualified candidates can send their CV to: Consultgreystone@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Warehouse / Inventory Officer Job at Kennedia Consulting Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/warehouse-inventory-officer-job-at-kennedia-consulting-limited",
    "pubDate": "Mon, 23 Jun 2025 19:12:38 GMT",
    "source": "JobGurus",
    "keyword": "kennedia consulting limited",
    "duplicate": false,
    "classifications": [],
    "content": "Kennedia Consulting Limited - Our client in the Telecom sector is recruiting suitable candidates to fill the position below:\n\nJob Position: Warehouse / Inventory Officer\n\nJob Location: Lekki-Epe Express Way, Lagos.\nEmployment Type: Full Time,Contract based for 2 Months(Onsite)\n\nRequirements\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tExperience in warehouse or inventory management\n\tBasic knowledge/understanding of asset identification and classification using technical specifications, model numbers, and serial numbers\n\tProficiency in capturing data through QR/barcode scanning using a mobile device\n\tMust have proficiency in Excel.\n\n\nMethod of Application\nInterested and Qualified candidates should send their CV to: careers@kennediaconsulting.net using \"Warehouse / Inventory Officer\" as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "IT Manager Job at African Natural Resources & Mines Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/it-manager-job-at-african-natural-resources-mines-limited",
    "pubDate": "Mon, 23 Jun 2025 19:12:38 GMT",
    "source": "JobGurus",
    "keyword": "african natural resources & mines limited",
    "duplicate": false,
    "classifications": [],
    "content": "African Natural Resources and Mines Limited (ANRML), established by African Industries Group, operates a fully integrated iron ore mining and processing plant in Gujeni village, Kagarko LGA, Kaduna state—the first of its kind in Nigeria.\n\nWe are recruiting to fill the position below:\n\nJob Position: IT Manager\n\nJob Location: Kaduna\nEmployment Type: Full-time\n\nResponsibilities\nNetwork Design and Implementation:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tPlan, configure, and deploy network systems, including routers, switches, and wireless access points.\n\tDesign network layouts that meet organizational needs and scalability requirements.\n\n\nNetwork Management:\n\n\n\tMonitor network performance and availability to ensure optimal operation and minimal downtime.\n\tPerform regular network maintenance, including hardware and software updates, to ensure reliability and security.\n\n\nSystem Management:\n\n\n\tManage and configure applications/infrastructure including AD domain management, user/group/account management, Group Policy Objects, DHCP, WSUS, DNS, and IIS.\n\tHarden laptops/desktops through deployment of AD policies.\n\tTechnical knowledge of RAID configuration, NTFS permissions, software/service pack installation, Roles and Features wizards, etc.\n\tManage and monitor Veeam backup and set backup policies.\n\tManage McAfee Antivirus tools, especially McAfee ePO; update virus definitions/signatures, set policies, and manage DLP configuration.\n\tManage patch deployment via WSUS and manual methods when necessary.\n\tEnsure overall security and health of infrastructure following established guidelines and best practices.\n\tCommunicate with vendors and the purchasing team for IT material quotations as required.\n\tStay updated on the latest threats and vulnerabilities by reviewing known and zero-day issues and fixes.\n\n\nTroubleshooting and Support:\n\n\n\tDiagnose and resolve network issues including connectivity, performance, and security problems.\n\tProvide technical support and troubleshooting for network-related user issues.\n\n\nDocumentation and Reporting:\n\n\n\tMaintain detailed documentation of network configurations, changes, and procedures.\n\tPrepare and present reports on network performance, incidents, and improvements.\n\n\nCollaboration and Coordination:\n\n\n\tWork closely with IT staff to ensure network solutions integrate smoothly with other IT systems and services.\n\n\nCompliance and Best Practices:\n\n\n\tEnsure network operations comply with organizational policies, industry standards, and regulatory requirements.\n\tStay updated on the latest network technologies and best practices to continuously improve network performance and security.\n\n\nRequirements\n\n\n\tStrong English communication skills.\n\tMinimum of 10 years of experience.\n\tExperience in the manufacturing industry.\n\tProven hands-on end-user support experience, including troubleshooting and resolving network issues on-site.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: george.mathew@anrml.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Procurement Manager (Raw Materials) Job at Cormart Nigeria Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/procurement-manager-raw-materials-job-at-cormart-nigeria-limited",
    "pubDate": "Mon, 23 Jun 2025 19:12:38 GMT",
    "source": "JobGurus",
    "keyword": "cormart nigeria limited",
    "duplicate": false,
    "classifications": [],
    "content": "Cormart Nigeria Limited is one of the leading chemical and food raw materials companies in Nigeria. Since its inception in 1980, it has been on the forefront of production, importation, stocking and distribution of chemicals and other raw materials. We provide premium products and services across the paint, confectionaries, cosmetics, pharmaceutical, food and beverage industries. With cutting edge and cost effective products and solutions, Cormart represents the business interests of top multinational companies who wish to do business in Nigeria. Cormart is committed to the continuous increase of local production and expansion of its products range.\n\nWe are recruiting to fill the position below:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Position: Procurement Manager (Raw Materials)\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nDuties & Responsibilities\nSourcing and Purchasing:\n\n\n\tExecute assigned procurement activities in line with the company’s purchasing policies, operational requirements and in alignment with the head of department guidance and strategy.\n\tSource and compare suppliersindustrial chemical , food grade chemical , pharmaceutical Chemicals and food raw materialsin line with product specifications, safety requirements,operational needs.\n\tObtain and evaluate quotations, perform supplier assessments, and recommend vendors based on price, quality, and delivery capabilities.\n\tRaise purchase orders and follow through with vendors to ensure timely and accurate delivery of goods.\n\n\nVendor and Supplier Engagement:\n\n\n\tLiaise with approved vendors and develop tactical relationships to support quality, delivery, and pricing expectations.\n\tTrack and document vendor performance to support periodic evaluation and improvement initiatives.\n\tAssist in vendor negotiations as delegated by the Head of Procurement.\n\n\nInventory and Supply Coordination:\n\n\n\tCollaborate with the production team to ensure sufficient raw material availability without overstocking.\n\tSupport the monitoring of procurement lead times and delivery schedules to prevent stockouts and delays.\n\n\nRegulatory Compliance & Documentation:\n\n\n\tEnsure that all sourced food, pharmaceutical, industrial chemicals and Food raw materials comply with relevant regulatory, safety, and quality standards (e.g., NAFDAC, SON, HACCP)\n\n\nAdministrative Support and Documentation:\n\n\n\tMaintain accurate and organized procurement records including supplier contracts, specifications, safety data sheets (SDS), and purchase documentation.\n\tMaintain accurate records of supplier contracts, delivery notes, purchase orders, and other procurement documentation.\n\tProvide timely procurement status updates to the Head of Procurement and relevant stakeholders.\n\n\nMarket Research and Analysis:\n\n\n\tMonitor price trends, material availability, and supply market dynamics for industrial and food chemicals\n\tEscalate to relevant stakeholders, critical market changes or supply chain issues that may impact production or delivery schedules.\n\n\nRequirements\n\n\n\tEducation: Bachelor’s Degree (B.Sc.) in Chemistry or any related discipline.\n\tExperience: 5 - 7 years of relevant experience inindustrial chemical, Food grade chemical , pharmaceutical Chemicals , and food raw materials manufacturing or distribution environment.\n\n\nIndustry Knowledge:\n\n\n\tUnderstanding of chemical material specifications, handling, and storage protocols.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: career.cormart@clicktgi.net using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]