[
  {
    "title": "Administrative Assistant Job at Elizabeth Maddeux",
    "link": "https://www.jobgurus.com.ng/jobs/view/administrative-assistant-job-at-elizabeth-maddeux",
    "pubDate": "Thu, 05 Jun 2025 14:15:55 GMT",
    "source": "JobGurus",
    "keyword": "elizabeth maddeux",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Elizabeth Maddeux provides a range of human resources solutions designed to empower your workforce, enhance technical proficiency, refine soft skills, and accelerateorganizational growth for better impacts by enhancing organizational dynamics through a well-rounded and robust human resource intervention.\n\nWe are recruiting to fill the position below:\n\nJob Position: Administrative Assistant\n\nJob Location: Lagos (Hybrid)\nEmployment Type: Full-time\n\nRole Overview\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a reliable and resourceful Administrative Assistant to support the day-to-day operational and logistical needs of our office.\n\tThis role is especially focused on managing tools, equipment, vendor coordination, office supplies, and general facility upkeep. \n\tThe ideal candidate will be proactive, organized, and capable of managing multiple administrative functions that ensure a well-run and efficient work environment.\n\n\nKey Responsibilities\n\n\n\tMaintain and monitor all office tools and equipment, ensuring they are properly assigned, functional, and well-maintained, including coordinating servicing or repairs when needed.\n\tTrack the usage, location, and condition of assets such as laptops, printers, projectors, and communication tools, updating logs and asset registers accordingly.\n\tOversee inventory of office supplies and consumables, conduct regular stock checks, forecast needs, and initiate timely reordering to avoid shortages or overstocking.\n\tServe as the primary point of contact for all vendors and service providers including equipment suppliers, courier services, utility companies, janitorial teams, and maintenance contractors.\n\tSupport facility management by ensuring that the workplace remains clean, safe, and well-organized at all times, including monitoring cleanliness of shared spaces, and following up on repairs or safety concerns.\n\tMaintain accurate and up-to-date records of vendor agreements, service level terms, contract expiration dates, and payment schedules, and alert management when renewals or reviews are due.\n\tHandle procurement processes by sourcing vendors, obtaining quotations, negotiating prices, raising purchase orders, and following up on deliveries and invoices.\n\tCoordinate and schedule routine servicing or maintenance for office equipment and infrastructure (e.g., air conditioning, lighting, plumbing) and ensure minimal disruption to office operations.\n\tAssist with workstation setups, internal office moves, equipment tagging, and ensuring new hires have the necessary tools and supplies upon arrival.\n\tParticipate in emergency readiness, safety compliance, and basic first-aid or equipment safety initiatives within the office, ensuring supplies like fire extinguishers or first-aid kits are regularly checked and restocked.\n\tProvide general administrative support as needed, including filing, documentation, supporting audits, handling minor office errands, and assisting in the preparation of reports or presentations related to office operations.\n\tMaintain a responsive and professional relationship with all internal teams and external partners to ensure smooth and uninterrupted business support functions.\n\n\nRequirements\n\n\n\tHND or B.Sc Degree in Administration, Secretarial Studies, or a related field.\n\tMinimum 2 years of relevant experience in administrative support, office coordination, or facilities operations.\n\tStrong organizational skills and the ability to manage multiple priorities effectively.\n\tProficiency in Microsoft Office (Word, Excel, Outlook); familiarity with inventory or asset tracking systems is a plus.\n\tGood understanding of office tools, basic troubleshooting, and the ability to follow up on technical or maintenance issues.\n\tStrong communication and interpersonal skills, especially in vendor negotiation and service coordination.\n\tAbility to work independently, exercise good judgment, and demonstrate a proactive approach to problem-solving.\n\n\nSalary\nN150,000 / Month\n\nMethod of Application\nInterested and qualified candidates should send their CV and Cover Letter to: careers@elizabethmaddeux.com using \"Administrative Assistant\" as the subject of the email.\n\nNote: Only qualified candidates will be contacted.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Business Development Manager Job at Elizabeth Maddeux Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/business-development-manager-job-at-elizabeth-maddeux-limited",
    "pubDate": "Thu, 05 Jun 2025 14:15:55 GMT",
    "source": "JobGurus",
    "keyword": "elizabeth maddeux limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Elizabeth Maddeux Limited - Our client is an emerging leader in the manufacturing and distribution of next-generation construction chemicals and solutions. The company offers a comprehensive range of high-quality products, expert technical support, and exceptional customer service. With its innovative approach, they are setting new standards in the construction industry.\n\nWe are recruiting to fill the position below:\n\nJob Position: Business Development Manager\n\nJob Location: Lagos\nEmployment Type: Full-time\nDepartment: Sales\nJob Mode: Onsite\nReports To: Senior Sales Manager Industry: Construction/ Manufacturing\n\nRole Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Business Development Manager will be responsible for developing growth strategies and plans to expand the reach of the company’s products and services. \n\tHe or She must have good knowledge of the construction industry, sales and marketing skills, good communication skills, business development and strategic thinking.\n\n\nKey Responsibilities\n\n\n\tDevelop growth strategies and plans\n\tManage and retain relationships with key/existing clients\n\tIncrease client base\n\tHave in-depth knowledge of products and value propositions\n\tNegotiate with stakeholders\n\tDrafting and reviewing contracts\n\tIdentify and map business strength and customer needs\n\tResearch business opportunities and viable income streams\n\tFollow industry trends locally and internationally\n\tEnsure that sales qualified leads (SQLs) are converting to opportunities and supporting sales pipeline growth\n\tIdentify opportunities for improvement across sales operations and make recommendations to executive leadership for streamlining processes.\n\n\nRequirements\n\n\n\tFirst Degree in Business Admin, Marketing, Civil /Chemical Engineering, Architecture, Chemistry.\n\t5 - 10 years of relevant work experience selling construction products or services\n\tProven experience in sales or relevant role.\n\tAbility to manage and lead a team effectively\n\tExcellent knowledge of MS Office.\n\tThorough understanding of marketing and negotiating techniques.\n\tFast learner and passion for sales.\n\tGood knowledge of the construction industry\n\tSelf-motivated with a results-driven approach.\n\tAptitude in delivering attractive presentations with good communication skills\n\tAbility to drive and must be ready for extensive travel\n\tExcellent Reporting.\n\n\nCore Competencies:\n\n\n\tGood understanding of the construction industry\n\tLeadership and management\n\tStakeholder relationship management\n\tA can-do attitude\n\n\nCompensation Package\n\n\n\tSalary: #400,000 net\n\tHealth Insurance\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and Cover Letter to: careers@elizabethmaddeux.com using \"BDM Construction” as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Automation Manager Job at CashXpress Nigeria Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/automation-manager-job-at-cashxpress-nigeria-limited",
    "pubDate": "Thu, 05 Jun 2025 14:15:55 GMT",
    "source": "JobGurus",
    "keyword": "cashxpress nigeria limited",
    "duplicate": false,
    "classifications": [
      "Software Engineering"
    ],
    "content": "CashXpress Nigeria Limited, a fast paced fintech organization in Lagos, Nigeria, is recruiting to fill the position below:\n\nJob Position: Automation Manager\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAre you passionate about streamlining systems, building smarter workflows, and leading innovation through automation? We are looking for an Automation Manager to take the wheel and drive efficiency across our operations!\n\tAs our Automation Manager, you will play a key role in identifying manual processes, designing automated solutions, and leading cross-functional implementation that powers productivity and scales impact.\n\n\nRequirements\n\n\n\tBachelor's degree in Engineering or a related field\n\tMust have served\n\tProven experience in automation and process improvement\n\tExcellent analytical skills\n\tA proactive, solution-driven mindset.\n\n\nKey skills needed:\n\n\n\tProgramming/Scripting Languages\n\tPython, JavaScript, PowerShell, or Bash for custom scripts and automation tasks.\n\tRPA Tools (Robotic Process Automation)\n\tUiPath, Blue Prism, Automation Anywhere, Microsoft Power Automate.\n\tAPI Integration\n\tUnderstanding of REST/SOAP APIs for system communication.\n\tDatabase Management\n\tSQL knowledge for querying and automating data manipulation.\n\tWorkflow Design\n\tTools like BPMN (Business Process Model and Notation) or software like Camunda or Bizagi.\n\tCloud Services\n\tFamiliarity with platforms like AWS, Azure, or Google Cloud for cloud-based automation.\n\n\nWhy You Should Join Us\n\n\n\tBe part of a forward-thinking, innovation-driven company\n\tWork with a dynamic, collaborative team\n\tOpportunities to be part of impactful projects and grow your career\n\tCompetitive salary and benefits package.\n\n\nMethod of Application\nIntersted and qualifed candidates should send their Resume and Cover Letter to: hr@cashx.ng using “Automation Manager” as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Human Resources Manager Job at CashXpress Nigeria Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/human-resources-manager-job-at-cashxpress-nigeria-limited",
    "pubDate": "Thu, 05 Jun 2025 14:15:55 GMT",
    "source": "JobGurus",
    "keyword": "cashxpress nigeria limited",
    "duplicate": false,
    "classifications": [],
    "content": "CashXpress Nigeria Limited, a fast paced fintech organization in Lagos, Nigeria, is recruiting to fill the position below:\n\nJob Position: Human Resources Manager\nJob Location: Lagos\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are hiring a passionate and experienced HR Manager to lead and support our growing team!\n\tAs our HR Manager, you’ll play a critical role in shaping our workplace culture, overseeing core HR operations, and ensuring our people practices align with business goals.\n\tFrom talent acquisition and onboarding to performance management and employee engagement, your expertise will help drive a productive and positive work environment.\n\n\nKey Responsibilities\n\n\n\tOversee day-to-day HR operations and ensure compliance with labor laws and internal policies.\n\tLead recruitment, onboarding, and orientation processes.\n\tDrive performance management, employee engagement, and training initiatives.\n\tMaintain accurate employee records and HR documentation.\n\tManage employee relations, disciplinary procedures, and conflict resolution.\n\tDevelop and implement HR strategies, policies, and best practices.\n\tSupport leadership with workforce planning and organizational development.\n\n\nRequirements\n\n\n\tBachelor’s degree in Human Resources, Business Administration, or related field (CIPM certification is an advantage).\n\tProven experience (5+ years) in an HR leadership role.\n\tStrong understanding of labor laws, HR policies, and best practices.\n\tExcellent interpersonal and communication skills.\n\tHigh emotional intelligence, integrity, and discretion.\n\tProficiency in HR software/tools (e.g., Zoho People etc.).\n\tClose proximity to Oshodi and Mile 2 is an advantage.\n\n\nMethod of Application\nIntersted and qualifed candidates should send their CV and a short Cover Letter to: hr@cashx.ng using “HR Manager” as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Network Operations Center (NOC) Engineer Job at Cobranet Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/network-operations-center-noc-engineer-job-at-cobranet-limited",
    "pubDate": "Thu, 05 Jun 2025 14:15:55 GMT",
    "source": "JobGurus",
    "keyword": "cobranet limited",
    "duplicate": false,
    "classifications": [],
    "content": "Cobranet Limited; a reputable organization incorporated in 2003 and provides internet solutions. Our footprint and range of products have grown immensely since incorporation and we are proud to provide every segment of society with a reliable link to the digital universe.\n\nOur entire network topology is rugged, dynamic and fully redundant with negligible downtimes: content showing extremely high availability exceeding 99.5%. Our promise is to continue providing innovative solutions at the best feature-to-price and service-to-price ratio.\n\nWe are recruiting to fill the position below:\n\nJob Position: Network Operations Center (NOC) Engineer\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Location: Lekki Phase 1, Lagos\nEmployment Type: Full-time\n\nJob Description\n\n\n\tPerform general “system administration” tasks on all elements of the network\n\tDiscover problem areas which could negatively impact system performance or customer satisfaction\n\tPro?actively monitor network and system performance.\n\tPerform network surveillance 24/7, respond to network?reported and customer?reported problems\n\tTake ownership to ensure that all problems are resolved in a timely and efficient manner.\n\tAnalyze traffic data and trends and escalate areas of concern to the network design authority.\n\tEscalate problems to third level support (Problem management team) where these cannot be resolved within the Network Operations Centre (NOC).\n\tPerform general “system administration” tasks on all elements of the network.\n\tManage problem resolution using network monitoring/management tools\n\tMonitor key suppliers service levels and highlight where Service Level Agreements (SLAs) are not being met.\n\n\nRequirements\n\n\n\tEducation and qualifications: B.Sc / HND in Computer Engineering/Telecommunications\n\tStrong communications skills both written and verbal.\n\tCapable of making solid, fact-based decisions under pressure.\n\tAbility to work well in an international, multi-cultural, and high-pressure technical environment.\n\tTechnical experience in a telecommunications or network operations environment.\n\tVery Good understanding of Fixed Wireless communications Technology\n\tCisco CCNA/CCNP certification.\n\tKnowledgeable to Manage Cisco switches\n\tInterested candidates must be able to work on a 24/7 shift Rotation.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: recruitment@cobranet.ng using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]