[
  {
    "title": "Job Vacancies at Yassir",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancies-at-yassir",
    "pubDate": "Fri, 15 Aug 2025 17:13:45 GMT",
    "source": "JobGurus",
    "keyword": "yassir",
    "duplicate": false,
    "classifications": [
      "Software Engineering"
    ],
    "content": "Yassir is the leading super App in the Maghreb region set to changing the way daily services are provided. It currently operates in 45 cities across Algeria, Morocco and Tunisia with recent expansions into France, Canada and Sub-Saharan Africa. It is backed (~$200M in funding) by VCs from Silicon Valley, Europe and other parts of the world.\n\nWe offer on-demand services such as ride-hailing and last-mile delivery. Building on this infrastructure, we are now introducing financial services to help our users pay, save and borrow digitally. Helping usher the continent into a digital economy era. We’re not just about serving people - we’re about creating a marketplace to bring people what they need while infusing social values.\n     \n\n            \n    \n\n\n\nWe are recruiting to fill the following positions below:\n\n1.) Senior Mobile Android Engineer (KMM)\n\nJob Location: Lagos, Nigeria\nJob title: Full time (Hybrid)\nCategory: Product & Tech - Last Mile Delivery.\n\nAbout the Role\n\n\n\tIn this role, you will be part of our engineering team, working with a high quality code base and the latest tools, where you will promote your skills to be an expert in complex frontend development in Android (kotlin) native platforms.\n\tYour primary focus will be development of mobile applications and their integration with back-end services.\n\tYou will be working alongside other engineers and developers working on different layers of the infrastructure.\n\tTherefore, a commitment to a highly dynamic environment, where root cause analysis and rapid collaborative problem solving, sophisticated design, and the creation of quality products are required.\n\n\nResponsibilities\n\n\n\tDesign and build mobile applications for Android.\n\tEnsure the performance, quality, and responsiveness of applications\n\tCollaborate with a team to define, design, and ship new features\n\tIdentify and correct bottlenecks and fix bugs\n\tHelp maintain code quality, organization, and automatization\n\tParticipate in brainstorming sessions and contribute ideas to our technology, algorithms and products.\n\tWork with the engineering and design teams to understand end-user requirements, formulate use cases, and then translate that into a pragmatic and effective technical solution\n\tDive into difficult problems and successfully deliver results on schedule\n\n\nRequirements\nQualifications:\n\n\n\tBSc/MSc in Engineering, Computer Science or relevant field with a minimum of 4 years of experience.\n\n\nMust have technical skills:\n\n\n\tLanguage: Android, Kotlin\n\tKMM experience.\n\tFamiliarity with cloud message APIs and push notification\n\tWeb architecture: Rest and restful APIs, micro-services\n\tVersion control: GIT\n\n\nNice to have technical skills (Strongly advised):\n\n\n\tContainers: Docker, Kubernetes\n\tCaching, Redis server\n\tScaling, Web load balancing\n\tExperience in a rapidly growing company.\n\n\nClick here to apply online\n\n \n\n \n\n2.) Senior Mobile iOS Engineer (Last Mile Delivery)\n\nJob Location: Lagos, Nigeria\nJob title: Full time (Remote)\nCategory: Product & Tech - Last Mile Delivery\n\nAbout the Role\n\n\n\tIn this role, you will be part of our engineering team, working with a high quality code base and the latest tools, where you will promote your skills to be an expert in complex frontend development in iOS (swift and swiftUI) native platforms.\n\tYour primary focus will be development of mobile applications and their integration with back-end services.\n\tYou will be working alongside other engineers and developers working on different layers of the infrastructure. Therefore, a commitment to a highly dynamic environment, where root cause analysis and rapid collaborative problem solving, sophisticated design, and the creation of quality products are required.\n\n\nTasks\n\n\n\tDesign and build mobile applications for iOS.\n\tEnsure the performance, quality, and responsiveness of applications\n\tCollaborate with a team to define, design, and ship new features\n\tIdentify and correct bottlenecks and fix bugs\n\tHelp maintain code quality, organization, and automatization\n\tParticipate in brainstorming sessions and contribute ideas to our technology, algorithms and products.\n\tWork with the engineering and design teams to understand end-user requirements, formulate use cases, and then translate that into a pragmatic and effective technical solution\n\tDive into difficult problems and successfully deliver results on schedule\n\n\nRequirements\n\n\n\tBSc/MSc in Engineering, Computer Science or relevant field\n\tMust have technical skills with at least 5 years of experience\n\tLanguage: iOS (swift) native\n\tFamiliarity with cloud message APIs and push notification\n\tWeb architecture: Rest and restful APIs, micro-services\n\tVersion control: GIT\n\n\nNice to have technical skills (Strongly advised):\n\n\n\tContainers: Docker, kubernetes\n\tCaching, Redis server\n\tScaling, Web load balancing\n\tExperience in a rapidly growing company in the mobility, on-demand or fintech space is a plus\n\n\nBenefits\n\n\n\tGround floor opportunity with the team; shape the strategic direction of the company\n\tSharp, motivated co-workers in a fun office environment or in remote\n\n\nWhy You Should join Yassir\n\n\n\tJoin one of the fastest-growing tech companies in North Africa\n\tHave a lasting impact on our company's culture\n\tMake a real impact on the world by helping us bring affordable financial and on-demand services to millions of Africans\n\tWork on some really hard technical challenges from identity infrastructure for Africans, digital payment networks to complex mapping and routing systems across the continent.\n\tWe are the first Algerian startup to go through Y Combinator program and we’re backed by top investors including Unpopular Ventures, Rebel Fund and DainTree.VC\n\n\nClick here to apply online\n\n \n\n3.) Senior Java Full Stack Engineer FS\n\nJob Location: Lagos \nJob type: Full-time (Hybrid)\nCategory: Product & Tech – Shared Services\n\nAbout Your Role\n\n\n\tBuild robust and scalable software in Java (Spring, Spring boot & hibernate)\n\tDesign and create (micro)services and system architecture for projects, and contribute and provide feedback to other team members\n\tHelp improve existing code quality through writing unit tests, automation and performing code reviews\n\tParticipate in brainstorming sessions and contribute ideas to our technology, algorithms and products\n\tWork with the engineering and design teams to understand end-user requirements, formulate use cases, and then translate that into a pragmatic and effective technical solution\n\tDive into difficult problems and successfully deliver results on schedule.\n\n\nRequirements\n\n\n\tBSc / MSc Degree in Engineering, Computer Science or a relevant field\n\tAt least 4 years of experience in a similar role\n\tSolid OOP and software design knowledge – you should know how to create software that is extensible, reusable and meets desired architectural objectives.\n\n\nMust have technical skills:\n\n\n\tLanguage: Java\n\tDatabase: MongoDB or other\n\tFramework: Spring boot and hibernate.\n\tWeb architecture: Rest and restful APIs, micro-services\n\tTDD\n\tExperience with Front end development and frameworks like Vue or React\n\tNice to have technical skills (Strongly advised for senior profiles):\n\tContainers: Docker, kubernetes\n\tCaching, Redis server\n\tDemonstrated ability to prioritize, self-start, contribute under pressure and meet tight deadlines\n\tHighly organized, creative and critical thinker\n\tComfortable working in an entrepreneurial environment\n\tExperience in a rapidly growing company in the mobility, on-demand or fin-tech space is a plus.\n\n\nClick here to apply online    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]