[
  {
    "title": "Human Resource Sales Associate Job at Pruvia Integrated Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/human-resource-sales-associate-job-at-pruvia-integrated-limited",
    "pubDate": "Tue, 03 Jun 2025 12:32:27 GMT",
    "source": "JobGurus",
    "keyword": "pruvia integrated limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Pruvia Integrated Limited, we are general service merchants with a strong desire to ensure customer satisfaction in the midst of efficient and effective service delivery. As an organization we are driven by the dictum of\n‘Impossibility is Nothing’.\n\nPIL was conceived in 2007, as regards to its incorporation and duly registered in 2013 with Corporate Affairs Commission of Nigeria (CAC) with Registration Number RC 1097861. It originated in response to providing world class services and solutions to the society at large and offering an alternative that is satisfactory in areas of our specialty. It has carried out service rendering duties in various states of Nigeria and within the ever bustling business environment of Lagos.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Human Resource Sales Associate\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\n\nJob Brief\n\n\n\tWe are seeking a skilled HR Sales Associate to join our team. The ideal candidate will make sure all HR Sales activities align with our business goals.\n\n\nResponsibilities\n\n\n\tIdentify and engage prospective clients, introducing them to our HR Services.\n\tBuild and maintain strong relationships with existing and potential clients to ensure long-term business success.\n\tConduct market research to understand client needs, industry trends, and competitor activities.\n\tDeliver compelling product demonstrations and presentations tailored to client requirements.\n\tDevelop and execute sales strategies to achieve or exceed individual and team targets.\n\tCollaborate with the marketing team to design campaigns that generate quality leads.\n\tProvide accurate sales forecasts, pipeline reports, and regular performance updates to management.\n\tAddress client inquiries and concerns, ensuring high customer satisfaction\n\n\nRequirements and skills\n\n\n\tBSc / HND in Business, Marketing, Human Resources, or related fields.\n\t1-3 years of proven experience preferably B2B Sales,\n\tAbility to build rapport and establish trust with clients quickly.\n\tResults-oriented with a track record of meeting or exceeding sales targets.\n\tA strong understanding of HR processes and challenges is an added advantage.\n\tExcellent communication, presentation, and negotiation skills.\n\tProficient in using CRM tools, Microsoft Office, and other sales enablement platforms.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV / Resume to: jobpruvia@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Graphics and Motion Designer Job at CIG Motors Co. Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/graphics-and-motion-designer-job-at-cig-motors-co-limited",
    "pubDate": "Tue, 03 Jun 2025 12:32:27 GMT",
    "source": "JobGurus",
    "keyword": "cig motors co. limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "CIG Motors Co. Limited has begun on a soft landing since 2013 following a pact signed with Guangzhou Automobile Group Co., Limited (GAC MOTOR) to establish and manage distribution network in Nigeria, Africa. The group, headquartered in Guangzhou China, launched business operation in Nigeria at the peak of Automobile boom based on Government advocacy for the production of brand new vehicles in Nigeria.\n\nWe are recruiting to fill the position below:\n\nJob Position: Graphics and Motion Designer\n\nJob Location: Victoria Island, Lagos\nJob type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a talented and creative Graphics and Motion Designer to join our team.\n\tThe ideal candidate will be responsible for creating visually stunning designs and motion content across digital and print platforms.\n\tThe ideal candidate should have a strong portfolio that demonstrates expertise in graphic design, animation, and visual storytelling.\n\n\nResponsibilities\n\n\n\tDesign static and animated graphics for digital campaigns, social media, websites, advertisements, presentations, and print materials.\n\tCreate motion graphics, animations, explainer videos, and video assets for marketing and content production.\n\tCollaborate with marketing, social media, and content teams to understand project requirements and translate concepts into engaging visuals.\n\tEdit and animate video content using After Effects, Premiere Pro, or equivalent software.\n\tEnsure all designs align with brand guidelines and visual identity.\n\tStay updated on industry trends, design best practices, and emerging motion graphics tools and techniques.\n\tManage multiple design projects and meet tight deadlines without compromising quality.\n\n\nRequirements\n\n\n\tBachelor’s Degree in Graphic Design, Animation, Multimedia Arts, or a related field (or equivalent experience).\n\tProven experience (2+ years) as a graphic designer and motion graphics artist.\n\tProficiency in Adobe Creative Suite (Photoshop, Illustrator, After Effects, Premiere Pro) and other relevant design tools.\n\tStrong understanding of composition, colour theory, typography, and layout.\n\tAbility to storyboard, design, and animate from concept to final output.\n\tExperience with video editing and post-production workflows is a plus.\n\tStrong communication and collaboration skills.\n\tAbility to take constructive feedback and iterate quickly.\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Chief Investment Officer Job at First Excelsia Professional Services Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/chief-investment-officer-job-at-first-excelsia-professional-services-limited",
    "pubDate": "Tue, 03 Jun 2025 12:32:27 GMT",
    "source": "JobGurus",
    "keyword": "first excelsia professional services limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "First Excelsia Professional Services Limited - Our client is recruiting to fill the position below:\n\nJob Position: Chief Investment Officer\nJob Location: Lagos Island, Lagos\nEmployment Type: Full-time\nIndustry: Asset Management\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tOur client is seeking a highly competent and result-driven Chief Investment Officer to join its dynamic team.\n\tThe Chief Investment Officer (CIO) will be responsible for setting and executing the investment strategy of the asset management company.\n\tThe ideal role holder will lead portfolio management, research, and trading functions to drive superior investment performance across all asset classes. The role requires balancing long-term investment strategy with short-term performance targets while managing risk and ensuring compliance.\n\n\nJob Responsibilities\n\n\n\tDevelop and implement the company’s overall investment philosophy and strategy.\n\tSet asset allocation models and risk parameters in line with client objectives and market conditions.\n\tAdvise the Board and Executive Management on market trends, investment opportunities, and risks.\n\tLead and mentor the investment and research teams, including portfolio managers, analysts, and traders.\n\tBuild a high-performance culture that fosters collaboration, accountability, and innovation.\n\tOversee the management and performance of all investment portfolios.\n\tMonitor and adjust portfolios to achieve targeted returns and risk metrics.\n\tEnsure consistency in the investment approach across all asset classes.\n\tSupervise trading activities and ensure alignment with portfolio strategy and market conditions.\n\tEnsure trades are executed efficiently, ethically, and in compliance with relevant regulations.\n\tSupport client relationship teams with performance reporting and investment communication.\n\tParticipate in client meetings and presentations as needed to explain strategy and results.\n\tEnsure investment activities comply with internal policies, regulatory guidelines, and fiduciary standards.\n\tWork closely with compliance and risk management teams to monitor portfolio and market risks.\n\n\nPerson Specification\n\n\n\tA Bachelor’s degree in Finance, Economics, Accounting, or a related field (required).\n\tMinimum of 10–15 years of experience in asset or investment management.\n\tMBA, CFA or other advanced investment qualifications (strongly preferred).\n\tRelevant regulatory certifications/licensing (as applicable in your jurisdiction).\n\tProven track record of leading investment teams and managing portfolios across multiple asset classes.\n\tExperience in developing and executing investment strategies and asset allocation models.\n\tStrong understanding of financial markets, instruments, and portfolio risk management.\n\tAbility to set and articulate long-term investment strategies.\n\tProven ability to lead and inspire investment teams.\n\tDeep analytical skills and ability to interpret complex data sets.\n\tStrong verbal and written communication skills; ability to explain complex investment concepts clearly.\n\tHigh level of professionalism and a strong orientation to client needs.\n\tStrong integrity, judgment, and commitment to regulatory and fiduciary responsibilities.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: talentsearch@firstexcelsia.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Executive Assistant Job at Universal Human Resource Consult",
    "link": "https://www.jobgurus.com.ng/jobs/view/executive-assistant-job-at-universal-human-resource-consult-2",
    "pubDate": "Tue, 03 Jun 2025 12:32:27 GMT",
    "source": "JobGurus",
    "keyword": "universal human resource consult",
    "duplicate": false,
    "classifications": [],
    "content": "Universal Human Resource Consult - Our client is seeking suitable candidates to fill the position below:\n\nJob Position: Executive Assistant \n\nJob Location: Abuja (FCT)\n\nJob Summary\n\n\n\tOur client is seeking a highly organized, proactive, and resourceful Executive Assistant to provide comprehensive administrative support to senior executives. \n\tThe ideal candidate will be detail-oriented, possess excellent communication skills, and be capable of managing a wide range of executive and administrative duties with confidentiality and professionalism.\n\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tProvide high-level administrative support to the Executive, including managing schedules, meetings, and travel arrangements.\n\tCoordinate and manage the executive’s calendar, ensuring optimal time management and prioritization.\n\tPrepare and edit correspondence, reports, presentations, and other documents.\n\tManage confidential information with discretion and integrity.\n\tOrganize and maintain files, records, and office systems.\n\tAssist with special projects, research, and reporting tasks as required.\n\tAttend and document minutes of executive meetings, follow up on action items, and track progress.\n\tCoordinate logistics for events, meetings, and engagements.\n\tServe as the first point of contact for internal and external stakeholders.\n\tLiaise with departments and teams to support the executive’s workflow and communication.\n\n\nQualifications & Experience\n\n\n\tBachelor’s Degree in Business Administration, Office Management, or related field.\n\tMinimum of 3–5 years of experience as an Executive Assistant or in a similar administrative role.\n\tProficiency in Microsoft Office Suite (Word, Excel, PowerPoint, Outlook).\n\tExceptional organizational, time management, and multitasking skills.\n\tStrong written and verbal communication skills.\n\tAbility to handle sensitive information with the highest level of confidentiality.\n\tExperience working in a fast-paced, high-pressure environment.\n\n\nKey Competencies:\n\n\n\tProfessionalism and discretion\n\tAttention to detail\n\tStrong interpersonal and relationship-building skills\n\tInitiative and problem-solving ability\n\tFlexibility and adaptability.\n\n\nRemuneration\n\n\n\tCompetitive salary and benefits, commensurate with experience and qualifications.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and cover letter in PDF to: uhrconsultlimited2019@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "General Manager Job at Excel and Grace Consulting",
    "link": "https://www.jobgurus.com.ng/jobs/view/general-manager-job-at-excel-and-grace-consulting-6",
    "pubDate": "Tue, 03 Jun 2025 12:32:27 GMT",
    "source": "JobGurus",
    "keyword": "excel and grace consulting",
    "duplicate": [
      {
        "site": "Example Site",
        "id": "f1167244121b741022b43c1a62c1b5b7",
        "timestamp": 1748869291184
      },
      {
        "site": "JobGurus",
        "id": "f1167244121b741022b43c1a62c1b5b7",
        "timestamp": 1748900381675
      },
      {
        "site": "JobGurus",
        "id": "887d4531103baa2671ea09fc3ee66bd3",
        "timestamp": 1748953945393
      }
    ],
    "classifications": [],
    "content": "Excel and Grace Consulting is a fast-paced business consulting organization with a track record of delivering exceptional business solutions to small and medium-scale enterprises in Nigeria, Ghana, Germany, Switzerland, Canada, etc. We are certified management consultants with the International Council of Management Consulting Institutes (CMC-Global) with over 18 years of experience. Our team of experts and consultants have authored over 20 books on business management, business structure, business operations, human resources, organizational structure, employee development, money management, and so on.\n\nWe are recruiting to fill the position below:\n\nJob Position: General Manager\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Location: Iyana-Ipaja, Lagos\nEmployment Type: Full-time\nIndustry: Hospitality & FMCG\n\nJob Summary\n\n\n\tWe are seeking a dynamic and results-driven General Manager to oversee and coordinate operations across our hospitality and FMCG business units.\n\tThe ideal candidate will be responsible for driving business growth, ensuring operational efficiency, managing teams, and maintaining high customer satisfaction standards.\n\n\nKey Responsibilities\n\n\n\tOversee daily operations of both the hospitality and FMCG units.\n\tDevelop and implement strategic plans to drive sales, profitability, and market share.\n\tLead, coach, and manage department heads and staff to ensure high performance.\n\tEnsure compliance with regulatory and safety standards.\n\tAnalyze business performance and generate regular reports for the executive team.\n\tEnsure exceptional customer service and operational excellence across all business outlets.\n\tManage budgeting, financial reporting, and cost control initiatives.\n\tMonitor inventory, supply chain, and vendor relationships to ensure smooth operations.\n\tIdentify opportunities for business development and process improvement.\n\tRepresent the company in external engagements and maintain a positive public image.\n\n\nRequirements\n\n\n\tBachelor's Degree in Business Administration, Hospitality Management, or related field (MBA is an added advantage).\n\tMinimum of 5 years of proven experience in a senior management role within the hospitality or FMCG sector.\n\tStrong leadership and people management skills.\n\tExcellent communication, negotiation, and decision-making abilities.\n\tProficient in budgeting, reporting, and operational planning.\n\tHands-on experience with inventory systems, POS, and supply chain management.\n\tMust reside in or be willing to relocate to Iyana-Ipaja or its environs.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and cover letter to: eandg.tprecruiters@gmail.com using \"General Manager - Iyana-Ipaja\" as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]