[
  {
    "title": "Head, Customer Care Job at Polaris Bank Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/head-customer-care-job-at-polaris-bank-limited-2",
    "pubDate": "Wed, 18 Jun 2025 14:44:48 GMT",
    "source": "JobGurus",
    "keyword": "polaris bank limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Polaris Bank was established by the Central Bank of Nigeria (CBN) on September 21, 2018 to offer commercial banking services to the Nigerian public. The bank commenced services on the same day, having purchased the assets and assumed certain liabilities of the defunct Skye Bank.With a footprint of over 350 branches across the country, Polaris Bank prides itself in delivering exceptional customer experience, leveraging best in class/state of the art Information Communication Technology (ICT). By focusing on ICT solutions across multiple service delivery channels (mobile banking, ATMs, POS and online platforms) Polaris Bank maintains a pivotal role in the Nigerian banking industry, providing customers with simple, convenient and secured banking services.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Head, Customer Care\n\nJob Location: Abuja / Lagos / Osun & Anambra\nJob Type: Full-Time\nDepartment: Branch Services Group\n\nKey Result Areas\nCash Management:\n\n\n\tEffect the reconciliation of the Bank’s cash position statement and physical cash in the vault.\n\tAnticipate cash levels and its impact on liquidity and propose alternative strategies to effectively manage it.\n\tEstablish optimal cash levels and review branch cash holding limits based on defined criteria.\n\tDemonstrate comprehensive knowledge of the cash management processes and use this knowledge to ensure consistency of practice, control, and identification of efficiency opportunities.\n\n\nCash Transactions (Deposits & Withdrawals):\n\n\n\tHave extensive experience with cash transactions and be able to handle sophisticated transactions.\n\tFamiliar with industry regulations and best practices, and be able to provide advanced customer service,\n\tHandle multiple transactions simultaneously and resolve complex issues.\n\n\nBanking Operations Policies:\n\n\n\tEnsure that operations procedures of different retail banking transactions designed could be able to facilitate the daily operations running smoothly and all procedures are in compliance with regulatory requirements.\n\tEnsure that the models for evaluating the effectiveness of operational procedures are designed.\n\tCarry out review and evaluation on operational procedures and make necessary adjustments\n\n\nCheque Printing and Management:\n\n\n\tUnderstand how to print and manage cheques using standard software applications.\n\tEnter data, generate, and print cheques, and perform basic tasks such as canceling, replacing, or voiding cheques.\n\n\nATM Operations and Management:\n\n\n\tBasic understanding of how to operate and manage an ATM,\n\tKnowledge of standard procedures for conducting transactions and basic maintenance tasks.\n\n\nTransaction Processing:\n\n\n\tMonitor cashing of different kinds of cheques after verifying the amounts and checking the deposit slips\n\tApprove acceptance of deposit and withdrawal by cash or cheque or fund transfer within the bank or to other banks (e.g., remittance), in local or foreign currencies within an assigned limit after verifying information related to the transaction.\n\tEnsure that transactions comply to internal guidelines regarding anti-money laundering to detect any suspicious transactions and report to management promptly.\n\n\nCustomer Service Management:\n\n\n\tHandle more complex customer enquiries and issues.\n\tManage conflicts and complaints.\n\tProvide additional information on products and services.\n\tManage multiple customer’s needs simultaneously and maintain effective and efficient customer service standards.\n\n\nFixed Asset Maintenance and Reconciliation:\n\n\n\tUnderstand the core concepts of Fixed Asset Maintenance and Reconciliation.\n\tCreate and maintain simple asset records and perform basic reconciliations.\n\tIdentify and locate fixed assets, record their acquisition cost and depreciation.\n\tPerform basic maintenance tasks such as cleaning and inspection.\n\n\nKey Performance Indicators:\nCash Management:\n\n\n\t100% of accuracy in reconciliation of the Bank’s physical cash and cash position statement.\n\tZero cases of low cash levels.\n\tOptimal cash levels.\n\n\nCash Transactions (Deposits & Withdrawals):\n\n\n\tPercentage of sophisticated cash transactions successfully handled based on their complexity level.\n\t100% adherence to industry regulations and best practices related to cash transactions.\n\tNumber of non-compliance issues identified during internal or external audits.\n\t100% accuracy while handling multiple transactions simultaneously.\n\n\nBanking Operations Policies:\n\n\n\tPercentage of operational procedures that are in compliance with relevant regulatory requirements.\n\tNumber of non-compliance issues identified during internal or external audits.\n\tRate of success of design and implementation of models for evaluating the effectiveness of operational procedures.\n\tAverage time taken to complete different retail banking transactions.\n\n\nCheque Printing and Management:\n\n\n\tAccuracy of cheques printed.\n\tZero cases of mistakes on cheques.\n\n\nATM Operations and Management:\n\n\n\tPercentage of transactions conducted without errors or discrepancies.\n\t100% adherence to standard procedures for conducting transactions and basic maintenance tasks at the ATM.\n\tPercentage of scheduled basic maintenance tasks completed within the defined timeline.\n\tNumber of complaints received related to ATM operations or maintenance issues.\n\n\nTransaction Processing:\n\n\n\t100% of cheques accurately verified for amounts and deposit slips checked.\n\t100% of transactions approved correctly without errors or discrepancies.\n\tNumber of suspicious transactions detected and promptly reported to management.\n\tNumber or percentage of compliance-related findings or issues identified during internal or external audits.\n\n\nCustomer Service Management:\n\n\n\tReduce average time taken to resolve complex customer issues and complaints by 50%\n\tPercentage of market research projects or studies completed within the defined timeline.\n\tNumber of actionable insights derived from market research that inform business decisions and improve customer service.\n\t100% accuracy of information provided to customers about Bank’s product and services.\n\tAverage rating of 3 on a 5 point-scale customer satisfaction index.\n\n\nFixed Asset Maintenance and Reconciliation:\n\n\n\t100% accuracy of asset records.\n\t100% accuracy of identification and location of fixed assets\n\tComplete schedules maintenance tasks on time 100% of the time.\n\tZero cases of fixed assets falling short of cleanliness and inspection standards.\n\n\nRequirements\n\n\n\tBachelor's Degree in Banking & Finance, Business Administration or any related field.\n\tAt least 0-2 years of cognate experience.\n\tAdditional academic qualification is an added advantage.\n\tRelevant professional qualification e.g., CCSP, CRM, NIM, ICSN, CIBN, etc. is an added advantage.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]