[
  {
    "title": "Social Media Manager Job at Duob Recruitment",
    "link": "https://www.jobgurus.com.ng/jobs/view/social-media-manager-job-at-duob-recruitment",
    "pubDate": "Wed, 11 Jun 2025 10:17:22 GMT",
    "source": "JobGurus",
    "keyword": "duob recruitment",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Duob Recruitment - Our client provides businesses with a professional phone system that enables teams to manage customer calls efficiently. Their goal is to help businesses improve the quality of their customer interactions while enhancing operational efficiency.\n\nThey are recruiting to fill the position below:\n\nJob Position: Social Media Manager\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Overview\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThey are looking for a Social Media Manager with strong creative instincts, a strategic mindset, and a deep understanding of internet culture.\n\tThis person will lead our client’s social media efforts, from curating content to managing campaigns, while making sure everything aligns with the brand.\n\tIf you’re someone who loves jumping on trends, turning insights into strategy, and using content to drive real business growth, this role is for you.\n\n\nKey Responsibilities\n\n\n\tOwn and manage all social media platforms (Instagram, Twitter/X, LinkedIn, TikTok)\n\tMonitor trends, viral content, conversations and tie them back to our client’s mission in a meaningful and timely way\n\tPlan, curate, and publish creative content across all platforms to increase engagement and visibility\n\tUse tools like Hootsuite to schedule, monitor, and analyse content performance\n\tTrack performance metrics and optimise based on data and user insights\n\tCollaborate cross-functionally with Product, Design, Growth, and Customer Success teams to support marketing campaigns\n\tStrategically manage organic and paid social campaigns from start to finish\n\tDevelop a consistent tone of voice that builds brand recognition and strengthens community trust.\n\n\nKey Success Metrics\n\n\n\tGrowth in engagement rate and follower count across platforms\n\tIncrease in link clicks and social-driven web traffic\n\tImproved brand visibility and consistency online\n\tCampaign success rates based on defined objectives (reach, engagement, conversions)\n\tTimely and relevant engagement with social trends\n\tQuality of content and alignment with brand essence.\n\n\nRequirements\n\n\n\t3+ years of experience managing social media for a brand, preferably in a fast-paced environment\n\tStrong understanding of social media algorithms, culture, and real-time marketing\n\tA creative thinker with the ability to execute ideas fast\n\tProficiency in social media scheduling and analytics tools (e.g. Hootsuite, Buffer, Later, etc.)\n\tExcellent written communication skills and an eye for compelling visuals\n\tFamiliarity with tools like Canva, CapCut, or Adobe Suite is a plus\n\tAnalytical and data-driven, comfortable using insights to guide strategy.\n\n\nBenefits\n\n\n\tBe part of a company solving a deep and urgent problem for African businesses\n\tCollaborate with a smart, driven, and kind team\n\tFreedom to take ownership and innovate\n\tOpportunity to shape the voice of one of Africa’s most promising startups\n\tWork remotely with flexible hours\n\tCompetitive salary and performance-based growth opportunities.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hrdamilolaasoata@outlook.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Assistant Finance Manager Job at KKON Technologies",
    "link": "https://www.jobgurus.com.ng/jobs/view/assistant-finance-manager-job-at-kkon-technologies-1",
    "pubDate": "Wed, 11 Jun 2025 10:17:22 GMT",
    "source": "JobGurus",
    "keyword": "kkon technologies",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "KKONTech stands as an Open Access Network provider with a dedicated focus on Fiber To The Business (FTTB) and metro wireless radio service, aiming to establish flawless fiber and radio connectivity for numerous businesses throughout the country.\n\nWe are recruiting to fill the position below:\n\nJob Position: Assistant Finance Manager\n\nJob Location: Anthony Village, Lagos\nEmployment Type: Full-time\n\nJob Objective\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe assistant manager finance is responsible for overseeing and coordinating the day-to-day activities of the finance team, ensuring the accurate and timely preparation of financial reports, managing financial operations, and maintaining compliance with company policies and financial regulations.\n\tThe role involves providing leadership to junior finance staff, driving process improvements, and supporting the Finance Manager in achieving departmental goals.\n\tThe assistant manager will also play a key role in ensuring the company’s financial health through effective management of accounting processes and financial reporting.\n\n\nJob Description\n\n\n\tEnsure the correctness of all General ledgers\n\tSupervision of customers receipt and ensure collections are according to SLA timelines\n\tEnsure the corrections of all reports (Monthly and weekly)\n\tTimeline submission of report\n\tPrepare cashflow projections for business plan and other projects.\n\tPrepare ad hoc reports and analysis as required\n\tPerform month end closure activity.\n\tEnsure Statutory and regulatory compliance\n\tPrepare supplementary reports when required.\n\tEnsure correctness of monthly bank reconciliation for FM sign off\n\tprepare and perform check runs\n\tEnsure 100% Statutory and regulatory compliance.\n\tEngagement with external and internal audit activities.\n\tprovide supporting documentation for audits\n\tmaintain accurate historical records by verifying all payment supportive documents on Bitrix.\n\tEnsure OLA are complied with.\n\n\nMethod of Application\nInterested and qualified candidates should send their resume to: careers@fob.ng using Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Contact Center Agent Job at KCL Jobs",
    "link": "https://www.jobgurus.com.ng/jobs/view/contact-center-agent-job-at-kcl-jobs",
    "pubDate": "Wed, 11 Jun 2025 10:17:22 GMT",
    "source": "JobGurus",
    "keyword": "kcl jobs",
    "duplicate": false,
    "classifications": [],
    "content": "KCL Jobs is dedicated to connecting top talent with the right opportunities. We specialize in sourcing skilled professionals across various industries, ensuring seamless hiring solutions for businesses. Our commitment to excellence, efficiency, and integrity makes us a trusted partner in workforce solutions.\n\nWe are recruiting to fill the position below:\n\nJob Position: Contact Center Agent\n\nJob Location: Lekki - Oniru, Lagos\n\nSummary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAre you a great communicator with a passion for customer service? Join our dynamic team as a Contact Centre Agent and be the voice of our brand, helping customers with their inquiries and delivering excellent service.\n\n\nResponsibilities\n\n\n\tHandle inbound and outbound customer calls professionally\n\tRespond to customer inquiries, complaints, and requests promptly\n\tEscalate complex issues to the appropriate departments\n\tMeet performance targets for response time, call quality, and customer satisfaction\n\tProvide accurate information about products and services\n\tLog interactions and follow up on unresolved issues\n\tMaintain a positive and helpful attitude at all times.\n\n\nRequirements\n\n\n\tMinimum of a B.Sc (Second Class Lower) from a recognized institution\n\tExcellent verbal and written communication skills\n\tStrong interpersonal and problem-solving abilities\n\tMust reside in or have easy access to Lekki or Oniru.\n\n\nRemuneration\n\n\n\tSalary: N101,000 monthly. \n\tIncentives: Leave Allowance, 13th Month Pay, Performance Bonuses.\n\n\nMethod of Application\nInterested and qualified candidates should send their applications to: victoria.skinn@kennediaconsulting.net using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Civil Engineer Job at Elvaridah Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/civil-engineer-job-at-elvaridah-limited",
    "pubDate": "Wed, 11 Jun 2025 10:17:22 GMT",
    "source": "JobGurus",
    "keyword": "elvaridah limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "At Elvaridah, we emphasize on the critical matters and prospects of organizations such as business growth, strategy, planning, marketing, structure, and people management across different industries. We help companies focus on the growth of their businesses while aligning costs with strategy. With our all-inclusive approach and expertise, we capture values across the boundaries of any organization. Elvaridah focuses on optimizing all the different parts of a business as a unit.\n\nWe are recruiting to fill the position below:\n\nJob Position: Civil Engineer\nJob Location: Lagos\nEmployment Type: Full-time\nIndustry: Real Estate\nReports To: Operations Manager\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Civil Engineer is responsible for planning, designing, overseeing, and managing construction and infrastructure projects from conception to completion.\n\tThis role ensures that all civil works on site are executed according to approved designs, industry standards, and regulatory requirements.\n\n\nKey Duties and Responsibilities\nProject Planning and Design Review:\n\n\n\tInterpret architectural and structural drawings to understand construction requirements.\n\tParticipate in site planning, layout designs, and interpretation of construction blueprints.\n\tRecommend modifications to design or construction methods where necessary.\n\n\nSite Supervision and Execution:\n\n\n\tOversee daily construction activities and ensure work is carried out according to specifications.\n\tMonitor the progress of civil works and ensure timely completion of project milestones.\n\tSupervise site workers and subcontractors to ensure adherence to quality and safety standards.\n\n\nQuality Control:\n\n\n\tEnsure that all materials used and work performed meet quality standards and specifications.\n\tConduct regular inspections to identify defects, non-compliance, or deviations from the plan.\n\n\nMaterial and Resource Management:\n\n\n\tEstimate material quantities and prepare requisitions for procurement.\n\tCoordinate with the storekeeper and Assistant Admin to ensure availability and proper usage of materials.\n\n\nTechnical Reporting and Documentation:\n\n\n\tMaintain accurate project documentation including site diaries, material logs, and progress reports.\n\tReport technical issues, delays, or risk factors to the project or operations manager promptly.\n\n\nRegulatory Compliance:\n\n\n\tEnsure all site activities comply with local building codes, health and safety regulations, and environmental standards.\n\tLiaise with government inspectors and agencies when necessary.\n\n\nTeam Collaboration:\n\n\n\tWork closely with architects, structural engineers, quantity surveyors, and other project stakeholders.\n\tAssist in resolving site conflicts or issues that may impact progress.\n\n\nCost and Time Efficiency:\n\n\n\tMonitor project budget and timeline to avoid overruns and delays.\n\tRecommend cost-saving construction methods or alternatives when necessary.\n\n\nQualifications\n\n\n\tBachelor’s degree in Civil Engineering or related field.\n\tMinimum of 3–5 years of proven experience in building construction or real estate development projects.\n\tCOREN certification is an advantage.\n\tStrong understanding of construction methods, project management tools, and engineering standards.\n\tProficient in AutoCAD, Microsoft Project, and other engineering software.\n\tExcellent leadership, problem-solving, and communication skills.\n\n\nSalary\nN300,000 - N350,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their resume and a cover letter to: careers@elvaridah.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Human Resources Officer Job at Valency Agro Nigeria Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/human-resources-officer-job-at-valency-agro-nigeria-limited-1",
    "pubDate": "Wed, 11 Jun 2025 10:17:22 GMT",
    "source": "JobGurus",
    "keyword": "valency agro nigeria limited",
    "duplicate": false,
    "classifications": [],
    "content": "Valency Agro Nigeria Limited is recruiting suitable candidates to fill the position below:\n\nJob Position: Human Resources Officer\nJob Location: Ibafo / Mowe, Ogun\nEmployment Type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAssist with recruitment activities, including posting job vacancies, screening resumes, scheduling interviews, and onboarding new employees\n\tPrepare employment letters, contracts, and other HR-related documentation\n\tMaintain accurate and up-to-date employee records and HR databases\n\tTrack attendance, leave, and performance appraisal schedules\n\tMaintain confidentiality and handle sensitive employee information with discretion\n\tManage office supplies and ensure timely replenishment of materials and equipment\n\tMaintain filing systems for both HR and administrative documents (digital and physical)\n\tSchedule meetings, prepare agendas, and take minutes when required\n\tSupport the implementation and enforcement of HR policies and procedures\n\tOrganize and coordinate staff training, development programs, and wellness activities\n\tRespond to employee inquiries regarding HR policies, benefits, and procedures\n\tCoordinate logistics for office maintenance, facility services, and vendor management\n\tAssist in planning and executing company events, staff engagements, and meetings\n\tMonitor renewal schedules for service contracts, subscriptions, and licenses\n\tProvide general administrative support to the HR Manager and other departments\n\tContribute to fostering a professional, efficient, and compliant work environment\n\tPerform other related duties as assigned by HR or management.\n\n\nRequirements\n\n\n\tBachelor’s degree in Human Resources, Business Administration, or a related field\n\t3 - 5 years of experience in HR, administration, or office management (internship experience may be considered)\n\tStrong understanding of HR principles, labor laws, and office procedures\n\tProficient in Microsoft Office Suite (Word, Excel, PowerPoint, Outlook)\n\tExcellent organizational and multitasking skills\n\tStrong verbal and written communication abilities\n\tAbility to handle confidential information with integrity and professionalism\n\tHigh attention to detail and accuracy\n\tPositive attitude and a proactive, problem-solving mindset\n\tAbility to work independently and collaboratively in a team\n\tKnowledge of HR software or tools is an added advantage.\n\n\nBenefits\n\n\n\tCompetitive monthly salary (N150,000 - N200,000)\n\tOpportunities for professional growth and on-the-job learning\n\tExposure to both HR and administrative functions\n\tFriendly and supportive work environment\n\tStaff wellness and engagement programs\n\tHealth Insurance\n\tExperience working with a dynamic team in a growing organization.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hrfactory@valencyafrica.com using the Job Positon as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]