[
  {
    "title": "Purchasing Officer Job at Kyosk Digital Services Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/purchasing-officer-job-at-kyosk-digital-services-limited-5",
    "pubDate": "Thu, 03 Jul 2025 10:17:44 GMT",
    "source": "JobGurus",
    "keyword": "kyosk digital services limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Kyosk Digital Services Limited is a tech-led platform that connects informal retailers who retail in kiosks and other similar retail outlets directly to fast-moving consumer goods companies (FMCGs) by communicating demand from retail outlets directly to FMCGs and their distributors and managing the delivery of the goods to the kiosks.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nOur digital ordering and delivery platform – Kyosk – ensures that these retail outlets get access to stock at competitive prices and have them delivered directly to them. FMCGs find the traditional distribution chain to be inadequate as well, making it expensive for them to serve kiosk-type retail outlets, leading to high incidences of product stock-outs and lost sales opportunities. By providing FMCGs with good data visibility, we solve this major problem of theirs.\n\nWe are recruiting to fill the position below:\n\nJob Position: Purchasing Officer\n\nJob Location: Lagos\nJob Type: Full-time\nAccountable to: Purchasing Manager\n\nPurpose\n\n\n\tEffectively manage the supply chain/buying of goods from the suppliers and timely delivery to the warehouses at the best prices, in the right quantities and in time to maximize Kyosk’s offering to the market.\n\tProfessionally cultivate and nurture relationships with suppliers.\n\n\nRoles and Responsibilities\n\n\n\tPayment management: Prepare LPOs from all warehouses for approval by Purchasing manager as per product movement. Send LPOs to the relevant suppliers and confirm deliveries; Follow and ensure minimal lead times for deliveries as per the LPOs.\n\tPurchasing: Ensure all the buying targets are met by following up with the warehouses for completion and achievement. Follow up with the accounts to ensure rebate payments are achieved. Negotiate for best-trading terms, margins and discounts\n\tStock Management: Monitor stock levels in the warehouses and advice accordingly. Initiate prior stocking up for high seasons-eg Back to school, Christmas, End months. Add new items on the catalog/inventory; update inventory prices as needed.\n\tData Management: Analyze data and reports; Keep accurate records of the purchases made in the business. Prepare relevant purchasing reports and meeting minutes; Reconcile purchases with Finance at the end of the month. Compile data relating to supplier performance to enable evaluation.\n\tMarket Analysis: Continuous monitor market trends, competitor strategies, market suppliers to ensure alignment and know-how of the current market and industry trends;\n\tSupplier management: Update supplier agreement files and documents. Communicate expiries, damages and obsolete goods to suppliers for solutions; Handle official meetings with vendors. Compare and double-check market prices to ensure the best deals. Review opportunities to make business savings utilizing negotiation and purchasing best practice tools and methods.\n\tWork seamlessly with other relevant departments for the goal of the company.\n\tAny other duties within the purchasing department as assigned by the Purchasing Manager.\n\n\nMinimum Requirements\n\n\n\tRelevant Degree in Business and/or Supply Chain;\n\tKnowledgeable on purchasing functions with a minimum of 3 years of experience preferably within retail;\n\tProfessional qualification in supply chain is a plus;\n\tGood knowledge of purchasing, negotiation, commercial understanding and cost breakdown;\n\tAble to add value, reduce costs and input to business improvements;\n\tA good understanding of the retail market is a plus;\n\tBe able to meet strict and dynamic deadlines;\n\n\nSkills and competencies:\n\n\n\tAnalytical & Logical Thinker;\n\tAttention to detail;\n\tDrive for Execution;\n\tCommercial Acumen;\n\tSelf-motivated\n\tHonesty and integrity.\n\tTech Savvy\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Process Control Engineer Job at International Breweries Plc",
    "link": "https://www.jobgurus.com.ng/jobs/view/process-control-engineer-job-at-international-breweries-plc",
    "pubDate": "Thu, 03 Jul 2025 10:17:44 GMT",
    "source": "JobGurus",
    "keyword": "international breweries plc",
    "duplicate": false,
    "classifications": [],
    "content": "International Breweries Plc - Our Dream is to bring people together for a better world. Beer, the original social network, has been bringing people together for thousands of years. We are committed to building great brands that stand the test of time and to brewing the best beers using the finest natural ingredients.\n\nOur diverse portfolio of well over 400 beer brands includes global brands Budweiser, Corona and Stella Artois; multi-country brands Beck’s, Castle, Castle Lite, Hoegaarden, and Leffe; and local champions such as Aguila, Bud Light, Jupiler, Klinskoye, Modelo Especial, Quilmes, Skol, and Victoria.\n\nWe are recruiting to fill the position below:\n\nJob Position: Process Control Engineer\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Requisition ID: 30084055\nJob Location: Port Harcourt, Rivers\nJob Type: Full-time\n\nSummary\n\n\n\tThe Key Purpose of this role is to report the Manufacturing Systems Manager, ensures the integrity of Control and Automation (C&A);\n\tResponsible for the:\n\t\n\t\tDesigning, coordinating and implementing the installations of new process control systems within the plant in accordance with standards\n\t\tEnsures sustainable integrity and stability of the C&A infrastructure\n\t\tProactively recommends best practices within the control and automation space\n\t\tAssesses business continuity risk and associated equipment obsolescence's in the assigned area and\n\t\tTesting and executing disaster recovery procedures.\n\t\n\t\n\n\nKey Roles and Responsibilities\nGovernance and Standards:\n\n\n\tSupport plant with C&A project implementation and ensure that they adhere to the C&A standards within the project\n\tTo support the plant with control and automation project implementations by ensuring correct control and automation standards are followed and advising on technologies where applicable\n\tAssist with technology selection by providing the plant with insight into new technologies and making recommendations around these technologies\n\tProvide the plant with Global Technical Specifications (GTS) and Zone Technical Specifications (ZTS) where they exist or assist the plant in developing new standards in conjunction with the regions\n\tProvide the plant with advice of technology implementation during design and commissioning of projects\n\tLead design and architecture workshops and ensure that a sound design and architecture solution is developed\n\tEnsure that the correct technologies are selected to deliver the solution\n\tCo-ordinate with System Integrators to ensure our C&A standards are adhered to during divisional control and automation projects\n\tReview, update and specify C&A standards\n\tTo be the custodians of all manufacturing standards by reviewing standards, updating these standards and developing new standards.\n\tUnderstand current standards and know why and how to implement these\n\tCoach plant staff on current standards\n\tReview standards and make recommendations to improve standards\n\tCreate new standards for new technologies and get plant manager approval\n\tTrain systems staff in new standards\n\tAudit plant against C&A standards and ensuring compliance\n\tConduct an unbiased audit on specified systems and process within the manufacturing system’s environment\n\tDocument findings of the audit and assist the plant in creating action plans and to close out gaps\n\tAssist with implementation of standards and processes where applicable and having follow-up meetings.\n\n\nMaintenance and Support:\n\n\n\tResolve issues that have been escalated or assigned as quickly as possible\n\tLog issues that have been escalated and report on these on a weekly basis\n\tCommunicate root cause and resolution details\n\tInteract with vendor to ensure quick resolution of issues escalated\n\tEscalating issues to vendors where required by logging the call with them and keeping track of root cause and resolution.\n\tProvide vendors with feedback on software tested and work with them to resolve any issues.\n\tEscalate issues that cannot be resolved, to vendors.\n\tKeep track of vendor escalated issues\n\tSupport the change control process at the plant to ensure that approved changes are made in accordance with approved procedures and vendor recommendations to the control and automation system as specified by the plant manager and site engineers\n\tFollow-up on the effectiveness and sustainability of changes made\n\tEnsure plant efficiency by maintaining C&A systems uptime and resolution of C&A breakdowns in as short a time period as possible\n\tAttending to and resolving C&A breakdowns both during and after office hours either remotely or by coming to site\n\tConducting after action reviews to engineer, design and execute sustainable preventative measures\n\tSupport plant with problems experienced in the Control and Automation layer that has been escalated to Tech Supply, ZBS Maintenance or Solutions\n\tTo support plant with operational control and automation issues that have been escalated to  Tech Supply, ZBS Maintenance or Solutions\n\tAudio visual support for projectors, zoom rooms, auditoriums, training rooms and boardrooms\n\tEscalation point for all help desk issues\n\tEnsure that manufacturing server checks are being done including Avmar backup checks – part of workflow verification to ensure backups are done - hardware, cluster health, server operating system, server application, time sync, SQL, anti-virus, SCCM, SCOM, incidents being driven to closure and deviations are being resolved or incidents logged by manufacturing systems resources or Solutions\n\tEnsure that Inter plc network maintenance – switches for inter plc network not managed by the network team but by region – is being done\n\tAct as single point of contact for outsourced Solutions services: Cameras, IT generators, IT UPS, IT networks.\n\n\nContinuity and Risk:\n\n\n\tTo ensure and maintain control and automation systems uptime by continuously assessing and mitigating risks, resolving breakdowns and instituting sustainable prevention measures\n\tConducting C&A risk assessments and recommending mitigation as per the site risk assessment process\n\tExecuting mitigation efforts in reduction of the risks identified\n\tDeveloping and Testing Disaster Recovery Procedures including ensuring data and configuration back-ups can be successfully restored\n\tIn the event of a disaster or unforeseen event - executing the disaster recovery procedures in accordance with the Business Continuity Plan\n\tCorrectly scope project and CAPEX to reduce or eliminate high risk items including but not limited only to hardware and software obsolescence and operational technology (OT)\n\tAssist identifying and resolving security vulnerabilities in partnership with Security Operations Centre and Solutions\n\tEnsure antivirus and anti-malware systems are up-to-date and functioning correctly.\n\n\nSkills:\n\n\n\tImprove control and automation knowledge at the plant to ensure faster escalation of issues\n\tPrepare material for and participate in weekly knowledge sharing sessions\n\tDevelop own and close Skills Acquisition Process (SKAP) training plan\n\tSupports the pipeline development of apprentices, instrument artisans and Technicians.\n\n\nProject (Investments):\n\n\n\tProvide input to the Business Case by reviewing business cases and making recommendations to the plant\n\tProvide the plant with advice of technology implementation during design and commissioning of projects\n\tProvide technical leadership for divisional control and automation projects in a timely manner\n\tAssist with determining scope of the project through communication session with the business, stakeholders and users and documenting the requirements\n\tManage development and testing of solution\n\tLead commissioning of the solution at the plant\n\tExecute small optimization projects, hence adding value in terms of cost saving\n\tCoordination of Control and Automation aspects of CAPEX projects\n\n\nOptimise:\n\n\n\tSupport plant process optimisation in terms of Quality, Cost and Speed improvements\n\tTo support the plant with process optimisation efforts in terms of improving quality, cost and speed of plant processes\n\tProvide insight and feedback on how processes are controlled to plant management team so that optimisation proposals can be engineered\n\tAnalyse and resolve long-term operational issues experienced in the plant.\n\n\nMinimum Requirements\n\n\n\tBachelor’s Degree in Electrical, Electronics, Mechatronic Engineering or Computer Science\n\tAt least 3 years in industrial control and automation or completion of Control and Automation technical traineeship\n\tIn-depth knowledge of Process Control\n\tSpecialisation in Industrial Control & Automation\n\tFMCG or beverages experience in industrial control and automation.\n\n\nAdditional Information:\n\n\n\t\n\tBand: VII.\n\t\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Logistics Operational Manager Job at Naija Global Logistics Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/logistics-operational-manager-job-at-naija-global-logistics-limited",
    "pubDate": "Thu, 03 Jul 2025 10:17:44 GMT",
    "source": "JobGurus",
    "keyword": "naija global logistics limited",
    "duplicate": false,
    "classifications": [],
    "content": "Naija Global Logistics Limited - In addition to offering Freight Forwarding, Industrial Projects Logistics, Customs Brokerage, and Cross Border Logistics, NG Logistics offers Consulting opportunities to Corporations and Governments majorly on Logistics optimization and Transport development studies in West Africa.\n\nWe are recruiting to fill the position below:\n\nJob Position: Logistics Operational Manager\nJob Location:  Ajao Estate, Lagos\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are looking for an experienced and result driven Logistic operational manager with a minimum of 7 years hands on experience in overseeing end-to-end logistics and supply chain operations, optimizing distribution networks, managing third-party logistics providers, ensuring compliance with industry standards, and efficiently managing export and Drive brand visibility by Implementing Business development in line with organizational policy and procedure.\n\n\nJob Responsibilities\n\n\n\tPlan warehouses and distribution centers for efficiency in both operations and capacity.\n\tOrganize transportation activities, including storage of goods, managing information accrued from point of origin to delivery, orchestrating transportation movements, and arranging for services as necessary.\n\tCoordinate and track movement of goods through logistic pathways.\n\tExecute logistics plan to move products and packages to reach destinations on schedule.\n\tReview freight rates and other transportation costs to keep working costs low.\n\tPrepare plans for liquidation and downsizing.\n\tDevelop and execute tools and methodologies to enable effective implementation of logistic plans.\n\tDesign and develop standard operating methods to manage logistics operations efficiently.\n\tMaintain quality throughout the logistics processes.\n\tDevelop logistics along with support plans, budget requirements and deployment timelines for new operations.\n\tDevelop logistical plans for current operations and logistics contingency plans.\n\tEnsure to work seamlessly and assiduously with all other department of the company.\n\tIdentify added logistic training requirements to attain high working standards.\n\tBe coordinative with a sound moral attitude in order not to put the company’s name in disrepute.\n\tEnsure the confidentiality of all the company’s information at your disposal.\n\n\nRequirements\n\n\n\tMaster Degree in Business Administration/social science / HND or related field\n\t6-8 years of experience in a related role\n\tSubstantial knowledge of standard logistics procedures and practices is required\n\tGood communication and representative skills\n\tAbility to multitask and deal with situations\n\tAbility to adapt within the working environment.\n\tKnowledge of Microsoft Excel, PowerPoint Presentation\n\tStrong analytical skill.\n\n\nMethod of Application\nInterested and qualified candidates should send their Applications / CVs to: Temidayo.k@naijaworldwide.com using the Job Position as the subject of the email    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]