[
  {
    "title": "Manager Job at EI Global",
    "link": "https://www.jobgurus.com.ng/jobs/view/manager-job-at-ei-global",
    "pubDate": "Thu, 05 Jun 2025 17:11:37 GMT",
    "source": "JobGurus",
    "keyword": "ei global",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "EI Global is the leading light in the cooperate world with subsidiaries in real estate and logistics. We are the fastest growing company in sub Saharan Africa. With cutting edge innovations and great work ethics and team work we are redefining luxury and style in every sense.\n\nWe are recruiting to fill the position below:\n\nJob Position: Manager\n\nJob Location: Port Harcourt, Rivers\nEmployment Type: Full-time\n\nRequirements\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tHardworking and Humble\n\tCreative and Innovative\n\tGood marketing strategy\n\tSocialite\n\tPassionate about guest services.\n\n\nMethod of Application\nInterested and qualified candidates should forward their CV / Resume to: bookeihomes@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Secretary Job at LMV Nigeria",
    "link": "https://www.jobgurus.com.ng/jobs/view/secretary-job-at-lmv-nigeria",
    "pubDate": "Thu, 05 Jun 2025 17:11:37 GMT",
    "source": "JobGurus",
    "keyword": "lmv nigeria",
    "duplicate": false,
    "classifications": [],
    "content": "LMV Nigeria is a dynamic, multi-sector company dedicated to building sustainable infrastructures, providing energy solutions, and enhancing healthcare services.\n\nWe are recruiting to fill the position below:\n\nJob Position: Secretary\nJob Location: Lugbe, Abuja (FCT)\nEmployment Type: Full-time\n\nJob Responsibility\n\n\n\tAbility to handle administrative task\n\n\nRequirements\n\n\n\tInterested candidates should possess relevant qualifications with at least 1 year of experience.\n\n\nSalary\nN50,000 - N60,000 Monthly.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: lixpharmacy03@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Procurement & Logistics Officer Job at Yinson Holdings Berhad",
    "link": "https://www.jobgurus.com.ng/jobs/view/procurement-logistics-officer-job-at-yinson-holdings-berhad",
    "pubDate": "Thu, 05 Jun 2025 17:11:37 GMT",
    "source": "JobGurus",
    "keyword": "yinson holdings berhad",
    "duplicate": false,
    "classifications": [],
    "content": "Yinson Holdings Berhad is a global energy infrastructure and technology company, listed on the Main Market of Bursa Malaysia Securities Berhad. We are a diversified global group recognised for our leadership position in sustainability, with key businesses in offshore energy, renewable energy and green technologies.\n\nWe are recruiting to fill the position below:\n\nJob Position: Procurement & Logistics Officer\n\nJob Location: Port Harcourt, Rivers\nEmployment Type: Permanent\n\nOverall Purpose of the Job\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tProvide procurement and logistics support as required by the Purchasing Manager in accordance with procedures in the Management system \n\n\nCore Responsibilities\n\n\n\tReceive and file all requisitions from the Units and follow up approval of requisitions by Superintendents / Operations Managers; \n\tPlace orders with suppliers as required and follow up until delivery onboard; \n\tEnter orders into the Purchasing system and keep the system updated to completion; \n\tMonitor contractors / suppliers goods handling practices; \n\tFollow up contractors / suppliers and Logistics Agents regarding Landed Goods for service and repairs and keep track on status of same; \n\tAssist in monitoring Company Logistics Agents’ import / export activities and related local logistics for efficiency; \n\tAssist in collation of operations statistics for Nigerian Content and related reporting; \n\tReceive and record confirmation of receipt of goods from the Units; \n\tReconcile invoices received against purchase orders and confirmation of goods received; \n\tNew supplier profiling for approval and registration in the Approved Supplier list; \n\tAdvise the Purchasing Manager on purchasing and logistics matters requiring attention; \n\tComply with Company HSSEQ System in performing duties. \n\n\nHSE Responsibilities:\n\n\n\tResponsible for maintaining a high degree of awareness; \n\tLead by doing; setting an example for others; \n\tObserve and report any unsafe activities, conditions or situations:\n\t\n\t\tIf you observe anything unsafe use the ‘Stop Work’ Policy.\n\t\n\t\n\n\nQualifications / Skills / Experience\n\n\n\tBachelor’s Degree in Purchasing and/or Logistics, additional professional qualification is an advantage \n\t2 – 3 years of relevant work experience in procurement with an international Oil & Gas/Engineering company \n\tKnowledge of IFS, SAP or related databases \n\tFluent in English \n\n\nPersonal qualities:\n\n\n\tAble to work in virtual teams, across functions and across borders; \n\tIndependent, but committed to contributing to a good team that shares knowledge and uses each other’s strengths; \n\tAbility to take ownership of deliverables; \n\tOrganised, responsible and punctual; \n\tPositive and outgoing; \n\tExcellent communication skills; \n\tFlexibility with workdays and some travel can be expected.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "PR & Branding Manager Job at HabariPay Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/pr-branding-manager-job-at-habaripay-limited",
    "pubDate": "Thu, 05 Jun 2025 17:11:37 GMT",
    "source": "JobGurus",
    "keyword": "habaripay limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "HabariPay Limited is a Fin-tech on the path to building a truly pan-African payments unicorn with it's unique product called SQUAD. At Squad, you will have access to best in class tools and resources to enable you to solve truly complex problems, developing game changing payments solutions.\n\nWe are recruiting to fill the position below:\n\nJob Position: PR & Branding Manager\n\nJob Location: Victoria Island, Lagos\nEmployment Type: Full-time\n\nJob Summary \n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe PR & Branding Manager will enhance the brand awareness by sharpening the offline/online communications for HabariPay Ltd.\n\tYou will give a new edge to our marketing strategies and develop ideas to improve communication between the brand and consumers.\n\tThe role and duties include preparing promotional material that takes our vision to the customers, use effective and timely messaging to attract new customers, develop strategies specific to different media, and networking for brand awareness.\n\tYou will be our brand’s voice. Ours is a fast-paced environment that requires quick thinking and a willingness to adapt according to the situation.\n\n\nJob Duties and Responsibilities\n\n\n\tDevelop creative messaging strategies to advertise the company’s vision and products on the top social media platforms.\n\tDevelop different strategies for different social media platforms and gauge their impact to keep the marketing graph high.\n\tNetwork with clients and the biggest and most influential names in the industry to increase brand awareness and name the company in its niche.\n\tGather and analyze feedback data to develop new ideas improving branding, marketing and advertising strategy.\n\tMonitor social media platforms and develop new ideas to enhance customer engagement by acknowledging and solving their problems and queries.\n\tCreate plans for press conferences and interviews to help send the required message to our consumer base.\n\tTrack ROI to measure the performance of each of the strategies to work on them continually.\n\tCome up with unique ideas for the company materials to be sent to subscribers to keep our valued customers engaged and attract new ones.\n\tCollaborate with the sales team and providing them with customer feedback on the company’s products.\n\tManage the production of traditional and digital ad copy, paid social copy, and other demand-generation assets, ensuring each asset meets the quality and acquisition expectations.\n\n\nRequirements\n\n\n\tBachelor’s Degree in Marketing, Mass Communication, Public Relations or related field required.\n\t3-5 years of experience as a Brand Manager, Marketing communication specialist, PR Personnel or related roles in a fintech and a good track record for the same\n\tWell-versed with working on MS Office.\n\tHands-on experience in using content management platforms and other communication tools to execute the unique ideas you come up with.\n\tFamiliarity with working on B2B and B2C advertising campaigns and the ability to make any marketing campaign stand out in the crowd.\n\tExperience working on social media marketing and an awareness of different social media platforms and the content that should go on each of them.\n\tExcellent presentation skills and proficiency in both written and spoken English.\n\tThe willingness to take challenges head-on and the courage to step up when others are reluctant to.\n\tAn eye for detail and the ability to come up with a unique and timely analysis of the feedback data received from the customers.\n\tAbility to mid-wife a start-up brand and nurture it to maturity with demonstrated evidence from previous work experience.\n\tAble to manage multiple sub-brands for various product verticals.\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]