[
  {
    "title": "Procurement Officer Job at Owens and Xley Consults",
    "link": "https://www.jobgurus.com.ng/jobs/view/procurement-officer-job-at-owens-and-xley-consults-3",
    "pubDate": "Thu, 19 Jun 2025 17:42:32 GMT",
    "source": "JobGurus",
    "keyword": "owens and xley consults",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Owens and Xley Consults is a recruitment firm based in Lagos that offers business advisory and consulting services to help Small and Medium-sized Enterprises (SMEs).\n\nWe are recruiting to fill the position below:\n\nJob Position: Procurement Officer\nJob Location: Lagos\nEmployment Type: Full-time\n\nDescription \n\n\n\tIn this role, your primary function is to ensure that items in their assigned categories are sourced to meet the needs of the business from the point of view of cost, quality, and availability.\n\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tUse sales data analysis, insight, and multiple inputs to create order patterns for assigned items, maximizing availability and minimizing waste.\n\tExecute purchases, including issuing Purchase Orders\n\tBuild overview of other categories and the business as a whole to provide back-up for other team members.\n\tRepresent assigned categories to the sales team and respond to ad-hoc queries and request.\n\tConduct research on potential products, vendors, and services, and comparing price and quality to ensure the best deal.\n\tMonitor inventory and write orders to refill stock.\n\tInspect purchased products upon delivery and report any issues timely.\n\tMeet with vendors and clients to negotiate the best contracts.\n\tLiaise with inventory team to ensure goods are received on time.\n\tUpdate all records of purchased products.\n\tWrite reports on purchases made and perform cost analysis.\n\tNegotiate contract terms of agreement and pricing\n\tEnter order details (e.g. vendors, quantities, prices) into internal databases.\n\tMaintain updated records of purchased products, delivery information and invoices\n\tMonitor stock levels and place orders as needed\n\tCoordinate with inventory officers to ensure proper storage\n\tPerform other duties as assigned\n\n\nCompetency and Skill Requirements\nTechnical Skills:\n\n\n\tExperience in use of ERP systems, Excel, and other relevant analytics tools.\n\tHands-on experience with purchasing software.\n\tGood knowledge of vendor sourcing practices (researching, evaluating and liaising with vendors)\n\tKnowledge of purchasing methods and procedures, purchasing sources, prices, market factors, product characteristics, and reporting procedures.\n\tUnderstanding of supply chain procedures\n\n\nSoft Skills:\n\n\n\tSolid analytical skills, with the ability to create financial reports and conduct cost analyses\n\tNegotiation skills\n\tSound research and networking skills.\n\tWritten, verbal, and interpersonal skills.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and cover letter to: recruitment@owensxley.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "HR Officer Job at SayWheels Auto",
    "link": "https://www.jobgurus.com.ng/jobs/view/hr-officer-job-at-saywheels-auto",
    "pubDate": "Thu, 19 Jun 2025 17:42:32 GMT",
    "source": "JobGurus",
    "keyword": "saywheels auto",
    "duplicate": false,
    "classifications": [],
    "content": "SayWheels Auto is a dynamic electric vehicle (EV) dealership based in Lagos, Nigeria, dedicated to driving the future of clean, sustainable transportation across the country. Specializing in the sale of high-quality electric cars, the company offers a wide range of eco-friendly vehicles designed to meet the needs of modern Nigerian drivers.\n\nWe are recruiting a proactive and detail-oriented candidate to join our team in the capacity below:\n\nJob Position: HR Officer\n\nJob Location: Lagos Island, Lagos\nEmployment Type: Full-time (Onsite)\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tCarryout recruitment, onboarding, and employee documentation\n\tAssist with payroll coordination and attendance tracking\n\tHandle employee queries and support general HR operations\n\tMaintain HR files and update internal systems\n\tSupport compliance with labor regulations and internal policies.\n\n\nRequirements\n\n\n\tInterested candidates should possess a Bachelor's Degree\n\t1 - 2 years of HR experience\n\tStrong organizational and communication skills\n\tKnowledge of basic HR processes and tools\n\tMust be available to work onsite and stay on the Island.\n\n\nSalary\nN100,000 monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: cynosureprofessionalservices@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Call Center Representative Job at Odixcity Consulting",
    "link": "https://www.jobgurus.com.ng/jobs/view/call-center-representative-job-at-odixcity-consulting",
    "pubDate": "Thu, 19 Jun 2025 17:42:32 GMT",
    "source": "JobGurus",
    "keyword": "odixcity consulting",
    "duplicate": false,
    "classifications": [],
    "content": "Odixcity Consulting is an International Hr consulting and procurement firm. With expertise in Recruitment & Selection, Performance management, Training & Development, Compensation and benefits as well as Outsourcing of goods and services for organizations.\n\nWe are recruiting to fill the position below:\n\nJob Position: Call Center Representative\n\nJob Location: Remote\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are looking for a friendly, articulate, and customer-focused Call Center Representative to be the voice of our company.\n\tYou will be responsible for handling incoming and outgoing calls, resolving customer inquiries, and providing product or service information.\n\n\nResponsibilities\n\n\n\tAnswer incoming calls and respond to customer inquiries promptly and professionally.\n\tMake outbound calls to follow up with customers or conduct surveys.\n\tHandle customer complaints or escalate issues when necessary.\n\tFollowing up on customer inquiries that require additional investigation.\n\tProviding technical support and troubleshooting for customer issues.\n\tMaintain detailed records of customer interactions and transactions.\n\tProvide accurate, valid, and complete information using the right tools and resources.\n\tMeet personal and team call handling goals and quality standards.\n\tUsing CRM software to document interactions and track customer information.\n\tBuilding strong relationships with customers, and addressing customers needs.\n\n\nRequirements\n\n\n\tBachelor’s Degree in Business Administration, or a relating field.\n\tProven customer service experience, ideally in a call center or similar setting.\n\tExcellent verbal communication and listening skills.\n\tStrong problem-solving and conflict resolution abilities.\n\tAbility to work with CRM systems and basic computer tools.\n\tAbility to analyze situations, identify solutions, and take appropriate action to address customer inquiries.\n\tEfficiently handling multiple calls, documenting information, and meeting performance goals.\n\n\nSalary\nN300,000 / Month (non-negotiable).\n\nMethod of Application\nInterested and qualified candidates should send their CV to: jobscandidate8@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Human Resources Executive Job at Owens and Xley Consults",
    "link": "https://www.jobgurus.com.ng/jobs/view/human-resources-executive-job-at-owens-and-xley-consults",
    "pubDate": "Thu, 19 Jun 2025 17:42:32 GMT",
    "source": "JobGurus",
    "keyword": "owens and xley consults",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Owens and Xley is a Small Business Advisory and Consulting Company in Lagos, Nigeria. Our services include of Small Business Startup and Set up, Business Plan preparation, Business Process Design and Business Strategy Formulation.\n\nWe know the role good planning plays in any business and its associated costs; and the initial capital challenges faced by a small business which is why we have developed solutions which ensure that small business owners have access to technical skills but at a fraction of the cost.\n\nWe are recruiting to fill the position below:\n\nJob Position: Human Resources Executive\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Location: Ikoyi, Lagos\nEmployment Type: Full-time\nAvailability: Available to resume immediately\n\nJob Summary\n\n\n\tThe Human Resources Executive will be responsible for overseeing and implementing HR strategies, policies, and procedures to support the organization's growth and success.\n\tThis role will partner with management to drive business outcomes through effective talent management, employee engagement, and compliance.\n\n\nKey Responsibilities\n\n\n\tMonitor daily employee activities and follow up with team members to ensure productivity.\n\tCompile and share weekly/monthly performance reports with management.\n\tSupport employee evaluation processes and provide documentation for performance reviews.\n\tCommunicate HR policies clearly and ensure company guidelines are followed.\n\tMaintain accurate staff records, schedules, and administrative documentation\n\tDevelop and implement recruitment strategies, manage job postings, and oversee the hiring process\n\tFoster positive employee relations, handle employee grievances, and provide guidance on company policies.\n\tEnsure compliance with labor laws, regulations, and company policies.\n\n\nRequirements\n\n\n\tInterested candidates should possess a Bachelor`s Degree\n\t2 - 3 years of experience in a Human Resource role\n\tProven ability to source and hire the right candidates across various roles.\n\tBachelor's degree in Human Resources, Business, or related field.\n\tProven experience in HR roles, preferably in a similar industry.\n\tStrong knowledge of labor laws and regulations.\n\tExcellent communication, interpersonal, and problem-solving skills.\n\tA passion for building a strong, values-driven company culture.\n\n\nSalary\nN200,000 - N250,000 monthly.\n\nMethod of Application\nInterested and qualified candidates should send their application, including their resume and cover letter to: recruitment@owensxley.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]