[
  {
    "title": "Electrical Engineer Job at Kinetic Electromechanic Nigeria Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/electrical-engineer-job-at-kinetic-electromechanic-nigeria-limited",
    "pubDate": "Thu, 03 Jul 2025 09:17:56 GMT",
    "source": "JobGurus",
    "keyword": "kinetic electromechanic nigeria limited",
    "duplicate": false,
    "classifications": [],
    "content": "Kinetic Electromechanic Nigeria Limited - We are a renowned Building, Industrial, Engineering and Facility Management Company in Port Harcourt, Rivers State Nigeria. We offer Engineering solutions in Mechanical, Electrical, Instrumentation and Plumbing to our esteemed client.\n\nWe are recruiting to fill the position below:\n\nJob Position: Electrical Engineer\n\nJob Location: Port Harcourt, Rivers - Site & Head Office (as required)\nEmployment Type: Full-time\nDepartment: Engineering\nReports To: Project Manager / MEP Coordinator\n\nJob Purpose\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tCandidate will oversee the planning, design, and execution of electrical systems in mechanical, piping, and process-driven projects.\n\tThis includes supervision of site activities, ensuring electrical systems support fabrication, welding, and installation equipment, and ensuring compliance with standards, safety, and client specifications.\n\n\nResponsibilities\nDesign & Engineering Support:\n\n\n\tWill develop and interpret electrical designs and layouts for equipment powering pipe fabrication, welding stations, HVAC, lighting, and instrumentation.\n\tWill design power distribution systems, grounding, cable routing, and panel schedules.\n\tEnsure integration of electrical systems with mechanical and process units.\n\n\nSite Installation & Supervision:\n\n\n\tSupervise installation of electrical systems for\n\tWelding machines\n\tHeavy-duty equipment (grinders, cranes, compressors)\n\tLighting and power points\n\tControl panels and junction boxes\n\tEnsure correct load distribution, safety interlocks, and proper earthing.\n\n\nProject Planning & Execution:\n\n\n\tPrepare BOQs, technical specifications, and shop drawings.\n\tSupport procurement team with technical input on electrical materials.\n\tCoordinate with piping, mechanical, and civil teams for sequencing and interfacing.\n\n\nTesting, Commissioning & Maintenance:\n\n\n\tPerform loop checks, megger tests, and load trials on connected systems.\n\tCommission control systems for automated welding or fabrication machines.\n\tMaintain backup power systems (generators, UPS, etc.).\n\n\nDocumentation & Compliance:\n\n\n\tDevelop and maintain method statements, risk assessments, and QA/QC documentation.\n\tEnsure adherence to Nigerian Electrical Code, IEE, IEC, or NEC standards.\n\tLiaise with consultants and client inspectors for approvals.\n\n\nQualifications & Experience\n\n\n\tEducation: B.Sc./B.Eng. or HND in Electrical Engineering.\n\tExperience: 5 – 8 years in MEP, industrial fabrication, or construction projects.\n\tCertifications: COREN, NSE, or similar professional body is an advantage.\n\n\nSkills & Competencies:\n\n\n\tStrong knowledge of industrial electrical systems and controls.\n\tFamiliar with electrical safety standards, permit-to-work systems, and lock-out/tag-out.\n\tAbility to read P&IDs and work with Instrumentation & Control teams.\n\tProficient in AutoCAD, Revit MEP, and MS Excel.\n\tEffective leadership, problem-solving, and communication skills.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: careers@kineticelectromechanic.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Internal Credit Control Job at Agricare STD Plus Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/internal-credit-control-job-at-agricare-std-plus-limited",
    "pubDate": "Thu, 03 Jul 2025 09:17:56 GMT",
    "source": "JobGurus",
    "keyword": "agricare std plus limited",
    "duplicate": false,
    "classifications": [],
    "content": "Agricare STD Plus Limited is an agro allied company and sole distributor of standard agro-allied brands known for quality products. We have been in operation since 2006 and have contributed greatly to the success of many livestock farmers and other agro-allied establishments in Nigeria. We serve ourdiverse and unique clients all across Nigeria and beyond. With AGRICARE STD PLUS, business is more than just selling products, no matter the challenge, we focus on delivering practical and enduring results and equipping our customers with relevant information, products, and services that help them grow and thrive.\n\nWe are recruiting to fill the position below:\n\nJob Position: Internal Credit Control\n\nJob Location: Oyo\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Summary\n\n\n\tEnsuring an effective internal control environment through the development of adequate policies and procedures, debt recovery policies and procedures and ensuring their implementation and monitoring compliance.\n\tDesigning, documenting, implementing, assessing, and monitoring the internal control framework, including policies and risks\n\tEnsuring that there are adequate controls to prevent errors or misstatements in financial reporting as well as ensure compliance with policies, operational and administrative processes\n\tContribute towards establishing credible risk governance, an integrated risk management mindset, and an execution approach that prioritizes action based on business impact.\n\n\nJob Responsibilities\n\n\n\tPerform and control the audit cycle that includes risk management and control management over operation effectiveness, financial reliability and compliance with all applicable regulations\n\tDebt recovery functions within and outside Nigeria.\n\tDetermine internal audit scope and develop annual plans\n\tObtain, analyse and evaluate accounting documentation, reports, data, flowcharts, etc.\n\tReview and approve transactions in line with laid down policies.\n\tPrepare and present reports that reflect the audit results and document the procedure\n\tAct as an objective source of independent advice to ensure validity, legality and goal achievements\n\tIdentify loopholes and recommend risk aversion measures and cost savings\n\tConduct regular audits to assess the adequacy and effectiveness of the control environment, including: Assessing and appraising the company's operational procedures and compliance with policies and regulations.\n\tDeliver adequate and timely reporting on the internal control framework and control framework and control deficiencies to ensure appropriate prompt communication, documentation, and reports to the Management teams.\n\tImplement adequate and timely action plans and monitor progress to address and resolve control deficiencies.\n\tWork collaboratively with various departments, functions or process owners to implement and monitor remediation effect efforts resulting in internal control assessments, ensuring implementations of corrective measure.\n\tConduct special investigations of fraudulent malpractices across the organization.\n\n\nRequirements\n\n\n\tCandidates should possess a Bachelor's Degree with 3 - 6 years of work experience.\n\tProven knowledge of auditing standards and procedures, laws, rules, and regulations\n\tStrong knowledge of implementing policies and SOPs\n\tAdvanced computer skills in MS Office, accounting software –Sage 50\n\tAnalytical skills to study problems, record and identify solutions.\n\tCompetent interpersonal skills, demonstrating the ability to lead\n\tProven knowledge of risk management and control.\n\n\nMethod of Application\nInterested and qualified candidates should send their Applications / CV to: recruit@agricareplus.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Accounting Officer Job at Choice Talents NG",
    "link": "https://www.jobgurus.com.ng/jobs/view/accounting-officer-job-at-choice-talents-ng-1",
    "pubDate": "Thu, 03 Jul 2025 09:17:56 GMT",
    "source": "JobGurus",
    "keyword": "choice talents ng",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Choice Talents NG is Nigeria’s preferred talents management company. Our goal is to help build successful businesses through effective talent, resource and process management.\n\nWe are recruiting to fill the position below:\n\nJob Position: Accounting Officer\nJob Location: Ikoyi, Lagos\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAssist in preparing, examining, and analysing accounting records and other financial reports to assess accuracy, completeness, and conformance to reporting and procedural standards.\n\tAppraise, evaluate, and take inventory of company assets while maintaining an asset register.\n\tRecording, Reconcile, and Post Petty cash and Fuel imprest.\n\tReconciliation of payments and receipts\n\tConfirmation of customer deposits and Issuance of receipts\n\tManage all accounting transaction.\n\tAdministering payrolls and controlling income and expenditure\n\tAuditing financial information\n\tCompiling and presenting reports, budgets, business plans, commentaries and financial statements.\n\tAny other related tasks as may be assigned.\n\n\nRequirements\n\n\n\tHND / B.Sc Degree in Accounting, Finance, or a related field.\n\t2+ years of post NYSC experience in a relevant accounting role.\n\tExperience with accounting software is an added advantage.\n\tMust be analytical, pay attention to detail and excellent customer service.\n\tKnowledge and competency in accounting principles\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: jobs@choicetalents.com.ng using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Senior Golang Developer Job at Apex Network",
    "link": "https://www.jobgurus.com.ng/jobs/view/senior-golang-developer-job-at-apex-network",
    "pubDate": "Thu, 03 Jul 2025 09:17:56 GMT",
    "source": "JobGurus",
    "keyword": "apex network",
    "duplicate": false,
    "classifications": [
      "Software Engineering"
    ],
    "content": "Apex Network is a Financial servicing firm, where anyone anywhere can easily and securely transact Bitcoin, which is the future of Money and a catalyst for creating and open financial system in Africa and the World.\n\nWe are recruiting to fill the position below:\n\nJob Position: Senior Golang Developer\n\nJob Location: Lagos (Remote)\nEmployment Type: Full Time\n\nDescription\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are currently sourcing for a Senior Go Developer, as a Senior Go- Dev, you will lead the design and development of our core micro-services ecosystem.\n\tYou’ll collaborate closely with our product, design, and QA teams to build resilient, high-performance APIs and services.\n\tArchitect, build, and maintain backend services and APIs in Go (Golang)\n\tWrite unit, integration, and end-to-end tests to ensure code quality\n\tCollaborate in code reviews, knowledge-sharing sessions, and technical discussions\n\tDesign and implement microservices with strong focus on scalability and reliability\n\tOptimize performance, memory usage, and concurrency patterns\n\tMentor and guide junior and mid-level engineers on Go best practices\n\tParticipate in DevOps activities: CI/CD pipelines, containerization (Docker/Kubernetes)\n\n\nRequirements\nThese are knowledge, Experience and skill you must have :\n\n\n\t 5+ years of professional experience developing applications in Go\n\tDeep understanding of Go idioms, concurrency (goroutines, channels), and memory management\n\tProven experience designing RESTful APIs and/or gRPC services\n\tStrong background with SQL and/or NoSQL databases (PostgreSQL, MySQL, MongoDB, Redis)\n\tHands-on with containerization tools (Docker) and orchestration platforms (Kubernetes)\n\tSolid understanding of version control (Git), agile workflows, and CI/CD pipelines\n\tExcellent problem-solving skills and attention to detail\n\tEffective communication skills and a collaborative mindset.\n\n\nThe following will set you apart of from other candidates:\n\n\n\tProfessional experience with Laravel or other PHP frameworks\n\tBackground in the fintech or e-commerce domains\n\tFamiliarity with cloud platforms (AWS, GCP, Azure)\n\tKnowledge of event-driven architectures (Kafka, NATS)\n\tExperience with monitoring, logging, and tracing tools (Prometheus, Grafana, Jaeger)\n\n\nBenefits\n\n\n\tCompetitive salary\n\tFlexible working hours and remote?first culture\n\tComprehensive health insurance package\n\tCollaborative and inclusive team environment\n\tTop Notch Work Tools\n\t13th Month Allowances\n\tPaid- Time Off\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]