[
  {
    "title": "Logistics Executive Job at Me Cure Industries Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/logistics-executive-job-at-me-cure-industries-limited",
    "pubDate": "Tue, 03 Jun 2025 11:37:00 GMT",
    "source": "JobGurus",
    "keyword": "me cure industries limited",
    "duplicate": false,
    "classifications": [],
    "content": "Me Cure Industries Limited strives to provide innovative healthcare solutions to our clients. We convert the promise of modern day technology and expert care into the services that have the power to restore health and save lives.\n\nWe are recruiting to fill the position below:\n\nJob Position: Logistics Executive\n\nJob Location: Lagos\n\nRole Overview\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tResponsible for the end-to-end logistics operations for our shipment with various stakeholders, including customs authorities, freight forwarders, and internal teams, to facilitate smooth operations while ensuring that shipments are handled efficiently, compliant with regulations and delivered in a timely manner.\n\n\nDuties and Responsibilities\n\n\n\tOptimize transportation routes and distribution networks in collaboration with internal departments and external partners.\n\tEnsure adherence to industry regulations and standards, including Good Distribution Practice (GDP) and Good Manufacturing Practice (GMP).\n\tImplement changes to operations to maintain compliance with up-to-date regulations.\n\tOversee handling and transportation of products to meet quality assurance standards.\n\tPrepare and submit documentation for customs clearance, including invoices, shipping manifests, and certificates of origin.\n\tEnsure compliance with local and international customs regulations and standards.\n\tMaintain accurate records of clearing and forwarding activities for audit and reference.\n\tTrack product movements and ensure accurate record-keeping.\n\tNegotiate contracts and monitor performance to meet service level agreements (SLAs).\n\tCollaborate with freight forwarders, shipping lines, and other logistics providers for efficient operations.\n\tCoordinate the transportation of goods from origin to destination, including arranging shipping, handling, and warehousing.\n\tTrack and monitor shipments to ensure timely delivery and address logistical challenges.\n\tAddress and resolve logistics-related issues such as delays, damages, and discrepancies.\n\tCommunicate with suppliers, customers, and internal teams to provide updates and resolve shipment-related concerns.\n\tIdentify and address problems related to customs, forwarding, or logistics effectively.\n\n\nMethod of Application\nInterested and qualified candiates should send their Applications to: hr@mecure.com.ng using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Procurement Officer Job at Society for Family Health (SFH)",
    "link": "https://www.jobgurus.com.ng/jobs/view/procurement-officer-job-at-society-for-family-health-sfh",
    "pubDate": "Tue, 03 Jun 2025 11:37:00 GMT",
    "source": "JobGurus",
    "keyword": "society for family health (sfh)",
    "duplicate": false,
    "classifications": [],
    "content": "Society for Family Health (SFH) is a Nigerian non-governmental organisation (NGO) working in partnership with communities, government, donors and the private sector for universal health coverage and social justice of all Nigerians.\n\nWe are recruiting to fill the position below:\n\nJob Position: Procurement Officer\n\nJob Location: Abuja\nJob Type: Full Time \n\nJob Description\n\n\n\tProcurement of goods and services\n\tProcurement documentation\n\tMonitoring and evaluation of procurement\n\tLiaising and vendor management.\n\n\nTechnical:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tProficiency in the use of the following software; SAP ERP, MS Excel, MS Word\n\tProcurement and contract management\n\t?Vendor Management.\n\n\nRequirements\n\n\n\tFirst Degree in Social Sciences, Business Administration, Health Sciences\n\tMaster’s degree in Health Policy, MPH, Health Management, Social Sciences, Nursing or related fields will be an advantage\n\tCIPS certified will be an added advantage.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Human Resources and Administrative Officer Job at Clinix Healthcare",
    "link": "https://www.jobgurus.com.ng/jobs/view/human-resources-and-administrative-officer-job-at-clinix-healthcare",
    "pubDate": "Tue, 03 Jun 2025 11:37:00 GMT",
    "source": "JobGurus",
    "keyword": "clinix healthcare",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Clinix Healthcare has 40 years of qualitative experience in Medical and Diagnostic services with over 120 centers across Africa. The state-of-the art Diagnostic Centre represents a milestone towards fulfilling Clinix strategic objectives in providing a world class integrated health system that ensures excellence in health and healthcare for all as a globally recognized destination for healthcare. Clinix Healthcare Nigeria is the first investment in West Africa. The Principal investor is Greenlife Pharmaceuticals and Bliss Gvs Pharmaceuticals. Both companies have outstanding repute in the Nigerian Healthcare industry.\n\nWe are recruiting to fill the position below:\n\nJob Position: Human Resources and Administrative Officer\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Location: Ilupeju, Lagos\nJob Type: Full-time\n\nRequirements\n\n\n\tDegree in management or business administration\n\tMust be computer literate and conversant with basic hr software\n\tAny completed and relevant independent courses on hr administrator\n\tPossesses basic analytic, management and interpersonal skills\n\tMinimum of two years experience working in a medical facility is an added advantage.\n\tNot more than 25 years of age.\n\n\nMethod of Application\nInterested and qualified candidates should send their Applications to: Hr@clinixhealthcare.com.ng using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Senior Accountant Job at DGIC International Business Services Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/senior-accountant-job-at-dgic-international-business-services-limited",
    "pubDate": "Tue, 03 Jun 2025 11:37:00 GMT",
    "source": "JobGurus",
    "keyword": "dgic international business services limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "DGIC International Business Services Limited is the business unit of the Delegation of German Industry and Commerce in Nigeria (known as AHK Nigeria). DGIC International Business Services Ltd facilitates bilateral trade and investment relations between Nigeria and Germany. It is the contact point for all German companies that wish to establish business relations in Nigeria and vice-versa.\n\nWe are recruiting to fill the position below:\n\nJob Position: Senior Accountant\n\nJob Location: Lagos (Hybrid)\nJob Schedule: Full-time\nStart Date: 01 July 2025\n\nRole Overview\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAs a Senior Accountant, you will play a key role in supporting the Finance and Administration Department by ensuring the accuracy and integrity of financial information.\n\tYour obligation will include preparing financial reports, performing account reconciliations, maintaining the general ledger and assisting in the preparation of tax returns.\n\tYou will also contribute to audit readiness and execution, while taking on various accounting duties as assigned to support overall departmental goals and compliance requirements.\n\n\nKey Responsibilities\n\n\n\tReport directly to the Head of Finance, while also collaborating closely with the General Manager and Director.\n\tPerform accurate and timely bookkeeping & data entry to maintain up-to-date financial records.\n\tSupport the preparation of monthly and quarterly financial reports for both local and international stakeholders.\n\tAssist in the development of budgets and the preparation of ad hoc financial reports as required.\n\tManage invoicing for ongoing projects and generate revenue reports to support financial tracking.\n\tAid in the preparation and submission of tax filings and ensure compliance with statutory requirements.\n\tContribute to the development and continuous improvement of processes within the Finance and Administration Department.\n\tMonitor and manage credit to ensure healthy cash flow and minimize financial risk.\n\tCoordinate with external auditors and tax consultants to facilitate annual audits and tax filings.\n\tEnsure all financial practices comply with International Financial Reporting Standards (IFRS), Generally Accepted Accounting Principles (GAAP), and specific guidelines from DHIK.\n\tPerform additional duties as assigned, in alignment with the scope of the role and Organizational needs.\n\n\nRequirements\n\n\n\tBachelor’s degree in accounting, Banking and Finance, Economics, or a related field.\n\tA minimum of 2-3 years of experience in Accounting.\n\tExcellent knowledge of MS Office, particularly with Excel.\n\tRelevant Accounting Certifications such as ACCA, CFA, ACA, ICAN (is an added advantage).\n\tProficiency in Accounting software e.g. QuickBooks and Sage.\n\tExcellent organizational and multi-tasking skills.\n\tExceptional verbal and written communication abilities, coupled with strong interpersonal skills.\n\tProficient in conducting in-depth financial analysis to support strategic decision-making.\n\n\nWhat We Offer\n\n\n\tCompetitive compensation.\n\tHealth insurance & retirement plan.\n\tFlexible working hours (up to 3 days of remote work per week).\n\tOpportunities for professional development.\n\tDynamic international team environment.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV / Resume, a cover letter highlighting your relevant experience, interest in the role and salary expectations and copies of their Academic and Professional credentials to: hr@lagos-ahk.de using “Application for the role of Senior Accountant\" as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Accountant Job at Glyde Lubricants Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/accountant-job-at-glyde-lubricants-limited",
    "pubDate": "Tue, 03 Jun 2025 11:37:00 GMT",
    "source": "JobGurus",
    "keyword": "glyde lubricants limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Glyde Lubricants is one of the fastest-growing independent lubricants producers in Nigeria. We are endowed with highly motivated and enthusiastic professionals driven by a vision to excel in the production of quality products and services.\n\nWe are recruiting to fill the position below:\n\nJob Position: Accountant \n\nJob Location: Lagos, Nigeria\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Finance Manager will be responsible for overseeing the financial health of the company.\n\tThis includes planning, analysis, controls, compliance, and reporting.\n\tThe ideal candidate is not just good with numbers but can design scalable finance systems, guide budgeting, manage risk, and support management with actionable insights.\n\tThis role requires hands-on execution and strategic thinking in equal measure.\n\n\nKey Responsibilities\nFinancial Planning & Analysis:\n\n\n\tDevelop and manage budgets, forecasts, and financial models.\n\tConduct monthly variance analysis and prepare management reports.\n\tProvide strategic recommendations to support business decisions, expansion, and cost-saving.\n\n\nCash Flow & Treasury Management:\n\n\n\tMonitor daily cash flow and manage bank relationships.\n\tOversee accounts payable, receivable, and working capital.\n\tEnsure optimal liquidity and proper allocation of resources.\n\n\nAccounting & Bookkeeping Oversight:\n\n\n\tSupervise accurate bookkeeping, general ledger, and financial statements.\n\tReview reconciliations, journals, and month-end/year-end close processes.\n\tEnsure accounting records comply with regulatory and internal standards.\n\tLiaise with external auditors, tax consultants, and regulatory agencies.\n\tImplement internal controls and risk management procedures to protect company assets.\n\n\nCosting & Profitability Management:\n\n\n\tWork closely with production and operations teams to track product costings.\n\tMonitor COGS, profit margins, and cost efficiency across departments.\n\tSupport pricing decisions with accurate financial data.\n\n\nTeam Leadership & Collaboration:\n\n\n\tSupervise junior accountants and finance officers.\n\tCollaborate with HR, sales, logistics, and operations on cross-functional initiatives.\n\tDrive adoption of digital tools and ERP systems where relevant.\n\n\nQualifications\n\n\n\tBachelor's degree or higher in Finance or related field 5 - 7 years of relevant experience\n\tFluency in the Microsoft Office suite (Outlook, Excel, Word, PowerPoint)\n\tDetailed Oriented and highly analytical\n\tICAN, ACCA, or other professional certification (fully or partly qualified).\n\tMBA or additional finance certification is an added advantage.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: nnekaezeasor9@gmail.com cc: isioma.ighodalo@glydelubricants.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]