[
  {
    "title": "Hospitality Manager Job at A&R Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/hospitality-manager-job-at-ar-group",
    "pubDate": "Tue, 03 Jun 2025 09:17:22 GMT",
    "source": "JobGurus",
    "keyword": "a&r group",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "A&R Group is a young Nigerian conglomerate company operating in the real estate, hospitality, mining and construction industries.\n\nWe are recruiting to fill the position below:\n\nJob Position: Hospitality Manager\nJob Location: Lagos\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tOversee daily operations of a hotel, resort, restaurant, or hospitality venue.\n\tEnsure excellent customer service and guest satisfaction.\n\tHandle guest complaints and resolve issues promptly.\n\tEnsure compliance with health, safety, and licensing regulations.\n\tManage staff, including hiring, training, and scheduling.\n\tMonitor budgets, expenses, and revenue to maximize profitability.\n\tCoordinate with marketing teams to promote services and attract customers.\n\n\nRequirements\n\n\n\tOND/HND/ Bachelor’s degree in Hospitality Management, Business Administration, or related field (preferred).\n\tProven experience in hospitality management (5+ years).\n\tStrong leadership and communication skills.\n\tComputer Knowledge and knowledge of industry software (e.g., PMS, POS systems).\n\tAbility to work flexible hours, including weekends/holidays.\n\n\nRemuneration\n\n\n\tSalary: N300,000 - N400,000 per month. \n\tBenefits: Housing / Accomodation Benefit.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: argroupnigeria@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Personal Assistant Job at Howbury School",
    "link": "https://www.jobgurus.com.ng/jobs/view/personal-assistant-job-at-howbury-school",
    "pubDate": "Tue, 03 Jun 2025 09:17:22 GMT",
    "source": "JobGurus",
    "keyword": "howbury school",
    "duplicate": false,
    "classifications": [],
    "content": "Howbury School is a family oriented Nursery, Primary and Secondary school located in a serene environment in Mende, Maryland, Lagos. We arecommitted to building a firm foundation for thechild's lifelong learning by deploying a value based system of learning, instilling a sense of respect and responsibility for each child and working in partnership with the home front. The integration of up to date technology comes natural to us as the goal is to raise a generation learners that areable to apply their classroom learning with the integration of technology in solving real life problems.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Personal Assistant\nJob Location: Maryland, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tAs the Personal Assistant to the School Director, the candidate is generally responsible for managing the Director’s diary and itinerary to ensure she operates seamlessly. The job holder's core duty is to ensure the Director functions optimally.\n\tThe ideal candidate must be highly professional and reliable, with the ability to manage time and multi task effectively. The ability to utilize technology is a key requirement for this role.\n\n\nResponsibilities\nHere are some of the duties you will be responsible for:\n\n\n\tActing as the first point of contact to the School Director\n\tManaging the School Director’s diary; scheduling various meetings, ensuring schedules are well planned and prioritised.\n\tArranging appointments with parents if required\n\tScheduling routine prompts on the School Director’s calendar on important tasks and deadlines\n\tSupporting the Director with varying tasks to ensure she remains organized and efficient\n\tImplementing and maintaining various office procedures for smooth operation of the Director\n\tCollating, filing and managing various data that will help the School Director’s efficiency\n\tSourcing assessment questions, ensuring they are promptly sent for printing\n\tOrganising meetings and appointments. Disseminating notices in a timely manner.\n\tGenerating various communications, reports, briefs, and correspondence from the School Director’s Office as may be required\n\tTaking and storing minutes of meetings\n\tProviding general oversight for Howbury Tech staff to ensure adherence to school procedures\n\tCollating, storing and analyzing various data in digital form\n\tOther duties are associated with the School Director’s office.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: talent@howburyschool.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Female Administrative Officer Job at Jobvet Services",
    "link": "https://www.jobgurus.com.ng/jobs/view/female-administrative-officer-job-at-jobvet-services",
    "pubDate": "Tue, 03 Jun 2025 09:17:22 GMT",
    "source": "JobGurus",
    "keyword": "jobvet services",
    "duplicate": false,
    "classifications": [],
    "content": "Jobvet Services - Our client, a Microfinance Bank, is recruiting suitably qualified candidates to fill the position below:\n\nJob Position: Female Administrative Officer\nJob Location: Garki, Abuja (FCT)\nEmployment Type: Full-time\nWork Days: Monday-Friday\n\nResponsibilities\n\n\n\tManage daily administrative tasks and office operations\n\tHandle customer inquiries and support account management\n\tAssist with documentation for loan applications and account openings\n\tEnsure smooth coordination between departments to meet organizational goals\n\n\nRequirements\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tMinimum Qualification: B.Sc/HND\n\tStrong organizational and communication skills\n\tAbility to work independently and multitask effectively\n\tBasic computer proficiency and attention to detail.\n\n\nSalary\nN85,000 - N120,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: jobvet24@gmail.com using the Job Position  as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Internal Control and Audit Officer Job at Jamub Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/internal-control-and-audit-officer-job-at-jamub-group",
    "pubDate": "Tue, 03 Jun 2025 09:17:22 GMT",
    "source": "JobGurus",
    "keyword": "jamub group",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Jamub Group is a conglomerate of different companies duly registered in line with relevant laws of the Federal Republic of Nigeria, the attribute of which makes us a non-cyclical organisation. Established to deliver solutions in the various areas of our business interests, our delivery model spans Business to Business (B2B), Business to Government (B2G) and Business to Consumer (B2C) in the economic value chain with a range of products and services which cut across the industries.\n\nWe are recruiting to fill the position below:\n\nJob Position: Internal Control and Audit Officer\n\nJob Location: Abuja (FCT)\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Internal Control and Audit Officer is responsible for evaluating and improving the effectiveness of internal controls, risk management, and governance processes within the organization.\n\tThis role involves conducting audits, analysing business processes, and ensuring compliance with internal policies and external regulations.\n\tThe role requires a thorough understanding of financial reporting, risk assessment, and process improvement.\n\n\nResponsibilities\n\n\n\tConduct periodic risk assessment to identify operational and financial risks and recommend risk-mitigating measures.\n\tIdentify gaps and recommend internal control measures, including to appraise the adequacy of control systems.\n\tEnsure protection of the organization’s assets against fraud and theft.\n\tVerify the accuracy of financial statements, reports, accounting system.\n\tEnsure compliance to regulatory requirements, corporate policies and procedures.\n\tInvestigate identified and reported cases, including following up to ensure timely resolution.\n\tPrepare audit reports and communicate findings in a timely manner.\n\tVerify the validity and certainty of goal achievement.\n\tParticipate in the development and implementation a detailed audit plan.\n\tRecommend or provide requisite guidance on control for effectiveness and efficiency of operations.\n\tOther responsibilities as assigned.\n\n\nRequirements\n\n\n\tBachelor’s Degree or equivalent in Accounting, Finance, Economics or a relevant field.\n\tMinimum of 3 years of experience in a similar position.\n\tProfessional certification (ICAN, ACCA, CIA) is an added advantage.\n\tIn-depth understanding of accounting and auditing standards.\n\tHands on experience with relevant software and proficiency in Microsoft Office Suite.\n\tStrong analytical skills with attention to detail.\n\tAbility to maintain objective view and confidentiality.\n\tCommitment to ethical standards and high level of personal and professional integrity.\n\tProactive approach to problem-solving.\n\tProfessional level verbal and written communication with good report writing and presentation skills.\n\tAbility to handle multiple tasks in a dynamic and fast-paced environment.\n\tAbility to work independently with little or no supervision.\n\tGood interpersonal and organizational skills.\n\n\nMethod of Application\nInterested and qualified candidates should send their Applications, including Resume and a Cover Letter to: jobs@jamubgroup.com using \"Internal Control and Audit Officer\" as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]