[
  {
    "title": "Site Manager (Civil Engineer) Job at Architrave Nigeria Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/site-manager-civil-engineer-job-at-architrave-nigeria-limited",
    "pubDate": "Wed, 11 Jun 2025 13:51:13 GMT",
    "source": "JobGurus",
    "keyword": "architrave nigeria limited",
    "duplicate": false,
    "classifications": [],
    "content": "Architrave Nigeria Limited is a design and build company dedicated to the development of the environment.\n\nWe are recruiting to fill the position below:\n\nJob Position: Site Manager (Civil Engineer)\nJob Location: Ikoyi, Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a highly skilled and experienced Site Manager - Civil Engineer with a building construction bias to join our team.\n\tThe ideal candidate must have extensive experience working on framed projects, specifically on buildings with raft foundation. It is essential that the candidate has previous experience working with a major construction firm.\n\n\nKey Responsibilities\n\n\n\tOversee and manage all aspects of the construction site, ensuring that projects are completed on time and within budget\n\tCoordinate with project managers, engineers, architects, and subcontractors to ensure smooth workflow and communication\n\tMonitor and enforce compliance with all safety regulations and procedures on the construction site\n\tConduct regular site inspections to ensure work is being carried out according to plans and specifications\n\tManage and coordinate manpower and equipment resources to maximize efficiency and productivity\n\tCommunicate regularly with stakeholders and provide updates on project progress\n\tResolve any issues or conflicts that may arise on the construction site in a timely and effective manner\n\n\nQualifications and Required Skills\n\n\n\tBachelor's degree in Civil Engineering or related field\n\t6 years of proven experience working on high-quality building projects\n\tMust be COREN registered\n\tPrevious experience working with a major construction firm is a must\n\tStrong project management and leadership skills\n\tExcellent communication and interpersonal skills\n\tAbility to work well under pressure and meet tight deadlines\n\tKnowledge of construction industry best practices and regulations\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hr@architrave-ng.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]