[
  {
    "title": "Operations Officer Job at Greystone Consulting Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/operations-officer-job-at-greystone-consulting-limited",
    "pubDate": "Mon, 23 Jun 2025 18:49:44 GMT",
    "source": "JobGurus",
    "keyword": "greystone consulting limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Greystone Consulting Limited - Our client is recruiting to fill the position below:\n\nJob Position: Operations Officer\n\nJob Location: Gbagada, Lagos\nEmployment Type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tOur client is looking for an Operations Officer who would be responsible for ensuring the smooth and efficient daily operations of the business, optimizing workflow, managing inventory, and supporting financial and customer service processes.\n\tThis role plays a key part in maintaining quality standards, streamlining production and enhancing overall business performance.\n\n\nDuties/ Responsibilities\nOperations & Process Management:\n\n\n\tOversee daily baking, decorating, and dessert catering workflows to ensure efficiency.\n\tImplement Standard Operating Procedures (SOPs) for production, inventory, and logistics.\n\tIdentify and resolve bottlenecks in production and order fulfilment.\n\tEnsure adherence to health, safety and food-handling regulations.\n\n\nInventory & Supply Chain Management:\n\n\n\tManagement of stock levels of baking ingredients, packaging materials and supplies\n\tCoordinates with vendors and suppliers to ensure timely restocking and cost control\n\tTrack and minimise ingredient waste and spoilage.\n\n\nCustomer Order & Delivery Coordination:\n\n\n\tEnsure smooth handling of customer orders from processing to fulfilment.\n\tCoordinate timely deliveries for event catering, custom cakes and daily orders\n\tWork with customer service to resolve customer complaints and ensure a great customer experience.\n\tAny unresolved complaints should be directed to the Managing Director.\n\n\nFinancial & Budgeting Support:\n\n\n\tMonitor operational expenses and cost control strategies.\n\tTrack and report financial performance related to supplies, production and deliveries\n\tWork with the finance team to ensure accurate pricing, invoicing and cost analysis\n\n\nTeam Management & Performance Monitoring:\n\n\n\tOversee bakers, decorators and the order management process to ensure productivity and adherence to deadlines.\n\tMaintain and analyze end-of-day reports from the baking and decorating teams.\n\tSupport in hiring, training, and performance management of team members.\n\n\nQuality Control & Compliance:\n\n\n\tEnsure all cakes, desserts, and treats meet Dara's BAKES n Cakes' quality standards\n\tImplement corrective actions to maintain consistency and customer satisfaction.\n\n\nTechnology & Tool Management:\n\n\n\tUtilize Zoho CRM, Zoho Books, Zoho Inventory and Zoho Sales IQ for operational efficiency.\n\tMaintain accurate records of sales, inventory and expenses using digital tools.\n\n\nExperience / Qualifications\n\n\n\tCandidate must possess a minimum of a Bachelor's Degree / HND in Business Operations Management, Food Science, related courses, and Previous experience in a similar role, preferably in the food industry. Must have strong customer service and team management skills.\n\n\nKey Skill Sets:\n\n\n\tOrganisation & Management skills\n\tProfessional in relating to people\n\tCommunication and interpersonal skills\n\tProcess improvement and Optimization\n\tAnalytical & problem-solving skills\n\tGood time management & optimisation\n\tAdaptability & Crisis Management\n\tFinancial & Budgeting skills.\n\n\nWork Tools:\n\n\n\tComputer applications, i.e Excel, Word, PowerPoint\n\tCustomer Relationship Management (CRM), Inventory application, Time Management Applications,\n\tProject & Task Management Tools.\n\n\nMethod of Application\nInterested and qualified candidates can send their CVs to: Consultgreystone@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Media Manager Job at Prixair Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/media-manager-job-at-prixair-group-1",
    "pubDate": "Mon, 23 Jun 2025 18:49:44 GMT",
    "source": "JobGurus",
    "keyword": "prixair group",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Prixair Group is a dynamic and diversified company committed to excellence across various industries including hospitality, beauty, events, logistics, media, and lifestyle services. With a passion for delivering world-class experiences, Prixair has built a strong reputation for quality, professionalism, and innovation.\n\nDriven by a customer-first philosophy, Prixair Group continuously sets industry benchmarks through exceptional service delivery, operational efficiency, and a dedicated workforce. Our diverse portfolio of brands works seamlessly together to provide top-tier solutions that meet the evolving needs of individuals and organizations.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Media Manager\nJob Location: Gaduwa, Abuja (FCT)\nEmployment Type: Full-time\nReports To: COO\nDepartment: Media & Communications / Production\n\nJob Summary\n\n\n\tThe Media Manager is responsible for planning, coordinating, and overseeing all media operations, including equipment handling, sound, lighting, videography, content production, post-production, and media advertising.\n\tThis role ensures the delivery of high-quality media content across various platforms while managing the media team and resources effectively.\n\n\nKey Responsibilities\nMedia Production & Management:\n\n\n\tSupervise all aspects of media production — from pre-production to post-production.\n\tManage audio-visual equipment, lighting, sound systems, and cameras.\n\tOversee live recordings, studio shoots, and outdoor video productions.\n\tCoordinate the scheduling of shoots, content creation, and production timelines.\n\tEnsure smooth post-production processes including editing, color grading, and sound mixing.\n\n\nTeam Leadership:\n\n\n\tLead and coordinate a team of videographers, sound engineers, editors, and creatives.\n\tProvide direction during shoots and ensure content meets quality and brand standards.\n\tTrain and support junior media team members.\n\n\nTechnical Operations:\n\n\n\tMaintain and troubleshoot all media equipment (cameras, lights, mics, mixers, etc.).\n\tEnsure backup systems are in place for sound, lighting, and recordings.\n\tManage media file storage, backup, and content delivery systems.\n\n\nMarketing & Advertising:\n\n\n\tCollaborate with marketing and advertising teams to create visual content for campaigns.\n\tOversee production of promotional videos, social media content, adverts, and branded visuals.\n\tEnsure media aligns with the overall communication and branding strategy.\n\n\nContent Oversight:\n\n\n\tManage content calendars and media release schedules.\n\tReview and approve final outputs before publishing or airing.\n\n\nBudgeting & Resource Management:\n\n\n\tPrepare media production budgets and track expenses.\n\tSource and manage vendors, freelancers, and third-party production crews when needed.\n\n\nQualifications\n\n\n\tBachelor’s degree in Media Production, Mass Communication, Film, or related field.\n\t8-12 years of experience in media production, broadcasting, or creative direction.\n\tProficient with media tools: Adobe Premiere Pro, After Effects, Final Cut Pro, DaVinci Resolve, etc.\n\tStrong knowledge of sound design, lighting setup, camera operations, and post-production.\n\tExperience with both studio and field production environments.\n\tExcellent organizational and leadership skills.\n\tCreativity, attention to detail, and the ability to meet tight deadlines.\n\n\nPreferred Skills:\n\n\n\tDrone operation\n\tSocial media content strategy\n\tMotion graphics or animation basics\n\tPhotography knowledge\n\tLivestreaming experience.\n\n\nMethod of Application\nInterested and qualified candidates should forward their CVs to: amandaosifoedwards@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Digital Executive Job at Ascentech Services Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/digital-executive-job-at-ascentech-services-limited",
    "pubDate": "Mon, 23 Jun 2025 18:49:44 GMT",
    "source": "JobGurus",
    "keyword": "ascentech services limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Ascentech Services Limited is a full-fledged Human Resource Solution Provider incorporated in 2013 with its Head Office in Lagos, Nigeria. We are committed to forging long-term partnerships with our clients by creating and delivering robust and flexible services that address the changing needs of their business.\n\nWe are recruiting to fill the position below:\n\nJob Position: Digital Executive\n\nJob Location: Surulere, Lagos\nEmployment Type: Full-time\n\nAbout the Role\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe’re looking for a savvy, strategic, and hands-on Digital Executive who will be responsible for elevating our digital presence and driving strong online performance across social platforms.\n\tThe ideal candidate is deeply passionate about digital trends, data-driven strategies, and crafting engaging consumer experiences that convert. Experience working across multiple African markets is a strong advantage.\n\n\nKey Responsibilities\n\n\n\tLead and execute the brand’s digital strategy across all channels (social media, website, email marketing).\n\tDrive performance marketing campaigns to drive online engagement and grow online presence.\n\tManage the planning, scheduling, and analysis of all social media platforms, including community management.\n\tCollaborate with internal teams (creative, brand, trade) and external partners (agencies, influencers, e-commerce platforms).\n\tMonitor digital trends, performance analytics, and consumer insights to inform strategy and refine execution.\n\tEnsure brand consistency and tone of voice across all online touchpoints.\n\n\nRequirements\n\n\n\t3+ years of proven experience in digital and content marketing.\n\tStrong grasp of digital platform (Meta, TikTok, YouTube, WhatsApp, Pinterest etc.).\n\tExperience growing and managing brand presence online across multiple countries.\n\tExceptional communication, storytelling, and copywriting skills.\n\tAbility to work cross-functionally and juggle multiple digital campaigns at once.\n\n\nGood to have:\n\n\n\tExperience managing digital campaigns or platforms across African markets (e.g., Ghana, Kenya, South Africa).\n\tPrior experience with regional adaptation of content and digital strategy for culturally diverse African audiences.\n\tA deep understanding of the beauty and lifestyle consumer space in Africa.\n\tPreviously working in a digital agency.\n\n\nWhat We Offer\n\n\n\tA vibrant, creative work environment where innovation is encouraged.\n\tThe chance to shape the digital future of a brand loved across the continent.\n\tGrowth opportunities across a fast-expanding international team.\n\n\nMethod of Application\nInterested and qualified candidates can send their CV to: cv@ascentech.com.ng using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Tele-Collections / Debt Recovery Officer (Entry-Level) Job at Mwanga Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/tele-collections-debt-recovery-officer-entry-level-job-at-mwanga-limited",
    "pubDate": "Mon, 23 Jun 2025 18:49:44 GMT",
    "source": "JobGurus",
    "keyword": "mwanga limited",
    "duplicate": false,
    "classifications": [],
    "content": "Mwanga is a pioneertech-driven debt recovery and businesssupport outsourcing company with a vision to be the leading extension to global teams in Africa.We started our pilot operations in 2018 witha small agile teamand have scaledimpressively since then in results and teambecoming trusted by key players for recoveries in Nigeria.We offer business support to businesses with the aim of helping them scale using ethical and innovative technology strategies. We are trusted by Africa’s leading lenders to recover their outstanding debts and to scale our impact.We provide a range of services ranging from debt recovery, telemarketing, call center outsourcing, virtual assistant services, customer support services, and data analysis.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Tele-Collections / Debt Recovery Officer (Entry-Level)\n\nJob Location: Maryland, Lagos (Proximity required)\nEmployment Type: Full-time\nWork Mode: On-site\n\nResponsibilities\n\n\n\tRecover overdue loans by contacting customers.\n\tFollow up on payment commitments and maintain accurate records.\n\tAdvise on payment options and negotiate plans.\n\n\nRequirements\n\n\n\tMinimum qualification of OND / HND / B.Sc Degree\n\t0 - 1 year of customer support experience (is an added advantage).\n\tStrong communication, negotiation, and teamwork skills.\n\tGood command of English.\n\tProactive, teachable, and detail-oriented.\n\tClose proximity to Maryland is a must.\n\n\nRemuneration\n\n\n\tSalary: N70,000 monthly + Commission on Recovery.\n\tBenefits: 13th Month Payment and Other Benefits.\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Office Assistant Job at LEAM Consulting",
    "link": "https://www.jobgurus.com.ng/jobs/view/office-assistant-job-at-leam-consulting",
    "pubDate": "Mon, 23 Jun 2025 18:49:44 GMT",
    "source": "JobGurus",
    "keyword": "leam consulting",
    "duplicate": false,
    "classifications": [],
    "content": "LEAM Consulting is the foremost consulting firm which stands out in areas of professional certification training, HR advisory services, Business Development / Startup and IT consulting services in Nigeria. We are recruiting agency with years of professional experience.\n\nWe are recruiting to fill the position below:\n\nJob Position: Office Assistant\nJob Location: Akala Express, Ibadan, Oyo\nEmployment Type: Full-time\n\nJob Brief\n\n\n\tAs a Customer Representative, you are responsible for managing customer queries and complaints, and ensure utmost delivery.\n\n\nJob Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tManage incoming phone calls and messages.\n\tIdentify and assess customers’ needs to achieve satisfaction.\n\tHandle customer complaints, provide appropriate solutions/alternatives within the time limits and follow up to ensure resolution.\n\n\nRequirements\n\n\n\tOND/HND/B.Sc in any relevant field.\n\tMinium of 1 year of experience as a customer representative or any related role.\n\tExperience working in a logistics company.\n\tRelationship management skills and openness to feedback.\n\n\nSalary\nN60,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: recruitment@leamconsulting.com using the Job Position as the subject of the mail.\n\nNote: For further enquiries, message 09022167744 on Whatsapp.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]