[
  {
    "title": "General Manager Job at DreamCity Property & Investment Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/general-manager-job-at-dreamcity-property-investment-limited-4",
    "pubDate": "Tue, 24 Jun 2025 13:30:58 GMT",
    "source": "JobGurus",
    "keyword": "dreamcity property & investment limited",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance"
    ],
    "content": "DreamCity Property & Investment Limited remains at the vanguard of residential and commercial real estate development across major cities in Nigeria delivering reliable structures with qualified infrastructure, luxury apartments in highbrow cities, and commercial real estate with good returns for our investors, who have over time become part of our success story.\n\nWe are recruiting to fill the position below:\n\nJob Position: General Manager\n\nJob Location: Jabi, Abuja (FCT) and Victoria Island,Lagos\nEmployment Type: Full-time (Onsite)\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAre you an accomplished professional with a wealth of experience in administration, HR, marketing, business development, construction site supervision, and real estate management?\n\tAre you ready to take the lead and drive success in the ever-evolving world of real estate and property construction? If so, we have a fantastic opportunity for you!\n\tAt DreamCity Group, a leading real estate and property construction company, we are seeking a highly skilled and motivated General Manager to oversee our operations, drive growth, and ensure excellence in all aspects of our business.\n\tWe are looking for an individual with at least 7 years of experience in the industry and a strong track record of success.\n\n\nResponsibilities\n\n\n\tOversee administration, HR, Sales, marketing, business development, construction site supervision, and real estate management functions.\n\tDevelop and maintain strong relationships with clients, stakeholders, and partners to drive target sales results, business growth and secure new opportunities.\n\tSales strategy development, lead generation and management, sales forecasting and reporting and sales targets achievement\n\tMonitor and analyze market trends, identify new market segments, and develop innovative strategies to expand our business footprint.\n\tEnsure exceptional project execution by overseeing construction site supervision, quality control, and adherence to timelines and budgets.\n\tLead and inspire a high-performing team, fostering a culture of team work collaboration, growth, and excellence.\n\tOversee financial management, including budgeting, forecasting, and cost control measures to achieve profitability targets.\n\tEnsure compliance with regulatory requirements and industry standards in all aspects of our operations.\n\n\nRequirements\n\n\n\tRelevant educational qualifications in Business Administration, Construction Management, or a related field.\n\tMinimum of 7 years of experience in administration, HR, sales, marketing, business development, construction site supervision, and real estate management in the real estate and property construction industry.\n\tProven track record of success in driving business growth, securing new clients, and expanding market presence.\n\tStrong leadership skills, with the ability to inspire and motivate teams to achieve exceptional results.\n\tExcellent communication, negotiation, and presentation skills.\n\tIn-depth knowledge of the real estate and property construction industry, including market trends, regulations, and best practices.\n\tAbility to multitask, prioritize, and manage projects effectively in a fast-paced environment.\n\n\nMethod of Application\nInterested and qualified candidates should submit their CV to: recruitment.office@dreamcityproperty.com using the Job Position and Job Location as the subject of the email.\n\nNote: Only shortlisted candidates will be contacted for further selection stages.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Marketer / Sales Executive Job at George Houston Resources Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/marketer-sales-executive-job-at-george-houston-resources-limited",
    "pubDate": "Tue, 24 Jun 2025 13:30:58 GMT",
    "source": "JobGurus",
    "keyword": "george houston resources limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "George Houston Resources (GHR) Consulting Services Limited is a human resource development and management consulting firm registered in Nigeria. GHR assists organisations to achieve their corporate visions and objectives through integrated, strategic and solution-oriented HR consulting services using best-practice methodologies. We provide our clients with services that will ensure that their staffing needs are being addressed in a timely and effective manner through recruitment, consulting, training, technology and outsourcing services, thereby allowing them to save cost and focus on other core areas of business.\n\nWe are recruiting to fill the position below:\n\nJob Position: Marketer / Sales Executive\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Locations: Iyana Oba, Obadore, Alimosho - Lagos\n\nJob Summary\n\n\n\tAs a Marketer / Sales Executive, you will play a key role in driving sales growth and expanding market reach for the company's products or services.\n\tYour responsibilities include identifying potential customers, developing marketing campaigns, and nurturing client relationships to achieve sales targets.\n\n\nKey Responsibilities\n\n\n\tIdentify potential customers and market segments through market research, industry analysis, and customer profiling.\n\tDevelop and implement sales and marketing strategies to promote products or services, increase brand awareness, and drive customer engagement.\n\tConduct sales presentations, product demonstrations, and pitches to prospective clients, highlighting key features, benefits, and value propositions.\n\tGenerate leads, follow up on inquiries, and qualify prospects through outbound calls, emails, networking events, and social media outreach.\n\tBuild and maintain relationships with existing clients, addressing their needs, resolving issues, and providing ongoing support to ensure customer satisfaction and retention.\n\tStay updated on industry trends, emerging technologies, and best practices in sales and marketing, participating in training programs, workshops, and professional development activities.\n\tNegotiate contracts, pricing, and terms of sale with clients, preparing proposals, quotes, and sales agreements in accordance with company policies and guidelines.\n\n\nRequirements\n\n\n\tBachelor's Degree in Marketing, Business Administration, or a related field\n\tProven experience in sales and marketing roles, preferably in the manufacturing industry.\n\tExcellent communication and presentation skills, with the ability to articulate product features, benefits, and value propositions to customers.\n\tStrategic thinking and analytical skills, with the ability to analyze market data, identify trends, and develop targeted marketing campaigns.\n\tProficiency in Microsoft Office suite.\n\tAbility to work independently and as part of a team, demonstrating initiative, drive, and resilience in a dynamic and competitive sales environment.\n\n\nSalary\nN80,000 Monthly plus commission.\n\nMethod of Application\nInterested and qualified candidates should send their updated CV to: talents@georgehoustonresources.com using \"Marketer\" as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Vacancies at Universal Human Resource Consult",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancies-at-universal-human-resource-consult-3",
    "pubDate": "Tue, 24 Jun 2025 13:30:58 GMT",
    "source": "JobGurus",
    "keyword": "universal human resource consult",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Universal Human Resource Consult is a human resource consulting firm that effectively manages private and government organization by ensuring adequate staff recruitment and selection, staff training and co-ordination thereby creating sustainable growth and increase quality of service delivery in organizations.\n\nWe are recruiting to fill the following positions below:\n\n1.) Head, Finance and Administration\n\nJob Location: Abuja (FCT)\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tOur client is seeking to hire a Head of Finance and Administration who will oversee the financial planning, strategy, and administrative operations of the organization.\n\tThis role is critical to ensuring financial health, regulatory compliance, and efficient management of administrative functions.\n\tThe ideal candidate will have a strong background in finance, accounting, and administration within the energy sector.\n\n\nKey Responsibilities\nFinance Functions:\n\n\n\tDevelop and implement financial strategies aligned with the company's goals.\n\tPrepare financial reports, budgets, forecasts, and analysis for decision-making.\n\tEnsure accurate and timely financial reporting in compliance with relevant standards.\n\tMonitor and manage cash flow, investments, and capital expenditure.\n\tOversee audits, tax planning, and regulatory filings.\n\tManage relationships with banks, investors, and financial institutions.\n\tEnsure effective risk management and internal controls.\n\n\nAdministration Functions:\n\n\n\tSupervise administrative operations, including procurement, office management, and logistics.\n\tDevelop and implement administrative policies and procedures.\n\tCoordinate with HR on payroll processing and benefits administration.\n\tManage vendor and contract negotiations for administrative services.\n\tEnsure compliance with health, safety, and environmental (HSE) regulations.\n\n\nQualifications & Experience\n\n\n\tMaster's degree in Accounting, Finance, Business Administration, or a related field.\n\tMinimum of 10 years of progressive experience in finance and administration, with at least 3 years in a senior leadership role.\n\tProfessional certification such as ICAN, ACCA, or CPA is required.\n\tPrior experience in the energy, oil & gas, or infrastructure sector is highly desirable.\n\tStrong knowledge of financial regulations, tax laws, and energy sector standards.\n\n\nSalary\nN1,500,000 - N2,000,000 Monthly.\n\nApplication Closing Date: 1st July, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV and cover letter in PDF to: uhrconsultlimited2019@gmail.com using the Job Position as the subject of the mail.\n\n \n\n \n\n2.) Business Development Manager\n\nJob Location: Abuja (FCT)\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tOur client is seeking to hire a strategic and results-driven Business Development Manager to lead growth initiatives within the energy sector.\n\tThe ideal candidate will have a deep understanding of the industry, strong technical acumen, and proven experience in developing client relationships, identifying market opportunities, and driving revenue growth in theenergy sector.\n\n\nKey Responsibilities\n\n\n\tIdentify and pursue new business opportunities within the energy sector.\n\tDevelop and execute strategic plans to achieve sales targets and expand the customer base.\n\tCollaborate with technical, project, and finance teams to develop proposals, bids, and contracts.\n\tRepresent the company at industry events, exhibitions, and conferences.\n\tBuild and maintain strong, long-lasting client relationships with key stakeholders, including utilities, regulators, EPC firms, and industrial clients.\n\tConduct market research and competitor analysis to identify trends, risks, and opportunities.\n\tManage the full sales cycle from lead generation to contract closure.\n\tPrepare regular reports on business development activities, pipeline status, and market feedback.\n\n\nQualifications & Experience\n\n\n\tAn MBA or Master's degree in Engineering, Business Administration, or related field.\n\tMinimum of 10years of experience in business development or sales, preferably in the energy sector.\n\tStrong understanding of the energy market, regulatory environment, and key players.\n\tDemonstrated ability to meet or exceed revenue targets.\n\tExcellent negotiation, presentation, and communication skills.\n\tStrong analytical and problem-solving abilities.\n\tWillingness to travel as required.\n\n\nSalary\nN1,000,000 - N1,500,000 Monthly.\n\nApplication Closing Date: 8th July, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV and cover letter in PDF to: uhrconsultlimited2019@gmail.com using the Job Position as the subject of the mail.\n\n \n\n \n\n3.) Sales Representative\n\nJob Location: Lagos \nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe are looking for a friendly and energetic Sales Representative to join our team in a gift store.\n\tThe ideal candidate will be passionate about customer service, have a flair for gift presentation, and be skilled in helping customers find the perfect items.\n\tYou will be the face of the store, ensuring customers enjoy a memorable shopping experience.\n\n\nKey Responsibilities\n\n\n\tGreet and engage customers in a warm and professional manner.\n\tAssist customers in selecting appropriate gifts for various occasions.\n\tProvide detailed information about products, including features, pricing, and promotions.\n\tOperate the cash register and handle all transactions accurately.\n\tMaintain knowledge of new products and seasonal items.\n\tHandle customer complaints and concerns promptly and courteou\n\tUpsell and cross-sell products to increase sales.\n\tEnsure the sales floor is well-organized, clean, and stocked at all times.\n\tWrap and package gifts neatly and attractively.\n\tsly.\n\tSupport inventory management and stock replenishment.\n\tMeet or exceed daily/weekly sales targets.\n\n\nRequirements\n\n\n\tHND / Bachelor's Degree\n\t2 years+ of experience in a retail or customer service role (experience in a gift store is a plus)\n\tExcellent communication and interpersonal skills\n\tPositive attitude and strong work ethic\n\tAbility to work under pressure in a fast-paced environment\n\tBasic math skills and proficiency with POS systems\n\tCreative and detail-oriented, especially with gift wrapping.\n\n\nSalary\nN200,000 - N250,000 Monthly.\n\nApplication Closing Date: 26th June, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV and cover letter in PDF to: uhrconsultlimited2019@gmail.com using the Job Position as the subject of the mail.\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "General Manager - Customer Value Management, Marketing Job at MTN Nigeria",
    "link": "https://www.jobgurus.com.ng/jobs/view/general-manager-customer-value-management-marketing-job-at-mtn-nigeria",
    "pubDate": "Tue, 24 Jun 2025 13:30:58 GMT",
    "source": "JobGurus",
    "keyword": "mtn nigeria",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance"
    ],
    "content": "MTN Nigeria - The leader in telecommunications in Nigeria, and a part of a diverse community in Africa and the Middle East, our brand is instantly recognisable. It is through our compelling brand that we are able to attract the right talents who we carefully nurture by continuously improving our employment offerings even beyond reward and recognition.\n\nWe are recruiting to fill the position below:\n\nJob Position: General Manager - Customer Value Management, Marketing\n\nJob Identification: 5952\nJob Location: Ikoyi, Lagos\nJob Category: MTN Level 4\nJob Schedule: Full-time\nReports To: Chief Marketing Officer - CMO\nDivision: Marketing\n\nMission\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tLead customer value management initiatives, designing and delivering customer lifecycle programs that drive revenue and profit margin growth, while leveraging data insights to personalize customer experiences, enhance loyalty, and maximize customer lifetime value\n\n\nDescription\n\n\n\tDevelop and implement strategies for customer segmentation, retention, and value enhancement.\n\tDesign and manage loyalty programs to encourage customer engagement and long-term retention.\n\tUse data analytics to identify customers at risk of churn and proactively address their concerns.\n\tReview MTNN corporate direction and develop CVM strategy ensuring alignment with MTN corporate strategic objectives.  \n\tManage all direct marketing campaign execution and improve ROI through strong campaign management tools – operations, campaign planning, detailed design, production, test, roll-out, commercial return and evaluation.\n\tDeliver volume and value forecasting, retention volume and spend, Cross-sell and up-sell revenue in line with finance budgets.\n\tProvide base management strategy and ensure operational execution of the following - churn management, customer inactivity and retention, product penetration, base management direct marketing results and Incremental revenue.\n\tOversee robust CVM reporting and dashboards and act upon data. \n\tAnalyse commercial impact of BTL programs on product penetration, ARPU and volume/ value churn. \n\tOversee operational analysis of customer base to identify opportunities to apply products and tariffs to maximize lifetime value.\n\tPerform channel mix optimisation for base development & retention activities. Drive/ optimise channel execution by setting volume and value targets based on approved budget.\n\tCross-sell and Up-Sell campaigns e.g. voice, SMS and data-upsell, SMS and data-cross-sell. .\n\tChampion Retention & Churn management e.g. outflow value management, early churn detection, involuntary churn.\n\tOversee Base Management e.g. inactivity management, top-up volume and value management, revenue stimulation.\n\tChampion tariff migration management, revenue boosters.\n\tDefine and execute base development programs and revenue booster initiatives to achieve growth in customer base ARPU through targeted and segmented offers, campaigns, and pricing; specifically, data up-sell initiatives, tariff migration initiatives.\n\tManage delivery of insight for the customer base to the rest of the business, including actionable value- and needs-based segmentation and predictive models, linked with competitor intelligence, and market research.\n\tArchitect the development of a blueprint for segmented offer management & fulfilment.\n\tOversee an integrated output through campaign management, charging and provisioning platforms, by translating CVM objectives to IT / Technical teams\n\tDefine and implement Key Performance Indicators and Metrics for support and operational activities and use these metrics to drive service delivery excellence\n\tLead a business transformation to embed CVM decision-making principles and culture across the organization.\n\tCoach and mentor the CVM team to ensure understanding of the objectives and goals of the department, awareness of all related job requirements and accountabilities and leverage human resources career development programs for staff career development.\n\tLead CVM capability development/ define the CVM capability strategy based on commercial improvement programs and provide opportunities for staff to build on the company’s investment in their training and improve productivity.\n\n\nRequirements\nEducation:\n\n\n\tFirst Degree in Marketing or a related discipline\n\tPossession of post graduate degree (MBA/ Masters in relevant fields) will be advantageous\n\tFluent in English and language of country preferable\n\n\nExperience:\nA minimum of 12 years of working experience, which includes:\n\n\n\tSenior management track record of 3 years or more; with at least 3 years in relevant sector/ industry as per relevant role\n\tExperience working in a global/multinational enterprise (understanding emerging markets advantageous)\n\tWorked across diverse cultures and geographies. \n\tExperience in leading change / transformation (marketing) at an operational level advantageous\n\tExperience in continuous improvement through the implementation of best practices\n\tExperience in customer value creation\n\tExperience in campaign management\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]