[
  {
    "title": "Operation / Admin Assistant Job at Maxitech Global Investment Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/operation-admin-assistant-job-at-maxitech-global-investment-limited",
    "pubDate": "Tue, 17 Jun 2025 11:13:36 GMT",
    "source": "JobGurus",
    "keyword": "maxitech global investment limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Maxitech Global Investment Limited is an equal-opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.\n\nWe are recruiting to fill the position below:\n\nJob Position: Operation / Admin Assistant\n\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a reliable and organized Operations / Admin Assistant to support our daily administrative and operational tasks.\n\tThe ideal candidate should be proactive, detail-oriented, and capable of multitasking in a fast-paced work environment.\n\tThis role is critical in ensuring smooth office operations and assisting various departments as required.\n\n\nResponsibilities\n\n\n\tProvide general administrative and operational support to the team\n\tSupport logistics and inventory processes\n\tCoordinate internal communication and follow up on assigned tasks\n\tHandle errands, basic documentation, and assist with vendor-related matters\n\tEnsure timely delivery and proper documentation of operational tasks\n\tPerform any other duties as assigned by management\n\n\nRequirements\n\n\n\tMaximum qualification of OND in any field\n\t1 year of relevant experience is an added advantage\n\tStrong communication and organizational skills\n\tMust be punctual, trustworthy, and willing to learn\n\tMust reside within or close to Ikeja, Lagos\n\tMale candidates are preferred for gender balance.\n\tGender Preference: Male (for gender balance).\n\n\nSalary\nN60,000 – N70,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: olamilekan.sule@maxitechglobal.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Factory Staff Job at Ascentech Services Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/factory-staff-job-at-ascentech-services-limited",
    "pubDate": "Tue, 17 Jun 2025 11:13:36 GMT",
    "source": "JobGurus",
    "keyword": "ascentech services limited",
    "duplicate": false,
    "classifications": [],
    "content": "Ascentech Services Limited is a full-fledged Human Resource Solution Provider incorporated in 2013 with its Head Office in Lagos, Nigeria. We are committed to forging long-term partnerships with our clients by creating and delivering robust and flexible services that address the changing needs of their business.\n\nWe are recruiting to fill the position below:\n\nJob Position: Factory Staff\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\nDepartment: Production\n\nSummary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Factory Staff supports daily operations in a food manufacturing plant by operating machinery, ensuring product quality, maintaining cleanliness, and adhering to safety standards.\n\n\nKey Responsibilities\n\n\n\tOperate and monitor machinery\n\tHandle raw materials and package finished goods\n\tConduct quality checks and report defects\n\tMaintain clean, safe, and organized work areas\n\tDocument production data and issues\n\tCollaborate with team members to meet production targets\n\tParticipate in training and follow company policies.\n\n\nKey Performance Indicators (KPIs)\n\n\n\tAccurate weighing of raw and finished materials\n\tMeeting production targets\n\tAdhering to food safety and sanitation standards\n\tEffective packaging and labelling\n\tDaily participation in GMP-related activities (e.g., HACCP, sanitation)\n\tThis role requires physical stamina, precision, and a strong focus on quality and safety in a team-based environment.\n\n\nRequirements\n\n\n\tHigh school diploma or equivalent\n\tExperience in production/manufacturing preferred\n\tAbility to operate machinery and lift heavy items\n\tStrong attention to detail and teamwork skills\n\tKnowledge of food safety and hygiene (a plus).\n\n\nSalary\nN70,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: recruiter13@ascentech.com.ng using \"Factory Staff\" as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Chief Supply Chain Officer Job at Jumia",
    "link": "https://www.jobgurus.com.ng/jobs/view/chief-supply-chain-officer-job-at-jumia",
    "pubDate": "Tue, 17 Jun 2025 11:13:36 GMT",
    "source": "JobGurus",
    "keyword": "jumia",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Jumia is Africa's leading internet group, with already over 3,000 employees in more than 20 African countries and huge successes such as Jumia, Jumia Travel, Jumia Food, Jumia Deals, Jumia House, Jumia Jobs and Jumia Services. It is led by top talented leaders offering a great mix of local and international talents and is backed by MTN, Millicom, Rocket Internet, Axa, Orange, Goldman Sachs & CdC.\n\nWe are recruiting suitable candidates to fill the position below:\n\nJob Position: Chief Supply Chain Officer - Pipeline\n\nJob Location: Nigeria\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAs CSCO, you will drive operational excellence across our integrated warehouse network, optimize logistics infrastructure, and support our path to profitability through efficient, scalable supply chain solutions adapted to African markets\n\n\nWhat you will be doing\nOperations Excellence and Service Quality:\n\n\n\tImplement best practice fulfillment, distribution, on-demand and delivery operations\n\tDrive business relationships with clients and prospects by exploring opportunities to sell the full portfolio of Jumia Services\n\tManage quality of service being provided to all clients\n\tConstantly improve and develop new internal processes\n\tMake fast decisions to resolve emergencies\n\tCoordinate project management of all initiatives within your team\n\tUndertake ad-hoc projects as required in the development of the company objectives\n\n\nTeam Management and Leadership:\n\n\n\tRecruit and manage the sales, fulfillment and logistics team\n\tScale the team and the processes to support the growth of the company\n\tCreate an unparalleled environment for employee development and happiness\n\tManage fleet operations and 3PL providers, including contract negotiations\n\n\nOperational and Financial Performance:\n\n\n\tDeliver measurable results linked to your business within designated region\n\tEnsure regular reporting of the Operational performance, actions and results against targets\n\tEnsure the quality of the measurement of selected KPIs\n\tManage and control Budget, including revenues and operational / capital expenditures\n\tEnsure that all financial processes associated with each financial month, quarter and year end are executed\n\n\nRequirements\n\n\n\t12+ years of senior supply chain leadership experience, preferably in e-commerce or retail.\n\tMaster's degree in Business Administration or Supply Chain Management preferred.\n\tProven track record managing multi-country logistics operations, preferably in emerging markets\n\tExperience with warehouse operations, distribution networks, and third-party logistics management\n\tStrong background in supply chain technology, automation, and digital transformation\n\tDeep understanding of e-commerce fulfillment and last-mile delivery challenges\n\tExcellent analytical skills with ability to optimize complex logistics networks\n\tExperience with warehouse management systems (WMS) and logistics technology platforms\n\tKnowledge of supply chain analytics and performance management\n\tUnderstanding of inventory optimization and demand planning\n\tStrong leadership and change management capabilities\n\tExperience with cost optimization and operational efficiency initiatives\n\tCultural sensitivity and understanding of African market dynamics\n\tFamiliarity with third-party logistics marketplace models\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Bank Teller Job at Workforce Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/bank-teller-job-at-workforce-group-19",
    "pubDate": "Tue, 17 Jun 2025 11:13:36 GMT",
    "source": "JobGurus",
    "keyword": "workforce group",
    "duplicate": false,
    "classifications": [],
    "content": "Workforce group is a leading provider of end-to-end, integrated and result focused Business and Human Resource solutions in Nigeria. From inception in 2004, we have helped clients across diverse industries and sectors such as Financial Services, Telecoms, Oil and Gas, Real Estate, Hospitality, Power, Entertainment, FMCG, etc., to achieve their strategic goals and objectives.\n\nWorkforce Group is a top business and HR consulting firm in Nigeria, offering advisory, outsourcing, recruitment and assessment, learning and development, market entry and technology services and solutions. Our reputation for excellence in service was built from over a decade of providing business and human resource consulting across several states in Nigeria.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Bank Teller\n\nJob Locations: Lagos Mainland & Island, Lagos\n\nRequirements\n\n\n\tCandidates should possess an OND qualification.\n\t26 years below.\n\n\nBenefits\n\n\n\tSalary: N160,000 Monthly.\n\tHMo, Pension, 13 months and other benefits.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Logistics Operations Manager Job at Jumia",
    "link": "https://www.jobgurus.com.ng/jobs/view/logistics-operations-manager-job-at-jumia",
    "pubDate": "Tue, 17 Jun 2025 11:13:36 GMT",
    "source": "JobGurus",
    "keyword": "jumia",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Jumia is Africa's leading internet group, with already over 3,000 employees in more than 20 African countries and huge successes such as Jumia, Jumia Travel, Jumia Food, Jumia Deals, Jumia House, Jumia Jobs and Jumia Services. It is led by top talented leaders offering a great mix of local and international talents and is backed by MTN, Millicom, Rocket Internet, Axa, Orange, Goldman Sachs & CdC.\n\nWe are recruiting suitable candidates to fill the position below:\n\nJob Position: Logistics Operations Manager\n\nJob Location: Nigeria\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Logistics Operations Manager will oversee material handling, transportation, delivery, and return collections.\n\tThey will prepare worker schedules and ensure that distribution, delivery, and last-mile workers adhere to safety regulations.\n\n\nWhat you will be doing\n\n\n\tManaging day to day operations.\n\tChallenging established processes and implementing new processes to adapt to the fast growth of Jumia Supply Chain clients.\n\tFinding creative and innovative ways to offer a better customer experience.\n\tFully understanding our information system and working with our IT team to roll our new developments.\n\tWorking closely with the Supply Chain central team to share and implement global best practices.\n\tManaging relationships with clients and partners (Third party logistics partners).\n\tResponsible for the logistics P&L.\n\tResponsible to meet the logistics targets and KPIs including quality of customer experience.\n\n\nWhat we are looking for\n\n\n\t10 years with 2+ years direct management experience, preferably in a manufacturing, production or distribution environment with a strong focus on logistics or alternatively consulting / banking.\n\tA completed master’s degree from an accredited university; Degree in Engineering, Operations, Supply Chain or MBA preferred.\n\tProficient in Microsoft Office – Excel, PowerPoint, Word, Email, Internet etc.\n\tProficient in Google Office Suite – Google Drive, Google Sheets, Google Docs, Gmail, etc.\n\tAbility to lead large teams.\n\tExperience with process design and improvement.\n\tExperience with the full staffing lifecycle, including interviewing, hiring, performance management, promotions and terminations.\n\tStrong analytical skills.\n\tPro-active attitude, entrepreneur, able to work both independently and within a team.\n\tHardworking, result-oriented, methodical and very structured.\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]