[
  {
    "title": "Junior Accountant Job at TeamAce Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/junior-accountant-job-at-teamace-limited-3",
    "pubDate": "Mon, 07 Jul 2025 14:43:47 GMT",
    "source": "JobGurus",
    "keyword": "teamace limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "TeamAce Limited - Our client, a luxury Beauty Brand, is recruiting to fill the position below:\n\nJob Position: Junior Accountant\nJob Locations: Ikoyi & Lekki - Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tAs the Junior Accountant, you will be responsible for supporting day-to-day financial transactions, maintaining accurate records, assisting in preparing financial reports, and ensuring compliance with accounting standards and salon policies.\n\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tRecord daily financial transactions, including sales, expenses, and petty cash.\n\tReconcile cash, bank statements, and POS reports.\n\tPrepare and update invoices, receipts, and payment records.\n\tMonitor inventory and support stock reconciliation in collaboration with the storekeeper or salon manager.\n\tMaintain accurate and organized financial records.\n\n\nRequirements\n\n\n\tBachelor’s degree in Accounting, Finance, or a related field.\n\tMinimum of 1 year of experience in the beauty or retail industry.\n\tFamiliarity with accounting software (e.g., QuickBooks, Sage) and MS Excel.\n\n\nSalary\nN250,000 Monthly (Gross).    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Virtual Accountant Job at Lendha Technology Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/virtual-accountant-job-at-lendha-technology-limited",
    "pubDate": "Mon, 07 Jul 2025 14:43:47 GMT",
    "source": "JobGurus",
    "keyword": "lendha technology limited",
    "duplicate": false,
    "classifications": [],
    "content": "Lendha Technology Limited is recruiting suitably qualified candidates to fill the position below:\n\nJob Position: Virtual Accountant\n\nJob Location: Nigeria\n\nJob Summary\n\n\n\tAs a Virtual Accountant, you'll be responsible for managing our financial records, preparing financial statements, and providing financial guidance and support to our team.\n\tYou'll work remotely and collaborate with our team to ensure accurate and timely financial management.\n\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tManage financial records, including accounts payable and accounts receivable\n\tPrepare financial statements, including balance sheets and income statements\n\tProvide financial guidance and support to the team\n\tConduct financial analysis and make recommendations for improvement\n\tEnsure compliance with financial regulations and standards\n\tCollaborate with the team to ensure accurate and timely financial management\n\n\nRequirements\n\n\n\t1-3+ years of experience in accounting and financial management\n\tStrong knowledge of financial regulations and standards\n\tExcellent analytical and problem-solving skills\n\tStrong communication and collaboration skills\n\tReliable internet connection and suitable computer equipment\n\n\nNice to Have:\n\n\n\tExperience with cloud-based accounting software (Xero, QuickBooks, etc.)\n\tKnowledge of financial planning and budgeting\n\tFamiliarity with financial analysis and reporting\n\n\nWhat We Offer\n\n\n\tCompetitive hourly rate or salary (N500,000 - N750,000 Monthly)\n\tFlexible working hours and remote work arrangement\n\tOpportunity to work with a leading engineering firm\n\tCollaborative and dynamic team environment (virtual).\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: melissaemmanuel34@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Inventory Officer Job at 500Chow",
    "link": "https://www.jobgurus.com.ng/jobs/view/inventory-officer-job-at-500chow",
    "pubDate": "Mon, 07 Jul 2025 14:43:47 GMT",
    "source": "JobGurus",
    "keyword": "500chow",
    "duplicate": false,
    "classifications": [],
    "content": "500Chow is a leading food tech restaurant chain on a mission to create the best food brand in Africa. We're passionate about revolutionizing the culinary experience for our customers, delivering exceptional food quality, and using cutting-edge technology to enhance every aspect of our operations. Join us in shaping the future of dining in Africa.\n\nWe are recruiting to fill the position below:\n\nJob Position: Inventory Officer\n\nJob Locations: Ikeja and Victoria Island - Lagos\n\nQualifications\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tInterested candidate(s) should possess relevant qualification and experience.\n\n\nMethod of Application\nInterested and qualified candidates should forward their CV to: people@500chow.com using the Job Position and preferred Location as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Social Media Manager Job at Startup Soar",
    "link": "https://www.jobgurus.com.ng/jobs/view/social-media-manager-job-at-startup-soar",
    "pubDate": "Mon, 07 Jul 2025 14:43:47 GMT",
    "source": "JobGurus",
    "keyword": "startup soar",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Startup Soar (Recruitment Services) - Our client is a fast-growing restaurant located in the heart of Wuse 2, Abuja. Known for its creativity, top-tier service, and culinary excellence, the restaurant is building a standout brand both on-site and online.\n\nThey are recruiting to fill the position below:\n\nJob Position: Social Media Manager\nJob Location: Wuse 2, Abuja\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThey are looking for a talented and strategicSocial Media Managerto drive engagement, build brand awareness, and connect with a loyal community of food lovers.\n\tWe’re looking for a creative, data-driven, and highly organized Social Media Manager to develop and execute our social media strategy.\n\tYou’ll be responsible for managing content, engaging with followers, analyzing performance, and building a strong online presence that reflects the restaurant’s identity and values.\n\n\nKey Responsibilities\n\n\n\tDevelop and execute a comprehensive social media strategy\n\tCreate, schedule, and publish high-quality content (posts, reels, stories, etc.)\n\tEngage actively with followers, respond to comments/messages, and grow community presence\n\tMonitor and analyze social media metrics to measure performance and optimize content\n\tCollaborate with kitchen/creative teams for photo and video shoots\n\tStay updated with trends and best practices in the food & hospitality industry\n\tRun paid ad campaigns and influencer collaborations as needed\n\tManage the brand’s voice across all platforms (Instagram, TikTok, Facebook, etc.)\n\n\nRequirements\n\n\n\t2-4 years of experience in social media management, preferably in hospitality, F&B, or lifestyle brands\n\tStrong knowledge of Instagram, Facebook, TikTok, and content creation tools\n\tExcellent copywriting and communication skills\n\tAbility to shoot and edit engaging content (photo/video)\n\tBasic graphic design skills (Canva, Photoshop, or similar)\n\tCreativity, attention to detail, and a passion for storytelling\n\tAbility to work independently and manage multiple tasks/projects\n\n\nWhat We Offer\n\n\n\tSalary: N120,000 Monthly\n\tFree staff meals\n\tFun, collaborative, and creative work environment\n\tOpportunities for career growth in a rapidly expanding business\n\tFreedom to innovate and take ownership of your work.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV, portfolio (or social media handles), and a short cover letter to: startupsoarhr@gmail.com using \"Application for Social Media Manager Position\" as the subject of the email.\n\nNote\n\n\n\tReady to help shape a restaurant brand people love online? We’d love to meet you!\n\tOnly shortlisted candidates will be contacted.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]