[
  {
    "title": "Job Openings at Bottleking Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-bottleking-limited",
    "pubDate": "Thu, 10 Jul 2025 09:43:12 GMT",
    "source": "JobGurus",
    "keyword": "bottleking limited",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance",
      "Software Engineering"
    ],
    "content": "(function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){\n        (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),\n        m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)\n    })(window,document,'script','//www.google-analytics.com/analytics.js','ga');\n\n    ga('create', 'UA-43112273-1', 'jobgurus.com.ng');\n    ga('send', 'pageview');\n\n\n\n\n    \n        \n    Home\n    Jobs\n    Free Aptitude Test Practice\n    Employer? Post a Job\n            Register\n        Sign in\n        Contact us\n    \n\n    \n\n        \n    \n        \n\n            \n\n                \n\n                    \n                        Toggle navigation\n                        \n                        \n                        \n                    \n\n                    \n                \n            \n\n            \n                \n\n\tJobs\n\tJob Seekers\n\tAptitude Test\n\tScholarships\n\n            \n\n            \n                \n\n                                            Register\n                        Sign in\n                    \n                    Employer? Post a Job\n                \n            \n\n        \n\n    \n\n        \n        \n            \n            \n                 \n    \n                    \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n        \n     \n\n\n                            \n                    \n        \n                        CLICK HERE TO JOIN OUR WHATSAPP CHANNEL \n                    \n    \n\n    \n                                \n                    \n\n                        \n                            \n                        \n\n                        \n                            \n                                Any Specialization\n                                                                    Accounting / Audit / Finance\n                                                                    Administration/ Office/ Operations\n                                                                    Advertising/ Social Media/ Marketing/ PR\n                                                                    Agriculture / Agro Allied\n                                                                    Analyst/ Quality Control\n                                                                    Automotive/ Car Services\n                                                                    Aviation / Airline\n                                                                    Banking / Insurance\n                                                                    Building Design / Architecture\n                                                                    Construction / Mining\n                                                                    Consulting / Business Strategy/ Planning\n                                                                    Craftsmen / Artisans\n                                                                    Creatives (Arts, Design, Fashion)\n                                                                    Customer Service\n                                                                    Domestic / Janitorial Services\n                                                                    Driving / Haulage\n                                                                    Education / Teaching / Training\n                                                                    Engineering / Technical\n                                                                    Executive / Management\n                                                                    Freelance / Data Entry\n                                                                    Government Agencies / Public Sector\n                                                                    Graduates / Freshers\n                                                                    Grants /  Scholarships\n                                                                    Hospitality / Food Services\n                                                                    HSE / Safety Management\n                                                                    Human Resources / Recruitment\n                                                                    Information Technology / ICT\n                                                                    Internship/ Industrial Training\n                                                                    Legal / Law\n                                                                    Logistics / Transportation/ Supply\n                                                                    Manufacturing / Production\n                                                                    Maritime Services / Shipping\n                                                                    Media / Art / Entertainment\n                                                                    Medical/ Healthcare / Pharmaceutical\n                                                                    Military / Para-Military\n                                                                    NGO / Community Services\n                                                                    Oil & Gas / Energy\n                                                                    Procurement/ Purchasing\n                                                                    Project Management\n                                                                    Real Estate / Property / Surveying\n                                                                    Research / Survey\n                                                                    Risk Management / Compliance\n                                                                    Sales / Business Development\n                                                                    Secretarial / PA\n                                                                    Security / Intelligence\n                                                                    Software/ Programming / Web development\n                                                                    Sports / Fitness\n                                                                    Supply Chain/ Store\n                                                                    Technicians\n                                                                    Telecommunications\n                                                                    Tourism / Travels\n                                                                    Vocational Trade and Services\n                                                            \n                        \n\n                        \n                            \n                                Any Work Level\n                                                                    Entry Level (Trainee)\n                                                                    Executive (Director, Head of Dept)\n                                                                    Experienced (Non-Manager)\n                                                                    Internship\n                                                                    Manager (Staff Supervisor)\n                                                                    Senior Executive (MD, CEO, COO)\n                                                                    Vocational (Skilled/Unskilled Labour)\n                                                            \n                        \n\n                        \n                            \n                                 Search\n                            \n                        \n                    \n                \n                            \n            \n\n\n\n\n\n\n            \n\n                \n                                        \n                    \n                                        \n                    \n                    \n\n                    \n                        \n                        \n{\n  \"@context\": \"https://schema.org\",\n  \"@type\": \"JobPosting\",\n  \"title\": \"Job Openings at Bottleking Limited\",\n  \"description\": \"Welcome to Bottleking Limited, the Minister of Enjoyment, at 27 Castle Rock Ave, Lekki Peninsula II, Lekki 105102, Lagos. We specialize in offering an exquisite selection of exotic wines and premium drinks. Our dedication to quality and customer satisfaction has made us a trusted name in the beverage industry. At Bottleking, we believe in celebrating life&amp;#39;s moments with the finest drinks from around the world. Join us and experience the true taste of luxury.\n\nWe are recruiting to fill the following positions below:\n\n1.)&amp;nbsp;Pricing Analyst\n\nJob Location:&amp;nbsp;Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tThe Pricing Analyst is responsible for developing and implementing pricing strategies to maximise profitability and market share while ensuring competitive positioning in the beverage industry.\n\tThe role involves in-depth data analysis, market research, competitor benchmarking, and collaboration with cross-functional teams to drive informed pricing decisions.\n\n\nKey Responsibilities\n\n\n\tAnalyse pricing data and evaluate the impact of pricing strategies on sales, profitability, and customer behaviour.\n\tMonitor market trends, competitor pricing, and consumer demand to identify opportunities for price adjustments.\n\tDevelop dynamic pricing models that respond to changes in market conditions and input costs.\n\tCollaborate with the sales, marketing, and finance teams to recommend and execute optimal pricing strategies.\n\tConduct margin analysis and support pricing decisions across product lines and channels (distributors, supermarkets, horeca, etc.).\n\tEvaluate promotional pricing effectiveness and suggest pricing tactics for new product launches.\n\tGenerate regular pricing performance reports, dashboards, and executive presentations.\n\tEnsure pricing policies are aligned with the company&amp;rsquo;s strategic and financial goals.\n\tRecommend improvements in processes to enhance pricing efficiency and accuracy.\n\tSupport annual budgeting and forecasting exercises with relevant pricing inputs.\n\n\nKey Requirements\n\n\n\tBachelor&amp;rsquo;s Degree in Economics, Finance, Statistics, Accounting, Business Administration, or related field.\n\tMinimum of 3 years of experience in pricing, financial analysis, revenue management, or a similar role.\n\tExperience in the FMCG or beverage industry is highly desirable.\n\tStrong analytical and quantitative skills with proficiency in Excel, Power BI, or other data analysis tools.\n\tFamiliarity with ERP systems and pricing software is an added advantage.\n\tAbility to interpret complex data sets and communicate insights clearly to non-technical stakeholders.\n\tExcellent attention to detail, critical thinking, and problem-solving abilities.\n\tStrong organisational and time management skills with the ability to work under pressure. Key Competencies:\n\tBusiness Acumen\n\tData Interpretation and Visualisation\n\tMarket and Competitive Intelligence\n\tCommunication and Interpersonal Skills\n\tStrategic Thinking and Commercial Awareness\n\tCollaboration and Stakeholder Management.\n\n\nRemuneration\nAttractive and competitive, based on experience and performance.\n\nApplication Closing Date:&amp;nbsp;7th August, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV and Cover Letter to:&amp;nbsp;hr@bottleking.ng&amp;nbsp;using &amp;quot;Pricing Analyst Application&amp;quot; as the subject of the email.\n\n&amp;nbsp;\n\n2.)&amp;nbsp;Data Analyst\n\nJob Location:&amp;nbsp;Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tThe Data Analyst will be responsible for collecting, analyzing, and interpreting data to help improve&amp;nbsp;BottleKing&amp;rsquo;s business performance.\n\tYou will transform raw data into meaningful insights and&amp;nbsp;dashboards, support strategic initiatives, and help optimize inventory, pricing, customer experience,&amp;nbsp;and sales trends.\n\n\nKey Responsibilities\n\n\n\tCollect, organize, and interpret data from sales, inventory, marketing, and customer feedback.\n\tAnalyze trends, identify patterns, and provide actionable insights to inform business decisions.\n\tCreate and maintain interactive dashboards and reports using tools like Power BI, Excel, or Tableau.\n\tCollaborate with departments (Sales, Marketing, Procurement, Logistics) to understand data needs and support projects.\n\tMonitor KPIs, identify data discrepancies, and recommend improvements in processes or strategy.\n\tConduct competitor and market analysis to inform pricing and promotional strategies.\n\tPresent data findings to management in clear, concise formats.\n\tMaintain databases and ensure data accuracy, integrity, and security.\n\tSupport demand forecasting and restocking decisions using historical and real-time data.\n\n\nRequirements\n\n\n\tBachelor&amp;rsquo;s degree in Statistics, Mathematics, Data Science, Economics, Computer Science, or a related field.\n\tMinimum of 2 years of experience in a data analysis role (Retail or FMCG experience is a plus).\n\tStrong proficiency in Microsoft Excel (pivot tables, VLOOKUP, etc.) and SQL etc\n\tFamiliarity with data visualization tools like Power BI, Tableau, or Google Data Studio etc\n\tStrong analytical and problem-solving skills.\n\tExcellent communication skills &amp;ndash; able to translate data into understandable insights.\n\tDetail-oriented, with a keen eye for identifying trends and anomalies.\n\n\nPreferred Skills:\n\n\n\tExperience in retail data analytics (especially in the wine or beverage sector).\n\tKnowledge of inventory and POS systems.\n\tAbility to work independently and manage multiple data-related tasks concurrently.\n\n\nWhat We Offer\n\n\n\tCompetitive salary and benefits package.\n\tOpportunity to work with a passionate and growth-oriented team.\n\tCareer development and learning opportunities.\n\tDynamic work environment in a rapidly growing retail company.\n\n\nApplication Closing Date:&amp;nbsp;17th July, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV and a short Cover Letter to:&amp;nbsp;hr@bottleking.ng&amp;nbsp;using &amp;quot;Data Analyst Application - BottleKing&amp;quot; as the subject of the email.\n\n&amp;nbsp;\n\n&amp;nbsp;\n\n3.)&amp;nbsp;E-Commerce Salesperson\n\nJob Location:&amp;nbsp;Lagos&amp;nbsp;\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tThe E-Commerce Salesperson will be responsible for driving online sales, maintaining accurate product and pricing information across all digital platforms, and conducting fieldwork to support marketing, partnerships, and client onboarding.\n\tThe role involves regular updates on the website, Android app, and existing or incoming e-commerce platforms like Jumia, Konga, or custom marketplaces.\n\n\nKey Responsibilities\n\n\n\tManage and update product listings, pricing, and availability across all e-commerce platforms (e.g., BottleKing website, Android app, Jumia, Konga, etc.).\n\tMonitor competitor pricing and market trends to ensure BottleKing remains competitive.\n\tEnsure product descriptions, images, and categories are accurate, engaging, and optimized for SEO.\n\tProcess online orders, follow up with logistics, and ensure timely delivery to customers.\n\tConduct fieldwork to source new corporate customers, partners, and retail opportunities.\n\tGather customer feedback through in-person visits and online interactions to improve service and product offerings.\n\tSupport digital marketing campaigns through content suggestions, product highlights, and real- time sales reporting.\n\tResolve online customer inquiries or complaints professionally and promptly.\n\tCollaborate with the inventory and procurement teams to ensure stock levels reflect accurately reflected across platforms.\n\tTrack sales performance and provide regular reports to management.\n\n\nRequirements\n\n\n\tOND / HND / Bachelor&amp;rsquo;s Degree in Marketing, Business, E-commerce, or related field.\n\tAt least 1&amp;ndash;2 years of experience in e-commerce sales or digital retail (experience in the wine/beverage industry is an added advantage).\n\tSolid understanding of online marketplaces, mobile apps, and website product management.\n\tStrong computer skills and familiarity with CMS platforms and e-commerce dashboards.\n\tField sales experience with excellent interpersonal and negotiation skills.\n\tHighly organised with attention to detail and data accuracy.\n\tAbility to multitask and manage time effectively in a fast-paced retail environment.\n\n\nPreferred Skills:\n\n\n\tExperience using platforms like Shopify, Glovoapp, ETC\n\tFamiliarity with tools such as Excel, Google Sheets, and basic graphic editing (e.g., Canva).\n\tBasic knowledge of digital advertising (Google Ads, Facebook Ads, etc.) is a plus.\n\tAbility to work independently and deliver results under minimal supervision.\n\n\nWhat We Offer\n\n\n\tCompetitive salary with performance-based incentives.\n\tField mobility allowance and support.\n\tA supportive work culture with room for growth in the e-commerce division.\n\tStaff discounts on premium wine and liquor selections.\n\n\nApplication Closing Date:&amp;nbsp;17th July, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV and a brief cover letter to:&amp;nbsp;Hr@bottleking.ng&amp;nbsp;using &amp;quot;E-Commerce Salesperson &amp;ndash; BottleKing&amp;quot; as the subject of the mail.\n\n&amp;nbsp;\",\n  \"datePosted\": \"2025-07-10\",\n  \"validThrough\": \"7600-07-10\",\n  \"employmentType\": \"Full-Time\",\n  \"hiringOrganization\": {\n    \"@type\": \"Organization\",\n    \"name\": \"Bottleking Limited\"\n    \n  },\n  \"jobLocation\": {\n    \"@type\": \"Place\",\n    \"address\": {\n      \"@type\": \"PostalAddress\",\n      \"addressLocality\": \"Lagos\",\n      \"addressCountry\": \"NG\"\n    }\n  },\n  \"identifier\": {\n    \"@type\": \"PropertyValue\",\n    \"name\": \"\",\n    \"value\": \"184067\"\n  },\n  \"baseSalary\": {\n    \"@type\": \"MonetaryAmount\",\n    \"currency\": \"NGN\",\n    \"value\": {\n      \"@type\": \"QuantitativeValue\",\n      \"minValue\": 0,\n      \"maxValue\": 0,\n      \"unitText\": \"MONTH\"\n    }\n  }\n}\n\n\n\nJob Openings at Bottleking Limited\n\n\n\n\n        \n    \n\n        \n        Welcome to Bottleking Limited, the Minister of Enjoyment, at 27 Castle Rock Ave, Lekki Peninsula II, Lekki 105102, Lagos. We specialize in offering an exquisite selection of exotic wines and premium drinks. Our dedication to quality and customer satisfaction has made us a trusted name in the beverage industry. At Bottleking, we believe in celebrating life's moments with the finest drinks from around the world. Join us and experience the true taste of luxury.\n\nWe are recruiting to fill the following positions below:\n\n1.) Pricing Analyst\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n            \n    \n\n\n\n\n\tThe Pricing Analyst is responsible for developing and implementing pricing strategies to maximise profitability and market share while ensuring competitive positioning in the beverage industry.\n\tThe role involves in-depth data analysis, market research, competitor benchmarking, and collaboration with cross-functional teams to drive informed pricing decisions.\n\n\nKey Responsibilities\n\n\n\tAnalyse pricing data and evaluate the impact of pricing strategies on sales, profitability, and customer behaviour.\n\tMonitor market trends, competitor pricing, and consumer demand to identify opportunities for price adjustments.\n\tDevelop dynamic pricing models that respond to changes in market conditions and input costs.\n\tCollaborate with the sales, marketing, and finance teams to recommend and execute optimal pricing strategies.\n\tConduct margin analysis and support pricing decisions across product lines and channels (distributors, supermarkets, horeca, etc.).\n\tEvaluate promotional pricing effectiveness and suggest pricing tactics for new product launches.\n\tGenerate regular pricing performance reports, dashboards, and executive presentations.\n\tEnsure pricing policies are aligned with the company’s strategic and financial goals.\n\tRecommend improvements in processes to enhance pricing efficiency and accuracy.\n\tSupport annual budgeting and forecasting exercises with relevant pricing inputs.\n\n\nKey Requirements\n\n\n\tBachelor’s Degree in Economics, Finance, Statistics, Accounting, Business Administration, or related field.\n\tMinimum of 3 years of experience in pricing, financial analysis, revenue management, or a similar role.\n\tExperience in the FMCG or beverage industry is highly desirable.\n\tStrong analytical and quantitative skills with proficiency in Excel, Power BI, or other data analysis tools.\n\tFamiliarity with ERP systems and pricing software is an added advantage.\n\tAbility to interpret complex data sets and communicate insights clearly to non-technical stakeholders.\n\tExcellent attention to detail, critical thinking, and problem-solving abilities.\n\tStrong organisational and time management skills with the ability to work under pressure. Key Competencies:\n\tBusiness Acumen\n\tData Interpretation and Visualisation\n\tMarket and Competitive Intelligence\n\tCommunication and Interpersonal Skills\n\tStrategic Thinking and Commercial Awareness\n\tCollaboration and Stakeholder Management.\n\n\nRemuneration\nAttractive and competitive, based on experience and performance.\n\nApplication Closing Date: 7th August, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV and Cover Letter to: hr@bottleking.ng using \"Pricing Analyst Application\" as the subject of the email.\n\n \n\n2.) Data Analyst\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tThe Data Analyst will be responsible for collecting, analyzing, and interpreting data to help improve BottleKing’s business performance.\n\tYou will transform raw data into meaningful insights and dashboards, support strategic initiatives, and help optimize inventory, pricing, customer experience, and sales trends.\n\n\nKey Responsibilities\n\n\n\tCollect, organize, and interpret data from sales, inventory, marketing, and customer feedback.\n\tAnalyze trends, identify patterns, and provide actionable insights to inform business decisions.\n\tCreate and maintain interactive dashboards and reports using tools like Power BI, Excel, or Tableau.\n\tCollaborate with departments (Sales, Marketing, Procurement, Logistics) to understand data needs and support projects.\n\tMonitor KPIs, identify data discrepancies, and recommend improvements in processes or strategy.\n\tConduct competitor and market analysis to inform pricing and promotional strategies.\n\tPresent data findings to management in clear, concise formats.\n\tMaintain databases and ensure data accuracy, integrity, and security.\n\tSupport demand forecasting and restocking decisions using historical and real-time data.\n\n\nRequirements\n\n\n\tBachelor’s degree in Statistics, Mathematics, Data Science, Economics, Computer Science, or a related field.\n\tMinimum of 2 years of experience in a data analysis role (Retail or FMCG experience is a plus).\n\tStrong proficiency in Microsoft Excel (pivot tables, VLOOKUP, etc.) and SQL etc\n\tFamiliarity with data visualization tools like Power BI, Tableau, or Google Data Studio etc\n\tStrong analytical and problem-solving skills.\n\tExcellent communication skills – able to translate data into understandable insights.\n\tDetail-oriented, with a keen eye for identifying trends and anomalies.\n\n\nPreferred Skills:\n\n\n\tExperience in retail data analytics (especially in the wine or beverage sector).\n\tKnowledge of inventory and POS systems.\n\tAbility to work independently and manage multiple data-related tasks concurrently.\n\n\nWhat We Offer\n\n\n\tCompetitive salary and benefits package.\n\tOpportunity to work with a passionate and growth-oriented team.\n\tCareer development and learning opportunities.\n\tDynamic work environment in a rapidly growing retail company.\n\n\nApplication Closing Date: 17th July, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV and a short Cover Letter to: hr@bottleking.ng using \"Data Analyst Application - BottleKing\" as the subject of the email.\n\n \n\n \n\n3.) E-Commerce Salesperson\n\nJob Location: Lagos \nEmployment Type: Full-time\n\nJob Summary\n\n\n\tThe E-Commerce Salesperson will be responsible for driving online sales, maintaining accurate product and pricing information across all digital platforms, and conducting fieldwork to support marketing, partnerships, and client onboarding.\n\tThe role involves regular updates on the website, Android app, and existing or incoming e-commerce platforms like Jumia, Konga, or custom marketplaces.\n\n\nKey Responsibilities\n\n\n\tManage and update product listings, pricing, and availability across all e-commerce platforms (e.g., BottleKing website, Android app, Jumia, Konga, etc.).\n\tMonitor competitor pricing and market trends to ensure BottleKing remains competitive.\n\tEnsure product descriptions, images, and categories are accurate, engaging, and optimized for SEO.\n\tProcess online orders, follow up with logistics, and ensure timely delivery to customers.\n\tConduct fieldwork to source new corporate customers, partners, and retail opportunities.\n\tGather customer feedback through in-person visits and online interactions to improve service and product offerings.\n\tSupport digital marketing campaigns through content suggestions, product highlights, and real- time sales reporting.\n\tResolve online customer inquiries or complaints professionally and promptly.\n\tCollaborate with the inventory and procurement teams to ensure stock levels reflect accurately reflected across platforms.\n\tTrack sales performance and provide regular reports to management.\n\n\nRequirements\n\n\n\tOND / HND / Bachelor’s Degree in Marketing, Business, E-commerce, or related field.\n\tAt least 1–2 years of experience in e-commerce sales or digital retail (experience in the wine/beverage industry is an added advantage).\n\tSolid understanding of online marketplaces, mobile apps, and website product management.\n\tStrong computer skills and familiarity with CMS platforms and e-commerce dashboards.\n\tField sales experience with excellent interpersonal and negotiation skills.\n\tHighly organised with attention to detail and data accuracy.\n\tAbility to multitask and manage time effectively in a fast-paced retail environment.\n\n\nPreferred Skills:\n\n\n\tExperience using platforms like Shopify, Glovoapp, ETC\n\tFamiliarity with tools such as Excel, Google Sheets, and basic graphic editing (e.g., Canva).\n\tBasic knowledge of digital advertising (Google Ads, Facebook Ads, etc.) is a plus.\n\tAbility to work independently and deliver results under minimal supervision.\n\n\nWhat We Offer\n\n\n\tCompetitive salary with performance-based incentives.\n\tField mobility allowance and support.\n\tA supportive work culture with room for growth in the e-commerce division.\n\tStaff discounts on premium wine and liquor selections.\n\n\nApplication Closing Date: 17th July, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV and a brief cover letter to: Hr@bottleking.ng using \"E-Commerce Salesperson – BottleKing\" as the subject of the mail.\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n\n    \n    \n\n\n\n\n        \n        \n\n\n\n\n   \n\n\n    \n        Similar Jobs\n    \n\n    \n        \n                        Job Vacancies at Youverify\n                        Sales / Marketing Executive Job at FinLab Nigeria Limited\n                        Sales and Marketing Lead Job at Creatives Island (TCI)\n                        Business Marketing Assistant Job at OPPO\n                        Job Vacancies at Catilas Resource Limited\n                        Downstream Sales Officer Job at Catilas Resources Limited\n                        Senior Business Development Leader Job at Visa Incorporated\n                        Wholesales Executive Job at Bogo Beverage Limited\n                        Business Development Executive Job at Workforce Group\n                        Assistant Sales Representative Job at Applicant Recruiters Limited\n                    \n    \n\n\n\n                        \n                    \n\n                    \n                        \n\n\n\n    \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n\n\n\n\n\n          \n\n\n    \n\n        Hottest Jobs\n\n        \n        \n            \n\n                Join our Cohort 32 and Become a Software Developer\n\n               \n            \n        \n            \n\n                Job Openings at the Concept Group\n\n               \n            \n        \n            \n\n                Job Openings at ABNL Limited\n\n               \n            \n        \n            \n\n                Job Vacancies at 9mobile\n\n               \n            \n        \n            \n\n                Job Openings at Lafarge Africa Plc\n\n               \n            \n        \n            \n\n                Analyst - Treasury Operations, Finance Job at MTN Nigeria\n\n               \n            \n        \n            \n\n                Analyst - Customer Acquisition and Compliance Job at MTN Nigeria\n\n               \n            \n        \n            \n\n                Job Vacancies at Carbon Nigeria\n\n               \n            \n        \n            \n\n                Receptionist Job at Management FIRST\n\n               \n            \n        \n            \n\n                Customer Service Representative - FMCG Job at Kiyix Recruitment Hub\n\n               \n            \n        \n        \n\n    \n\n\n\n\n        \n        \n   \n\n\n                    \n                            \n            \n        \n        \n        \n\n        \n\n    \n\n        \n\n            \n\n                \n\n                    Job Seekers\n\n                    \n\n                        Search for Jobs\n                         Featured Jobs\n                         Jobs by Specialization\n                         Jobs by Industry\n                         Jobs by Location\n                         \n                        Companies Currently Hiring\n\n                        Upload CV\n\n                        Free Aptitude Test Practice\n                        \n                        Scholarships and Financial Aid\n\n                        Testimonies\n                    \n\n                \n\n                \n\n                    Employers\n\n                    \n\n                        Post A Job\n\n                        Search Resumes/Profiles\n\n                        Create Employer Account\n\n                        Advertise\n\n                        Pricing\n\n                    \n\n                \n\n                \n\n                    Tools & Resources\n\n                    \n\n                        Contact us\n                        \n                        Our Blog\n  \n                        \n\n                        Job XML/RSS Feeds\n \n                        Free Aptitude Test Practice\n\n                        Bank Details\n\n                        FAQ & Support\n\n                    \n\n                \n\n                \n\n                    Connect with us\n\n                    \n\n                        \n\n                            \n\n                            \n\n                        \n\n                        \n\n                            \n\n                            \n\n                        \n\n                \n\n                        \n\n                            \n\n                            \n\n                        \n\n                    \n\n\n\n                    \n\n                        Customer Care\n\n                        09134259221 \n\n                        (9am - 5pm) weekdays\n\n                         info [at] jobgurus.com.ng\n\n                    \n\n\n\n                \n\n            \n\n        \n\n    \n\n\n\n    \n\n        \n\n\n\n            \n\n                Privacy Policy\n\n                Terms & Conditions\n\n                Sitemap\n                \n                About us\n\n            \n\n\n\n            Copyright © 2025 Jobgurus.com.ng - Latest Jobs in Nigeria 2025. All right reserved.",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Vacancies at Youverify",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancies-at-youverify-4",
    "pubDate": "Thu, 10 Jul 2025 09:43:12 GMT",
    "source": "JobGurus",
    "keyword": "youverify",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance",
      "Software Engineering"
    ],
    "content": "(function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){\n        (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),\n        m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)\n    })(window,document,'script','//www.google-analytics.com/analytics.js','ga');\n\n    ga('create', 'UA-43112273-1', 'jobgurus.com.ng');\n    ga('send', 'pageview');\n\n\n\n\n    \n        \n    Home\n    Jobs\n    Free Aptitude Test Practice\n    Employer? Post a Job\n            Register\n        Sign in\n        Contact us\n    \n\n    \n\n        \n    \n        \n\n            \n\n                \n\n                    \n                        Toggle navigation\n                        \n                        \n                        \n                    \n\n                    \n                \n            \n\n            \n                \n\n\tJobs\n\tJob Seekers\n\tAptitude Test\n\tScholarships\n\n            \n\n            \n                \n\n                                            Register\n                        Sign in\n                    \n                    Employer? Post a Job\n                \n            \n\n        \n\n    \n\n        \n        \n            \n            \n                 \n    \n                    \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n        \n     \n\n\n                            \n                    \n        \n                        CLICK HERE TO JOIN OUR WHATSAPP CHANNEL \n                    \n    \n\n    \n                                \n                    \n\n                        \n                            \n                        \n\n                        \n                            \n                                Any Specialization\n                                                                    Accounting / Audit / Finance\n                                                                    Administration/ Office/ Operations\n                                                                    Advertising/ Social Media/ Marketing/ PR\n                                                                    Agriculture / Agro Allied\n                                                                    Analyst/ Quality Control\n                                                                    Automotive/ Car Services\n                                                                    Aviation / Airline\n                                                                    Banking / Insurance\n                                                                    Building Design / Architecture\n                                                                    Construction / Mining\n                                                                    Consulting / Business Strategy/ Planning\n                                                                    Craftsmen / Artisans\n                                                                    Creatives (Arts, Design, Fashion)\n                                                                    Customer Service\n                                                                    Domestic / Janitorial Services\n                                                                    Driving / Haulage\n                                                                    Education / Teaching / Training\n                                                                    Engineering / Technical\n                                                                    Executive / Management\n                                                                    Freelance / Data Entry\n                                                                    Government Agencies / Public Sector\n                                                                    Graduates / Freshers\n                                                                    Grants /  Scholarships\n                                                                    Hospitality / Food Services\n                                                                    HSE / Safety Management\n                                                                    Human Resources / Recruitment\n                                                                    Information Technology / ICT\n                                                                    Internship/ Industrial Training\n                                                                    Legal / Law\n                                                                    Logistics / Transportation/ Supply\n                                                                    Manufacturing / Production\n                                                                    Maritime Services / Shipping\n                                                                    Media / Art / Entertainment\n                                                                    Medical/ Healthcare / Pharmaceutical\n                                                                    Military / Para-Military\n                                                                    NGO / Community Services\n                                                                    Oil & Gas / Energy\n                                                                    Procurement/ Purchasing\n                                                                    Project Management\n                                                                    Real Estate / Property / Surveying\n                                                                    Research / Survey\n                                                                    Risk Management / Compliance\n                                                                    Sales / Business Development\n                                                                    Secretarial / PA\n                                                                    Security / Intelligence\n                                                                    Software/ Programming / Web development\n                                                                    Sports / Fitness\n                                                                    Supply Chain/ Store\n                                                                    Technicians\n                                                                    Telecommunications\n                                                                    Tourism / Travels\n                                                                    Vocational Trade and Services\n                                                            \n                        \n\n                        \n                            \n                                Any Work Level\n                                                                    Entry Level (Trainee)\n                                                                    Executive (Director, Head of Dept)\n                                                                    Experienced (Non-Manager)\n                                                                    Internship\n                                                                    Manager (Staff Supervisor)\n                                                                    Senior Executive (MD, CEO, COO)\n                                                                    Vocational (Skilled/Unskilled Labour)\n                                                            \n                        \n\n                        \n                            \n                                 Search\n                            \n                        \n                    \n                \n                            \n            \n\n\n\n\n\n\n            \n\n                \n                                        \n                    \n                                        \n                    \n                    \n\n                    \n                        \n                        \n{\n  \"@context\": \"https://schema.org\",\n  \"@type\": \"JobPosting\",\n  \"title\": \"Job Vacancies at Youverify\",\n  \"description\": \"Youverify&amp;#39;s mission is to be the most reliable source of identity, address and background data verification. Since been peer-selected by cohort members of Village Capital PayPal Fintech 2018, Youverify has continued to shift the verification landscape with our product offerings. As a company that provides modern and compliant identity and address verification services for government, global enterprises and startups, Youverify knows first-hand how difficult it may be for business to verify the identity of their customers, staffs and partners and we want to help to make this process as simple and as easy as possible. This is a unique opportunity to work in a fast-growing scale up and product driven environment using new technologies and frameworks as we continue building our ID verification solution.\n\nWe are recruiting to fill the following positions below:\n\n1.)&amp;nbsp;Legal Associate\n\nJob Location:&amp;nbsp;Lagos\nEmployment Type: Full-time\n\nSummary\n\n\n\tWe are seeking an Legal Associate to join our team.\n\tThe ideal candidate will have a background in corporate law, contract negotiation, and regulatory compliance.\n\tThis role requires excellent analytical skills, attention to detail, and the ability to provide sound legal advice and support to the organization.\n\n\nResponsibilities\n\n\n\tProvide legal advice and guidance on corporate governance, regulatory compliance, and contractual matters.\n\tReview, draft, and negotiate contracts, agreements, and legal documents with clients, vendors, and other parties.\n\tConduct legal research and analysis on relevant laws, regulations, and precedents to support business activities.\n\tIdentify legal risks and issues, and develop strategies to mitigate and resolve them.\n\tAssist with corporate transactions, including mergers and acquisitions, joint ventures, and strategic partnerships.\n\tCollaborate with internal stakeholders, including executives, managers, and other departments, to address legal issues and ensure compliance with laws and regulations.\n\tRepresent the company in legal proceedings, negotiations, and meetings with external parties.\n\tMonitor changes in laws and regulations that may impact the company&amp;#39;s operations and advise on potential implications.\n\tDevelop and deliver legal training and education programs for employees on relevant legal topics.\n\tMaintain accurate and organized legal records, documents, and databases.\n\n\nRequirements and Qualifications\n\n\n\tLLB with 3 - 5 PQE.\n\tAdmitted to the Nigerian Bar.\n\tProven experience as a Legal Counsel in a law firms or a corporate environment.\n\tStrong understanding of corporate law, contract law, and regulatory compliance.\n\tExcellent legal research and analytical skills.\n\tAbility to communicate complex legal concepts effectively to non-legal stakeholders.\n\tNegotiation and problem-solving abilities.\n\tAttention to detail and accuracy in work.\n\tIntegrity and professionalism in handling confidential and sensitive information.\n\tAdaptability and willingness to learn and grow in the role.\n\n\nSkills Required:\n\n\n\tLegal advisory\n\tContract negotiation\n\tRegulatory compliance\n\tLegal research and analysis\n\tCorporate transactions\n\tCommunication\n\tProblem-solving\n\tAttention to detail\n\tIntegrity\n\tAdaptability.\n\n\nApplication Closing Date:&amp;nbsp;24th July, 2025.\n\nMethod of Application\nInterested and qualified candidates should send&amp;nbsp;their resume, cover letter and portfolio to:&amp;nbsp;hr@youverify.co&amp;nbsp;using &amp;quot;Legal Associate&amp;quot;&amp;nbsp;as the subject of the email.\n\n&amp;nbsp;\n\n2.)&amp;nbsp;Enterprise Account Manager\n\nJob Location:&amp;nbsp;Yaba, Lagos\nEmployment Type: Full-time\n\nResponsibilities\n\n\n\tProactively manage key partner relationships to strengthen overall solution capabilities and drive greater client value.\n\tDevelop and implement specific customer account and opportunity plans supporting company goals and quota objectives.\n\tCreating and managing sales plans that clearly outline goals and objectives for each sale.\n\tNurture and close new solution opportunities that result in incremental sales and revenue for Youverify product.\n\tManage and stimulate revenue through complex, multiple go-to-market strategies\n\tManage, negotiate, and exchange information with all levels of management within the enterprise.\n\tSupport marketing team to identify and execute plans for market awareness, client case studies, and vertical market growth within assigned accounts.\n\tMaintaining knowledge of new technologies and industry trends that could impact customers&amp;rsquo; needs.\n\tEnsure that customer satisfaction is met with all products and services provided by the company.\n\tMeeting regularly with clients to discuss their needs, progress, and satisfaction with current products or services.\n\tMeet and exceed quarterly sales targets and build a strong 12-month pipeline.\n\n\nRequirements\n\n\n\t3 years plus of experience working as an Enterprise Account Manager\n\tMaster&amp;rsquo;s Degree or MBA.\n\tStrong sales and business development acumen with a record of outstanding delivery.\n\tProven track record of success in managing large FinTech, Banks, and Telecommunications accounts.\n\tConversant with the use of data within business and Customer Experience concepts.\n\tExcellent negotiation, influencing and relationship-building skills.\n\tExcellent time management and business sales skills\n\tSelf-motivated and willing to work under pressure.\n\tExperience in working with a cross-culture team and a fast-paced environment\n\tAbility to understand business goals and recommend new approaches, policies and procedures to effect continual improvements in business objectives, and productivity.\n\tBusiness-driven, people-focused, with exceptional influencing skills.\n\n\nApplication Closing Date:&amp;nbsp;17th July, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their Resume to:&amp;nbsp;hr@youverify.co&amp;nbsp;using &amp;quot;Enterprise Account Manager&amp;quot; as the subject of the email.\n\n&amp;nbsp;\n\n3.)&amp;nbsp;Business Development Executive\n\nJob Location:&amp;nbsp;Lagos\nEmployment Type: Full-time\n\nResponsibilities\n\n\n\tPlanning and overseeing new marketing initiatives as well as developing and executing sales plans to meet and exceed monthly/quarterly revenue/sales goals.\n\tOversee the sales process to attract new clients.\n\tProcuring new clients through leads, direct contact, and collaboration with the marketing team.\n\tFollowing company guidelines and procedures for the acquisition of customers, submission of tenders, etc.\n\tMaintain fruitful relationships with clients (existing &amp;amp; potential) and address their needs effectively.\n\tSuggesting upgrades or added products and services that may be of interest to clients.\n\tResearch and identify new market opportunities and trends to ensure our offering remains relevant.\n\tPrepare and deliver pitches to potential customers.\n\tCollaborating with management on sales goals, planning, and forecasting; maintaining short- and long-term business development plans.\n\tDrafting business proposals and contracts to draw more revenue from clients.\n\tMaintain knowledge of all products and services offered by the company.\n\tWork with team members to identify and manage risks.\n\n\nRequirements\n\n\n\t3 years plus of experience working as an Enterprise Account Manager\n\tMaster&amp;rsquo;s Degree or MBA.\n\tStrong sales and business development acumen with a record of outstanding delivery.\n\tProven track record of success in managing large FinTech, Banks, and Telecommunications accounts.\n\tConversant with the use of data within business and Customer Experience concepts.\n\tExcellent negotiation, influencing and relationship-building skills.\n\tExcellent time management and business sales skills\n\tSelf-motivated and willing to work under pressure.\n\tExperience in working with a cross-culture team and a fast-paced environment\n\tAbility to understand business goals and recommend new approaches, policies\n\tand procedures to effect continual improvements in business objectives, and\n\tproductivity.\n\tBusiness-driven, people-focused, with exceptional influencing skills.\n\n\nApplication Closing Date:&amp;nbsp;17th July, 2025.\n\nMethod&amp;nbsp; of Application\nInterested and qualified candidates should send their Resume and portfolio to:&amp;nbsp;hr@youverify.co&amp;nbsp;using &amp;quot;Business Development Executive&amp;quot; as the subject of the email.\",\n  \"datePosted\": \"2025-07-10\",\n  \"validThrough\": \"8000-07-10\",\n  \"employmentType\": \"Full-Time\",\n  \"hiringOrganization\": {\n    \"@type\": \"Organization\",\n    \"name\": \"Youverify\"\n    \n  },\n  \"jobLocation\": {\n    \"@type\": \"Place\",\n    \"address\": {\n      \"@type\": \"PostalAddress\",\n      \"addressLocality\": \"Lagos\",\n      \"addressCountry\": \"NG\"\n    }\n  },\n  \"identifier\": {\n    \"@type\": \"PropertyValue\",\n    \"name\": \"\",\n    \"value\": \"184066\"\n  },\n  \"baseSalary\": {\n    \"@type\": \"MonetaryAmount\",\n    \"currency\": \"NGN\",\n    \"value\": {\n      \"@type\": \"QuantitativeValue\",\n      \"minValue\": 0,\n      \"maxValue\": 0,\n      \"unitText\": \"MONTH\"\n    }\n  }\n}\n\n\n\nJob Vacancies at Youverify\n\n\n\n\n        \n    \n\n        \n        \n     \n\n            \n    \n\nYouverify's mission is to be the most reliable source of identity, address and background data verification. Since been peer-selected by cohort members of Village Capital PayPal Fintech 2018, Youverify has continued to shift the verification landscape with our product offerings. As a company that provides modern and compliant identity and address verification services for government, global enterprises and startups, Youverify knows first-hand how difficult it may be for business to verify the identity of their customers, staffs and partners and we want to help to make this process as simple and as easy as possible. This is a unique opportunity to work in a fast-growing scale up and product driven environment using new technologies and frameworks as we continue building our ID verification solution.\n\nWe are recruiting to fill the following positions below:\n\n1.) Legal Associate\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nSummary\n\n\n\tWe are seeking an Legal Associate to join our team.\n\tThe ideal candidate will have a background in corporate law, contract negotiation, and regulatory compliance.\n\tThis role requires excellent analytical skills, attention to detail, and the ability to provide sound legal advice and support to the organization.\n\n\nResponsibilities\n\n\n\tProvide legal advice and guidance on corporate governance, regulatory compliance, and contractual matters.\n\tReview, draft, and negotiate contracts, agreements, and legal documents with clients, vendors, and other parties.\n\tConduct legal research and analysis on relevant laws, regulations, and precedents to support business activities.\n\tIdentify legal risks and issues, and develop strategies to mitigate and resolve them.\n\tAssist with corporate transactions, including mergers and acquisitions, joint ventures, and strategic partnerships.\n\tCollaborate with internal stakeholders, including executives, managers, and other departments, to address legal issues and ensure compliance with laws and regulations.\n\tRepresent the company in legal proceedings, negotiations, and meetings with external parties.\n\tMonitor changes in laws and regulations that may impact the company's operations and advise on potential implications.\n\tDevelop and deliver legal training and education programs for employees on relevant legal topics.\n\tMaintain accurate and organized legal records, documents, and databases.\n\n\nRequirements and Qualifications\n\n\n\tLLB with 3 - 5 PQE.\n\tAdmitted to the Nigerian Bar.\n\tProven experience as a Legal Counsel in a law firms or a corporate environment.\n\tStrong understanding of corporate law, contract law, and regulatory compliance.\n\tExcellent legal research and analytical skills.\n\tAbility to communicate complex legal concepts effectively to non-legal stakeholders.\n\tNegotiation and problem-solving abilities.\n\tAttention to detail and accuracy in work.\n\tIntegrity and professionalism in handling confidential and sensitive information.\n\tAdaptability and willingness to learn and grow in the role.\n\n\nSkills Required:\n\n\n\tLegal advisory\n\tContract negotiation\n\tRegulatory compliance\n\tLegal research and analysis\n\tCorporate transactions\n\tCommunication\n\tProblem-solving\n\tAttention to detail\n\tIntegrity\n\tAdaptability.\n\n\nApplication Closing Date: 24th July, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their resume, cover letter and portfolio to: hr@youverify.co using \"Legal Associate\" as the subject of the email.\n\n \n\n2.) Enterprise Account Manager\n\nJob Location: Yaba, Lagos\nEmployment Type: Full-time\n\nResponsibilities\n\n\n\tProactively manage key partner relationships to strengthen overall solution capabilities and drive greater client value.\n\tDevelop and implement specific customer account and opportunity plans supporting company goals and quota objectives.\n\tCreating and managing sales plans that clearly outline goals and objectives for each sale.\n\tNurture and close new solution opportunities that result in incremental sales and revenue for Youverify product.\n\tManage and stimulate revenue through complex, multiple go-to-market strategies\n\tManage, negotiate, and exchange information with all levels of management within the enterprise.\n\tSupport marketing team to identify and execute plans for market awareness, client case studies, and vertical market growth within assigned accounts.\n\tMaintaining knowledge of new technologies and industry trends that could impact customers’ needs.\n\tEnsure that customer satisfaction is met with all products and services provided by the company.\n\tMeeting regularly with clients to discuss their needs, progress, and satisfaction with current products or services.\n\tMeet and exceed quarterly sales targets and build a strong 12-month pipeline.\n\n\nRequirements\n\n\n\t3 years plus of experience working as an Enterprise Account Manager\n\tMaster’s Degree or MBA.\n\tStrong sales and business development acumen with a record of outstanding delivery.\n\tProven track record of success in managing large FinTech, Banks, and Telecommunications accounts.\n\tConversant with the use of data within business and Customer Experience concepts.\n\tExcellent negotiation, influencing and relationship-building skills.\n\tExcellent time management and business sales skills\n\tSelf-motivated and willing to work under pressure.\n\tExperience in working with a cross-culture team and a fast-paced environment\n\tAbility to understand business goals and recommend new approaches, policies and procedures to effect continual improvements in business objectives, and productivity.\n\tBusiness-driven, people-focused, with exceptional influencing skills.\n\n\nApplication Closing Date: 17th July, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their Resume to: hr@youverify.co using \"Enterprise Account Manager\" as the subject of the email.\n\n \n\n3.) Business Development Executive\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nResponsibilities\n\n\n\tPlanning and overseeing new marketing initiatives as well as developing and executing sales plans to meet and exceed monthly/quarterly revenue/sales goals.\n\tOversee the sales process to attract new clients.\n\tProcuring new clients through leads, direct contact, and collaboration with the marketing team.\n\tFollowing company guidelines and procedures for the acquisition of customers, submission of tenders, etc.\n\tMaintain fruitful relationships with clients (existing & potential) and address their needs effectively.\n\tSuggesting upgrades or added products and services that may be of interest to clients.\n\tResearch and identify new market opportunities and trends to ensure our offering remains relevant.\n\tPrepare and deliver pitches to potential customers.\n\tCollaborating with management on sales goals, planning, and forecasting; maintaining short- and long-term business development plans.\n\tDrafting business proposals and contracts to draw more revenue from clients.\n\tMaintain knowledge of all products and services offered by the company.\n\tWork with team members to identify and manage risks.\n\n\nRequirements\n\n\n\t3 years plus of experience working as an Enterprise Account Manager\n\tMaster’s Degree or MBA.\n\tStrong sales and business development acumen with a record of outstanding delivery.\n\tProven track record of success in managing large FinTech, Banks, and Telecommunications accounts.\n\tConversant with the use of data within business and Customer Experience concepts.\n\tExcellent negotiation, influencing and relationship-building skills.\n\tExcellent time management and business sales skills\n\tSelf-motivated and willing to work under pressure.\n\tExperience in working with a cross-culture team and a fast-paced environment\n\tAbility to understand business goals and recommend new approaches, policies\n\tand procedures to effect continual improvements in business objectives, and\n\tproductivity.\n\tBusiness-driven, people-focused, with exceptional influencing skills.\n\n\nApplication Closing Date: 17th July, 2025.\n\nMethod  of Application\nInterested and qualified candidates should send their Resume and portfolio to: hr@youverify.co using \"Business Development Executive\" as the subject of the    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n\n    \n    \n\n\n\n\n        \n        \n\n\n\n\n   \n\n\n    \n        Similar Jobs\n    \n\n    \n        \n                        Job Openings at Bottleking Limited\n                        Sales / Marketing Executive Job at FinLab Nigeria Limited\n                        Sales and Marketing Lead Job at Creatives Island (TCI)\n                        Accountant Job at Fresh County Limited\n                        Business Marketing Assistant Job at OPPO\n                        Job Vacancies at Firstfruit Housing Limited\n                        Accounting Assistant Job at OPPO\n                        Job Vacancies at Catilas Resource Limited\n                        Downstream Sales Officer Job at Catilas Resources Limited\n                        Credit Portfolio Manager\n                    \n    \n\n\n\n                        \n                    \n\n                    \n                        \n\n\n\n    \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n\n\n\n\n\n          \n\n\n    \n\n        Hottest Jobs\n\n        \n        \n            \n\n                Join our Cohort 32 and Become a Software Developer\n\n               \n            \n        \n            \n\n                Job Openings at the Concept Group\n\n               \n            \n        \n            \n\n                Job Openings at ABNL Limited\n\n               \n            \n        \n            \n\n                Job Vacancies at 9mobile\n\n               \n            \n        \n            \n\n                Job Openings at Lafarge Africa Plc\n\n               \n            \n        \n            \n\n                Analyst - Treasury Operations, Finance Job at MTN Nigeria\n\n               \n            \n        \n            \n\n                Analyst - Customer Acquisition and Compliance Job at MTN Nigeria\n\n               \n            \n        \n            \n\n                Job Vacancies at Carbon Nigeria\n\n               \n            \n        \n            \n\n                Receptionist Job at Management FIRST\n\n               \n            \n        \n            \n\n                Customer Service Representative - FMCG Job at Kiyix Recruitment Hub\n\n               \n            \n        \n        \n\n    \n\n\n\n\n        \n        \n   \n\n\n                    \n                            \n            \n        \n        \n        \n\n        \n\n    \n\n        \n\n            \n\n                \n\n                    Job Seekers\n\n                    \n\n                        Search for Jobs\n                         Featured Jobs\n                         Jobs by Specialization\n                         Jobs by Industry\n                         Jobs by Location\n                         \n                        Companies Currently Hiring\n\n                        Upload CV\n\n                        Free Aptitude Test Practice\n                        \n                        Scholarships and Financial Aid\n\n                        Testimonies\n                    \n\n                \n\n                \n\n                    Employers\n\n                    \n\n                        Post A Job\n\n                        Search Resumes/Profiles\n\n                        Create Employer Account\n\n                        Advertise\n\n                        Pricing\n\n                    \n\n                \n\n                \n\n                    Tools & Resources\n\n                    \n\n                        Contact us\n                        \n                        Our Blog\n  \n                        \n\n                        Job XML/RSS Feeds\n \n                        Free Aptitude Test Practice\n\n                        Bank Details\n\n                        FAQ & Support\n\n                    \n\n                \n\n                \n\n                    Connect with us\n\n                    \n\n                        \n\n                            \n\n                            \n\n                        \n\n                        \n\n                            \n\n                            \n\n                        \n\n                \n\n                        \n\n                            \n\n                            \n\n                        \n\n                    \n\n\n\n                    \n\n                        Customer Care\n\n                        09134259221 \n\n                        (9am - 5pm) weekdays\n\n                         info [at] jobgurus.com.ng\n\n                    \n\n\n\n                \n\n            \n\n        \n\n    \n\n\n\n    \n\n        \n\n\n\n            \n\n                Privacy Policy\n\n                Terms & Conditions\n\n                Sitemap\n                \n                About us\n\n            \n\n\n\n            Copyright © 2025 Jobgurus.com.ng - Latest Jobs in Nigeria 2025. All right reserved.",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]