[
  {
    "title": "Loan Recovery / Collections Specialist Job at Renda Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/loan-recovery-collections-specialist-job-at-renda-limited",
    "pubDate": "Tue, 24 Jun 2025 12:33:00 GMT",
    "source": "JobGurus",
    "keyword": "renda limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Renda is a technology solution that aggregates and digitizes access to the end-to-end logistics and fulfillment infrastructure that enables businesses to scale seamlessly and efficiently across Africa.\n\nWe are recruiting to fill the position below:\n\nJob Position: Loan Recovery / Collections Specialist\nJob Location: Ilupeju, Lagos\nEmployment Type: Full-time\n\nDescription\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tSCALE is Renda’s Value-Added Services (VAS) and credit platform that powers essential mobility solutions such as vehicle repairs, fueling, insurance, CNG conversion, and financing.\n\tThrough SCALE, we support drivers, fleet owners, and operators with access to tailored financial and operational services.\n\tWe are seeking a diligent and result-oriented Loan Collection/Recovery Specialist to support the timely repayment of loans and enforce agreed repayment terms.\n\tThe ideal candidate will have strong interpersonal skills, persistence, and a commitment to maintaining professionalism while driving results.\n\n\nKey Responsibilities\n\n\n\tEngage directly with SCALE beneficiaries to recover outstanding loan repayments.\n\tEducate beneficiaries on repayment terms, timelines, and the implications of default.\n\tEscalate unresolved or high-risk accounts following internal recovery protocols.\n\tCollaborate with the finance, risk, and VAS teams to reconcile account statuses.\n\tNegotiate and document revised payment plans where necessary.\n\tMaintain accurate logs of repayment efforts and report daily activities.\n\tEnsure all recovery efforts comply with company policies and regulatory standards.\n\n\nKey Performance Indicators (KPIs)\n\n\n\tLoan recovery rate (%).\n\tRepayment promise-to-actual conversion rate.\n\tNumber of successful recoveries per period.\n\tAccuracy and timeliness of recovery reports.\n\tCompliance with escalation and documentation procedures.\n\n\nKey Qualifications & Requirements\n\n\n\tCandidates should possess relevant qualifications in a related field.\n\t5 years of experience in loan collection, debt recovery, or credit control.\n\tStrong negotiation, communication, and problem-solving skills.\n\tHigh level of professionalism, integrity, and persistence.\n\tAbility to work independently, manage multiple accounts, and meet deadlines.\n\tFamiliarity with basic reporting tools (e.g., Google Sheets, Excel).\n\tFluency in English (local language proficiency is an added advantage).\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: careers@renda.co using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Tax & Audit Officer Job at Petrogap Oil and Gas Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/tax-audit-officer-job-at-petrogap-oil-and-gas-limited",
    "pubDate": "Tue, 24 Jun 2025 12:33:00 GMT",
    "source": "JobGurus",
    "keyword": "petrogap oil and gas limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Petrogap Oil and Gas Limited was incorporated as a response to the emerging trends in the dynamic Oil & Gas industry. We are a wholly indigenous company and registered player in the Upstream, Midstream and Downstream sectors of the Oil & Gas industry.\n\nWe are recruiting to fill the position below:\n\nJob Position: Tax & Audit Officer\n\nJob Location: Victoria Island, Lagos\nEmployment Type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Tax and Audit Officer is responsible for all tax planning, compliance, and audit functions of the organization.\n\tThe role ensures full compliance with statutory regulations, coordinates external and internal audits, manages tax risks, and advises management on tax strategies to improve financial efficiency and compliance.\n\n\nResponsibilities\nTax Management:\n\n\n\tEnsure timely and accurate preparation and filing of all tax returns (CIT, VAT, PAYE, WHT, etc.).\n\tDevelop tax planning strategies to optimize tax liabilities within legal bounds.\n\tMonitor changes in tax laws and assess their impact on the company’s operations.\n\tLiaise with tax authorities and external tax consultants to resolve tax issues or audits.\n\tMaintain proper documentation of all tax transactions and correspondence.\n\n\nAudit Oversight:\n\n\n\tPlan and coordinate internal and external audit processes.\n\tLiaise with external auditors to ensure timely and accurate completion of statutory audits.\n\tReview and assess internal controls and recommend improvements.\n\tInvestigate audit findings and implement corrective actions.\n\tPrepare and present audit reports to senior management.\n\n\nCompliance and Risk Management:\n\n\n\tEnsure compliance with all applicable local and international financial regulations.\n\tIdentify and assess areas of financial risk and recommend mitigating measures.\n\tMaintain up-to-date knowledge of industry and regulatory developments.\n\n\nRequirements\n\n\n\tBachelor’s Degree in Accounting, Finance, or a related field.\n\tMinimum of 4 – 6 years of experience in tax and audit.\n\tProfessional certification (e.g., ACA, ACCA, ICAN) is required.\n\tExperience in the oil & gas or manufacturing industry is an added advantage.\n\n\nSkills & Competencies:\n\n\n\tIn-depth knowledge of Nigerian tax laws and regulations.\n\tStrong understanding of audit standards and procedures.\n\tExcellent analytical and problem-solving skills.\n\tHigh level of integrity and attention to detail.\n\tStrong communication and interpersonal skills.\n\tProficiency in accounting and ERP software (e.g., SAP, Sage, QuickBooks).\n\n\nSalary\nVery Attractive.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: careers.pgog@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Supply Chain Manager Job at Oilserv Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/supply-chain-manager-job-at-oilserv-limited-3",
    "pubDate": "Tue, 24 Jun 2025 12:33:00 GMT",
    "source": "JobGurus",
    "keyword": "oilserv limited",
    "duplicate": false,
    "classifications": [],
    "content": "Oilserv Limited is a leading provider of integrated engineering, procurement, construction, installation & commissioning (EPCIC) services and complementary solutions across the asset and program life cycle within the onshore, offshore and subsea market segments of the oil and gas sector. Oilserv Limited was incorporated in 1992 and commenced operations in 1995.\n\nWe are recruiting to fill the position below:\n\nJob Position: Supply Chain Manager\nJob Location: Rivers\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDevelop, improve, and fulfill organizational and functional objectives in procurement and supply.\n\tFormulate direction, manage change, and lead and influence internal and external procurement and supply stakeholders.\n\tOversee the development and execution of project procurement and resource plans.\n\tLead procurement teams within the organization, develop procurement strategies and establish best practices.\n\n\nJob Details\n\n\n\tEnsure that the procurement and supply function aligns with the achievement of the organization's sources of competitive advantage.\n\tCreate and implement appropriate strategies and plans (project procurement and resource plans) with stakeholders to increase value from supply chain management.\n\tWork with stakeholders to mitigate or manage risks that can impact supply chains.\n\tWork with stakeholders to eliminate bribery, corruption, and fraud in supply chains.\n\tAssess and manage stakeholder expectations through a controlled and value-adding process.\n\tPromote effective relationships with suppliers and internal stakeholders to secure their commitment to processes, systems, practices, and strategy objectives.\n\tIdentify and explore opportunities for globalization in the procurement of goods and services.\n\tContribute to the management of the procurement and supply chain function taking steps to mitigate challenges and difficulties in resolving conflict within the organization and with its supply chains.\n\tGuide stakeholders to use technologies that help effective communication to support the achievement of supply chain business outcomes.\n\tDemonstrate leadership behaviours and styles to promote procurement and supply chain management with internal and external stakeholders.\n\tAdvise colleagues and other stakeholders on how to promote ethical and sustainable procurement in the organization and its supply chain.\n\tAdvise colleagues and other stakeholders on cultural and social issues that can affect supply chains.\n\tEvaluate the impact of customs unions, trade areas, and trade blocs on any restrictions or opportunities for global sourcing.\n\tIdentify the potential impact of STEEPLED criteria on the organization and its supply chain and draw up plans to maximize the benefits and mitigate difficulties. Monitor and ensure compliance with the licensing and documentation for imports and exports that affect the organization.\n\tProvide advice to colleagues and other stakeholders on the impact of tariffs and duties on imports and exports arranging appropriate actions when necessary.\n\n\nRequirements\n\n\n\tMinimum of 10 years of experience in the procurement function \n\tEngineering background is preferred\n\tMBA is an added advantage\n\tMust be an MCIPS - Completed level 6 or equivalent\n\n\nBenefits\n\n\n\tGreat work culture and multiple opportunities for growth and self-development. \n\t26 days of annual leave, excluding federal public holidays. \n\tHealth Insurance coverage. \n\tMonthly employer pension contribution. \n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Office Assistant Job at Globalclique Resources",
    "link": "https://www.jobgurus.com.ng/jobs/view/office-assistant-job-at-globalclique-resources",
    "pubDate": "Tue, 24 Jun 2025 12:33:00 GMT",
    "source": "JobGurus",
    "keyword": "globalclique resources",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Globalclique HR - Our client, Mo Grills, is one of Lagos’ fast-rising culinary brands, known for delivering premium food experiences with unmatched flavor and service. Located in the heart of Ikota, Lekki, they are redefining the casual dining landscape through exceptional customer service and operational excellence.\n\nAs part of their expansion, they are seeking a reliable and well-organized candidate to fill the position below:\n\nJob Position: Office Assistant\n\nJob Location: Ikota, Lekki - Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe ideal candidate is dependable, detail-oriented, and able to multitask in a dynamic food service environment.\n\tYou will support the team in ensuring smooth office operations, maintaining documentation, and assisting in basic logistical and clerical duties.\n\n\nKey Responsibilities\n\n\n\tHandle basic clerical and administrative tasks, including filing, photocopying, and record-keeping.\n\tRun errands such as purchasing office supplies, dispatching documents, or coordinating deliveries.\n\tSupport inventory checks and stock updates for the restaurant.\n\tAssist with communication between kitchen, service staff, and management.\n\tKeep the office environment clean, organized, and well-stocked.\n\tReceive visitors and assist with basic customer or vendor inquiries.\n\tHandle simple correspondence and report submission as directed.\n\tProvide ad hoc support to other departments when needed.\n\n\nRequirements\n\n\n\tSSCE / OND / NCE in any discipline.\n\tMinimum of 1 year of experience in a similar support role is an advantage.\n\tAbility to communicate clearly and professionally.\n\tTrustworthy, punctual, and organized.\n\tBasic computer knowledge (MS Word/Excel) is an added advantage.\n\tWillingness to learn and take initiative.\n\tResides within Lekki or surrounding areas.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hr@globalclique.net using \"Office Assistant\" as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Social Media Manager / Content Creator Job at Ziba Consulting",
    "link": "https://www.jobgurus.com.ng/jobs/view/social-media-manager-content-creator-job-at-ziba-consulting",
    "pubDate": "Tue, 24 Jun 2025 12:33:00 GMT",
    "source": "JobGurus",
    "keyword": "ziba consulting",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Ziba Consulting is a dynamic recruitment and consulting firm committed to connecting top talent with the right opportunities. Our mission is to help businesses streamline their hiring processes while supporting job seekers in achieving their career goals.\n\nWe are recruiting to fill the position below:\n\nJob Position: Social Media Manager / Content Creator\nJob Location: Lekki Phase I, Lagos\nEmployment Type: Full-Time\nWork Mode: Hybrid\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are currently seeking a creative and strategic Social Media Manager with strong content creation skills to join our team.\n\tThe ideal candidate will help enhance our digital presence, engage our audience, and position our brand as a leading voice in the HR and recruitment industry.\n\n\nKey Responsibilities\n\n\n\tDevelop and execute a comprehensive social media strategy aligned with business objectives.\n\tManage and grow the company’s presence across platforms, including LinkedIn, Instagram, Twitter (X), Facebook, and TikTok.\n\tCreate, curate, and schedule high-quality, engaging content (text, images, videos, reels, infographics) tailored to each platform.\n\tMonitor social and industry trends; implement innovative campaigns to increase brand awareness, engagement, and lead generation.\n\tManage paid social advertising campaigns on platforms such as LinkedIn, Facebook, and Instagram.\n\tWork with designers, copywriters, and external vendors to develop strong visual and written content.\n\tCollaborate with the recruitment team to promote job openings, employer branding content, and career development tips.\n\tEngage actively with followers, respond to comments and inquiries, and build a strong online community.\n\tUse analytics tools to track and report performance, adjusting strategies for optimal results.\n\tStay updated on platform algorithm changes, digital trends, and best practices to maintain a competitive edge.\n\n\nKey Requirements\n\n\n\tBachelor’s degree in Marketing, Communications, Business, or a related field.\n\t2–3 years of proven experience as a Social Media Manager or in a similar role, preferably in recruitment, HR, or consulting.\n\tStrong content creation skills — including experience with graphic design, short-form video editing, and storytelling.\n\tProficiency in tools such as Canva, Adobe Creative Suite, or similar content creation platforms.\n\tFamiliarity with social media management tools (e.g., Hootsuite, Buffer).\n\tSolid understanding of SEO, paid social advertising, and analytics (e.g., Google Analytics, Meta Business Suite, LinkedIn Analytics).\n\tExcellent copywriting and verbal communication skills.\n\tStrong attention to detail, creativity, and ability to manage multiple projects in a fast-paced environment.\n\n\nWhy Join Us?\n\n\n\tWork in a fast-growing recruitment and consulting firm with strong industry impact.\n\tShape the digital voice and employer brand of a reputable HR consultancy.\n\tCollaborative team environment with room for growth and learning.\n\n\nSalary\nN150,000 - N200,000 per month\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]