[
  {
    "title": "PR / Media Director Job at Choice Talents NG",
    "link": "https://www.jobgurus.com.ng/jobs/view/pr-media-director-job-at-choice-talents-ng-2",
    "pubDate": "Mon, 16 Jun 2025 11:14:04 GMT",
    "source": "JobGurus",
    "keyword": "choice talents ng",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Choice Talents NG is Nigeria’s preferred talents management company. Our goal is to help build successful businesses through effective talent, resource and process management.\n\nWe are recruiting to fill the position below:\n\nJob Position: PR / Media Director\nJob Location: Abuja (FCT)\nEmployment Type: Full-time\n\nAbout the Job\n\n\n\tWe are looking for a very senior editor well experienced with print, radio and TV media, to manage the public relations responsibilities of an international NGO.\n\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDevelop and maintain strong relationships with key media outlets, journalists, and influencers to secure positive press coverage.\n\tDraft and distribute press releases, media advisories, and pitch materials.\n\tRespond to media inquiries and coordinate media interviews with company spokespeople.\n\tDevelop and implement crisis communication plans and manage communication during sensitive or critical situations.\n\tAct as the company’s spokesperson during a crisis, providing clear, timely, and accurate information to the media.\n\tWrite press releases, articles, speeches, blog posts, op-eds, articles, and other communication materials as needed.\n\tWork with senior leadership to develop and execute PR strategies that align with the company’s goals and objectives.\n\tEstablish and maintain a clear and consistent voice for the brand across all communication channels.\n\tProvide strategic counsel to executives on media interactions and public appearances.\n\tOversee the creation of compelling, media-friendly content, ensuring alignment with objectives.\n\tPlan and coordinate press events, conferences, and other public relations activities.\n\tRepresent the organization at industry events, media interviews, and public speaking engagements.\n\tTrack media coverage and report on the effectiveness of PR campaigns and media outreach.\n\tAnalyze trends in media coverage and public opinion to adapt strategies and improve outcomes.\n\tLead and mentor junior PR team members, providing guidance and support in their professional development.\n\tCollaborate with marketing, social media, and other internal teams to ensure cohesive and effective communication strategies.\n\n\nRequirements\n\n\n\tBachelor’s Degree in Public Relations, Communications, Journalism, or a related field (Master’s degree preferred).\n\t15+ years of experience in public relations, with a focus on media relations and corporate communications.\n\tProven track record of developing and executing successful PR campaigns and securing positive media coverage.\n\tExceptional written and verbal communication skills, with the ability to craft compelling narratives.\n\tStrong media relationships with local, national, and trade press.\n\tExperience in crisis communication and handling sensitive issues.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: jobs@choicetalents.com.ng using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Project Manager Job at WIOCC Nigeria Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/project-manager-job-at-wiocc-nigeria-limited-1",
    "pubDate": "Mon, 16 Jun 2025 11:14:04 GMT",
    "source": "JobGurus",
    "keyword": "wiocc nigeria limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "WIOCC is the leading player in the deployment of carrier-scale, future-proofed network infrastructure into Africa. We have the flexibility and scale to meet the ever-growing demand for reliable, high-speed capacity throughout Africa, driven by end consumers, enterprise users and the ecosystem that supports them. Our policy of continual investment in our network to create Africa’s first, truly hyperscale network infrastructure means ongoing investment for growth, ensuring our readiness to meet the future data volume demands of end users throughout Africa.\n\nWe are recruiting to fill the position below:\n\nJob Position: Project Manager\n\nJob Location: Lagos\nEmployment Type: Full Time\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Objective\n\n\n\tThis role oversees planning, implementing and executing individual projects and group-related company projects in a coordinated manner to obtain benefits and control.\n\n\nKey Duties & Responsibilities\nProject Management & Execution:\n\n\n\tLead and manage WIOCC’s network infrastructure projects to ensure timely and successful completion\n\tOversee client orders from pre-sales solution design to final handover, ensuring high levels of client satisfaction\n\tDevelop and maintain project charters, project plans, risk registers, budgets and lessons learned documentation\n\tMonitor project delivery milestones to ensure alignment with client target timelines\n\n\nStakeholder & Client Engagement:\n\n\n\tCollaborate closely with account managers to understand client requirements and ensure project alignment\n\tServe as the primary point of contact for clients, providing regular and accurate project updates and reports\n\tManage relationships with internal teams, stakeholders and WIOCC clients effectively\n\tEnsure seamless handovers to internal teams, aligning with client specifications\n\n\nCross-Functional Coordination:\n\n\n\tLead virtual project teams consisting of Engineering, Operations, Legal, Procurement, Logistics and Finance\n\tEngage and manage third-party suppliers to ensure compliance with client specifications, service level agreements (SLAs), and quality standards\n\tAddress and mitigate project concerns, contractual challenges and risks, escalating issues where necessary\n\n\nProcess & Performance Improvement:\n\n\n\tActively participate in and promote the project gate review process\n\tOversee vendor and logistics management, ensuring timely delivery of materials and services\n\tEnsure data accuracy within NetSuite and other project management tools\n\tServe as a deputy for the Programme Manager as required and contribute to ad-hoc reporting\n\tActively participate in process improvement and automation initiatives\n\n\nMinimum Qualifications\n\n\n\tBachelor’s Degree (or equivalent; a master’s degree is an added advantage) in a technical field or equivalent relevant experience\n\tMust be bilingual (English and French proficiency)\n\tPMP, PRINCE2, or AGILE certification or equivalent\n\tProficient in Microsoft Project\n\n\nExperience & Skills:\n\n\n\tA minimum of 5 years of technical experience in the telecom industry, with at least 3 years in a project management role\n\tStrong background in fibre network project management\n\tEffective project management skills, including experience in written and verbal communication, as evidenced by work history and accomplishments\n\tStrong written and verbal communication skills, with the ability to summarise and present key information to stakeholders concisely\n\tProficiency in using B/OSS tools and experience with the Microsoft Office suite, including MS Project\n\tDemonstrated ability to manage multiple priorities and solve problems in a fast-paced environment\n\tFamiliarity with WIOCC network technologies, including Subsea, OTN, DWDM, SDH and Data (Ethernet, IP/MPLS, OSPF, BGP), is preferred\n\tExcellent interpersonal skills, including active listening, negotiation and conflict resolution\n\tAbility to work cross-functionally and influence teams in a matrix environment\n\n\nAttributes:\n\n\n\tStrong team leader and manager of virtual teams; motivated, persistent, and able to manage stress\n\tClient-focused with confidence and relationship-building skills\n\tIntegrity and honesty with high ethical standards and strong negotiation skills\n\tPassionate, adaptable and flexible\n\tCommitted to personal excellence, accuracy and attention to detail\n\tCollaborative and results-driven through teamwork and partnerships\n\tStrong analytical skills with the ability to collate and interpret data from various sources\n\tExcellent communicator in both English and French, with a natural aptitude for dealing with people\n\tCreative thinker with excellent problem-solving skills\n\tCommercially aware, numerate and articulate\n\tExceptional network diagnostic skills.\n\n\nMethod of Application\nInterested and qualified candidates should send their updated CV including three referees to: applications@wiocc.net using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Quality Assurance Executive Job at Husk Power Energy Systems Nigeria Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/quality-assurance-executive-job-at-husk-power-energy-systems-nigeria-limited",
    "pubDate": "Mon, 16 Jun 2025 11:14:04 GMT",
    "source": "JobGurus",
    "keyword": "husk power energy systems nigeria limited",
    "duplicate": false,
    "classifications": [],
    "content": "Husk is one of the world’s leading rural energy providers. We provide low-cost and reliable power to rural households and businesses, entirely from renewable energy sources. Powering economic possibilities in every village is at the heart of everything we do.\n\nWe design, build and operate the lowest cost hybrid (solar and biomass) power plant and distribution network in India and Africa. To date, Husk has provided electricity to over 15,000 homes and business, reducing 95,000 tonnes of CO2. Our aim is to provide 30MW of power to 225,000 customers by 2025, and save 350,000 tonnes of CO2 each year.\n\nWe are recruiting to fill the position below:\n\nJob Position: Quality Assurance Executive\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Location: Lafia, Nasarawa\nReports to: Quality Manager\n\nRole Summary\n\n\n\tWe are looking to hire an experienced Quality Assurance (QA) Executive who will be responsible for conducting daily quality inspections, ensuring that all materials and work on-site meet project specifications and standards, maintaining quality documentation, assisting in testing and and ensure all new HMG meets all project requirement  and specification before HOTO, and promptly reporting and supporting the resolution of any quality issues during project execution.\n\tThis role reports to the QHSSE Manager and will work in conjunction with the quality and safety procedures of the organization.\n\n\nKey Responsibilities\n\n\n\tExecute daily QA/QC checks for Hybrid Mini-Grid (HMG) and related rural electrification projects.\n\tMaintain inspection checklists, quality documentation, and reports\n\tSupport in material receipt inspections at the warehouse and ensure compliance with specifications.\n\tAssist in testing, commissioning, and documentation for site acceptance Before (HOTO)\n\tEscalate quality issues and support resolution under guidance of QA manager\n\tEnsure compliance with internal QA processes and safety protocols\n\n\nQualifications\nRequired Skills & Attributes:\n\n\n\t2 - 5 years of QA/QC experience, preferably in solar or renewable energy projects.\n\tBachelors degree in Mechanical or Electrical Engineering.\n\tRequired certifications such as NEMSA HSSE certificate are desirable\n\tWorking knowledge of solar PV system components and installations.\n\tFamiliarity with ISO 9001, IEC standards, and construction QA/QC procedures.\n\tStrong attention to detail, reporting, documentation, and communication skills.\n\tDemonstrated ability to work cross-functionally with other departments, to promote best practices, and to develop solutions to business challenges\n\tExperience in construction, tech, solar or similar industries preferred.\n\n\nSalary\nNegotiable based on experience.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "HR and Admin Executive Job at AT Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/hr-and-admin-executive-job-at-at-limited-1",
    "pubDate": "Mon, 16 Jun 2025 11:14:04 GMT",
    "source": "JobGurus",
    "keyword": "at limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "AT Limited is a dynamic and innovative provider of human capital solutions, specializing in Recruitment, Outsourcing, Consulting, and Business Contracting services. Our mission is to connect businesses with top talent, drive growth, and deliver exceptional results.\n\nWe are recruiting to fill the position below:\n\nJob Position: HR and Admin Executive\n\nJob Location: Asokoro, Abuja (FCT)\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking an enthusiastic and detail-oriented HR/Admin Officer to join our real estate company in Abuja.\n\tThe ideal candidate must have a strong background in human resource management, recruitment, and employee relations.\n\tThis role requires a proactive professional with excellent organizational skills and the ability to foster a positive work environment while supporting the company’s strategic objectives.\n\tThe successful candidate will be responsible for managing HR functions, including recruitment, onboarding, employee engagement, and compliance with labor regulations.\n\tThis role involves working closely with management to support talent acquisition and employee development initiatives.\n\n\nKey Responsibilities\n\n\n\tManage the full recruitment cycle, including job postings, candidate sourcing, interviews, and selection.\n\tCoordinate onboarding processes to ensure smooth integration of new employees.\n\tMaintain accurate employee records and manage HR databases and systems.\n\tAdminister payroll, benefits, and attendance records in compliance with company policies.\n\tConduct performance evaluations and support managers in setting employee goals and development plans.\n\tEnsure compliance with Nigerian labor laws and industry regulations.\n\tDevelop and implement HR policies and procedures to align with organizational goals and legal requirements.\n\tFacilitate employee training programs and professional development initiatives.\n\tHandle employee relations, including conflict resolution, grievances, and disciplinary actions.\n\tPrepare HR reports and analytics to support strategic decision-making.\n\n\nRequirements & Qualifications\n\n\n\tBachelor’s Degree in Human Resources, Business Administration, or a related field.\n\tMinimum of 2 years of experience in HR management, preferably in real estate or a related industry.\n\tStrong knowledge of HR practices, recruitment strategies, and Nigerian labor laws.\n\tExcellent communication, interpersonal, and conflict-resolution skills.\n\tProficiency in Microsoft Office Suite and HR software (e.g., HRIS or payroll systems).\n\tAbility to maintain confidentiality and handle sensitive information with discretion.\n\tStrong organizational skills with the ability to multitask in a fast-paced environment.\n\tGoal-oriented with a focus on fostering a positive and inclusive workplace culture.\n\tCertification in HR (e.g., CIPM or equivalent) is an added advantage.\n\tAbility to work independently and collaboratively with cross-functional teams.\n\n\nSalary\nN100,000 Gross\n\nMethod of Application\nInterested and qualified candidates should send their CV and a cover letter to: hr.department.atlimited@gmail.com using \"Application for HR/Admin Officer\" as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "HR / Recruitment Officer Job at Buckler Systems",
    "link": "https://www.jobgurus.com.ng/jobs/view/hr-recruitment-officer-job-at-buckler-systems-2",
    "pubDate": "Mon, 16 Jun 2025 11:14:04 GMT",
    "source": "JobGurus",
    "keyword": "buckler systems",
    "duplicate": false,
    "classifications": [],
    "content": "Buckler Systems is a Nigerian defense solutions provider with strong expertise in manufacturing civilian armored vehicles, design, and prototyping of military vehicles and ordnance equipment.\n\nWe are recruiting to fill the position below:\n\nJob Position: HR / Recruitment Officer\nJob Location: Lekki, Lagos\nEmployment Type: Full-time\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tTalent Acquisition: Lead and manage the full recruitment cycle, including job postings, candidate sourcing, interviewing, and selection.\n\tOnboarding: Facilitate a seamless onboarding process for new hires, ensuring they are well-integrated into the company culture and equipped for success.\n\tEmployee Relations: Serve as a point of contact for employee queries and issues, fostering a positive and supportive workplace environment.\n\tHR Administration: Maintain and update employee records, ensuring accuracy and compliance with company policies and legal requirements.\n\tPerformance Management: Support performance appraisal processes, providing guidance and feedback to employees and managers.\n\tHR Projects: Contribute to the development and implementation of HR initiatives and projects that enhance organizational effectiveness.\n\n\nQualifications\n\n\n\tEducational Background: A degree in Human Resources, Business Administration, or a related field is preferred.\n\tExperience: 2-4 years of proven experience in HR and recruitment roles, with a strong understanding of best practices and employment legislation.\n\tTechnical Proficiency: Proficiency in HR software and Microsoft Office Suite (Outlook, Word, Excel, PowerPoint).\n\tInterpersonal Skills: Exceptional communication and interpersonal skills, with the ability to build strong relationships across all levels of the organization.\n\tOrganizational Skills: Strong organizational and multitasking abilities, with a keen attention to detail.\n\tProblem-Solving Ability: Demonstrated ability to handle sensitive issues with discretion and implement effective solutions.\n\n\nWhy Join Buckler Systems?\n\n\n\tProfessional Development: Opportunities for continuous learning and career advancement in a supportive and innovative environment.\n\tCollaborative Culture: Be part of a team that values creativity, collaboration, and professional growth.\n\tCompetitive Compensation: Attractive salary and benefits package commensurate with your skills and experience.\n\tImpactful Work: Contribute to the success of a company that is shaping the future of [Industry/Field].\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]