[
  {
    "title": "Social Media Manager / Content Creator (Female) Job at Bonzee Consulting",
    "link": "https://www.jobgurus.com.ng/jobs/view/social-media-manager-content-creator-female-job-at-bonzee-consulting",
    "pubDate": "Fri, 20 Jun 2025 18:21:06 GMT",
    "source": "JobGurus",
    "keyword": "bonzee consulting",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Bonzee Consulting - Our client is recruiting suitable candidates to fill the position below:\n\nJob Position: Social Media Manager / Content Creator (Female)\n\nJob Location: Lekki Phase 1, Lagos\nEmployment Type: Full-time\nWork Mode: Hybrid (Once or twice a week)\nIndustry: Home and Lifestyle luxury\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tOur client is seeking a highly skilled and experienced Social Media Manager to lead our social media strategy and execution.\n\tThe successful candidate will be responsible for developing and implementing a comprehensive social media strategy that aligns with our business goals and objectives.\n\n\nKey Responsibilities\n\n\n\tDevelop and implement social media strategy: Create and execute a social media strategy that aligns with our business goals and objectives.\n\tManage social media accounts: Manage and maintain our social media presence across multiple platforms, including Facebook, Twitter, Instagram, LinkedIn, and YouTube.\n\tCreate engaging content: Develop and curate high-quality, engaging content that resonates with our target audience.\n\tBuild and grow online communities: Build and grow our online communities by responding to comments, messages, and reviews in a timely and professional manner.\n\tMonitor and analyze performance metrics: Monitor and analyze social media performance metrics, including engagement rates, follower growth, and conversions.\n\tRun social media ads: Plan, execute, and optimize social media ads to drive website traffic, generate leads, and boost sales.\n\tCollaborate with cross-functional teams: Collaborate with cross-functional teams, including marketing, communications, and customer service, to ensure alignment and maximize impact.\n\tStay up-to-date with industry trends: Stay up-to-date with the latest social media trends, best practices, and platform changes.\n\n\nRequirements\n\n\n\tA Bachelor's Degree in Marketing, Communications, or a related field is required.\n\tA minimum of 2 years of experience in social media management is required.\n\tA proven track record of success in developing and executing social media strategies that drive engagement, conversions, and sales.\n\tExcellent communication and writing skills are required.\n\tExperience with social media management tools, such as Hootsuite, Sprout Social, or Buffer, is required.\n\tKnowledge of social media advertising platforms, such as Facebook Ads Manager or LinkedIn Ads, is essential.\n\n\nSalary\nN200,000 - N250,000 per month.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: Careers@bonzeeconsulting.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Locum Pharmacist Job at Kiyix Recruitment Hub",
    "link": "https://www.jobgurus.com.ng/jobs/view/locum-pharmacist-job-at-kiyix-recruitment-hub",
    "pubDate": "Fri, 20 Jun 2025 18:21:06 GMT",
    "source": "JobGurus",
    "keyword": "kiyix recruitment hub",
    "duplicate": false,
    "classifications": [],
    "content": "Kiyix Recruitment Hub is a recruitment/HR consulting firm and our goal is to to help create one million jobs in Nigeria by 2030. At Kiyix recruitment hub, we help make recruitment a stress-free experience for both the employer and the potential job seekers.\n\nWe are recruiting to fill the position below:\n\nJob Position: Locum Pharmacist\n\nJob Location: Oworonshoki, Lagos\nEmployment Type: Part Time (Morning / Evening Shift)\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are looking for a qualified and registered Locum Pharmacist to cover shifts in our community pharmacy.\n\tAs a Locum Pharmacist, you will be responsible for providing pharmaceutical services, advising patients, and working collaboratively with our pharmacy team.\n\n\nResponsibilities\n\n\n\tDispense medications and provide patient counselling\n\tManage and monitor patient medication regimens\n\tMaintain accurate patient records and comply with relevant legislation\n\tProvide health advice and promote healthy lifestyles\n\tWork collaboratively with the pharmacy team and other healthcare professionals\n\tParticipate in continuing professional development to stay up-to-date with industry developments\n\n\nRequirements\n\n\n\tRegistered pharmacist with the General Pharmaceutical Council (GPhC)\n\tValid practicing certificate\n\tExperience working in a community pharmacy setting\n\tExcellent communication and interpersonal skills\n\tAbility to work independently and as part of a team\n\tReliable and flexible with a commitment to providing high-quality patient care.\n\n\nSalary\nN100,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should forward their application, including their Application, including their CV to: kicvacancy@gmail.com using the Job Position as the subject of the mail.\n\nNote: For Inquiries, WhatsApp to 09063916949.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Claims Officer, HMO Job at Mediplan Healthcare Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/claims-officer-hmo-job-at-mediplan-healthcare-limited",
    "pubDate": "Fri, 20 Jun 2025 18:21:06 GMT",
    "source": "JobGurus",
    "keyword": "mediplan healthcare limited",
    "duplicate": false,
    "classifications": [],
    "content": "Mediplan Healthcare Limited is a Health Maintenance Organization established to provide healthcare services to corporate organizations and members of the public under a prepaid payment structure.\n\nWe are recruiting to fill the position below:\n\nJob Position: Claims Officer, HMO\nJob Location: Lagos\n\nRequirements\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tInterested and qualified candidates shouldmay be a registered Nurse (RN) / BNSC with1-3 years of work experience and must be able to work on Claims Adjudication with experience within an HMO industry.\n\tHe or she must also be af ast learner and have passion for the job and also proficient in Microsoft word, excel.\n\n\nMethod of Application\nInterested and qualified candidates should send their updated CVs to: career@mediplanhealthcare.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Internal Auditor Job at Interswitch",
    "link": "https://www.jobgurus.com.ng/jobs/view/internal-auditor-job-at-interswitch",
    "pubDate": "Fri, 20 Jun 2025 18:21:06 GMT",
    "source": "JobGurus",
    "keyword": "interswitch",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Interswitch is an Africa-focused integrated digital payments and commerce company that facilitates the electronic circulation of money as well as the exchange of value between individuals and organisations on a timely and consistent basis. We started operations in 2002 as a transaction switching and electronic payments processing, and have progressively evolved into an integrated payment services company, building and managing payment infrastructure as well as delivering innovative payment products and transactional services throughout the African continent. At Interswitch, we offer unique career opportunities for individuals capable of playing key roles and adding value in an innovative and fun environment.\n\nWe are recruiting to fill the position below:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Position: Internal Auditor\n\nJob Location: Lagos\n\nJob Summary\n\n\n\tReporting to the Div. Head, Business Process and Shared Services Audit, the Internal Auditor will execute assurance, and other internal audit engagements testing as part of the annual risk-based internal audit plan.\n\tThe role requires requisite internal audit competencies with knowledge of business processes, the International Standard for the Professional Practice of Internal Auditing and other global standards.\n\n\nKey Roles & Responsibilities\n\n\n\tPerform sections of assurance, consulting engagements, special requests, and management requests\n\tPrepare work programs for assigned sections of audits and other necessary documentation\n\tCommunicate draft findings and recommendations through written reports to the Senior Internal Auditor\n\tDocument audit work in concise work papers, collate observations, and communicate results per internal audit standards\n\tPropose and evaluate value-adding recommendations to strengthen internal controls, policies, and procedures\n\tProvide timely feedback to the Divisional Head, Business Process and Shared Services Audit, on engagement status\n\tCollaborate with audit team members to complete and close out each audit engagement\n\tPerform non-standard or ad hoc requests, including spot checks and investigations\n\tHandle administrative tasks as assigned by internal audit management\n\tMaintain the overdue actions database and liaise with process owners for implementation updates\n\tPlan and organize workload, manage multiple tasks, and adjust priorities as needed\n\tExecute other duties as directed by Internal Audit Management\n\tUse CAAT (Computer-Assisted Audit Techniques) tools for efficient project delivery\n\tUphold Interswitch and professional ethical standards, ensuring audit activities align with International Standards for the Professional Practice of Internal Auditing and IIA Code of Ethics.\n\n\nExperience and Qualifications Required\n\n\n\tFirst Degree in any business-related discipline (e.g., Accounting, Finance, Economics, etc.)\n\t3 - 5 years of internal and/or external audit experience in a reputable organisation\n\tACA, CIA, CISA, or other relevant professional certifications are an added advantage\n\tExperience in a fintech or payment services firm, Big 4 professional services firm, bank, financial services, or technology company is an advantage\n\tStrong knowledge and application of best practice audit standards, modern audit techniques, and tools\n\tProficiency in data analytics and continuous auditing is an added advantage\n\tDemonstrated understanding of common fraud schemes and red flags.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Personal Assistant to the Hospital Administrator Job at St. Dominic Catholic Hospital",
    "link": "https://www.jobgurus.com.ng/jobs/view/personal-assistant-to-the-hospital-administrator-job-at-st-dominic-catholic-hospital",
    "pubDate": "Fri, 20 Jun 2025 18:21:06 GMT",
    "source": "JobGurus",
    "keyword": "st. dominic catholic hospital",
    "duplicate": false,
    "classifications": [],
    "content": "St. Dominic Catholic Hospital is a 64-bed hospital located in Ogungbade off New Ife road in Ibadan. St. Dominic Catholic Hospital is the vision of the Dominican Sisters of St. Catherine of Siena (Italy). We offer various medical services such as: General medicine, internal medicine, O & G, Laboratory, and Radiology, to mention just a few. The hospital is run in collaboration with foreign partners. We are registered and licensed by the Corporate Affairs Commission and the Ministry of Health. Also, we are accredited by the NHIS as both primary and secondary health care providers.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Personal Assistant to the Hospital Administrator\nJob Location: Ibadan, Oyo\nEmployment Type: Full-time\nReports to: Hospital Administrator\n\nJob Summary\n\n\n\tThe Personal Assistant (PA) provides administrative support to the Hospital Administrator, ensuring the smooth operation of the office and facilitating effective communication.\n\n\nKey Responsibilities\n\n\n\tManage the Hospital Administrator's schedule, including scheduling meetings and appointments.\n\tPrepare and distribute correspondence, reports, and other documents.\n\tProvide administrative support, including answering phone calls, responding to emails, and managing paperwork.\n\tMaintain accurate records and databases.\n\tHandle confidential and sensitive information with discretion.\n\tCoordinate travel arrangements, meetings, and events.\n\tDevelop and implement administrative processes to improve efficiency.\n\tLiaise with staff, patients, and external stakeholders as required.\n\n\nRequirements\n\n\n\tStrong administrative and organizational skills.\n\tExcellent communication and interpersonal skills.\n\tAbility to maintain confidentiality and handle sensitive information.\n\tProficiency in Microsoft Office and other administrative software.\n\tPrevious experience as a PA or in a similar role.\n\n\nSkills:\n\n\n\tTime management and prioritization.\n\tAttention to detail.\n\tProblem-solving and adaptability.\n\tDiscretion and confidentiality.\n\n\nSalary\nN70,000 - N80,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their Application Letters and CV to: adm.sdchib2019@yahoo.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]