[
  {
    "title": "Chartered Accountant Job at Edgewood Consulting Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/chartered-accountant-job-at-edgewood-consulting-limited-1",
    "pubDate": "Thu, 19 Jun 2025 12:32:26 GMT",
    "source": "JobGurus",
    "keyword": "edgewood consulting limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Edgewood Consulting Limited - Our client is recruiting suitably qualified candidates to fill the position below:\n\nJob Position: Chartered Accountant\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDevelop and implement financial responsibility plans aligned with organizational strategy.\n\tEnsure timely and accurate completion of the month-end accounting process.\n\tCoordinate and process various financial, administrative, and operational forms and reports.\n\tMaintain up-to-date financial records, ensuring the accuracy of transactions and changes.\n\tProactively identify and implement financial solutions to improve service levels.\n\tProvide accurate financial reporting to Management, ensuring compliance with statutory requirements.\n\tEstablish standards and procedures for internal and third-party payments.\n\tParticipate in financial audits and provide necessary documentation.\n\tPrepare balance sheets, and invoices, and handle client financial interactions.\n\tDrive financial efficiency and cost-saving culture across all business areas.\n\tReview and recommend internal financial requests for management approval.\n\tOrganize and maintain electronic filing of invoices.\n\tTrack invoices from receipt to final payment, ensuring reconciliation with vendors.\n\tEnsure compliance with company policies, procedures, and regulatory requirements.\n\tMaintain accurate records on accounts receivable and payable.\n\tManage monthly deduction and remittance of statutory payments (PAYE, WHT, Pension, VAT).\n\tHandle annual company tax returns and monthly bank statement reconciliation.\n\tConduct vendor reconciliation and analyze industry trends for improvement opportunities.\n\tPerform quarterly budget analysis, comparing forecast to actual spending.\n\tCreate and implement financial policies to enhance operational efficiency.\n\tEnsure compliance with corporate policies, internal controls, and accounting standards.\n\tUnderstand cost drivers for accurate budgeting and forecasting.\n\n\nRequirements\n\n\n\tBachelor's Degree in Accounting, Finance, Business, a related field, or equivalent practical experience\n\t4-5 years of accounting practice and/or industry experience\n\tExperience with International Financial Reporting Standards\n\tACA/ACCA or Equivalent is required\n\tStrong working knowledge of Accounting software and Microsoft Office\n\tHigh-energy, self-motivated, team player with a desire to excel in demanding and fast paced detailed oriented environment\n\tAbility to adapt quickly, work independently, take ownership, and work in a flexible team environment\n\tGood understanding of Tax compliance\n\tAbility and willingness to meet business critical deadlines.\n\tAbility to work independently and be responsible to follow up on action items.\n\tExcellent verbal, interpersonal and written communication skills.\n\tStrong analytical, problem-solving and decision-making capabilities.\n\tTeam player with the ability to work in a fast-paced environment.\n\tAbility to work with all levels of internal staff as well as outside clients and vendors\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: edgewoodconsultingofficial@gmail.com using \"Chartered Accountant\" as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Front Desk Officer Job at the Ocularist",
    "link": "https://www.jobgurus.com.ng/jobs/view/front-desk-officer-job-at-the-ocularist-2",
    "pubDate": "Thu, 19 Jun 2025 12:32:26 GMT",
    "source": "JobGurus",
    "keyword": "the ocularist",
    "duplicate": false,
    "classifications": [],
    "content": "The Ocularist is the firstIndigenous ophthalmic practise specialized in fabricating customized artificial eyes. We offer services such as general eye examination, contact lens, optical and ocularistry services. We are 14years old, and currently have 2 offices, A head office in Lagos and one branch office in Abuja.\n\nWe are recruiting to fill the position below:\n\nJob Position: Front Desk Officer\nJob Locations: Abuja (FCT) and Alimosho, Lagos\nEmployment Type:\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tA smart and intelligent individual is needed for the position of front desk in our Gowon Estate, Egbeda clinic. Interested individuals must stay close to Egbeda.\n\tCandidates must be ready to work under little or no supervision. Friendly and good looking.\n\n\nRequirements\n\n\n\tInterested candidates should possess an OND qualification with 1 year of experience. \n\n\nSalary\nN50,000 - N70,000 per month. \n\nMethod of Application\nInterested and qualified candidates should send teir CV to: eyeclinicjobsnigeria@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Loan Collection Officer Job at ISurf Global Service",
    "link": "https://www.jobgurus.com.ng/jobs/view/loan-collection-officer-job-at-isurf-global-service",
    "pubDate": "Thu, 19 Jun 2025 12:32:26 GMT",
    "source": "JobGurus",
    "keyword": "isurf global service",
    "duplicate": false,
    "classifications": [],
    "content": "ISurf Global Service is an Information Technology Consulting Services Company with specialization in delivering technology solutions to meet the needs of our clients. Our Consulting experience provides practical, cost effective innovative change, insights and knowledge to help you organize and maintain an effective Optimal model for your business growth and flexibility.\n\nOur main activities are focused on providing professional consulting and technical services, carrying out research and training in the use of ICT and organizing events and workshops. The solutions we build help our customers achieve profitable growth, reduce costs and take advantage of new business opportunities.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Loan Collection Officer\nJob Location: Ikeja GRA, Lagos\nEmployment Type: Full-time, Onsite\n\nRequirements\n\n\n\tMinimum OND (OND, NCE, HND, BSc accepted)\n\tMust reside in Ikeja or nearby.\n\n\nSalary\n\n\n\tN80,000 - N100,000 per month + Performance Bonus\n\tPerks: HMO, Pension, Daily Free Lunch.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and a brief cover letter to: jobs.david@isurfglobal.com using the Job Position as the subject of the mail.\n\nNote: For more information contact 07049905970.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Python Developer Job at Odixcity Consulting",
    "link": "https://www.jobgurus.com.ng/jobs/view/python-developer-job-at-odixcity-consulting",
    "pubDate": "Thu, 19 Jun 2025 12:32:26 GMT",
    "source": "JobGurus",
    "keyword": "odixcity consulting",
    "duplicate": false,
    "classifications": [
      "Software Engineering"
    ],
    "content": "Odixcity Consulting is an International Hr consulting and procurement firm. With expertise in Recruitment & Selection, Performance management, Training & Development, Compensation and benefits as well as Outsourcing of goods and services for organizations.\n\nWe are recruiting to fill the position below:\n\nJob Position: Python Developer\n\nJob Location:  Remote\n\nJob Summary\n\n\n\tWe are looking for a talented Python Developer to join our engineering team and help build robust, scalable systems.\n\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWrite clean, efficient, and reuseable Python codes.\n\tBuild and maintain back-end services, APIs, and data pipelines.\n\tIdentify and address technical challenges, finding optimal solutions, and optimizing application performance.\n\tWrite unit and integration tests for code reliability.\n\tCollaborate with front-end developers, designers, and product managers.\n\tDevelop, test, and deploy new features and fixes.\n\tIntegrate with databases, third-party services, and external APIs.\n\tAnalyzing data, identifying trends, and providing insights to support business decisions.\n\tImplementing security measures to protect data and applications from unauthorized access and cyber threats.\n\n\nRequirements and Experience\n\n\n\tStrong proficiency in Python (3.x)\n\tExperience with at least one framework; Django, Flask, or FastAPI.\n\tSolid understanding of RESTful APIs and microservice architecture.\n\tExperience with databases (PostgreSQL, MySQL, MongoDB).\n\tFamiliarity with version control systems (Git).\n\tExperience with DevOps tools (Docker, Kubernetes, CI/CD).\n\tFamiliarity with cloud platforms (AWS, Azure, GCP).\n\tExposure to data engineering or machine learning principles.\n\tUnderstanding of asynchronous programming and message queues (Celery, RabbitMQ, Kafka).\n\tStrong debugging and problem-solving skills.\n\n\nSalary\nN400,000 Monthly (non-negotiable).\n\nMethod of Application\nInterested and qualified candidates should send their CV to: jobscandidate8@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Finance Manager Job at FairMoney",
    "link": "https://www.jobgurus.com.ng/jobs/view/finance-manager-job-at-fairmoney",
    "pubDate": "Thu, 19 Jun 2025 12:32:26 GMT",
    "source": "JobGurus",
    "keyword": "fairmoney",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "FairMoney is building the leading mobile bank for emerging markets. We started with a digital microcredit application on Android, and currently roll out additional financial services (current account, savings, debit card) while expanding the product to Western Africa and South-East Asia.\n\nWe are recruiting to fill the position below:\n\nJob Position: Finance Manager\n\nJob Location: Lagos\nEmployment Type: Full-time (Hybrid)\n\nResponsibilities\nMonthly Management Reporting:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tReview monthly management report prepared by accountants and sign off.\n\tEnsure there are relevant schedules supporting the items on the financial statement.\n\tTrain and motivate accountants.\n\tResolve issues raised by the financial control units and other reviewers timely and accurately.\n\n\nVariance Analysis:\n\n\n\tIdentify drivers for financial statements line items.\n\tAnalyse the variance between actuals and budget as well as change over time.\n\tRecommend corrective actions for adverse variances.\n\n\nRegulatory Reporting:\n\n\n\tEnsure CBN returns is submitted on or before the 5th day of the month.\n\tEnsure the NDIC report and other regulatory returns are submitted as at when due.\n\tManage CBN audits.\n\n\nYear End Close/Statutory Audits:\n\n\n\tLead the annual statutory audit.\n\n\nRequirements\nThe ideal candidate will be\n\n\n\t A qualified Accountant (ACCA, ICAN).\n\tHave a minimum of seven (7) years of experience.\n\tExperience in audit and/or financial service industry is necessary.\n\t Must be very good with IFRS.\n\tHave an Advanced Microsoft Excel Skills.\n\tSQL and other data analytics skills are major advantage.\n\tMust have excellent leadership and interpersonal skills.\n\tBe an effective team player with a positive attitude.\n\tMust be able to work without supervision.\n\n\nBenefits\n\n\n\tPrivate Health Insurance.\n\tPension Plan.\n\tPaid Time Off.\n\tHybrid Work Model.\n\tTraining & Development.\n\n\nRecruitment Process\n\n\n\tA screening interview with one of the members of the Talent Acquisition team.\n\tTechnical Interview with the Chief Financial Officer.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]