[
  {
    "title": "Job Openings at Moove",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-moove-1",
    "pubDate": "Mon, 30 Jun 2025 19:35:57 GMT",
    "source": "JobGurus",
    "keyword": "moove",
    "duplicate": false,
    "classifications": [
      "Software Engineering"
    ],
    "content": "Moove is on a mission to redefine what large-scale rideshare leasing and vehicle ownership look like in Africa. We are developing an innovative model to rapidly improve the availability of vehicles for on-demand ridesharing services across major metro cities while also creating sustainable jobs for drivers.\n\nWe are recruiting to fill the following positions below:\n\n1.) Data Analyst, Reconciliation & Payments\n\nJob Location: Lagos\nDepartment: Data\n\nAbout the Role\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAs a Data Analyst for Reconciliation & Payments, you will support Moove’s operations by performing data analysis, ensuring data quality, and providing business insights. \n\tYour role will involve conducting exploratory analysis, automating recurring data requests, and supporting business and product strategies with actionable insights.\n\n\nResponsibilities\nWhat You’ll be Doing:\n\n\n\tDevelop and maintain cross browser compatible web and mobile based applications and work closely with team to enhance existing functionalities\n\tTake charge and be a decision driver for assigned web platforms\n\tAbility to explain issues, decisions and solutions to the team succinctly\n\tProduce prototypes and effectively articulate design decisions\n\tKeep up-to-date on emerging technology solutions, particularly those on JavaScript, for continuous improvements in front-end application development and end-user experience\n\tOpen to work in Low-code No-code tools and Backend\n\n\nWho You'll Be Working with:\n\n\n\tDirectly reporting to our Lead Data Analyst , and closely working with our Product, Data and Engineering Teams.\n\n\nRequirements\nWhat You will need for this position:\n\n\n\tDegree in Mathematics, Economics, Computer Science, Information Management, Statistics.\n\tAdvanced SQL proficiency (cohort analysis, complex joins, window functions, etc.).\n\tExperience with Python for exploratory data analysis and automation\n\tKnowledge of reporting tools like Looker/Holistics/Quicksight.\n\tExperience: Proven experience in data analysis, working with business users to create reports and dashboards, and delivering actionable insights. Familiarity with statistical packages (e.g., Google Sheets, Python libraries).\n\tSkills: Strong problem-solving abilities, attention to detail, critical thinking, and business acumen.\n\tAbility to communicate insights clearly & collaborate with cross-functional teams.\n\n\nClick here to apply online\n\n \n\n \n\n2.) People Partner (West Africa)\n\nJob Location: Lagos\nDepartment: People\n\nAbout The Role\n\n\n\tResponsible for translating business objectives into a set of strategic people initiatives and actions, which fully align with our People Strategy and contribute to business growth, profitability and high levels of employee performance engagement.\n\tAlso responsible for building a trusted adviser relationship with key stakeholders and developing a deep understanding of the business and its strategic objectives.\n\tIn addition, providing functional leadership and expertise in People processes, programs and policies.\n\n\nResponsibilities\nWhat You’ll Be Doing:\n\n\n\tContributing to the development and execution of the business strategy by helping business leaders to identify, prioritise, and build organisational capabilities, behaviours, structures, and processes for the future\n\tPayroll administration\n\tConducting weekly meetings with respective business units.\n\tConsulting with line management, providing HR guidance when appropriate.\n\tAnalysing trends and metrics in partnership with the People Team to develop solutions, programs, and policies.\n\tManaging and resolving complex employee relations issues.\n\tMaintaining in-depth knowledge of legal requirements related to day-to-day management of employees, reducing legal risks and ensuring regulatory compliance.\n\tPartnering with the legal department as needed/required.\n\tProviding day-to-day performance management guidance to line management (e.g., coaching, counselling, career development, disciplinary actions).\n\tWorking closely with management and employees to improve work relationships, build morale, and increase productivity and retention.\n\tProviding HR policy guidance and interpretation.\n\tProviding guidance and input on business unit restructures, workforce planning, and succession planning.\n\tIdentifying and developing the key competencies needed to support the business and ensure the appropriate training and development is available to meet the business needs.\n\tDriving data-informed decisions and support in calibrating and rewarding high performance.\n\tPartnering with the People Team to contribute towards our people strategy and projects, and to ensure a best-in-class experience.\n\n\nKey Metrics:\n\n\n\tEmployee Engagement Score: Measure of overall employee satisfaction and commitment to the organization's mission and values.\n\tTurnover Rate: Percentage of employees leaving the company within a specific period, indicating retention and job satisfaction levels.\n\tPerformance Review Completion Rate: Percentage of performance reviews completed on time, reflecting the effectiveness of performance management processes.\n\tLearning & Development Participation: Measure of employee engagement in training and development programs, highlighting the focus on continuous learning and growth.\n\n\nRequirements\nWhat You Will Need For This Position\n\n\n\tCandidates should possess a Bachelor's Degree in Human Resource Management or in a related field.\n\tMinimum of 5 years of experience resolving complex employee relations issues.\n\tWorking knowledge of multiple human resource disciplines, including payroll, compensation practices, organisational diagnosis, diversity, performance management, and federal and state respective employment laws.\n\tExcellent organisational skills and attention to detail.\n\tExcellent time management skills with a proven ability to meet deadlines.\n\tStrong analytical and problem-solving skills.\n\tExcellent verbal and written communication skills.\n\n\nClick here to apply online\n\n \n\n \n\n3.) People Data and Operations Specialist\n\nJob Location: Lagos\nDepartment: People\n\nAbout the Role\n\n\n\tWe seek a detail-oriented and motivated People Data and Operations Specialist to join our People team for a full-time employment contract. \n\tThis role is integral in managing various administrative activities to ensure smooth People operations. \n\tThe ideal candidate should possess strong analytical, organizational and data management skills, attention to detail, and experience in people processes.\n\n\nResponsibilities\nWhat you’ll be doing:\n\n\n\tCollecting, analysing and reporting on key people metrics and workforce demographics to provide actionable insights.\n\tMaintain internal people dashboards and reports to track key trends and recommend data-driven decisions.\n\tAnalyze metrics across the employee lifecycle (hiring to exit) to identify patterns and opportunities.\n\tAssist in forecasting workforce trends (e.g., attrition, hiring needs, skill gaps) using historical data and predictive analytics to support strategic workforce planning.\n\tMaintain user guides and system process documentations for HiBob users.\n\tManage and escalate people system-related tickets as needed.\n\tAssist with data transfers between internal systems, payroll and other platforms.\n\tAssist in designing and distributing engagement surveys while ensuring accessibility and confidentiality.\n\tHelp analyze survey responses to identify key trends in workplace satisfaction and areas for improvement.\n\tManage HR information system, ensuring company accuracy, up-to-date records of people data and local/global policy compliance.\n\tProvide support in payroll processing by collecting payroll data, reviewing payroll reports, quotes and invoices, verifying accuracy and addressing any discrepancies in a timely manner.\n\tSupport in resolving payroll related queries.\n\tOrganize and maintain employment records, ensuring compliance with legal requirements and company policies.\n\tCollaborate with team members to improve HR processes and documentation.\n\tSupport in generating People reports as required.\n\tProvide support for ad-hoc projects within the People Ops team.\n\n\nRequirements\nWhat you will need for this position:\n\n\n\tBachelor’s Degree in Human Resources, Business Administration, or a related field preferred.\n\tMinimum 2 years of experience in HR administration/Operations/People Analytics, with exposure to workforce planning, system administration and people reporting is highly desirable.\n\tProficient in HRIS preferably HiBob, Advance Excel, Google Workspace, Looker Studio, Basic SQL etc.\n\tStrong organizational skills with the ability to manage multiple tasks and deadlines.\n\tExcellent attention to detail and analytical skills.\n\tStrong verbal and written communication skills.\n\tAbility to work collaboratively and independently within a fast-paced environment.\n\tAbility to maintain confidentiality and handle sensitive information with discretion.\n\n\nClick here to apply online    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Vacancies at STP Apartments",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancies-at-stp-apartments",
    "pubDate": "Mon, 30 Jun 2025 19:35:57 GMT",
    "source": "JobGurus",
    "keyword": "stp apartments",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "At STP Apartments, we don’t just welcome guests — we create experiences. And the same goes for our team. We believe that our people are the heart of everything we do, which is why we are committed to building a workplace that inspires, supports, and rewards talent.\n\nAs a leading hospitality brand in the heart of Abuja, ST Apartments offers more than just a job — we offer a meaningful career journey. Our hotel combines world-class service with a warm, inclusive culture where your contributions are valued, your growth is supported, and your passion for hospitality is celebrated.\n\nWe are recruiting to fill the position below:\n\n1.) Maintenance Officer\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Location: Abuja (FCT) \n\nResponsibilities\n\n\n\tHave intergrity\n\tRespond and attend to guest repair requests.\n\tWelcome and acknowledge all guests according to company standards, anticipate and address guests.\n\tUnderstand and operate advanced electrical, plumbing, refrigeration, and boiler systems.\n\tCommunicatewith different types of people to comprehend what they want and to provide them with information and assistance.\n\tCheck for new maintenance requests from the Front Desk and housekeeping and update remarks once the task is completed.\n\tUpdate the maintenece task list and check all done tasks.\n\tAbility to work under pressure situations and exercise good judgment.\n\tAbility to focus attention on details, speed, and accuracy.\n\tAbility to interpret readings from meters & gauges and other measuring units.\n\tAbility to prioritize and organize work assignments.\n\tAbility to maintain confidentiality of hotel guests and pertinent hotel information.\n\tAbility to ensure security of guest room access and hotel property.\n\tAbility to read and understand test equipment, measuring devices, and safety manuals.\n\tPerform maintenance activities in the guest room like plunging toilets, unclogging drains, and repairing all types of hardware, and electrical equipment including lamps.\n\tPerform maintenance activities in hotel public areaslike plunging toilets, unclogging drains, and repairing all types of hardware, plumbing, and electrical equipment and cosmetic items.\n\tProgram TVs and perform general housekeeping and engineering-related inventory duties.\n\tTest, troubleshoot, and perform basic repairs on all types of equipment.\n\tTo clean, lubricate, protect, and otherwise maintain all tools and equipment in the hotel.\n\tTo operate as an independent mechanic by analyzing problems, identifying courses of action, and implementing solutions with available resources and to a high degree of quality.\n\n\nApplication Closing Date: 31st July, 20225.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hr@stpapartments.com using the Job Position as the subject of the mail.\n\n \n\n2.) Store Officer\n\nJob Location: Abuja (FCT) \n\nResponsibilties\n\n\n\tReceive and forward all goods and deliveries in and out of the hotel to the correct point of contact/storage area.\n\tAble to follow standards for issuing and receiving stock within the store’s area of operation.\n\tMonitor and take inventory regularly to compile orders based on par levels or needs.\n\tMaintain clear and organized records to ensure all reports and invoices are filed and stored properly.\n\tMonitor parlevels for all food items to ensure proper levels.\n\tResponsible for storage of both food & beverage and operational stock.\n\tResponsible for the day-to-day check on the storage facilities for upkeep and hygiene.\n\tResponsible for verifying all goods arrived as per the agreed purchase, delivery note, and agreed quantity had been received.\n\tRefuse acceptance of damaged, unacceptable, or incorrect items.\n\tEnsure cleanliness of all areas, keeping storage areas clean & tidy and in strict compliance with hygiene regulations.\n\tEnsure all store requisitions are signed by concerned Department Heads (HODs) and approved by FC/GM depending upon the hotel’s operations procedure.\n\tEnsure the quantity requested and the quantity issued always match.\n\tEnsure the store requisition form is signed by the person collecting the goods and recorded.\n\tPost all invoices using the MMS – Material Management System.\n\tConduct inventory audits to determine inventory levels and needs.\n\tConduct physical stock audits regularly and ensure the physical count is to be tallied with the inventory count.\n\n\nApplication Closing Date: 15th July, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hr@stpapartments.com using the Job Position as the subject of the mail.\n\n \n\n \n\n3.) Chef\n\nJob Location: Abuja (FCT)\n\nResponsibilities\n\n\n\tTakes care of daily food preparation and duties assigned by the Executive Chef to meet the standard and quality set by the Restaurant.\n\tFollows the instructions and recommendations from the immediate superiors to complete the daily tasks.\n\tCoordinates daily tasks with other Chefs and Kitchen Assistants.\n\tResponsible for supervising junior chefs and Kitchen Assistants.\n\tAble to estimate the daily production needs and check the quality of raw and cooked food products to ensure that standards are met.\n\tKnowledge of all standard procedures and policies about food preparation, receiving, storage, and sanitation.\n\tFull awareness of all menu items, their recipes, methods/cost of production, and presentation standards.\n\tEnsure that the production, preparation, and presentation of food are of the highest quality at all times.\n\tEnsure the highest levels of guest satisfaction, quality, operating, and food costs on an ongoing basis.\n\tFollows good preservation standards for the proper handling of all food products at the right temperature.\n\tOperate and maintain all department equipment and reporting of malfunctioning.\n\tEnsure effective communication between staff by maintaining a secure and friendly working environment.\n\n\nRequirements\n\n\n\tInterested candidates should possess a relevant qualification with 5 years of work experience. \n\n\nApplication Closing Date: 10th July, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hr@stpapartments.com using the Job Position as the subject of the mail.\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]