[
  {
    "title": "Petroleum Analyst Job at Future Moves Recruitment Agency",
    "link": "https://www.jobgurus.com.ng/jobs/view/petroleum-analyst-job-at-future-moves-recruitment-agency",
    "pubDate": "Sat, 08 Nov 2025 08:42:30 GMT",
    "source": "JobGurus",
    "keyword": "future moves recruitment agency",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Future Moves Recruitment Agency is a licensed full-fledged Human Resource firm with extensive expertise and experience in human Capital development and staffing. Future Moves has exceptional expertise in Talent Sourcing, learning & development, talent management, HR Outsourcing & Payrolling, HR planning & Consulting, Policy Drafting, Culture Change and Organisation Effectiveness by designing and implementing interventions which identify the core areas of development to enhance the overall growth and competitiveness of your organization.\n\nWe are recruiting to fill the position below:\n\nJob Position: Petroleum Analyst\n\nJob Location: Lagos\nEmployment Type: Full-time\n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Description\n\n\n\tWe are seeking a detail-oriented and highly skilled Petroleum Analyst to join our laboratory team.\n\tThe successful candidate will be responsible for conducting chemical and physical analyses of petroleum and petroleum products to ensure compliance with regulatory standards and client specifications.\n\tThis role is critical to maintaining product quality, supporting research and development, and contributing to continuous process improvements.\n\n\nKey Responsibilities\n\n\n\tConduct standardized tests and analyses on crude oil, refined products, lubricants, and petrochemicals.\n\tOperate and maintain analytical instruments such as GC, HPLC, FTIR, XRF, Viscometers, and Distillation Units.\n\tInterpret and document analytical results, ensuring accuracy and adherence to industry standards (ASTM, ISO, IP).\n\tPrepare technical reports, test certificates, and quality assurance documentation for internal and external use.\n\tSupport research, method development, and validation for new testing procedures.\n\tEnsure laboratory compliance with health, safety, and environmental regulations.\n\tParticipate in proficiency testing and internal audits as part of quality management systems (e.g., ISO 17025).\n\tCollaborate with other departments (e.g., field services, logistics) to resolve quality-related issues.\n\n\nRequirements\n\n\n\tBachelor’s Degree in Chemistry, Petroleum Engineering, Industrial Chemistry, or a related field.\n\t2–5 years of experience in petroleum or analytical laboratory testing.\n\tSolid understanding of petroleum chemistry and analytical techniques.\n\tProficiency in using laboratory equipment and interpreting data accurately.\n\tFamiliarity with industry standards (ASTM, ISO, IP methods).\n\tStrong attention to detail and organizational skills.\n\tGood written and verbal communication skills.\n\tAbility to work independently and as part of a team in a fast-paced environment.\n\n\nSalary\nN110,000 / month.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: tikanavara@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]