[
  {
    "title": "Logistics Officer Job at Egbin Power Plc",
    "link": "https://www.jobgurus.com.ng/jobs/view/logistics-officer-job-at-egbin-power-plc",
    "pubDate": "Tue, 24 Jun 2025 11:14:09 GMT",
    "source": "JobGurus",
    "keyword": "egbin power plc",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Egbin Power Plc. Lagos is one of the biggest additions to the electricity industry in Nigeria. Often seen as the biggest single generating power station in Sub-Saharan Africa, it was built to meet the every rising demand for electricity in Lagos and its environs.\n\nFollowing the nation’s privatization exercise, Sahara, through its power division, Sahara Power Group and sundry affiliations, acquired the 1320 MW installed capacity Egbin Power Plant. We are working towards deploying a minimum of 5,000 MW of electricity generation over the next five years.\n\nWe are recruiting to fill the position below:\n\nJob Position: Logistics Officer\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Identification: 375\nJob Location: Lagos\nJob Schedule: Full time\n\nJob Description\n\n\n\tThe Logistics Officer will be responsible for providing logistics support and overseeing the overall logistics processes supporting the organisation's objectives.\n\tResponsible for tracking, receiving and stocking all items ordered.\n\tCarry out packing, warehousing and storage duties in preparation for shipment.\n\tLiaising and negotiating with suppliers, manufacturers, retailers and consumers.\n\tResearch on ideal shipping methods, routing or carriers to meet necessary parameters, specifications and costs.\n\tKeep track of quality, quantity, stock levels, delivery times, transport costs and efficiency.\n\tSupport the management of third-party logistics service providers.\n\tDevelop new strategies to streamline processes and reduce costs.\n\tAssist in drafting metrics, reporting and data analysis tasks to identify issues and opportunities for process improvements\n\tEnsure optimum cost savings on all logistics-related activities by providing and exploring available tax exemption windows\n\tLiaise with the relevant authorities for import and other statutory clearances required for procurement and imports\n\tDevelop and maintain good relationships with customs, shipping/logistics agents and port authorities\n\tAssist in the coordination with transporters and freight agents for the timely delivery of goods\n\tPrompt processing of permits for clearance of Imported Consignment and payment of duties and taxes.\n\tImplement data protection policies and practices of Egbin Power Plc.\n\tEnsure compliance with the NDPR and other data protection laws, and data protection policies.\n\tUndertake a Data Protection Impact Assessment as applicable to curb the risk during data processing operations.\n\tEnsure awareness, understanding and application of QHSE policy and application of departmental objectives\n\tEnsure awareness of the Integrated Management System (ISO 9001:2015, 14001:2015 &45001:2018) and implications of not conforming with the requirements.\n\tUnderstand and identify hazards, risks, environmental aspects and Impact as it is related to their jobs\n\n\nEducational Qualification & Work Experience\n\n\n\tCandidates should possess a Bachelor's Degree in Supply Chain Management, Logistics, Business Administration, Transportation, or Engineering.\n\tThree (3) to five (5) years of experience working in logistics, warehouse, or transportation operations.\n\tPostgraduate degree or certifications in logistics, supply chain or any relevant field will be an added advantage.\n\n\nSkills and Work Experience:\n\n\n\tWorking technical knowledge of mechanical and non-mechanical materials.\n\tKnowledge of supply chain management.\n\tKnowledge of warehousing and storage.\n\tMarket and vendor knowledge for contract management.\n\tGood understanding of industry limitations and regulations.\n\tKnowledge of policies, procedures and guidelines for supply chain management.\n\tGood attention to detail.\n\tBasic knowledge of regulatory norms on taxation, duties, and import policies.\n\tKnowledge of contract and commercial law.\n\tTime Management skills.\n\tGood negotiation and bargaining skills.\n\n\nNote\n\n\n\tCandidates will be interviewed on a rolling basis.\n\tOnly qualified candidates will be contacted.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Social Media Manager Job at Uleval Technology",
    "link": "https://www.jobgurus.com.ng/jobs/view/social-media-manager-job-at-uleval-technology",
    "pubDate": "Tue, 24 Jun 2025 11:14:09 GMT",
    "source": "JobGurus",
    "keyword": "uleval technology",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "At Uleval Technology, We help businesses from healthcare, Oil and Gas ,transportation, real estate, communication, and other industries seize new opportunities, overcome business challenges.\n\nWe are recruiting to fill the position below:\n\nJob Position: Social Media Manager\n\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tContent Creation: Producing engaging content, including text, images, videos, and other formats, tailored to different platforms.\n\tContent Calendar Management: Planning and scheduling content to ensure consistent posting and engagement.\n\tCommunity Engagement: Monitoring social media channels, responding to comments and messages, and fostering positive interactions with followers.\n\tPerformance Analysis: Tracking key metrics, analyzing data, and reporting on campaign performance to identify areas for improvement.\n\tTrend Monitoring: Staying informed about social media trends, new platforms, and best practices to optimize strategies and content.\n\tCollaboration: Working with marketing, sales, and other teams to ensure consistent branding and messaging.\n\tInfluencer Marketing: Identifying and collaborating with influencers to expand reach and engagement.\n\tAdvertising Management: Developing and managing social media advertising campaigns, including budget allocation and performance monitoring.\n\tReputation Management: Monitoring online reviews and feedback, addressing concerns, and managing the brand's online reputation.\n\tReporting: Generating regular reports on social media performance, providing insights and recommendations for improvement.\n\tStrategy Development: Creating and implementing social media strategies aligned with overall marketing goals.\n\n\nRequirements\n\n\n\tCandidates should possess an HND / Bachelor's Degree with 2-5 years of experience.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: jobs@uleval.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Customer Sales Agent Job at Joseph Robotics Lab and Tech",
    "link": "https://www.jobgurus.com.ng/jobs/view/customer-sales-agent-job-at-joseph-robotics-lab-and-tech",
    "pubDate": "Tue, 24 Jun 2025 11:14:09 GMT",
    "source": "JobGurus",
    "keyword": "joseph robotics lab and tech",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Joseph Robotics Lab and Tech - We are a leading technology training institute dedicated to equipping individuals and organizations with cutting-edge digital skills. Our mission is to bridge the tech skills gap by delivering hands-on, industry-relevant training that prepares learners for real-world challenges and in-demand careers. We offer a wide range of beginner to advanced programs in software development, mobile app development, data science, cybersecurity, cloud computing, UI/UX design, and more. Our curriculum is developed in collaboration with industry experts and is continuously updated to align with current technology trends and employer needs.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Customer Sales Agent\nJob Location:  Nigeria\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe are looking for a dynamic and results-driven Customer Sales Agent to join our team.\n\tThe ideal candidate will be responsible for engaging with prospective and existing customers, promoting our products, and ensuring excellent customer satisfaction.\n\tYou will be the first point of contact for customers, helping them make informed purchase decisions while driving sales and revenue growth.\n\n\nKey Responsibilities\nCustomer Interaction:\n\n\n\tHandle inbound and outbound customer inquiries via phone, WhatsApp, email, and other channels.\n\tProvide detailed information about products and services to prospective customers.\n\tRespond promptly to customer inquiries and resolve any issues effectively.\n\n\nSales & Promotions:\n\n\n\tPromote and sell the company’s products by understanding customer needs and preferences.\n\tMeet the customers at their place of gathering and commit them to register.\n\tConvert leads from social media platforms (e.g., Facebook and Instagram) into paying customers.\n\tUpsell and cross-sell additional products to maximize revenue per customer.\n\n\nFollow-Up & Relationship Building:\n\n\n\tFollow up with potential customers who have shown interest in the products to close sales.\n\tBuild and maintain positive relationships with customers to encourage repeat business.\n\n\nRecord-Keeping & Reporting:\n\n\n\tDocument customer details, inquiries, and sales in spreadsheets or CRM systems.\n\tTrack sales metrics and prepare regular reports for management.\n\n\nRequirements\n\n\n\tCandidates should possess a minimum of OND qualification with a minimum of 5 years work experience.\n\tProven experience in sales, customer service, or a related role.\n\tStrong communication and interpersonal skills.\n\tAbility to build rapport with customers and maintain professionalism.\n\tProficiency in using WhatsApp Business, social media, and basic office tools like Excel and Google Sheets.\n\tResults-oriented with a strong desire to meet and exceed sales targets.\n\tAbility to multitask and prioritize tasks effectively.\n\n\nPreferred Skills:\n\n\n\tExperience in technology training institute industry is a plus.\n\tKnowledge of CRM software or other sales tools is an advantage.\n\tFluency in local languages is an added benefit.\n\n\nSalary\nN100,000 / Month.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: adamsosamehon@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Marketing Executive Job at Monmartt",
    "link": "https://www.jobgurus.com.ng/jobs/view/marketing-executive-job-at-monmartt",
    "pubDate": "Tue, 24 Jun 2025 11:14:09 GMT",
    "source": "JobGurus",
    "keyword": "monmartt",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Monmartt is a one stop store for babies to toddlers . We feature great varieties of products for Newborn, Infants and Toddlers. Our aim is to ensure that we meet all our clients needs with efficient customers services inline with our policy and procedure. We understand our clients needs and our experience and researches give us the ability to respond to your needs with up to date products. We also provide guidance to our first time moms. We offer products at amazing prices in line with the right quantity and quality.\n\nWe are recruiting to fill the position below:\n\nJob Position: Marketing Executive\n\nJob Locations: Lagos and Oyo\nEmployment Type: Full-time\n\nAbout the Role\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a results-driven and creative Marketing Executive to join our team.\n\tThis role is ideal for someone who understands both traditional and digital marketing, thrives in fast-paced environments, and is passionate about brand growth and customer engagement.\n\n\nKey Responsibilities\n\n\n\tDevelop and execute marketing campaigns to promote products and services\n\tConduct market research to identify trends, customer preferences, and competitor activity\n\tCoordinate brand visibility efforts, including product activations and promotional events\n\tMaintain relationships with influencers, partners, and media outlets\n\tLiaise with sales, design, and production teams to align marketing efforts\n\tMonitor and report on campaign performance, adjusting strategies where needed\n\tContribute ideas for new marketing strategies and tools.\n\n\nRequirements\n\n\n\tBachelor's Degree in Marketing, Business, Communications, or related field\n\t2+ years of experience in a marketing role\n\tStrong communication and writing skills\n\tCreativity, initiative, and attention to detail\n\tAbility to work under pressure and meet deadlines\n\tExperience using Canva, Mailchimp, or any CRM is an added advantage.\n\n\nSalary\nN100,000 base salary with commission on sales and weekly transport alowance.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: shopatmonmartt@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Virtual Banker, Africa China Banking (ACB) Job at Stanbic IBTC Bank",
    "link": "https://www.jobgurus.com.ng/jobs/view/virtual-banker-africa-china-banking-acb-job-at-stanbic-ibtc-bank",
    "pubDate": "Tue, 24 Jun 2025 11:14:09 GMT",
    "source": "JobGurus",
    "keyword": "stanbic ibtc bank",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Stanbic IBTC Bank is a leading African banking group focused on emerging markets globally. It has been a mainstay of South Africa's financial system for 150 years, and now spans 16 countries across the African continent.\n\nStandard Bank is a firm believer in technical innovation, to help us guarantee exceptional client service and leading edge financial solutions. Our growing global success reflects our commitment to the latest solutions, the best people, and a uniquely flexible and vibrant working culture. To help us drive our success into the future, we are looking for resourceful individuals to join our dedicated team at our offices.\n\nWe are recruiting to fill the position below:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Position: Virtual Banker, Africa China Banking (ACB)\n\nJob Ref ID: 80442636A-0001\nJob Location: Victoria Island, Lagos \nJob Type: Full-time\n\nJob Description\n\n\n\tTo effectively resolve customer complaints and complex queries, ensuring a consistent and positive brand experience for Africa China Banking clients.\n\tThis involves adhering to complaint management and dispute resolution processes to minimize reputational risk and customer attrition.\n\n\nRequirements\nQualifications:\n\n\n\tB.Sc in Social Science or related field.\n\tMasters and Professional certifications can be an added advantage.\n\n\nExperience: \n\n\n\tMandarin speaking.\n\t1 - 3 years of experience in Operations, Channel, Call Centre, Helpdesk -Service, Support, Project Implementation and management.\n\tExperience in telecommunications Support.\n\tUnderstanding of Stanbic IBTC’s products and services.\n\tConceptual and practical knowledge of credit procedures, policies, and standards\n\tComputer literacy, particularly with Microsoft Word, Excel and Power Point\n\n\nAdditional Information:\nBehavioural Competencies:\n\n\n\tAdopting Practical Approaches \n\tArticulating Information \n\tChallenging Ideas \n\tConvincing People \n\tExploring Possibilities \n\n\nTechnical Competencies:\n\n\n\tBanking Process & Procedures \n\tCustomer Understanding (Consumer Banking) \n\tProduct Knowledge (Consumer Banking) \n\tActive Listening \n\tQuery Resolution\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]