[
  {
    "title": "Manager - Audit & Assurance Job at Nexia Nigeria",
    "link": "https://www.jobgurus.com.ng/jobs/view/manager-audit-assurance-job-at-nexia-nigeria",
    "pubDate": "Mon, 23 Jun 2025 11:14:31 GMT",
    "source": "JobGurus",
    "keyword": "nexia nigeria",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "Nexia Nigeria is a multi – skill and multi – discipline professional advisory firm committed to technical and professional excellence in the provision of services that are tailored, innovative, cost effective and accord with national and international professional standards\n\nWe are recruiting to fill the position below:\n\nJob Position: Manager - Audit & Assurance\nJob Location: Kaduna\nEmployment Type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe role holder is responsible for the overall execution and completion of assigned audit engagements, while building relationship with team members and clients..\n\n\nResponsibilities\n\n\n\tCarry out and execute audit assignments in line with international standards and the firm’s quality management procedures.\n\tLead and train junior staff and build professional capacity both on-the-job and other technical sessions.\n\tManage departmental deliverables including monthly, quarterly and annual reports, and annual work plans; and collaborate with other departments on duties related to communication and marketing campaigns.\n\tSupervise audit engagements and perform review work of subordinates and entire audit engagements.\n\tDeliver reports for higher?level review within required deadlines.\n\tUse the audit tools provided by the firm on all engagements.\n\tManage online jobs effectively using various tools available.\n\n\nRequired Minimum Qualifications\n\n\n\tA minimum of a Second Class Upper (2:1) Bachelor's degree or Upper Credit in Higher National Diploma (HND) in Accounting, Economics, Finance, or a related discipline. (Possession of an MBA will be an added advantage)\n\tMinimum of 7 years of post-qualification audit experience within a structured audit or assurance environment, preferably in a top-tier audit or accounting firm\n\tProven ability to handle at least 7 PIE clients.\n\tMembership of the Institute of Chartered Accountants of Nigeria or its equivalent\n\n\nOther Requirements:\n\n\n\tDemonstrated technical understanding of accounting and auditing standards.\n\tExperience in various sectors/industries of audit.\n\tGreat communication skills (including oral, written, report writing and presentation).\n\tProblem identification and solution skills (including core, conceptual, and analytical thinking).\n\tUp to date with industry and regulatory changes and professional standards.\n\tStrong commitment and proven record of professional and client service excellence.\n\tPossesses an analytical, inquisitive mindset with a strong ability to interpret and derive insights from key data.\n\tGood IT skills, competent user of Microsoft Office and IT applications.\n\tAbility to manage multiple priorities.\n\tChange management skills.\n\tGreat team player.\n\n\nMethod of Application\n\nInterested and qualified candidates should send their Resume to: careers@nexianigeria.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Audit & Assurance Manager Job at Nexia Nigeria",
    "link": "https://www.jobgurus.com.ng/jobs/view/audit-assurance-manager-job-at-nexia-nigeria-1",
    "pubDate": "Mon, 23 Jun 2025 11:14:31 GMT",
    "source": "JobGurus",
    "keyword": "nexia nigeria",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "Nexia Nigeria is a multi – skill and multi – discipline professional advisory firm committed to technical and professional excellence in the provision of services that are tailored, innovative, cost effective and accord with national and international professional standards.\n\nWe are recruiting to fill the position below:\n\nJob Position: Audit & Assurance Manager\nJob Location: Mabushi, Abuja (FCT)\nEmployment Type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe role holder is responsible for the overall execution and completion of assigned audit engagements, while building relationships with team members and clients..\n\n\nResponsibilities\n\n\n\tCarry out and execute audit assignments in line with international standards and the firm’s quality management procedures.\n\n\n\n\tLead and train junior staff and build professional capacity both on-the-job and other technical sessions.\n\tManage departmental deliverables including monthly, quarterly and annual reports, and annual work plans; and collaborate with other departments on duties related to communication and marketing campaigns.\n\tSupervise audit engagements and perform review work of subordinates and entire audit engagements.\n\tDeliver reports for higher?level review within required deadlines.\n\tUse the audit tools provided by the firm on all engagements.\n\tManage online jobs effectively using various tools available.\n\n\nRequired Minimum Qualifications\n\n\n\tA minimum of a Second Class Upper (2:1) Bachelor's degree or Upper Credit in Higher National Diploma (HND) in Accounting, Economics, Finance, or a related discipline. (Possession of an MBA will be an added advantage)\n\tMinimum of 7 years of post-qualification audit experience within a structured audit or assurance environment, preferably in a top-tier audit or accounting firm\n\tProven ability to handle at least 7 PIE clients.\n\tMembership of the Institute of Chartered Accountants of Nigeria or its equivalent.\n\n\nMethod of Application\nInterested and qualified candidates should send their Resume to: careers@nexianigeria.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Human Resource Officer Job at Stremvans Fund Management",
    "link": "https://www.jobgurus.com.ng/jobs/view/human-resource-officer-job-at-stremvans-fund-management",
    "pubDate": "Mon, 23 Jun 2025 11:14:31 GMT",
    "source": "JobGurus",
    "keyword": "stremvans fund management",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Stremvans Fund Management is a dynamic and growing fund management company based in the Federal Capital Territory, Nigeria. We are dedicated to delivering superior investment returns for our clients through innovative strategies and robust financial management. We are committed to operational excellence, fostering a collaborative work environment, and empowering our team to achieve their full potential while serving our clients with integrity and professionalism.\n\nWe are recruiting to fill the position below:\n\nJob Position: Human Resource Officer\n\nJob Location: Abuja (FCT) \nEmployment Type: Full-time\nReports To: Managing Director\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Human Resources Officer will be responsible for managing all aspects of the HR function, including recruitment, employee relations, performance management, training and development, and compensation and benefits.\n\tThis role requires a dedicated and experienced HR professional who can contribute to creating a positive and productive work environment.\n\n\nKey Responsibilities\n\n\n\tManage the end-to-end recruitment process, including drafting job descriptions,posting advertisements, screening resumes, scheduling interviews, and conducting candidate assessments.\n\tManage the onboarding process for new hires, including preparing offer letters, conducting background checks, facilitating new hire paperwork, and organizing orientation sessions.\n\tDevelop and implement HR policies and procedures.\n\tGather and process payroll-related information (e.g., new hires, terminations, promotions, leave data) for accurate and timely payroll processing.\n\tAdminister compensation and employee benefits programs (e.g., health insurance, pension, leave management).\n\tHandle employee relations issues and provide guidance to managers and employees.\n\tCoordinate the performance management process, including performance appraisals and tracking employee development plans.\n\tGenerate various HR reports as required (e.g., headcount, attrition, leave balances).\n\n\nQualifications\n\n\n\tEducation: Bachelor's degree in Human Resources, Business Administration, or a related field. Professional HR certification (e.g., CIPM) is highly desirable.\n\tExperience: Minimum 3 years of experience in a generalist HR role.\n\tTechnical Skills: Proficiency in HRIS and Microsoft Office Suite.\n\tKnowledge: In-depth knowledge of Nigerian labor law and HR best practices.\n\tSoft Skills: Excellent interpersonal and communication skills. High level of discretion and confidentiality. Ability to build rapport with employees at all levels.\n\n\nWhat We Offer\n\n\n\tSalary and benefits package.\n\tOpportunity to work in a fast-paced and growing fund management firm.\n\tProfessional development and growth opportunities.\n\tA collaborative and supportive work environment.\n\n\nMethod of Application\nInterested and qualified candidates should submit their resume and a cover letter outlining their qualifications and experience to hr@sticltd.com using \"Human Resources Officer Application - [Your Name]\" as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Marketer Job at Demyhealth Clinic and Genomic Medicine",
    "link": "https://www.jobgurus.com.ng/jobs/view/marketer-job-at-demyhealth-clinic-and-genomic-medicine-1",
    "pubDate": "Mon, 23 Jun 2025 11:14:31 GMT",
    "source": "JobGurus",
    "keyword": "demyhealth clinic and genomic medicine",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Software Engineering"
    ],
    "content": "DemyHealth is impacting lives in Africa through healthcare innovation and accessibility with our team of highly trained professionals with proven track record as industry leaders within and outside the country. Our core expertise span accross Medical Devices, PCR testing, Diagnostics, Research, Biomedical Engineering, Biorepository and Sequencing services.\n\nWe are recruiting to fill the position below:\n\nJob Position: Marketer\n\nJob Location: Abuja\nEmployment Type: Full-time\n\nPosition Overview:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAs a Marketing Officer at DemyHealth, you will be responsible for coordinating for developing, implementing and executing strategic marketing plans in order to attract potential customers and retain existing ones.\n\n\nResponsibilities\n\n\n\tResponsible for ensuring that the sales targets on activations are fully achieved monthly.\n\tDeveloping and implementing commercial strategies according to company goals and objectives aiming to accelerate growth.\n\tConducting market research and analysis to create detailed business plans on commercial opportunities (expansion, business development, etc.)\n\tUnderstand the requirements of existing customers to ensure their needs are being met and to ensure the maximum retention and immediate conversion of new/potential, clients.\n\tAcquire new customers and manage client relationships (new and existing).\n\tBuild and maintain profitable partnerships with key stakeholders\n\tMonitor performance of commercial activities using key metrics and prepare reports for senior management\n\tFunction as an experienced business developer / marketer that will add value to our growth and activities by identifying new commercial opportunities and manage marketing efforts.\n\tKeep abreast of trends and market conditions to advice upper management strategically.\n\tPromote and expand the company’s commercial activities to generate revenues.\n\tAssist in setting financial targets and budget development and monitoring.\n\tBuild and maintain profitable partnerships with key stakeholders\n\n\nRequirements\n\n\n\tA minimum of 2 years of experience in Medical Diagnostic industry.\n\tProven experience as regional marketing manager or other relevant role\n\tProven experience in sales and/or marketing and managing relationships with key clients\n\tIn-depth understanding of market research methods and analysis\n\tSolid knowledge of performance reporting and financial/budgeting processes\n\tCommercial awareness partnered with a strategic mindset\n\tExcellent organizational and leadership skills\n\tOutstanding communication and interpersonal abilities\n\tApplicants must reside in Abuja.\n\n\nBenefits\n\n\n\tSalary: Competitive Salary\n\tOpportunity to make a meaningful impact in a growing industry.\n\tCollaborative and innovative work environment.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: demyhealthhq@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Human Resource Manager Job at Bretty Consultancy Services",
    "link": "https://www.jobgurus.com.ng/jobs/view/human-resource-manager-job-at-bretty-consultancy-services",
    "pubDate": "Mon, 23 Jun 2025 11:14:31 GMT",
    "source": "JobGurus",
    "keyword": "bretty consultancy services",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Bretty Consultancy Services - Our client, a renowned and reputable school in Abuja, is recruiting to fill the position below:\n\nJob Position: Human Resource Manager\nJob Location: Garki, Abuja (FCT)\nEmployment Type: Full-time\n\nJob Overview\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAre you a seasoned HR professional looking for an exciting opportunity to make a significant impact? Bretty Consultancy's client, a renowned and reputable school based in Abuja, is seeking a highly skilled and dedicated Human Resources Manager to join their dynamic team.\n\tThis is a fantastic opportunity for an experienced HR leader to shape the human capital strategy of a leading educational institution, fostering a positive and productive environment for both staff and students.\n\n\nAbout the Role\nAs the Human Resources Manager, you will be responsible for overseeing all aspects of the HR function within the school. This includes, but is not limited to:\n\n\n\tDeveloping and implementing HR strategies, policies, and procedures aligned with the school's vision and mission.\n\tManaging the full recruitment and selection cycle, from talent attraction to onboarding.\n\tOverseeing performance management systems, including appraisals, feedback, and professional development.\n\tEnsuring compliance with all relevant labor laws and regulations.\n\tDeveloping and delivering HR-related training programs.\n\tManaging employee relations, ensuring a fair and supportive work environment.\n\tAdministering compensation and benefits programs.\n\tMaintaining accurate HR records and data.\n\tProviding expert HR advice and support to management and staff.\n\n\nQualifications and Experience\nThe ideal candidate will possess:\n\n\n\tA Bachelor's degree in Human Resources, Business Administration, or a related field. A Master's degree or professional HR certification (e.g., CIPM, SHRM) is a significant advantage.\n\tMinimum of 5years of progressive HR experience, with at least 3 years in a managerial or senior HR role, preferably within the education sector.\n\tIn-depth knowledge of Nigerian labor laws and HR best practices.\n\tProven experience in recruitment, performance management, employee relations, and compensation & benefits.\n\tExceptional communication, interpersonal, and negotiation skills.\n\tStrong leadership and people management abilities.\n\tHigh level of integrity, confidentiality, and professionalism.\n\tProficiency in HR software and Microsoft Office Suite.\n\n\nWhy Join Us\n\n\n\tSalary: N150,000 - N200,000 Monthly.\n\tBe part of a prestigious and well-established educational institution with a commitment to excellence.\n\tWork in a supportive and collaborative environment where your contributions are valued.\n\tOpportunity to lead and innovate the HR function.\n\tCompetitive salary and benefits package.\n\tProfessional growth and development opportunities.\n\n\nMethod of Application\nInterested and qualified candidates should send their resume and a cover letter detailing their relevant experience and why they are the ideal candidate for this role to: brettyconsultancyservices@gmail.com using the Job Position as the subject of the email.\n\nNote: Only shortlisted candidates will be contacted.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]