[
  {
    "title": "Accountant Job at FGS Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/accountant-job-at-fgs-limited",
    "pubDate": "Wed, 11 Jun 2025 11:37:22 GMT",
    "source": "JobGurus",
    "keyword": "fgs limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "FGS Limited, an Oil and Gas Company is recruiting suitably qualified candidates to fill the position below:\n\nJob Position: Accountant\nJob Location: Port Harcourt, Rivers\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tPlan, executing the company’s financial strategy.\n\tDeveloping plans for growth to increase company profit while also reducing expenditure.\n\tIdentifying investment opportunities and managing mergers and acquisitions.\n\tAssisting the Managing Director (MD) to develop financial plans.\n\tManaging accounting procedures.\n\tAnalysing data and creating models based on the analysis.\n\tWork in conjunction with all department heads to ensure maximum profitability and strategize ways to minimize waste and control costs.\n\tProvide critical assessment of all budgets and cost projections.\n\tEnsure the Company’s compliance with relevant statutory law and financial regulations.\n\tLiaising with internal and external auditors to ensure periodic monitoring.\n\tDevelop financial strategy, including risk minimization plans and opportunity forecasting.\n\tConducting reviews and evaluations for cost reduction as well as monitoring actual versus budgeted expenses.\n\tDevelop actionable business strategies and plans that ensure alignment with short-term and long-term objectives developed in alignment with the MD.\n\tEnsures strategic objectives are shaped at the Executive Management level and are translated into tactical business plans with mechanisms for key measurements in place to monitor progress.\n\tEnsure the accuracy, reliability, completeness, and integrity of the Company’s financial statement in line with local and international statutory standards (GAAP, IFRS, etc).\n\tProduce and analyse periodic results and KPIs (Financial & Operations) in accordance with the company’s policies.\n\tCoordinate the Company’s annual statutory audit and periodic review activities with independent auditors.\n\tSupervision of the finance/account officers and assistants.\n\tOverseeing the preparation and analysis of accurate and timely financial reports (e.g., income statements, balance sheets, cash flow statements).\n\tPrepare the Company’s annual budgets and quarterly forecasts.\n\tEnsure Standard Operating procedures and internal control policies in place are strictly adhered to.\n\tDeveloping strategies and plans for the long-term financial goals of the organization as well as directing budgets to meet these goals.\n\tMonitor and control cash flow to enable the organization to meet its business and investment needs.\n\tSetting credit rating criteria, determining credit ceilings, monitoring of receivables, aging, and following up with payment.\n\n\nRequirements\n\n\n\tBachelor’s Degree in Accounting, Finance, Economics, or a related field.\n\tMinimum of 14 - 16 years of financial management experience, with at least 5 - 7 years in a leadership role.\n\tProfessional certification (e.g., ACCA, CPA, CFA) is preferred.\n\tStrong knowledge of financial regulations, accounting principles, and tax laws.\n\tExperience with financial planning, budgeting, and investment analysis.\n\tStrong leadership and team management skills.\n\tExcellent analytical and problem-solving abilities.\n\tProficiency in financial software and ERP systems.\n\tStrong communication and presentation skills.\n\tAbility to work strategically while managing financial details effectively.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: robertituboala@gmail.com or: info@fleesglobal.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Customer Support Specialist Job at Ledgeris",
    "link": "https://www.jobgurus.com.ng/jobs/view/customer-support-specialist-job-at-ledgeris",
    "pubDate": "Wed, 11 Jun 2025 11:37:22 GMT",
    "source": "JobGurus",
    "keyword": "ledgeris",
    "duplicate": false,
    "classifications": [],
    "content": "Ledgeris is revolutionizing back-office outsourcing by offering agile, cost-effective, and high-quality support tailored to your business needs. We specialize in creating dedicated teams that seamlessly integrate with your operations, adopting your preferred tools and processes to ensure smooth collaboration and high efficiency.Our approach allows you to focus on scaling your core business while we handle the rest.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWith a commitment to excellence, Ledgeris provides premium talent without the premium price tag.Our professionals are rigorously vetted, highly skilled, and deeply committed to delivering top-tier results.Leveraging AI to enhance decision-making and eliminate inefficiencies, we combine human expertise with technological innovation to offer smarter, faster, and more human outsourcing solutions.\n\nWe are recruiting to fill the position below:\n\nJob Position: Customer Support Specialist\nJob Location: Benin City, Edo\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe are seeking a Customer Support Specialist who will act as a key point of contact, providing exceptional customer service, and resolving inquiries.\n\n\nKey Responsibilities\n\n\n\tProvide timely and accurate support through phone, email, or chat channels.\n\tAssist with inquiries and appointment scheduling.\n\tResolve complex customer issues while ensuring compliance with regulations and confidentiality protocols.\n\tDocument and track customer interactions in the system, ensuring accurate records for follow-up and reporting purposes.\n\tIdentify potential issues and escalate them appropriately to ensure swift resolution.\n\tOffer guidance to customers.\n\tWork closely with internal teams to ensure smooth communication.\n\tProvide feedback and recommendations for process improvements, training, and tools to enhance customer satisfaction.\n\tEnsure the highest level of customer service while maintaining professionalism and empathy when interacting with customers.\n\n\nRequirements\n\n\n\tAt least 1 year of customer service experience.\n\tExcellent communication skills, both verbal and written, with the ability to convey complex information clearly.\n\tExperience with BPO customer support is preferred.\n\tAbility to handle sensitive and confidential information while adhering to compliance rules and regulations.\n\tProficiency in using customer service software and office productivity tools.\n\tAbility to manage multiple inquiries simultaneously and prioritize tasks in a fast-paced environment.\n\tDetail-oriented with strong organizational and problem-solving skills.\n\tA positive attitude and a passion for providing excellent customer service.\n\n\nBenefits\n\n\n\tGrowth Plan:Develop your skills and grow professionally.\n\tCompetitive Pay:Earn above average pay while doing work that matters.\n\tLearning Opportunities:Accesscontinuous learning opportunities.\n\n\nNote\n\n\n\tLedgeris is proud to be an equal opportunity employer.\n\tWe promote a diverse an inclusive environment for candidates and employees.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Accounting Associate Job at Ledgeris",
    "link": "https://www.jobgurus.com.ng/jobs/view/accounting-associate-job-at-ledgeris",
    "pubDate": "Wed, 11 Jun 2025 11:37:22 GMT",
    "source": "JobGurus",
    "keyword": "ledgeris",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Ledgeris is revolutionizing back-office outsourcing by offering agile, cost-effective, and high-quality support tailored to your business needs.We specialize in creating dedicated teams that seamlessly integrate with your operations, adopting your preferred tools and processes to ensure smooth collaboration and high efficiency.Our approach allows you to focus on scaling your core business while we handle the rest.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWith a commitment to excellence, Ledgeris provides premium talent without the premium price tag.Our professionals are rigorously vetted, highly skilled, and deeply committed to delivering top-tier results.Leveraging AI to enhance decision-making and eliminate inefficiencies, we combine human expertise with technological innovation to offer smarter, faster, and more human outsourcing solutions.\n\nWe are recruiting to fill the position below:\n\nJob Position: Accounting Associate\nJob Location: Benin City, Edo\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe are looking for a detail-oriented and analytical Accounting Associate to join our growing Finance & Accounting team.\n\tThe successful candidate will provide day-to-day accounting support to our clients, ensuring accurate financial records, timely reporting, and compliance with accounting standards.\n\tThis is a fully remote role ideal for candidates with strong financial acumen and experience in cloud-based accounting environments.\n\n\nKey Responsibilities\n\n\n\tRecord daily financial transactions in client accounting systems with accuracy and consistency.\n\tReconcile bank statements, accounts payable/receivable, and general ledger entries.\n\tMonitor budgets and support forecasting and cash flow planning as needed.\n\tEnsure compliance with relevant financial regulations and internal controls.\n\tAssist in month-end and year-end closing activities and financial reporting.\n\tSupport invoice preparation, billing, and expense tracking in alignment with client requirements.\n\tWork with AI tools to automate routine tasks and enhance data accuracy.\n\tCollaborate with client-side finance teams to resolve discrepancies and improve processes.\n\n\nRequirements\n\n\n\tBachelor’s degree in Accounting, Finance, or a related field.\n\t2+ years of accounting experience (bookkeeping, reconciliations, reporting).\n\tProficiency in accounting software such as QuickBooks, Xero, Sage, or similar platforms.\n\tSolid understanding of financial regulations, general accounting principles (GAAP/IFRS), and reconciliations.\n\tStrong Excel or Google Sheets skills, including formulas and pivot tables.\n\tHigh attention to detail, accuracy, and integrity in handling financial data.\n\tExcellent communication skills, with a good command of written and spoken English.\n\n\nPreferred Qualifications:\n\n\n\tExperience in a BPO, outsourcing, or virtual accounting role.\n\tFamiliarity with automated accounting workflows and AI-enhanced financial tools.\n\tCertification such as ACA, ACCA (part-qualified), or CPA is a plus.\n\tKnowledge of cloud-based ERP systems (e.g., NetSuite, Zoho Books).\n\n\nBenefits\n\n\n\tGrowth Plan: Develop your skills and grow professionally,\n\tCompetitive Pay: Earn above average pay while doing work that matters.\n\tLearning Opportunities: Accesscontinuous learning opportunities.\n\n\nNote\n\n\n\tLedgeris is proud to be an equal opportunity employer.\n\tWe promote a diverse an inclusive environment for candidates and employees.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Senior Procurement Manager Job at Maurice Xandra Solutions Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/senior-procurement-manager-job-at-maurice-xandra-solutions-limited",
    "pubDate": "Wed, 11 Jun 2025 11:37:22 GMT",
    "source": "JobGurus",
    "keyword": "maurice xandra solutions limited",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance"
    ],
    "content": "Maurice Xandra Solutions Limited is a management consulting company that renders quality services in Human Resource, Management and Process improvement. MXS Limited was set up to provide high quality, up to date training, team management and process improvement services for its clients.\n\nWe are recruiting to fill the position below:\n\nJob Position: Senior Procurement Manager \n\nJob Location: Lagos\n\nSummary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Senior Procurement Manager will be responsible for building and managing procurement functions that support business needs across technology, marketing, logistics, retail operations, and more.\n\tThis is a strategic role for a results-driven professional who understands how to operate in a fast-moving, Performance-led business environment.\n\n\nkey Responsibilities\n\n\n\tEstablish and lead the Procurement function across all company operations—digital, retail, and infrastructure.\n\tDevelop and execute a comprehensive sourcing and procurement strategy tailored to business priorities.\n\tDefine procurement policies, workflows, and performance KPIs to drive efficiency and accountability.\n\tLead and manage the procurement team, ensuring optimal daily operations and adherence to best practices.\n\tNegotiate contracts and service agreements that protect company interests and meet SLA expectations.\n\tOversee vendor performance reviews and drive continuous improvement.\n\tEnsure full compliance with Nigerian procurement laws corporate governance standards, and internal controls.\n\tSupervise procurement activities for key categories: IT hardware/software, retail materials, marketing assets, logistics, office equipment, and facility services.\n\tEnsure real-time tracking and transparency of all procurement activities.\n\tBuild and maintain strong supplier relationships to ensure quality, cost-effectiveness, and reliability.\n\tDevelop and enforce internal procurement policies and procedures.\n\tIdentify procurement risks and implement strategies to mitigate supply disruptions or overdependence.\n\tConduct regular market and cost analysis to identify savings opportunities and optimise value.\n\tDrive bulk purchasing, strategic sourcing, and supplier diversification to support business sustainability.\n\tTrack budget performance and align procurement spend with financial targets.\n\tOversee procurement systems and tools (e.g., ERP platforms like QuickBooks or others).Collaborate with Finance to ensure seamless integration of procurement workflows and transaction tracking.\n\tContinuously optimise system-based approval processes, requisition tracking, and purchase order management.\n\n\nRequirements\n\n\n\tBachelor’s Degree in Business, Supply Chain Management, Engineering, or a related field. An MBA or relevant certifications (e.g., CIPS, CPSM) is an added advantage.\n\t8+ years of progressive procurement experience, with a minimum of 3 years in a senior leadership role, ideally in technology, telecoms, or gaming sectors\n\tStrong commercial negotiation skills and experience managing contracts and service level agreements.\n\tFamiliarity with ERP/procurement systems (e.g., SAP, Oracle, Coupa) and procurement analytics.\n\tProven ability to deliver cost efficiencies, drive process improvements, and manage supplier relationships.\n\tExcellent stakeholder management, communication, and team leadership skills.\n\n\nMethod of Application\nInterested and qualified candiates should send their CV to: hr@mauricexandra.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Vacancies at Lily Hospitals Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancies-at-lily-hospitals-limited-1",
    "pubDate": "Wed, 11 Jun 2025 11:37:22 GMT",
    "source": "JobGurus",
    "keyword": "lily hospitals limited",
    "duplicate": false,
    "classifications": [],
    "content": "LiLily Hospitals Limited was established since 1986 remains one of the foremost hospitals in Nigeria and within the South-South region of the country. It is the first private hospital in Nigeria to achieve ISO 9001:2000 quality management system certification from the Standards Organization of Nigeria (SON) and was also recently accredited with COHSASA (Council for Health Service Accreditation of Southern Africa) Certificate.\n\nWe are recruiting suitable candidates to fill the following positions below:\n\n1.) Junior Registrar - Radiology\n\nJob Location: Warri, Delta\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tJoin our structured Residency Training Program in Radiology. As a Junior Registrar, you will gain hands-on experience across major imaging modalities such as X-ray, CT, MRI, Ultrasound; while learning under expert consultants in a supportive academic environment.\n\n\nKey Responsibilities\n\n\n\tConduct and report radiological investigations\n\tAttend clinical teaching & academic sessions\n\tMaintain detailed, accurate patient records\n\tWork closely with consultants & allied professionals\n\tAdhere to ethical, safety & clinical best practices\n\n\nEligibility Criteria\n\n\n\tMBBS (with full license)\n\tCompleted Internship & NYSC\n\tPassed Primaries in Radiology (NPMCN or WACS)\n\tStrong interest in imaging, diagnosis & research.\n\n\nWhat We Offer\n\n\n\tAttractive Pay Package - Earn above N500,000 monthly\n\tStructured Residency & Training\n\tDedicated Consultant Mentorship\n\tResearch & Career Development Support\n\tA progressive, teaching-driven work culture.\n\n\nApplication Closing Date: 18th June, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV & Credentials to: recruitment@lilyhospitals.net using \"Junior Registrar - Radiology” as the subject of the email.\n\n \n\n \n\n2.) Clinical Quality Lead\n\nJob Location: Warri, Delta\nEmployment Type: Full-time\n\nSummary\n\n\n\tWe are seeking a driven and quality-focused Clinical Quality Lead to support the delivery of excellent patient care across our hospital group.\n\tIn this role, you will guide a team of clinical professionals, lead routine quality assessments, and help embed continuous improvement practices within the clinical environment.\n\tThis position is ideal for a healthcare professional with a solid clinical background and a growing track record in quality assurance, supportive supervision, and health systems strengthening.\n\n\nKey Responsibilities\n\n\n\tLead implementation of quality improvement initiatives across hospital units\n\tConduct Gemba rounds to assess frontline clinical practices and identify service gaps\n\tOversee team-based learning activities, training programs, and technical mentorship\n\tTrack clinical KPIs and report progress toward care standards and safety benchmarks\n\tDrive internal quality audits, performance reviews, and feedback processes\n\tSupport accreditation readiness (e.g., ISO, COHSASA) and regulatory compliance\n\tCollaborate with multidisciplinary teams to standardize and sustain best practices.\n\n\nRequirements\n\n\n\tMBBS from a recognized institution (mandatory)\n\t5 - 7 years of clinical experience, including 2+ years in quality, supervision, or health program management roles\n\tPostgraduate qualification in Public Health, Health Management, or related field is an advantage\n\tDemonstrated experience in quality improvement, supportive supervision, or clinical mentorship\n\tFamiliarity with Kaizen/Lean principles and healthcare accreditation frameworks (e.g., ISO, COHSASA)\n\tStrong communication, analytical, and leadership skills\n\tProficiency in Microsoft Office and clinical data tools (DHIS2, Kobo Collect, etc.) is desirable.\n\n\nWhat We Offer\n\n\n\tCompetitive salary and benefits package.\n\tOpportunities for professional growth and development.\n\tA supportive and collaborative work environment.\n\n\nApplication Closing Date: 17th June, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV and credentials to: recruitment@lilyhospitals.net using \"Clinical Quality Lead\" as the subject of the mail.\n\n \n\n \n\n3.) Logistics Officer\n\nJob Location: Warri, Delta\nEmployment Type: Full-time\n\nJob Description\n\n\n\tThe Logistics Officer will ensure timely transportation, and distribution of goods and services to meet the hospital’s operational needs efficiently.\n\n\nKey Responsibilities\n\n\n\tImplement systems to track and report on inventory usage and waste.\n\tOversee the hospital’s transport and logistics activities, including managing delivery schedules.\n\tProvide regular updates on the status of logistics operations.\n\tEnsure all logistics activities comply with relevant policies, procedures, and regulations.\n\tEnsure the hospital’s vehicles are well-maintained and compliant with safety standards.\n\tWork closely with departments to understand their logistics needs and ensure timely delivery of required items.\n\tPeriodically evaluate suppliers and contractors to ensure consistent quality and reliability.\n\n\nQualifications and Skills\nEducation:\n\n\n\tBachelor’s Degree or HND in Logistics, Supply Chain Management, Business Administration, or a related field.\n\n\nExperience:\n\n\n\tMinimum of 2 years of experience in logistics preferably in the healthcare industry.\n\n\nSkills:\n\n\n\tStrong organizational and problem-solving skills.\n\tProficiency in logistics software and Microsoft Office Suite.\n\tExcellent communication and negotiation skills.\n\tAbility to multitask and work under pressure.\n\tLocation: Must Reside in Warri Delta State or its environs.\n\n\nWhat We Offer\n\n\n\tCompetitive salary and benefits package.\n\tOpportunities for professional growth and development.\n\tA supportive and collaborative work environment.\n\n\nApplication Closing Date: 17th June, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV and credentials to: recruitment@lilyhospitals.net using the Job Position as the subject of the mail.\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]