[
  {
    "title": "Social Media Manager Job at Ezion-Geber Energy Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/social-media-manager-job-at-ezion-geber-energy-limited",
    "pubDate": "Mon, 16 Jun 2025 13:30:44 GMT",
    "source": "JobGurus",
    "keyword": "ezion-geber energy limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Ezion-Geber Energy Limited is a wholly Nigerian company established to deliver industry-leading solutions in the oil and gas sector. Renowned for innovation, technology and engineering ingenuity, the company is well positioned to provide a range of products and services that deliver fully integrated solutions to challenges of any scale or complexity.\n\nWe are recruiting to fill the position below:\n\nJob Position: Social Media Manager\nJob Location: Lagos \nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDevelop and implement a comprehensive social media strategy aligned with overall business goals.\n\tConduct competitive research and audience analysis to inform content and campaigns.\n\tCreate and manage engaging content (text, image, video) across platforms (e.g., Facebook, Instagram, LinkedIn, Twitter/X).\n\tDevelop and maintain a content calendar.\n\tMonitor and engage in relevant conversations to build community and brand loyalty.\n\tManage user-generated content and influencer collaborations.\n\tAnalyse key metrics and report on social media performance (reach, engagement, conversions, etc.).\n\tUse analytics tools (e.g., Meta Business Suite, Google Analytics, Sprout Social) to measure success and adjust strategies accordingly.\n\tStay aligned with other digital marketing efforts (email, SEO, content marketing).\n\tDevelop and execute content strategies across all major social media platforms of the organization.\n\tPlan and execute social media advertising campaigns (paid social).\n\tTrack ROI and optimize ads for performance.\n\tCreate high-quality, engaging, and original content.\n\n\nRequirements\n\n\n\tBachelor’s degree in Marketing, Communications, Public Relations, Journalism, or a related field (preferred).\n\t3 - 5 years of proven experience in social media management or digital marketing.\n\tStrong content creation and storytelling skills\n\tDeep familiarity with Instagram and other platforms' growth strategies.\n\tPortfolio or examples of past successful campaigns and content.\n\n\nSalary\nN240,000 - N250,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: recruitment.egel@gmail.com with the subject line \"Social Media Manager\" as the title of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Engineering Store Assistant Job at High Caliber Nigeria Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/engineering-store-assistant-job-at-high-caliber-nigeria-limited",
    "pubDate": "Mon, 16 Jun 2025 13:30:44 GMT",
    "source": "JobGurus",
    "keyword": "high caliber nigeria limited",
    "duplicate": false,
    "classifications": [],
    "content": "High Caliber Nigeria Limited is a human resources/management consultancy company. We specialize in the following areas: Outsourcing, Recruitment and Placement, Human Capacity Development (Training), Staff Audit, Advisory and Human Resources Management.\n\nWe are recruiting to fill the position below:\n\nJob Position: Engineering Store Assistant\nJob Location: Lagos\nEmployment Type: Full-time\n\nDuties\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tArranges store items and supplies, ensuring ease of retrieval.\n\tAssist the Store Officer in raising purchase requests as may be delegated.\n\tFollows up with procurement to ensure timely supply of the items\n\tLiaises with external suppliers for the delivery of store\n\tEnsures the store maintains a high level of hygiene at all times.\n\tRecord all receipts in receiving log and issuance in the issue logbook.\n\tInspects all newly purchased store items, ensuring conformance with quantity and design specifications.\n\tUpdate the bin cards immediately after receiving or issuing store items.\n\tMaintain a file of open requisitions.\n\tPerform all other task as assigned. Etc.\n\n\nQualifications\n\n\n\tMinimum of OND.\n\n\nExperience:\n\n\n\t2-4 years.\n\n\nMethod of Application\nInterested and qualified candidates should forward their CV to: highcaliberhub@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Internal Auditor Job at Total Quest Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/internal-auditor-job-at-total-quest-limited-1",
    "pubDate": "Mon, 16 Jun 2025 13:30:44 GMT",
    "source": "JobGurus",
    "keyword": "total quest limited",
    "duplicate": false,
    "classifications": [],
    "content": "Total Quest is an institute which specializes on consultancy both in Health, construction and hospitality field.\n\nWe are recruiting to fill the position below:\n\nJob Position: Internal Auditor\n\nJob Location: Warri, Ebrumede - Delta\nEmployment Type: Full-time\n\nRequirements\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tCandidates should possess a Degree with at least 3 years of experience\n\tAccount experience in a hotel is a must\n\tHave Audit Experience\n\tGreat communication Skills\n\tMust be computer Literate.\n\tPresentation Skills are a must.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: info@totalquest.net using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Customer Success Manager Job at the Greytar Company",
    "link": "https://www.jobgurus.com.ng/jobs/view/customer-success-manager-job-at-the-greytar-company",
    "pubDate": "Mon, 16 Jun 2025 13:30:44 GMT",
    "source": "JobGurus",
    "keyword": "the greytar company",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "At Greytar, we bring brands to life with exceptional design and top-quality printing. From striking logos to beautifully crafted marketing and packaging materials, we ensure every detail makes a lasting impression.\n\nWe are recruiting to fill the position below:\n\nJob Position: Customer Success Manager\n\nJob Location: Yaba, Lagos\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tHandle customer inquiries and provide support\n\tPromote and sell our products\n\tTrack and report on customer service KPI\n\tWork with other department to improve customer satisfaction\n\tMaintain CRM record and ensure prompt follow up\n\tDevelop strategies to improve response time and service quality.\n\n\nWhat you get\n\n\n\tSalary: N80,000 - N100,000 / month.\n\tCompetitive salary\n\tQuarterly performance bonus\n\tHealthy work environment\n\tHybrid work mode\n\tTeam Support\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: greytar01@gmail.com using the Job Position and Location as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Assistant Manager, Financial Reporting Job at Oando Plc",
    "link": "https://www.jobgurus.com.ng/jobs/view/assistant-manager-financial-reporting-job-at-oando-plc",
    "pubDate": "Mon, 16 Jun 2025 13:30:44 GMT",
    "source": "JobGurus",
    "keyword": "oando plc",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Oando Plc is one of Africa’s largest integrated energy solutions provider with a proud heritage. It has a primary listing on the Nigeria Stock Exchange and a secondary listing on the Johannesburg Stock Exchange. With shared values of Teamwork, Respect, Integrity, Passion and Professionalism (TRIPP).\n\nWe are recruiting to fill the position below:\n\nJob Position: Assistant Manager, Financial Reporting\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Assistant Manager, Financial Reporting provides technical and administrative support in executing OERNL financial reporting strategies and obligations that aim to ensure the continued efficiency, profitability and growth of the Company and its subsidiaries.\n\tThe role is responsible for coordination of the interactions between Financial Reporting Accountants.\n\tApprove transactions being recorded and processed with a view to ensuring consistency and accurate reports that reflect a true and fair view of the Company’s financial position at all times.\n\tResponsibilities also covers review of financial analysis of assigned entities which will support working capital and liquidity management by senior team members in Finance.\n\tThe incumbent will also be responsible for presentation of detailed financial information at each reporting period to the respective Financial Reporting Managers.\n\n\nMain Responsibility Areas\n\n\n\tReview statutory accounts of subsidiaries\n\tApprove transactions of corporate and others are posted accurately and timely.\n\tReview and approve financial analysis for entities within and outside Nigeria.\n\tCheck and approve IFRS disclosure checklists in place. and implement solutions to unconventional situations and results oriented.\n\tEnsure transactions are recorded in line with IFRS\n\tBuild system templates for preparation of relevant financial reports to monitor performance and support decision making\n\tKey Financial accounting inputs for tax audis.\n\tReview and approve detailed analytical reviews to be used for internal and external reporting to key stakeholders.\n\tProvide support to ensure strict adherence to set policies and procedures for internal controls over financial reporting\n\tSupport financial reporting Manager with managing audit requirements with EY and PwC for the consolidated entities.\n\tSupport JV accounting team on treatment of complex transactions.\n\n\nKey Performance Indicators\n\n\n\tSupport in the Completion of Statutory accounts for assigned subsidiaries.\n\tTimely completion of monthly, quarterly and annual close process.\n\tCompliance with IFRS.\n\n\nPerson Specifications\n\n\n\tB.Sc degree in Accounting or relevant degree\n\tMinimum of 8 years of relevant work experience\n\tMembership of a recognized Accounting Professional Body (ACA / ACCA / CPA)\n\tWorking experience in a big 4 audit and accounting firm / Oil and Gas will be of added advantage.\n\tGood knowledge of IFRS.\n\n\nCore Competencies:\n\n\n\tStrong and effective Interpersonal Skills\n\tGood understanding of IFRS\n\tCompetent in preparing statutory financial statements\n\tOil and Gas Accounting\n\tWorking Knowledge of Oil and Gas Industry in Nigerian and understanding PSC and Joint Venture Arrangements as well as their key accounting related issues.\n\tUnderstanding of Current and Deferred Taxes\n\tComputer Skills - Microsoft Office (Excel, Word etc) and Oracle EBS\n\tAbility to think strategically and holistically and provide direction and coaching to the team.\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]