[
  {
    "title": "Service Delivery Manager Job at Barnksforte Group Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/service-delivery-manager-job-at-barnksforte-group-limited",
    "pubDate": "Fri, 06 Jun 2025 10:17:23 GMT",
    "source": "JobGurus",
    "keyword": "barnksforte group limited",
    "duplicate": false,
    "classifications": [],
    "content": "Barnksforte Group Limited is a diverse conglomerate which operations spans across different sectors of the economy; health, housing, energy, agriculture, and technology. The Company’s core business focus is to develop state of the art technology that meets the needs of its Clients in Nigeria and Globally.\n\nWe are recruiting to fill the position below:\n\nJob Position: Service Delivery Manager\nJob Locations: Abuja & Lagos\nEmployment Type: Full-time\n\nDescription\nOur Exciting Opportunity:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are now looking for a Service Delivery Manager who will be responsible for ensuring the correct and proper delivery of customer support services to our customers.\n\tIn this role, you will be responsible for the Technical and financial performance of delivered customer support services.\n\tYou will also ensure that agreed margins are achieved whilst delivering Service Level Agreement fulfillment and customer satisfaction.\n\tThe role also includes leading the customer network support engineers’ team and working closely with the competence centers, global support, and product line maintenance teams.\n\n\nResponsibilities\nYou will:\n\n\n\tResponsible for the financial and commercial as well as environment, health and safety (EHS) performance of delivered customer support services\n\tCollaborate and maintain relationships\n\tActive contributor in the Sales process, identify new business opportunities and drive Add on Sales, in cooperation with Account team\n\tManage the contractual requirements towards the Customer Support organization\n\tDistribute information to internal partners and call out delivery Issues\n\tYou will stay up to date with financial data\n\t24/7 support in emergency situations\n\n\nRequirements\nTo be successful in the role you are:\n\n\n\tMinimum of Graduate Degree in Engineering (Telecommunication or IT preferred) or equivalent\n\tMinimum of 10 years of working experience and at least 5 years of Service Delivery Management experience.\n\tE2E knowledge of Telecom Network including Cloud, Core, RAN and Revenue Management Nodes\n\tFinancial analysis skills\n\tNegotiation and argumentation\n\tPresenting & Communicating information\n\tYou will promote knowledge sharing and mentoring\n\tDelivering Results & Meeting Customer Expectations\n\tResponsible for delivering results & meeting customer expectations\n\tYou will drive Entrepreneurial & Commercial Thinking\n\tChange and improvement management skills\n\tLeading & Supervising\n\tDeciding & initiating action\n\tYou are capable of coping with pressures & setbacks\n\n\nYou should also have:\n\n\n\tVery good leadership and management skills\n\tExcellent social skills and strong customer orientation\n\tSelf-motivated and teammate.\n\tAbility to adapt to change\n\tAbility to work under pressure\n\tTrade compliance knowledge\n\tPersuading & Influencing\n\tRelating & Networking.\n\n\nSalary\nN400,000 - N700,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: careers@barnksfortegroup.com using the Job Position and Location as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Internal Human Resources Manager (HR) Job at Ziba Consulting",
    "link": "https://www.jobgurus.com.ng/jobs/view/internal-human-resources-manager-hr-job-at-ziba-consulting",
    "pubDate": "Fri, 06 Jun 2025 10:17:23 GMT",
    "source": "JobGurus",
    "keyword": "ziba consulting",
    "duplicate": false,
    "classifications": [],
    "content": "Ziba Consulting is a dynamic recruitment and consulting firm committed to connecting top talent with the right opportunities. Our mission is to help businesses streamline their hiring processes while supporting job seekers in achieving their career goals.\n\nWe are recruiting to fill the position below:\n\nJob Position: Internal Human Resources Manager (HR)\nJob Location: Lekki Phase I, Lagos\nEmployment Type: Full-time\nWork Mode: Hybrid\nReports To: COO & CEO\n\nPosition Overview\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are a dynamic HR consulting firm committed to delivering high-impact solutions to our clients.\n\tWe work with speed, strategy, and precision, and we’re looking for a proactive HR Manager to lead our internal HR operations and help us continue building a high-performance culture.\n\n\nJob Summary\n\n\n\tThe ideal candidate is a performance-oriented professional who can create and improve trackers, monitor employee activities, call out defaulters, and develop performance reports to guide strategic decisions. You must demonstrate strong leadership, communication, and organizational skills to thrive in our fast-paced environment.\n\n\nKey Responsibilities\n\n\n\tDevelop, manage, and improve HR trackers for attendance, performance, and compliance.\n\tMonitor employee activities and proactively follow up with defaulters.\n\tGenerate and present performance reports to management, highlighting trends and areas for improvement.\n\tEnsure HR policies are up-to-date and effectively communicated across the company.\n\tCoordinate recruitment, onboarding, and offboarding processes.\n\tLead and manage employee performance review cycles and recommend development strategies.\n\tDrive employee engagement, retention, and team productivity.\n\tHandle employee relations, conflict resolution, and disciplinary procedures firmly but fairly.\n\n\nRequirements\n\n\n\tBachelor's Degree in Human Resources, Industrial Relations, Business Administration, or related field.\n\t1–3 years of progressive HR experience in a fast-paced environment.\n\tProven ability to create, monitor, and improve HR performance.\n\tStrong reporting and data analysis skills (Excel, Google Sheets, HRIS tools, etc.).\n\tExcellent communication and interpersonal skills.\n\tStrong leadership qualities and the ability to work with minimal supervision.\n\tProactive, detail-oriented, and firm when addressing performance or compliance issues.\n\n\nWhat We Offer\n\n\n\tN200,000 monthly\n\tOpportunity for growth and leadership within the company\n\tExposure to a diverse range of HR projects and clients\n\tCollaborative and fast-paced work environment.\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Admin Officer Job at G-Shoppers",
    "link": "https://www.jobgurus.com.ng/jobs/view/admin-officer-job-at-g-shoppers-1",
    "pubDate": "Fri, 06 Jun 2025 10:17:23 GMT",
    "source": "JobGurus",
    "keyword": "g-shoppers",
    "duplicate": false,
    "classifications": [],
    "content": "G-Shoppers is a leading grocery delivery e-commerce platform based in Port Harcourt, dedicated to providing convenient and easy food shopping experiences for homes, career women, and businesses. We aim to make cooking effortless for our customers by offering: Convenient shopping: An easy online shopping experience, Fresh produce: Top-notch foodstuffs and meat products, and Prepped ingredients: Ready-to-use food ingredients to make cooking a breeze.\n\nWe offer a wide range of products, including Fresh meat, Seafood, Frozen foods, Dry foods, Vegetables, Fruits and Prepped, ready-to-cook food ingredients. At G-Shoppers, we're committed to delivering exceptional service, quality products, and a seamless shopping experience to our customers.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Admin Officer\nJob Location: Eliozu, Port Harcourt, Rivers\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe are seeking a highly organized, detail-oriented, and versatile Administrative Officer & Executive Assistant to support our dynamic team at G-Shoppers.\n\tThe successful candidate will provide administrative support, tracking of KIPs and assist the Managing Director (MD) in various capacities.\n\n\nKey Responsibilities\nAdministrative Support:\n\n\n\tDocumentation of all staff files and update when neccesary and tranfering of hard copies to soft copies.\n\tStaff Support: Provide support to staff members, including onboarding, training, and performance monitoring.\n\tExecutive Assistance: Assist the MD with scheduling appointments, managing emails, and preparing reports.\n\tCompliance: Ensure compliance with organizational policies, procedures, and regulatory requirements.\n\tRecord-Keeping: Maintain accurate and up-to-date records, files, and databases.\n\tCommunication: Develop and implement effective communication strategies to ensure seamless information flow.\n\n\nRequirements\n\n\n\tEducation: Bachelor's Degree in Business Administration, Management, or a related field.\n\tExperience: At least 1 year of experience in administration or a related field.\n\tSkills: Excellent communication, organizational, and time management skills.\n\tSoftware: Proficient in Microsoft Office, Google Suite, and other productivity software.\n\tLiving not far away from Eliozu.\n\n\nSalary\nN100,000 monthly.\n\nMethod of Application\nInterested and qualified candidates should send their Application and CV to: gshoppersrecruitment@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Account Officer Job at G-Shoppers",
    "link": "https://www.jobgurus.com.ng/jobs/view/account-officer-job-at-g-shoppers",
    "pubDate": "Fri, 06 Jun 2025 10:17:23 GMT",
    "source": "JobGurus",
    "keyword": "g-shoppers",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "G-Shoppers provide easy food shopping support to homes, career men, women and business people who are faced with the challenge of being constantly away from home and have less or no time to shop as well as cook. We execute orders to supply food stuff and items such as fresh meat, seafood, frozen, dry foods, vegetables, fruits, and prepped, ready-to-cook food ingredients. We are based in Port Harcourt.\n\nWe are recruiting to fill the position below:\n\nJob Position: Account Officer\nJob Location: Rivers\nEmployment Type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are looking for an account officer to assist in managing the company's finances, to also record and analyze financial data.\n\tRecord financial data, analyze this data, and prepare regular reports\n\tRegular bookkeeping to ensure accounting is accurate and up-to-date\n\tEnsure each operational facility has accurate financial data\n\tLead the company's relationship with banks and other financial houses\n\tWork with the management team in approving company expenses\n\tAssist with budget preparation and financial forecasting\n\tAnalyze financial data using ERP or Quickbooks and other accounting software\n\tRelate with external auditors and tax consultants.\n\n\nRequirements\n\n\n\tFirst Degree in Accounting, Banking and Finance, Economics, or a similar financial field.\n\tAdvanced use of Microsoft Excel or Google Sheets\n\tVery detailed and not easily distracted\n\tShould reside near Eliozu\n\tShould be willing to work Monday to Saturday with one day off a month\n\tShould be agile, smart, and deeply analytical.\n\tReady to resume in a few days.\n\n\nSalary\nN100,000 monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: gshoppersrecruitment@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Human Resources / Admin Personnel Job at C Recruite",
    "link": "https://www.jobgurus.com.ng/jobs/view/human-resources-admin-personnel-job-at-c-recruite",
    "pubDate": "Fri, 06 Jun 2025 10:17:23 GMT",
    "source": "JobGurus",
    "keyword": "c recruite",
    "duplicate": false,
    "classifications": [],
    "content": "C Recruite - Our client, one of the foremost technology and media companies in Nigeria, is recruiting to fill the position below:\n\nJob Position: Human Resources / Admin Personnel\nJob Location: Lagos\nEmployment Type: Full-time\nGender: Female\n\nKey Responsibilities\nHR Management:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tMaintaining employee records, including contracts, benefits, and performance reviews.\n\tOverseeing the recruitment process, including job postings, interviewing, and hiring.\n\tProcessing payroll and ensuring timely payment of salaries.\n\tProviding HR guidance and support to employees, answering inquiries about benefits and policies.\n\tDeveloping and implementing HR policies and procedures.\n\n\nAdministrative Duties:\n\n\n\tManaging office supplies and facilities.\n\tCoordinating logistics for meetings and events.\n\tHandling correspondence and communications.\n\tEnsuring compliance with legal and regulatory requirements.\n\tCreating and maintaining administrative records.\n\n\nSalary\nN100,000 - N150,000 monthly.\n\nMethod of Application\nInterested and qualified candidates should send an updated CV with working phone number and full address to: crecruitment50@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]