[
  {
    "title": "Procurement Officer Job at Prime Pharmacy",
    "link": "https://www.jobgurus.com.ng/jobs/view/procurement-officer-job-at-prime-pharmacy-1",
    "pubDate": "Thu, 12 Jun 2025 13:29:41 GMT",
    "source": "JobGurus",
    "keyword": "prime pharmacy",
    "duplicate": false,
    "classifications": [],
    "content": "Prime Pharmacy is a Pharmaceutical industry with superstores in all of its branches, We're a one-stop shop for all your medical and groceries needs. currently, we have three branches that are currently functional and operational 24/7. The Asokoro Garki branch is the Head Branch, while the other branches are located in Gwarimpa and Kubwa respectively.\n\nWe are recruiting to fill the position below:\n\nJob Position: Procurement Officer\n\nJob Location: Area 11 Garki, Abuja (FCT)\nEmployment Type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tEstimate and establish cost parameters and budgets for purchases.\n\tCreate and maintain good relationships with vendors/suppliers.\n\tMake professional decisions in a fast-paced environment.\n\tNegotiate the best deal for pricing and supply contracts.\n\tEnsure that the products and supplies are high quality.\n\tMaintain records of purchases, pricing, and other important data.\n\tReview and analyze all vendors/suppliers, supply, and price options.\n\tDevelop plans for purchasing equipment, services, and supplies.\n\tMaintain and update a list of suppliers and their qualifications, delivery times, and potential future development.\n\tWork with team members and procurement manager to complete duties as needed.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: primepharmacyjobs@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Delivery Manager Job at BAFashion",
    "link": "https://www.jobgurus.com.ng/jobs/view/delivery-manager-job-at-bafashion",
    "pubDate": "Thu, 12 Jun 2025 13:29:41 GMT",
    "source": "JobGurus",
    "keyword": "bafashion",
    "duplicate": false,
    "classifications": [],
    "content": "BAFashion is a fast-growing fashion and lifestyle brand focused on offering trendy, budget-friendly, and quality clothing for the modern customer. Our aim is to create a smooth shopping experience through innovation, consistency, and excellent customer service.\n\nWe are recruiting to fill the position below:\n\nJob Position: Delivery Manager\n\nJob Location: Ketu, Lagos\nEmployment Type: Full-time\nStart Date: Immediate\nWorking Hours: Monday – Saturday, 8:00 AM – 6:30 PM\n\nSummary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are looking for an exceptional Delivery Manager to join our growing operations team in Ketu.\n\tThis is a leadership role for a confident, experienced professional who understands the fast-paced demands of logistics, thrives under pressure, and can lead delivery operations to excellence.\n\t\n\tIf you’re a results-driven logistics professional with a strong leadership background and you’re ready to take full ownership of delivery performance, this opportunity is for you.\n\t\n\n\nRole Overview\n\n\n\tAs the Delivery Manager, you will be responsible for managing and optimizing the full delivery lifecycle from dispatch to final customer drop-off.\n\tYou will lead the delivery team, ensure efficient routing, enforce service standards, and troubleshoot logistics challenges in real time.\n\n\nKey Responsibilities\n\n\n\tSupervise and coordinate daily delivery activities and personnel\n\tDesign and execute effective delivery schedules and routing plans\n\tEnsure timely, accurate, and damage-free deliveries\n\tMonitor driver performance and manage compliance with protocols\n\tRespond to delivery issues and customer concerns promptly\n\tProvide regular reports and insights to improve operational efficiency.\n\n\nCandidate Requirements\n\n\n\tB.Sc. or HND in Logistics, Business, or any relevant field\n\tA minimum of 4 years of experience in delivery/logistics operations, preferably in a leadership role\n\tProven ability to manage delivery teams and logistics KPIs\n\tStrong organizational and problem-solving skills\n\tExcellent communication and team leadership ability\n\tMust be available to resume immediately.\n\n\nWhat We Offer\n\n\n\tAttractive monthly salary of N250,000\n\tLeadership role with real impact and visibility\n\tProfessional environment focused on growth and operational excellence.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: recruitment@bafashion.shop using \"Delivery Manager\" as the subject of the mail.\n\nNote\n\n\n\tApplications are reviewed on a rolling basis.\n\tOnly candidates who meet the requirements and can start immediately will be considered.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Virtual Assistant Trainer Job at Raphael Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/virtual-assistant-trainer-job-at-raphael-group",
    "pubDate": "Thu, 12 Jun 2025 13:29:41 GMT",
    "source": "JobGurus",
    "keyword": "raphael group",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Raphael Group - A professional virtual assistant service that connects employers with skilled remote assistants. We offer a wide range of services to support individuals and businesses, including scheduling, email management, research, and more. We take the hassle out of finding and hiring qualified virtual assistants, allowing you to focus on growing your business.\n\nWe are recruiting a highly skilled and passionate candidate to join our dynamic team in the capacity below:\n\nJob Position: Virtual Assistant Trainer\n\nJob Locations: Abuja (FCT)  and Lagos (Remote)\nEmployment Type: Full-time\n\nAbout the Role\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAs our VA Trainer, you will be responsible for designing, delivering, and evaluating training programs to prepare aspiring virtual assistants for high-performance roles in international markets.\n\tThis role is ideal for someone with deep experience in the virtual assistance industry, a talent for teaching, and a passion for empowering others.\n\n\nKey Responsibilities\n\n\n\tDevelop and update VA training curriculums, including lesson plans, presentation materials, assessments, and resource guides.\n\tConduct live virtual training sessions (Zoom/Google Meet) for cohorts of 10–50 trainees.\n\tProvide 1-on-1 mentorship and performance feedback to trainees.\n\tTeach a wide range of VA skills including:\n\t\n\t\tAdministrative support\n\t\tCalendar & email management\n\t\tCustomer service\n\t\tSocial media management\n\t\tBasic graphic design (Canva)\n\t\tContent creation\n\t\tResearch & data entry\n\t\tCRM tools (e.g. HubSpot, Zoho, Salesforce)\n\t\tProject management tools (e.g. Trello, Asana, ClickUp)\n\t\tUse of Google Workspace and Microsoft Office Suite\n\t\tEvaluate trainee performance and certify those who meet required standards.\n\t\tKeep up with industry trends and update course materials accordingly.\n\t\tCollaborate with the recruitment and placement team to ensure trainees are job-ready.\n\t\tProvide post-training support and guidance to help VAs transition into client roles.\n\t\n\t\n\n\nQualifications & Skills Required\n\n\n\t2 - 3 years of experience working as a Virtual Assistant (or managing VAs).\n\tProven experience as a trainer, coach, or mentor (formal or informal).\n\tLeadership capabilities\n\tHighly motivated and adaptable with a Positive and solution-oriented mindset\n\tDeep familiarity with VA tools and platforms.\n\tTech-savvy and comfortable using online platforms (Zoom, Google Meet, LMS, Slack, etc.).\n\tStrong presentation and facilitation skills.\n\tStrong organizational and time management skills.\n\tExcellent English communication skills (spoken & written).\n\tEmpathetic, patient, and passionate about helping others grow.\n\tAbility to teach international etiquette and client communication.\n\tPrior experience creating SOPs and workflow systems.\n\tCertification in training, coaching, or project management (an added advantage).\n\n\nWorking Conditions:\n\n\n\tFully remote, with flexible but consistent working hours.\n\tWeekly team check-ins and training updates.\n\tYou must have a reliable laptop, reliable electricity, stable internet (minimum 10 Mbps), and a quiet workspace.\n\n\nWhat We Offer\n\n\n\tCompetitive monthly salary (N150,000 - N200,000 per month based on experience and performance)\n\tOpportunity to impact lives and create job opportunities.\n\tLong-term career growth and promotion opportunities.\n\tAccess to paid courses, resources, and a vibrant remote team culture.\n\n\n \n\nApplication requirements\n\n\n\tYour updated CV\n\tA short video (2–3 mins) introducing yourself and explaining what makes a great Virtual Assistant Trainer\n\tA recent professional headshot (clean background, well-lit, business-casual or formal attire).\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Social Media Manager Job at Raphael Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/social-media-manager-job-at-raphael-group-2",
    "pubDate": "Thu, 12 Jun 2025 13:29:41 GMT",
    "source": "JobGurus",
    "keyword": "raphael group",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Raphael Group - A professional virtual assistant service that connects employers with skilled remote assistants. We offer a wide range of services to support individuals and businesses, including scheduling, email management, research, and more. We take the hassle out of finding and hiring qualified virtual assistants, allowing you to focus on growing your business.\n\nWe are recruiting to fill the position below:\n\nJob Position: Social Media Manager\n\nJob Locations: Abuja (FCT) and Lagos\nEmployment Type: Full-time\n\nDescription\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are a dynamic and forward-thinking company seeking a dedicated and experienced Social Media Manager to join our team.\n\tIf you are proactive, creative, and have a proven track record of managing successful social media campaigns, we would love to hear from you.\n\n\nKey Responsibilities\n\n\n\tDevelop, implement, and manage social media strategies across various platforms (Facebook, Instagram, Twitter, LinkedIn, etc.).\n\tCreate engaging multimedia content and manage social media accounts, ensuring brand consistency and voice.\n\tAnalyze social media metrics and derive actionable insights to optimize performance.\n\tCollaborate with other departments to align social media strategies with overall marketing goals.\n\tStay up-to-date with the latest social media best practices and technologies.\n\tMonitor SEO and web traffic metrics to assess campaign effectiveness.\n\tManage social media advertising campaigns, including budget allocation and performance tracking.\n\n\nRequirements\n\n\n\tInterested candidates should possess an HND / Bachelor's Degree\n\tMinimum of 5 years of experience in social media management, with a strong portfolio of successful campaigns.\n\tClear proof of work, including case studies or examples of past projects.\n\tProficiency in social media management tools (e.g., Hootsuite, Buffer, Sprout Social).\n\tStrong understanding of social media KPIs and analytics tools (Google Analytics, Facebook Insights, etc.).\n\tExcellent communication, writing, and editing skills.\n\tCreative thinker with the ability to develop innovative and engaging content.\n\tStrong organizational and multitasking skills with the ability to manage multiple projects simultaneously.\n\tExperience with graphic design tools (e.g., Adobe Creative Suite, Canva) is a plus.\n\tMust be really good with CapCut.\n\n\nDesired Attributes:\n\n\n\tHighly motivated and proactive with a passion for social media and digital marketing.\n\tStrong analytical skills and attention to detail.\n\tAbility to work independently and as part of a team.\n\tExcellent time management and organizational skills.\n\tAbility to stay calm under pressure and meet tight deadlines.\n\tPositive attitude and strong work ethic.\n\n\nSalary\nN135,000 / month.\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "B2B Sales Executive Job at Ascentech Services Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/b2b-sales-executive-job-at-ascentech-services-limited",
    "pubDate": "Thu, 12 Jun 2025 13:29:41 GMT",
    "source": "JobGurus",
    "keyword": "ascentech services limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Ascentech Services Limited is a full-fledged Human Resource Solution Provider incorporated in 2013 with its Head Office in Lagos, Nigeria. We are committed to forging long-term partnerships with our clients by creating and delivering robust and flexible services that address the changing needs of their business.\n\nWe are recruiting to fill the position below:\n\nJob Position: B2B Sales Executive\nJob Location: Lagos\nEmployment Type: Full-time\nIndustry: Small & Kitchen Appliances / Electronics\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are looking for experienced and motivated B2B Sales Executives to strengthen our sales team.\n\tThis role focuses on building and expanding our client base across wholesale, distribution, and institutional segments.\n\tCandidates with a solid background in the small and kitchen appliances industry will be especially well-positioned for success.\n\n\nKey Responsibilities\n\n\n\tDevelop and manage B2B sales pipelines with a focus on wholesale, retail partners, dealers, and institutional buyers.\n\tBuild strong, long-term relationships with key decision-makers and procurement teams.\n\tConduct regular market analysis to identify new business opportunities and emerging trends.\n\tCollaborate closely with the marketing, logistics, and product teams to align strategies and ensure customer satisfaction.\n\tPresent product offerings effectively to potential clients and negotiate deals.\n\tMeet and exceed monthly and quarterly sales targets.\n\tPrepare detailed reports and sales forecasts.\n\n\nRequirements\n\n\n\tMinimum 3 years of proven experience in B2B sales, preferably within the consumer electronics or home/kitchen appliances sector.\n\tStrong understanding of product distribution, pricing strategies, and trade relationships.\n\tCandidates with prior exposure to well-known and established brands in the appliance industry will have a competitive advantage.\n\tExcellent negotiation, communication, and presentation skills.\n\n\nWhat We Offer\n\n\n\tSalary: N300,000 - 500,000 Monthly.\n\tCompetitive salary and commission structure.\n\tCareer advancement opportunities within a fast-paced organization.\n\tSupportive team culture with a focus on professional growth.\n\tAccess to high-demand, market-relevant product lines.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: cv@ascentech.com.ng using “B2B SALES EXECUTIVE LAGOS” as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]