[
  {
    "title": "Import / Export Manager Job at Tempo Paper Pulp & Packaging Plc",
    "link": "https://www.jobgurus.com.ng/jobs/view/import-export-manager-job-at-tempo-paper-pulp-packaging-plc",
    "pubDate": "Thu, 12 Jun 2025 11:13:24 GMT",
    "source": "JobGurus",
    "keyword": "tempo paper pulp & packaging plc",
    "duplicate": false,
    "classifications": [],
    "content": "Tempo Paper Pulp and Packaging Plc is one of the leading manufacturers and suppliers of BOPP and CPP film to lamination and packaging industries in Africa. It was established in the year 2005 and commenced production of corrugated carton boxes. The flexible packaging arm of the business (BOPP) was introduced in the year 2011 with the first line while CPP production came into being in the year 2019.Our second line of 8.7 meter width wascommissioned in 2022.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nA state-of-the-art manufacturing unit in Ota, Ogun state (Nigeria) helps us in delivering world class BOPP and CPP films to our customers which meet the trends for recyclability and ultrahigh barrier films, also by manufacturing thicker films with advanced properties for monolayers. This enables us to fulfil new market demands and requirements.\n\nWe are recruiting to fill the position below:\n\nJob Position: Import / Export Manager\nJob Location: Ota, Ogun\nEmployment Type: Full-time\n\nResponsibilities\n\n\n\tTo open form M and letter of credit for the consignment\n\tTo liaise with the bank for the LC establishment and transfer of fund to the supplier.\n\tTo get the original documents from the bank and arrange for the clearing agent to clear the consignment without delay or demurrage\n\tTo monitor & follow up the movement of the consignment from supplier’s country to the final destination\n\tTo get necessary document from governmental agencies i.e import permit from NAFDAC, CUSTOM, SON, SONCAP, MAN\n\tTo open NXP form for the export consignment\n\tFollow up with the bank for the approved NXP form and receipt\n\tArrange containers for the loading of export consignment\n\tSubmission of registration of all SGD documents brought back by agent after clearing.\n\tKeeping records of logistics file and documents\n\tAscertain and confirming the arrival date of each consignment.\n\tRaising of oversea purchase order for all imported items\n\tPreparation of proforma invoice for the export consignments\n\tPreparation of commercial Invoice, Packing list, CCVO, Custom Movement Certificate for the export orders\n\tArrange for the marine issuance for both import and export goods\n\tMail correspondence to import suppliers and export customers\n\tMemo for approval to chairman on all consignments\n\tPreparation of movement for import & export orders\n\tPreparation of covering letter for the opening of form M & NXP form to the signatories\n\tMonitoring the raw materials and spare parts position and arrange for the immediate order\n\tArrange for the offloading of raw materials and prepare the memo for the approval of the payment\n\tLiaise with account department for the funding of account for LC and fund transfer to suppliers\n\n\nQualifications\n\n\n\tMinimum requirement: HND/B.sc Economics\n\tExperience: Minimum requirement: Five years of experience\n\tAdded Advantage: More Than five years experience in a process industry\n\n\nProfessional (Memberships & Certifications):\n\n\n\tMinimum requirement: Member, Institute of Strategic Management, Nigeria.\n\n\nKey Competence:\n\n\n\tA deep understanding of import/export laws, regulations, and customs procedures is crucial. This includes navigating tariff regimes, trade agreements, and compliance requirements.\n\tAdded advantage: M.sc Economic/Accounting\n\tInternational Trade Compliance\n\tLogistics Management:\n\tMarket Research and Analysis\n\tFinancial Skills:\n\tLanguage Skills:\n\tTechnology and Data Analysis\n\n\nSalary\nN700,000 - N1,000,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their Applications to: jobs@tempong.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "HR Officer Job at Amani Advisory Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/hr-officer-job-at-amani-advisory-limited",
    "pubDate": "Thu, 12 Jun 2025 11:13:24 GMT",
    "source": "JobGurus",
    "keyword": "amani advisory limited",
    "duplicate": false,
    "classifications": [],
    "content": "Amani Advisory Limited - Our client, Our client specializes in providing comprehensive HR solutions to companies of all sizes, across various industries. We bring expertise, innovation, and a client-centric approach to every project and help businesses succeed by optimizing their most valuable asset - their people.\n\nThey are recruiting to fill the position below:\n\nJob Position: HR Officer\nJob Location: Lekki, Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe HR Officer will be responsible for assisting with various HR functions, including recruitment, onboarding, employee relations, performance management, and HR administration.\n\n\nResponsibilities\n\n\n\tAssist with the recruitment process, including posting job openings, screening resumes, scheduling interviews, and conducting reference checks.\n\tCoordinate new employee onboarding activities, including orientation sessions, paperwork completion, and training arrangements.\n\tSupport performance management processes, including goal setting, performance evaluations, and development planning.\n\tAdminister employee benefits programs, including enrollment, changes, and inquiries.\n\tCoordinate employee training and development initiatives, including identifying training needs, scheduling sessions, and tracking attendance.\n\tMaintain employee records and HR databases, ensuring accuracy, completeness, and confidentiality of information.\n\tAssist with employee relations matters, including addressing employee grievances, conflicts, and disciplinary actions in compliance with company policies and procedures.\n\tAssist with HR reporting and analytics, including preparing HR metrics, reports, and presentations for management review.\n\tStay updated on HR laws, regulations, and best practices to ensure compliance with employment laws and regulations.\n\tProvide general administrative support to the HR department, including managing correspondence, scheduling meetings, and maintaining HR files and documents.\n\n\nPerson Specification\n\n\n\tBachelor's degree in Human Resources, Business Administration, or related field preferred.\n\t1 - 2 years of experience in a human resources role, preferably in a fast-paced environment.\n\tKnowledge of HR laws, regulations, and best practices.\n\tStrong organizational and time management skills.\n\tExcellent communication and interpersonal skills.\n\tProficiency in Microsoft Office Suite (Word, Excel, PowerPoint, Outlook).\n\tAbility to maintain confidentiality and handle sensitive information with discretion.\n\n\nSalary\nN100,000 per month.\n\nMethod of Application\nInterested and qualified candidates should forward their CV to: talent@amaniadvisory.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Openings at HEA Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-hea-group",
    "pubDate": "Thu, 12 Jun 2025 11:13:24 GMT",
    "source": "JobGurus",
    "keyword": "hea group",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "HEA Group is a multifaceted service group operating across the energy, engineering, and environmental sectors in Nigeria. Our organization delivers comprehensive solutions that span technical project execution, workforce development, and sustainability consulting. With a strong emphasis on safety, quality, and regulatory compliance, we support clients in achieving operational excellence and long-term impact.\n\nOur energy services arm offers specialized support in upstream and downstream operations, including project management, procurement, technical manpower supply, and maintenance services. We collaborate closely with industry stakeholders to ensure seamless execution of complex energy projects, leveraging deep sector expertise and a responsive delivery model.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the following positions below:\n\n1.) Business Development Executive\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe are seeking a proactive and results-driven Business Development Executive to identify new business opportunities, strengthen client relationships, and support proposal development for environmental and ESG-related services.\n\tThe ideal candidate will have a strong understanding of the Nigerian regulatory and project landscape, and experience selling professional or technical services (e.g., ESIA, audits, due diligence, sustainability reporting).\n\n\nKey Responsibilities\nResponsibility Weight (%):\n\n\n\tOpportunity Identification & Client Prospecting – Proactively identify and pursue new business opportunities, especially in the oil & gas, power, infrastructure, and financial sectors. 25%\n\tClient Relationship Management – Build and manage relationships with existing and potential clients, including multinationals, regulators, and financiers. 20%\n\tProposal & Tender Development – Coordinate and contribute to technical and commercial proposals, EOIs, and bid submissions. 20%\n\tMarket Intelligence & Positioning – Track industry trends, regulatory developments (e.g., NUPRC, NESREA, LFN), and competitor activity to inform strategy. 15%\n\tCollaboration with Technical Teams – Work with project leads and SMEs to develop relevant service offerings and align BD efforts with delivery capacity. 10%\n\tReporting & CRM Maintenance – Maintain records of leads, pipelines, and performance metrics using CRM tools and weekly reporting. 10%\n\n\nQualifications\n\n\n\tBachelor's degree in Environmental Science, Business, Engineering, or related field (Master’s degree is a plus).\n\t4–7 years of experience in business development, preferably in consulting, environmental services, or infrastructure sectors.\n\tProven track record of winning business or supporting bids over N50M.\n\tStrong written and verbal communication skills.\n\tFamiliarity with CRM tools and Microsoft Office Suite.\n\n\nRequired Skills & Experience:\nCompetency Description Weight (%):\n\n\n\tBusiness Acumen Strong understanding of environmental services (ESIA, ESDD, audits, risk assessments) and how they create value. 20%\n\tSales & Communication Skills: Ability to pitch technical services in a compelling and credible way to different stakeholders. 20%\n\tClient Relationship Management Track record of managing accounts, developing rapport with decision-makers, and growing business lines. 15%\n\tProposal Writing & Coordination Experience writing and managing proposals/tenders in a structured format (e.g., EOIs, RFPs). 15%\n\tStrategic Thinking Ability to see and pursue BD beyond transactional sales—partnerships, frameworks, strategic bids. 10%\n\tRegulatory & Sector Knowledge Familiarity with Nigerian regulatory agencies (NUPRC, NESREA, etc.) and ESG trends. 10%\n\tSelf-Management Ability to work independently, meet targets, and adapt quickly in a fast-paced consultancy. 10%\n\n\nRemuneration\n\n\n\tCompetitive salary (based on experience), performance-based incentives, and opportunity for career growth in a dynamic team.\n\n\nApplication Closing Date: 20th June, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hea.careers@outlook.com using the Job Position as the subject of the email.\n\n \n\n2.)  Business Development Manager\n\nJob Location: Lagos Island, Lagos\nEmployment Type: Full-time\n\nDescription\n\n\n\tWe are a leading provider of environmental management, sustainability, and compliance solutions—serving clients across oil & gas, energy, infrastructure, and development sectors.\n\tOur work balances business performance with environmental responsibility.\n\tWe're seeking a Business Development Manager with strong industry experience and a proven track record in winning business, managing bids, and building key client relationships.\n\n\nKey Responsibilities\n\n\n\tLead generation, conversion & BD strategy execution.\n\tIdentify, coordinate & submit high-quality bids/tenders.\n\tRepresent the company at events and client meetings.\n\tDevelop & implement BD and marketing plans.\n\tBuild strong client & partner relationships.\n\tConduct market research & analyze trends to unlock new income streams.\n\n\nRequirements\n\n\n\tBachelor’s / Master’s Degree in Environmental Science, Engineering or a related field.\n\t8 - 12 years of experience in Business Development (Environmental Services, Engineering, Energy, or Oil & Gas)\n\tSolid knowledge of EOI/bid processes\n\tStrong communication, negotiation & relationship-building skills\n\tHighly driven, ethical, and detail-oriented.\n\n\nApplication Closing Date: 29th July, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hea.careers@outlook.com using the Job Position as the subject of the email.\n\n \n\n \n\n3.)  HVAC Technician\n\nJob Location: Lagos \nEmployment Type: Contract\n\nKey Responsibilities\n\n\n\tStart up / shut down HVAC units and monitor performance\n\tMonthly filter cleaning and condenser maintenance\n\tQuarterly steam wash and refrigerant pressure checks\n\tInspect and clean ductwork, pipes, joints\n\tTest electrical controls and motor wiring\n\tMaintain a safe, clutter-free work area\n\n\nRequirements\n\n\n\tCandidates should possess a FSLC\n\t3+ years in commercial HVAC maintenance\n\tRelevant HVAC certification or equivalent experience\n\tProficient in HVAC systems, refrigeration, and basic electrical\n\tStrong communication and teamwork skills\n\tMicrosoft Office familiarity\n\tResidence near Victoria Island.\n\n\nApplication Closing Date: 29th July, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: HEA.careers@outlook.com using the Job Position as the subject of the mail.\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Factory Human Resource Manager Job at African Foundries Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/factory-human-resource-manager-job-at-african-foundries-limited",
    "pubDate": "Thu, 12 Jun 2025 11:13:24 GMT",
    "source": "JobGurus",
    "keyword": "african foundries limited",
    "duplicate": false,
    "classifications": [],
    "content": "African Foundries Limited (AFL) was established to support the accelerating growth in Nigeria by making the country self-reliant for steel rebars and eliminating its dependence on imported rebars. AFL is set up to reach a 0.5 million-ton per year capacity for high strength rebars and allied products.\n\nWe are recruiting to fill the position below:\n\nJob Position: Factory Human Resource Manager\n\nJob Location: Ogijo, Ogun\nEmployment Type: Full-time\n\nKey Responsibilities\nStrategic HR Leadership:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tLead the development and implementation of HR strategies aligned with overall business and operational goals.\n\tOversee recruitment, retention, training, performance management, and succession planning.\n\tEnsure compliance with labor laws, employee welfare, industrial relations, and HR best practices.\n\tDevelop and maintain policies and procedures to drive performance and productivity.\n\tResolve employee grievances and disciplinary matters effectively.\n\n\nFactory Operations Oversight:\n\n\n\tSupervise day-to-day factory operations including production, maintenance, quality, and logistics.\n\tCoordinate with production and engineering teams to ensure efficient workflow and output.\n\tMonitor operational KPIs (cost, quality, delivery, safety, and morale) and implement continuous improvement initiatives.\n\tDrive lean manufacturing and 5S principles throughout the factory floor.\n\tEnsure timely availability of manpower, materials, and machinery to meet production targets.\n\n\nAdministrative Management:\n\n\n\tOversee factory administration including facility management, transport, security, and general services.\n\tEnsure proper documentation, record-keeping, and reporting practices across the factory.\n\tLiaise with local authorities, vendors, contractors, and statutory bodies for compliance and approvals.\n\n\nLeadership & Team Development:\n\n\n\tLead and mentor a cross-functional team comprising HR, Admin, Production, Maintenance, and Support Staff.\n\tFoster a high-performance culture through leadership, coaching, and clear accountability.\n\n\nQualifications & Experience\n\n\n\tCandidates should possess a Bachelor’s Degree in HR, Business Administration, Industrial Relations\n\t15 - 20 years of progressive experience in HR, administration, and factory operations.\n\tMBA or Postgraduate in HR or Operations Management is preferred.\n\n\nSkills & Competencies:\n\n\n\tStrong leadership and people management skills.\n\tDeep understanding of factory operations, labor management, and compliance requirements.\n\tAbility to handle crises, conflict resolution, and employee engagement initiatives.\n\tFamiliarity with manufacturing systems (VIRDi ERP, HRMS),\n\tExcellent communication, negotiation, and interpersonal skills.\n\tStrategic thinker with strong analytical and problem-solving ability.\n\n\nPreferred Industry Background:\n\n\n\tFMCG, Chemical,Manufacturing\n\n\nMethod of Application\nInterested and qualified candidates should forward their CV to: Folajimi.omolara@africanfoundries.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "HR, Finance and Business Operations Manager Job at Ruhe Global Resources",
    "link": "https://www.jobgurus.com.ng/jobs/view/hr-finance-and-business-operations-manager-job-at-ruhe-global-resources",
    "pubDate": "Thu, 12 Jun 2025 11:13:24 GMT",
    "source": "JobGurus",
    "keyword": "ruhe global resources",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance"
    ],
    "content": "Ruhe Global Resources (RGR) is an international student and work force Recruitment and visa consultancy, Language and examination Tutorial Center. We represent the interest of several education and employer organization in Australia, Canada, Cyprus, Turkey, Russia, France, Italy, China, India, Germany, Dubai, New Zealand, USA, and United Kingdom. (other Europe, Asia and Middle east countries) and offer national and international examinations, Registration tutorial and preparation service.\n\nWe are recruiting to fill the position below:\n\nJob Position: HR, Finance and Business Operations Manager\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Location: Abuja (FCT)\nEmployment Type: Full-time\nDepartment: Administration /Recruitment/Accounting\n\nJob Summary\n\n\n\tWe are seeking to employ Finance, HR and Business Operations Manager (Admin, Accounting, Finance, and Human Resources) in our reputable organisation\n\tThis is a versatile role that combines financial management, human resource administration, and business process optimization. This position oversees our company financial records, ensures compliance with accounting standards, manages employee relations and recruitment, and improves overall business processes to enhance efficiency and productivity.\n\n\nJob Purpose\n\n\n\tTo work with the managing director to evaluate, analyse, create, implement, overseeing and managing a wide range of administrative, accounting, Finance, Business operation, Facilities management and human resources functions at Ruhe Global Resources\n\tTo ensure the smooth running of our offices on a day-to-day basis and manage a team of Teachers, Conversion officers, administrators, customer service Business development & administrative or support staff.\n\tTo successfully establish new business, partnerships opportunities while strengthening existing ones.\n\tTo Assist in coordinating operations & marketing activities; to consistently drive traffic to the RGR offices in the region; generate and follow up with MOU partners and ensure consistent flow & conversion of; be involved in supporting digital campaigns and effectively increase brand awareness.\n\tEnsure all staff Achieve set monthly revenue, recruitment and registration target.\n\tResponsible for ensuring daily registration & Conversion target in the branch is met.\n\tthis role acts as a bridge between the financial health of the organization, staff performance and the well-being of its workforce, ensuring that both are thriving.\n\n\nJob Description\n\n\n\tRecruiting, hiring, onboarding, and managing employees, along with developing HR policies and maintaining employee relations.\n\tOverseeing payroll and benefits and ensuring compliance with labour laws.\n\tDeveloping business strategies, monitoring performance metrics, and mentoring team members to foster a positive work environment.\n\tEngaging in recruitment activities, such as attending exhibitions and conducting seminars, to attract potential applicants. - Ensuring staff is well-trained, equipped to represent RGR, and achieve client conversion targets.\n\tBuilding relationships with vendors and maintaining communication with partner institutions. - Contributing to RGR's marketing strategy and promoting courses to prospective students.\n\tManaging financial budgets and accounting processes and ensuring financial compliance with external auditors. - Analysing financial data for trends and implementing process improvements in daily operations.\n\tImplementing marketing campaigns and managing follow-ups with institutions in Nigeria. Overall, the role encompasses a blend of human resources, financial oversight, marketing, and strategic development to ensure organisational success.\n\n\nResponsibilities\nHuman Resources Management:\n\n\n\tRecruitment and Onboarding: Managing the entire hiring process, from job postings and candidate sourcing to interviewing and onboarding new hires.\n\tTraining and Development: Identifying training needs, developing and delivering training programs, and managing employee development plans.\n\tPerformance Management: Implementing and managing performance appraisal systems, providing feedback to employees, and addressing performance issues.\n\tCompensation and Benefits: Providing advice on pay negotiations, redundancy, and employment law.\n\tManaging salary structures, benefits packages, and ensuring fair and competitive compensation.\n\tPayroll: Ensuring employees are paid correctly and on time, including managing pensions and benefits.\n\tCompensation: Providing advice on pay negotiations, redundancy, and employment law.\n\tBenefits Administration: Managing employee benefits programs, such as health insurance and retirement plans.\n\tEmployee Relations: Addressing employee concerns, mediating conflicts, and fostering a positive and productive work environment.\n\tCompliance: Ensuring the organization complies with all relevant employment laws and regulations.\n\tEnsuring company policies and procedures comply with employment law and regulations.\n\tLegal Advice: Advising line managers and employees on employment law and company policies.\n\tTraining Programs: Planning and implementing staff training and development activities.\n\tRecord Keeping: Maintaining confidential employee records, including personal information, attendance, and performance evaluations.\n\tHR Policy Development: Developing company HR policies and procedures.\n\tCommunication: Communicating HR policies and procedures to employees.\n\tCollaboration: Collaborating with management to develop strategies for employee retention and engagement.\n\tPolicy Development and Implementation: Developing and implementing HR policies and procedures that align with company goals and best practices.\n\tStrategic HR Planning: Contributing to the development and execution of HR strategies that support the organization's overall business objectives.\n\tEmployee Engagement: Developing and implementing strategies to increase employee engagement, satisfaction, and retention.\n\n\nFinance and accounting management:\n\n\n\tTo oversees a company's financial operations, ensuring compliance, accuracy, and efficiency.\n\tTo manage day-to-day financial tasks, prepare reports and budgets, and provide financial insights to support strategic decision-making\n\tDay-to-day financial operations: This includes managing payroll, invoicing, cash flow, and other transactions.\n\tFinancial planning Analysis and reporting: Developing budgets, forecasts, Prepare and analyze financial statements reports, and budgets and ensuring accuracy and adherence to legal and industry standards\n\tCompliance and risk management: Ensuring adherence to accounting standards, financial regulations, and minimizing financial risk.\n\tTeam management and Leadership: Supervising staff, managing their performance, providing guidance and ensuring proper training.\n\tFinancial analysis and insights: Analysing financial data to identify trends, areas for improvement, and provide insights to senior management.\n\tProcess improvement: Identifying and implementing process improvements to enhance financial efficiency.\n\tAccounting Operations:Oversee and manage the accounting department, ensuring efficient and compliant operations.\n\tBudgeting & Forecasting:Develop and manage budgets and forecasts, analyzing variances and making recommendations.\n\tCash Flow Management:Manage cash flow, identify trends, and forecast requirements.\n\tInternal Controls:Implement and maintain effective internal controls to safeguard assets and financial information.\n\tAudits:Manage and coordinate audits, ensuring accurate and timely completion of audits.\n\tStakeholder Communication:Communicate financial information to internal and external stakeholders, including management, investors, and regulators.\n\tExternal relations: Liaising partners, company lawyers, banks, and other external parties.\n\n\nAdministration & Office Management:\n\n\n\tOffice Operations: Managing office supplies and ordering new stock of stationery and furniture as needed.\n\tAdministrative Support: Providing clerical and administrative assistance to staff and management, including handling correspondence, preparing documents, and managing schedules.\n\tOffice Management: Overseeing day-to-day office operations, maintaining office supplies, and ensuring a clean and organized workspace.\n\tEnsuring a welcoming and professional office environment.\n\tOverseeing office equipment and facilities, including maintenance and repairs.\n\tCommunication: Answering phone calls, managing emails, and directing inquiries to the appropriate personnel.\n\tMeeting and Event Coordination: Scheduling meetings, taking minutes, arranging conferences, and supporting the organization, Organising company events or conferences and execution of company events.\n\tArranging travel accommodations and event logistics.\n\tData Management: Performing data entry, maintaining databases, and preparing reports.\n\tFinancial Management: Managing the office budget and expense by Assisting with expense tracking, invoice reconciliation, and budget management.\n\tProject Management: Assisting with project planning, coordination, and task execution.\n\tImplementing and maintaining office procedures and policies.\n\tProcessing invoices and managing vendor relationships.\n\tCustomer and Visitor Support: Dealing with correspondence, complaints and queries and Providing general assistance to customers and clients.\n\tOrganising meetings and managing databases of partners\n\tSupervising and monitoring the work of all staff\n\tLiaising with staff, suppliers and clients for effective operation\n\tImplementing and maintaining procedures/office administrative systems\n\tDelegating tasks to junior employees\n\tEnsuring that health and safety policies are up to date\n\tOrganising and attending meetings with senior management\n\tPreparing reports, presentations, and other documents.\n\tMaintaining filing systems and records.\n\n\nFacilities Management:\n\n\n\tOverseeing and agreeing contracts and providers for services including security, parking, cleaning, catering, technology and so on\n\tSupervising multi-disciplinary teams of staff including cleaning, maintenance, grounds and security\n\tEnsuring that basic facilities, such as water and heating, are well-maintained\n\tManaging budgets and ensuring cost-effectiveness\n\tAllocating and managing space between buildings\n\tEnsuring that facilities meet government regulations and environmental, health and security standards\n\tAdvising businesses on increasing energy efficiency and cost-effectiveness\n\tOverseeing building projects, renovations or refurbishments\n\tHelping businesses to relocate to new offices and to make decisions about leasing\n\tDrafting reports and making written recommendations\n\n\nMarketing:\n\n\n\tCompiling and distributing financial and statistical information such as budget spreadsheets\n\tAnalysing questionnaires\n\tWriting reports, company brochures and similar documents\n\tOrganising and hosting presentations and customer visits\n\tOrganise & Initiate promotional activities\n\tVisiting customers/external agencies\n\tOrganise market research.\n\n\nBusiness Development:\n\n\n\tDevelop and initiate business development and /marketing strategies.\n\tAssist in coordinating actions to influence developed strategies.\n\tAssist in the execution of marketing campaigns.\n\tAssist in the development and planning of all branding and marketing activities.\n\tIdentify opportunities, develop plans and establish business alliances that will strengthen the RGR brand.\n\tCarry out sensitization activities and generate new leads in formal and informal sectors of key cities where an RGR office does not exist at the moment.\n\tMake presentations to key employers, parents and students of highly rated secondary institutions and generate traffic/leads/registrations, ensuring students register.\n\tCreate the needed buzz in tertiary institutions thereby increasing leads from the institutions.\n\n\nCore Working Relationships\n\n\n\tCustomer Service officer, Business Development Officers, Recruitment Officers and managers, Branch Manager, Conversion Officers/ Manager, Events Manager, Marketing/Brand Marketing Manager, Human Resource Officer, Managing Director.\n\tThe post holder will be Reporting to the Regional manager /Managing Director and work closely with all staff; this position will focus on Admin, Accounting, Finance, and Human Resources and support recruitment to all RGRs services and partner Universities programs and market the RGR brand in Nigeria across all marketing communications channels.\n\n\nEducational Qualification and Experience\n\n\n\tGraduate Degree in Accounting, Finance, Business Administration or Human Resources or a related – essential, Postgraduate degree (MBA) will be an added advantage.\n\tExperience: Proven experience in HR, finance, and business operations management.\n\tKnowledge: Strong understanding of HR practices, financial principles, and business operations.\n\tSkills: Excellent communication, interpersonal, and leadership skills.\n\tOther: Analytical skills, problem-solving abilities, and the ability to manage multiple tasks simultaneously.\n\tDirect experience in a similar role with\n\tConsiderable experience in a customer facing role – essential.\n\tYou'll need a blend of HR-specific skills, strong administrative abilities, and financial acumen.\n\tExperience in HR administration, knowledge of payroll and benefits, and proficiency in accounting software are key.\n\tGood communication, organizational, and problem-solving skills are also essential.\n\n\nDesirable Skills and experience:\n\n\n\tSignificant experience related to the international Higher Education sector or Travel/ Tour.\n\tKnowledge of international educational qualifications and their Nigeria equivalencies\n\tKnowledge of marketing for international Higher Education sector within Nigeria\n\tKnowledge and experience of visa counselling for visa applicants\n\tKnowledge of international higher education and experience of working in international education – desirable\n\tExperience working in the Education marketplace\n\tKnowledge of the study-overseas market\n\n\nKey Skills:\nReliability and discretion: you will often learn of confidential matters:\n\n\n\tAdaptability\n\tCommunication, negotiation and relationship-building skills\n\tOrganisational skills\n\tHR, Admin accounting and IT skills\n\tProblem solving skills\n\tInitiative\n\tLeadership and the ability to ‘make things happen’\n\tBudgeting skills\n\tAttention to detail.\n\n\nEssential Skills and Experience:\n\n\n\tEvidence of working within a target-driven environment\n\tExperience in an administrative role, Human Resources and Accounting position\n\tKnowledge of software packages\n\tGood interpersonal and time management skills.\n\tMeeting and Encouraging company Goals and Professionalism\n\tExperience and ability in providing market intelligence in order to guide recruitment and retention activities\n\tProspecting Skills, Sales Planning, Selling to Customer Needs, Closing Skills, Market Knowledge, Presentation Skills, High & Sustainable Energy Level\n\tExperience of report -writing and statistical analysis\n\tExcellent customer service skills, experience working within a customer -facing role\n\tTakes initiatives and works independently/within a team when required\n\tHighly organised, can manage a number of different tasks simultaneously\n\tCan work under pressure when required\n\tExcellent communication skills, can build positive relationships with people of a variety of different ages and levels of authority\n\tCan influence and persuade at all levels\n\tCulturally sensitive and committed to equal opportunities. Committed to RGR’s values of equality and diversity.\n\tAbility and willingness to travel within Nigeria and outside Nigeria.\n\tExcellent customer service and employee support skills Excellent written and Verbal communication skills\n\tEvidence of success in building and maintaining relationships leading to increased organisation performance\n\tAble to work under pressure to meet deadlines.\n\tSound organisational, planning & time management skills.\n\tHighly motivated self-starter with a high level of energy and motivation.\n\tAble to work on own initiative and as part of a team.\n\n\nSalary\n\n\n\tYou will be placed on 3 months to 6 Months’ probation with a salary of NGN 150,000 to NGN 200,000 / Month. After probation your salary could be increased to between 180,000 NGN to 300,000 depending on input and performance.\n\tTraining and development opportunities and performance-related incentives may be available as part of the role.\n\n\nNote: You should be ready to resume in as soon as possible.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]