[
  {
    "title": "Supermarket Supervisor Job at Abuja’s Favourite Supermarket",
    "link": "https://www.jobgurus.com.ng/jobs/view/supermarket-supervisor-job-at-abujas-favourite-supermarket",
    "pubDate": "Wed, 18 Jun 2025 08:48:19 GMT",
    "source": "JobGurus",
    "keyword": "abuja’s favourite supermarket",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Abuja’s Favourite Supermarket - We’re your neighborhood supermarket, offering fresh produce, quality groceries, household essentials, and unbeatable deals—all under one roof. Located in the heart of Abuja, we’re here to make your everyday shopping easy, affordable, and enjoyable.\n\nWe are recruiting to fill the position below:\n\nJob Position: Supermarket Supervisor\n\nJob Location: Abuja (FCT)\nEmployment Type: Full-time\n\nAbout the Role\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a committed and disciplined Supermarket Supervisor to provide strong leadership and hands-on supervision to our cashiers and sales attendants.\n\tThe ideal candidate should be passionate about enforcing high standards of staff behavior, ensuring teamwork, and creating a positive, customer-friendly atmosphere while supporting smooth store operations.\n\n\nKey Responsibilities\n\n\n\tSupervise and coordinate the activities of cashiers, sales attendants, and other front-line staff to ensure discipline, professionalism, and excellent customer service at all times.\n\tSet clear expectations for staff behavior, punctuality, grooming, and work ethics, and ensure compliance with company policies.\n\tEnsure shelves are properly stocked, displays are neat, and the sales floor is clean and organized.\n\tOversee cash handling processes, monitor point-of-sale activities, and ensure accuracy in transactions.\n\tMonitor inventory levels, assist in restocking, and support periodic stock counts.\n\tAddress customer complaints promptly and professionally, ensuring customer satisfaction.\n\tCollaborate with the branch manager to meet sales targets and implement store policies effectively.\n\n\nQualifications & Experience\n\n\n\tMinimum of OND, HND, or B.Sc. in any field.\n\tExperience in a supervisory role within a supermarket or retail setting is preferred\n\tAbility to work under pressure and manage multiple priorities.\n\tStrong leadership skills with the ability to correct, discipline, and motivate team members.\n\tExcellent communication, interpersonal, and conflict resolution skills.\n\tHonest, proactive, and results-oriented.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: supermarketabuja@gmail.com using \"Supermarket Supervisor - Abuja\" as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Customer Service / Shipping Manager Job at Dangote Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/customer-service-shipping-manager-job-at-dangote-group-1",
    "pubDate": "Wed, 18 Jun 2025 08:48:19 GMT",
    "source": "JobGurus",
    "keyword": "dangote group",
    "duplicate": false,
    "classifications": [],
    "content": "Dangote Group is one of Nigeria’s most diversified business conglomerates with a hard – earned reputation for excellent business practices and products’ quality with its operational headquarters in the bustling metropolis of Lagos, Nigeria in West Africa.\n\nWe are recruiting to fill the position below:\n\nJob Position: Customer Service / Shipping Manager\n\nJob Location: Lagos\n\nJob Purpose Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Customer Service/Shipping Manager ensures that shipping operations at the Refinery run smoothly, contributing to timely and cost-effective movement of refined products, thereby supporting DPRP's operational efficiency.\n\tIn addition, the Customer Service Manager will be responsible for overseeing and managing the customer service function.\n\tThis role includes ensuring customer satisfaction, handling customer inquiries, resolving issues, and maintaining strong relationships with clients.\n\n\nDuties and Responsibilities\nShipping Operations Management:\n\n\n\tCoordinate all shipping activities, including vessel scheduling, berthing arrangements, and cargo documentation in compliance with company policies\n\tEnsure timely dispatch and receipt of cargoes, adhering to operational deadlines.\n\tMonitor and document all shipping activities\n\tMonitor vessel movement pre-and post loading\n\n\nCustomer Service:\n\n\n\tManage and lead the customer service team to ensure high levels of service delivery.\n\tCoordinate with other departments to ensure seamless service and communication.\n\tMonitor and analyze customer service metrics to identify areas for improvement.\n\tDevelop and implement customer service policies, procedures, and standards.\n\tHandle customer inquiries and complaints in a professional and timely manner.\n\tTrain and mentor customer service staff to maintain high performance and motivation.\n\tMaintain accurate records of customer interactions and transactions.\n\tAddress and resolve any issues related to shipping delays, damages, or discrepancies.\n\n\nRequirements\n\n\n\tBachelor’s Degree in Maritime Studies, Logistics, Supply Chain Management, or a related field.\n\tMinimum of 7 years of experience in shipping operations /customer service or a similar role within the Petroleum/Maritime industry.\n\tStrong knowledge of vessel clearance processes, maritime regulations, and port operations.\n\tExcellent organizational, communication, and problem-solving skills.\n\tProficiency in shipping software and logistics management and/or customer service software and tools.\n\tAbility to work under pressure in a fast-paced environment.\n\tStrong leadership and team management skills.\n\tExcellent communication and interpersonal skills.\n\tAbility to handle high-pressure situations and resolve conflicts effectively.\n\t Strong analytical and problem-solving abilities.\n\tKnowledge of the oil and gas industry and its customer service requirements\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Human Resource (HR) Manager Job at Staff Line Consulting",
    "link": "https://www.jobgurus.com.ng/jobs/view/human-resource-hr-manager-job-at-staff-line-consulting",
    "pubDate": "Wed, 18 Jun 2025 08:48:19 GMT",
    "source": "JobGurus",
    "keyword": "staff line consulting",
    "duplicate": false,
    "classifications": [],
    "content": "Staff Line Consulting is a consulting firm based in Lagos, Nigeria, specializing in providing professional human resource solutions and advisory services to businesses and organizations in the region.The company is committed to helping clients achieve their HR and organizational goals through tailored consulting services and industry expertise.\n\nWe are recruiting to fill the position below:\n\nJob Position: Human Resource (HR) Manager\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tStaff Line Consulting is recruiting on behalf of a reputable company to fill the position of an experienced and proactive HR Manager.\n\tThe ideal candidate will be responsible for overseeing the company’s human resources operations, ensuring strategic alignment between HR initiatives and business goals.\n\n\nKey Responsibilities\n\n\n\tDevelop and implement HR strategies, policies, and procedures\n\tHandle talent acquisition, onboarding, and employee engagement\n\tManage performance appraisal systems and staff development plans\n\tEnsure compliance with labor laws and internal HR standards\n\tMaintain accurate employee records and prepare HR reports\n\n\nRequirements\n\n\n\tDegree or certification in Human Resource Management or a related field.\n\tProven experience as an HR Manager or similar senior HR role\n\tIn-depth knowledge of Nigerian labor laws and HR best practices\n\tStrong leadership, interpersonal, and communication skills\n\tHigh level of integrity and ability to maintain confidentiality\n\n\nSalary\nOpen to Negotiation\n\nMethod of Application\nInterested and qualified candidates should send their CV and cover letter to: Info@stafflinenigeria.com using the Job Position as the subject of the email.\n\nNote\n\n\n\tThis recruitment is being handled by Staff Line Consulting on behalf of our client.\n\tOnly shortlisted candidates will be contacted.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "IT Operations Specialist Job at AMS Finance & Management",
    "link": "https://www.jobgurus.com.ng/jobs/view/it-operations-specialist-job-at-ams-finance-management",
    "pubDate": "Wed, 18 Jun 2025 08:48:19 GMT",
    "source": "JobGurus",
    "keyword": "ams finance & management",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "AMS Finance & Management is a financial services company, providing top-notch investment and financial solutions to our clients including individuals, corporations, and the government. We are licensed with, and regulated by the Central Bank of Nigeria (CBN) We are equipped with a shrewd team of professionals, who are proactively prepared to provide our clients with top-tier services.\n\nWe are recruiting to fill the position below:\n\nJob Position: IT Operations Specialist\n\nJob Location: Nigeria\n\nJob Summary \n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe IT Operations Specialist is responsible for overseeing the development, implementation, and maintenance of all technology systems and infrastructure within the company. This includes ensuring the security, reliability, and scalability of IT services to support the company’s financial operations, compliance requirements, and business goals.\n\tThe role requires strategic leadership, technical expertise, and strong alignment with regulatory standards and innovation trends in financial services.\n\n\nKey Responsibilities\n\n\n\tDevelop and execute the company's IT strategy in alignment with business goals.\n\tDrive digital transformation initiatives, including automation and cloud adoption.\n\tRecommend and implement new technologies to enhance efficiency and security.\n\tOversee day-to-day operations of IT systems including core banking software, ERP, CRM, and telecommunication tools.\n\tEnsure 99.9% uptime of systems and manage data backups and recovery procedures.\n\tSupervise the development and maintenance of the company's website and digital platforms.\n\tImplement and enforce IT security protocols to protect company and customer data.\n\tEnsure compliance with CBN and other regulatory standards.\n\tConduct regular IT audits, risk assessments, and vulnerability testing.\n\tLead the IT team, including technicians and support staff.\n\tSupervise IT technicians with a strong understanding of website development, graphic design, and social media platforms.\n\tManage relationships with software vendors and service providers.\n\tManage company-wide IT projects from conception to execution.\n\tProvide technical support for cross-functional projects and departmental needs.\n\tAnalyze IT performance and present reports to executive leadership.\n\n\nRequirements \n\n\n\tCandidates should possess a Bachelor’s Degree in Information Technology, Computer Science, or a related field.\n\tMinimum of 4–6 years of experience in IT, with at least 3 years in leadership role in the financial sector.\n\tProven knowledge of banking systems, infrastructure management, ERP, CRM, cloud services, and information security.\n\tStrong understanding of web development (HTML, WordPress, CMS), graphic design tools, and branding elements.\n\tRelevant certifications (CISM, CISSP, PMP, ITIL, etc.) are highly desirable.\n\n\nKey Skills:\n\n\n\tStrategic thinking & innovation\n\tLeadership & cross-functional collaboration\n\tWebsite development & graphic design oversight\n\tCybersecurity & compliance knowledge\n\tExcellent communication & stakeholder engagement.\n\n\nWhat We Offer \n\n\n\tA performance-driven culture with career growth opportunities\n\tOpportunity to lead digital transformation in a dynamic finance company\n\tCompetitive salary and benefits package.\n\n\nMethod of Application\nInterested and qualified candidates should submit their CV and Cover Letter to: careers@amsfinanceltd.com using the Job Position as the subject of the email.\n\nNote: Only shortlisted candidates will be contacted.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]