[
  {
    "title": "Administrative Assistant Job at Ledgeris",
    "link": "https://www.jobgurus.com.ng/jobs/view/administrative-assistant-job-at-ledgeris",
    "pubDate": "Wed, 11 Jun 2025 15:17:30 GMT",
    "source": "JobGurus",
    "keyword": "ledgeris",
    "duplicate": false,
    "classifications": [],
    "content": "Ledgeris is revolutionizing back-office outsourcing by offering agile, cost-effective, and high-quality support tailored to your business needs.We specialize in creating dedicated teams that seamlessly integrate with your operations, adopting your preferred tools and processes to ensure smooth collaboration and high efficiency.Our approach allows you to focus on scaling your core business while we handle the rest.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWith a commitment to excellence, Ledgeris provides premium talent without the premium price tag.Our professionals are rigorously vetted, highly skilled, and deeply committed to delivering top-tier results.Leveraging AI to enhance decision-making and eliminate inefficiencies, we combine human expertise with technological innovation to offer smarter, faster, and more human outsourcing solutions.\n\nWe are recruiting to fill the position below:\n\nJob Position: Administrative Assistant\n\nJob Location: Benin City, Edo\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe are seeking a proactive, organized, and tech-savvy Administrative Assistant to support internal teams and external clients with high-quality administrative operations.\n\tThe ideal candidate is a strong communicator, quick learner, and thrives in a remote environment where agility, reliability, and attention to detail are essential.\n\n\nKey Responsibilities\n\n\n\tProvide administrative support including calendar management, scheduling, email handling, and documentation.\n\tCoordinate meetings, prepare agendas, take meeting minutes, and follow up on action items.\n\tMaintain accurate digital records and manage file systems across cloud platforms.\n\tAssist with onboarding new team members and clients by preparing documentation and managing workflows.\n\tPerform research, create reports, and support project tracking and status updates.\n\tCommunicate clearly with clients and team members, ensuring tasks are completed on time and to a high standard.\n\tUse AI and productivity tools to streamline and automate routine tasks where appropriate.\n\tHandle confidential information with discretion and professionalism.\n\n\nRequirements\n\n\n\t1–3 years of experience as an administrative assistant, virtual assistant, or in a similar role.\n\tStrong written and verbal English communication skills.\n\tProficiency in productivity tools such as Google Workspace (Docs, Sheets, Calendar), Microsoft Office, Zoom, and Slack.\n\tExperience managing calendars, coordinating meetings, and handling email communications.\n\tExcellent organizational skills with the ability to prioritize tasks and manage multiple projects simultaneously.\n\tDetail-oriented, reliable, and capable of working independently in a remote setup.\n\n\nPreferred Qualifications\n\n\n\tExperience in a remote or BPO environment.\n\tFamiliarity with project management tools such as Trello, Asana, Notion, or Monday.com.\n\tComfort using or learning AI-based productivity tools.\n\tBasic knowledge of CRM systems or document automation platforms is a plus.\n\n\nBenefits:\n\n\n\tGrowth Plan: Develop your skills and grow professionally.\n\tCompetitive Pay: Earn above average pay while doing work that matters.\n\tLearning Opportunities: Accesscontinuous learning opportunities.\n\n\n \n\nNote\n\n\n\tLedgeris is proud to be an equal opportunity employer.\n\tWe promote a diverse an inclusive environment for candidates and employees.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]