[
  {
    "title": "Junior Recruitment Officer Job at GN128 GN128 Solutions",
    "link": "https://www.jobgurus.com.ng/jobs/view/junior-recruitment-officer-job-at-gn128-gn128-solutions",
    "pubDate": "Wed, 02 Jul 2025 21:14:32 GMT",
    "source": "JobGurus",
    "keyword": "gn128 gn128 solutions",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "GN128 Solutions an IT Solutions firm dedicated to helping clients leverage Information Technology to Increase profitability & efficiency.\n\nWe are recruiting to fill the position below:\n\nJob Position: Junior Recruitment Officer\n\nJob Location: Lagos\n\nSummary\n\n\n\tWe are a business based in Lagos currently looking to hire a Recruitment Officer to work in our office in Ikeja.\n\tYou will be required to have excellent communications, administration and organizational skills.\n\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tScreening prospective job applicants to evaluate their skills and qualifications\n\tEntering job applicants’ CVs and contact details into the company database for future reference\n\tRevamping potential job candidates CVs to ensure that they are an excellent match for the client company\n\tProducing and posting job adverts that attract appropriate candidates\n\tCold calling companies to promote recruitment services\n\tMeeting with new clients to develop and expand business opportunities\n\tHeadhunting specific candidates for specific job roles\n\tAchieving recruitment quotas and business development targets each month.\n\n\nJob Responsibilities\n\n\n\tGenerate New Employer Leads & Maintain contact with exiting Employer clients;\n\tUse of online & social media platforms to source for prospective employees;\n\tOnline & Site based screening of all applicants and Identifying suitable candidates;\n\tEnsure all applicants attending an interview are suitable for the roles;\n\tCo-ordinate the interview process with candidates and clients;\n\tReview and evaluate current recruitment process to ensure a smooth and efficient service;\n\tYou will be required to perform any other required task as assigned to this role.\n\n\nPerson Specification\n\n\n\tExperienced in creating CV's + Cover Letters from existing CV;\n\tExperienced in making phone calls to a minimum of 20 contacts a day & documenting the calls;\n\tUse of online & social media platforms to generate Leads of prospective Employers;\n\tRespond to employee requests promptly and in a professional manner;\n\tStrong orientation to achieving team's goals and targets set;\n\tAbility to create daily report of operations;\n\tVery good level of English Language - both written and spoken;\n\tExcellent communication and interpersonal skills;\n\tExcellent Telephone handling skills;\n\tExcellent Computer Literacy & Record Keeping Skills;\n\tExcellent Administrative and Organizational skills\n\tAbility to work with own Initiative\n\tStrong orientation to achieving team's goals and targets set;\n\tWillingness to learn and develop;\n\tTeam player open to share knowledge and to support your colleagues;\n\tCall Centre Experience will be an advantage;\n\tProfessional attitude and orientation to details.\n\n\nSalary\nBasic From N150,000 + Bonus.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: recruit@gn128.com using \"Recruitment Officer Position\" as the subject of the msil.\n\nNote: Only candidates that live in Lagos and within 30mins commuting of Ikeja would be considered.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Electrical and Electronics Engineer Job at Proforce Galaxies Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/electrical-and-electronics-engineer-job-at-proforce-galaxies-limited",
    "pubDate": "Wed, 02 Jul 2025 21:14:32 GMT",
    "source": "JobGurus",
    "keyword": "proforce galaxies limited",
    "duplicate": false,
    "classifications": [],
    "content": "Proforce Galaxies Limited - At the forefront of innovation and global connectivity, Proforce Galaxies is driven by a bold vision: To become the leading space and satellite technology solutions provider globally. We believe satellites do more than orbit the Earth — they connect its people, empower industries, and unlock new frontiers of opportunity.\n\nWe are a comprehensive space technology company committed to advancing capabilities across the entire value chain of space operations — upstream, midstream, and downstream. Our solutions span from cutting-edge spacecraft manufacturing to real-time data delivery and integrated surveillance systems on Earth, in the air, and beyond.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Electrical and Electronics Engineer\n\nJob Location: Ode-Remo, Ogun\nEmployment Type: Full-time\n\nJob Overview\n\n\n\tAs an Electrical and Electronics Engineer, you will be at the heart of our technical operations, working on the design, development, and testing of electrical systems for space and terrestrial applications.\n\tYour expertise will be critical in ensuring that our satellite platforms, ground station equipment, and data infrastructure operate with precision, reliability, and safety.\n\tYou’ll collaborate with cross-disciplinary teams including embedded systems engineers, mechanical engineers, and software developers to develop end-to-end integrated solutions across upstream (space hardware), midstream (ground control), and downstream (user applications) segments.\n\n\nKey Responsibilities\n\n\n\tSatellite Systems Design: Design and prototype electrical systems for satellites including power distribution networks, solar energy systems, and battery management units.\n\tGround Station Equipment: Develop and maintain hardware for ground-based systems such as RF transceivers, antenna control systems, and signal processing modules.\n\tComponent Selection & Integration: Specify, select, and integrate microcontrollers, ASICs, sensors, and other electrical components for use in satellite and terrestrial systems.\n\tPCB Design & Development: Perform circuit design, schematic capture, and PCB layout using industry-standard tools such as Altium Designer, Cadence, or equivalent platforms.\n\tTesting & Compliance: Conduct rigorous testing and validation of electrical systems including EMI/EMC compliance, thermal cycling, and vibration/environmental stress tests.\n\tCollaborative Engineering: Work closely with embedded systems engineers to ensure hardware-software integration and compatibility, especially for avionics and ground communication systems.\n\tSupport for Downstream Applications: Design electrical hardware for edge-processing units and IoT gateways that connect to satellite data services.\n\tDiagnostics & Troubleshooting: Identify and resolve electrical system faults during design, integration, testing, and operational deployment—including in-orbit scenarios.\n\tDocumentation: Prepare and maintain engineering documentation, test procedures, compliance reports, and mission requirement validations.\n\tSystem-Level Collaboration: Participate in cross-functional engineering teams for system-level design reviews, safety audits, and mission planning operations.\n\n\nQualifications & Skills\n\n\n\tBachelor’s or Master’s Degree in Electrical Engineering, Electronics Engineering, or a related field.\n\t3+ years of experience in electrical systems development (preferably in aerospace, defense, or high-reliability environments).\n\tHands-on experience with PCB design software (e.g., Altium, Cadence, Eagle).\n\tSolid understanding of RF design, power electronics, embedded systems, and sensor integration.\n\tExperience with regulatory and environmental testing standards (EMI/EMC, thermal, vibration, etc.).\n\tFamiliarity with satellite systems, ground station operations, or IoT infrastructure is a plus.\n\tStrong analytical thinking, problem-solving ability, and teamwork skills.\n\tProficiency in technical documentation and reporting.\n\tPassion for innovation and space technologies.\n\n\nMethod of Application\nInterested and qualified candidates should send their updated CV, a portfolio or links to past projects, proof of hands-on experience to: hr@proforcegalaxies.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Vacancies at HTSF Global Nigeria Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancies-at-htsf-global-nigeria-limited",
    "pubDate": "Wed, 02 Jul 2025 21:14:32 GMT",
    "source": "JobGurus",
    "keyword": "htsf global nigeria limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "HTSF Global Nigeria Limited is a leading company dedicated to revolutionizing the agricultural and grocery shopping experience through our innovative e-commerce marketplace.HTSF Global was founded with a clear vision: to transform the Agriculture sector by delivering excellence in goods and services through technology. Our story began with Ayodeji Enitan's firsthand experience of the challenges in Agriculture, igniting a passion for creating meaningful change.\n\nWe are recruiting to fill the following positions below:\n\n1.) Sales Representative\n\nJob Location: Ikorodu, Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a smart Sales Representative for our newly established Egg Depot in Ikorodu, Lagos.\n\tIn this role, you will drive sales, build customer relationships, and promote our egg products to retailers, wholesalers, and walk-in customers in the area.\n\tFrom generating leads to managing inquiries and ensuring timely delivery, you will play a critical role in the day-to-day success of our depot operations.\n\tThe Ideal candidate should reside in Ikorodu, Lagos.\n\n\nKey Responsibilities\n\n\n\tActively promote and sell eggs to existing and potential customers within Ikorodu and nearby communities.\n\tGenerate leads and convert them into repeat customers through excellent service and follow-up.\n\tAttend to walk-in customers, process orders, and manage inquiries effectively.\n\tBuild and maintain strong customer relationships to drive customer loyalty.\n\tMonitor inventory levels and coordinate with logistics for timely delivery.\n\tMaintain accurate records of sales, customer interactions, and transactions.\n\n\nRequirements\n\n\n\tEducation: OND, HND, or any related qualifications.\n\tExperience: Minimum of 1 (one) year of experience with proven experience as a Sales Representative in sales, marketing or similar sectors.\n\tExcellent communication, negotiation, and interpersonal skills.\n\tAbility to work in a fast-paced environment and manage multiple customer inquiries.\n\tSelf-motivated and result-oriented and able to work with minimal supervision.\n\tProficiency in Microsoft Office tools.\n\n\nBenefits\n\n\n\tCompetitive Salary Package\n\tOpportunity for career growth and professional development.\n\tA Dynamic and supportive work environment.\n\n\nApplication Closing Date: 9th July, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CVs detailing why they are suitable for this role to: htsfarmshumanresources@gmail.com and copy (cc):hr@htsfarms.ng using “Sales Representative Ikorodu” as the subject of the mail.\n\n \n\n \n\n2.) Marketing Officer\n\nJob Location: Ikorodu, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe are seeking a proactive Marketing Officer to support the growth of our new Egg Depot in Ikorodu, Lagos.\n\tThe successful candidate will be responsible for developing and executing marketing strategies to attract and retain customers, promote our egg products extensively, and increase brand visibility within the local market.\n\tYou will play a key role in on-ground marketing activities, community outreach, and customer engagement. The ideal candidate must reside in Ikorodu, and be familiar with the local market dynamics.\n\n\nKey Responsibilities\n\n\n\tDevelop and implement local marketing strategies to promote egg sales.\n\tIdentify and engage potential B2B and B2C customers (retailers, supermarkets, restaurants, and households).\n\tBuild partnerships with local businesses to drive depot traffic.\n\tCollaborate with the sales team to align marketing and sales goals.\n\tConduct on-ground marketing campaigns (flyers, roadshows, local events, etc.)\n\tMonitor and report on market trends, customer feedback, and competitor activity.\n\tTrack performance metrics and analyze campaign effectiveness.\n\n\nRequirements\n\n\n\tEducation: OND / HND / B.Sc in Marketing, Business Administration, or related fields.\n\tExperience: Proven experience in marketing, preferably in agro-based products.\n\tMust reside in Ikorodu.\n\tStrong communication, persuasion, and sales skills.\n\tSelf-motivated, target-driven, and able to work under minimal supervision.\n\n\nBenefits\n\n\n\tCompetitive Salary Package\n\tOpportunity for career growth and professional development.\n\tA Dynamic and supportive work environment.\n\n\nApplication Closing Date: 16th July, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CVs and a Cover letter detailing why they are suitable for this role to: htsfarmshumanresources@gmail.com using “Marketing Officer” as the subject of the email.\n\n \n\n \n\n3.) Company Driver\n\nJob Location: Ikorodu, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe seek a reliable and experienced Driver to join our team in Ikorodu, Lagos. The Driver will be responsible for transporting goods, staff, and equipment safely and efficiently, ensuring timely deliveries, and maintaining the vehicle in excellent condition.\n\n\nKey Responsibilities\n\n\n\tSafely transport company goods, staff, and equipment to designated locations.\n\tPlan routes and meet delivery timelines efficiently.\n\tAdhere to all traffic rules and regulations while on duty.\n\tConduct routine checks on the vehicle (oil, fuel, tires, lights, etc.) to ensure it is in good working condition.\n\tReport any vehicle faults or maintenance needs promptly to management.\n\tKeep the vehicle clean and organized at all times.\n\tMaintain accurate records of trips, mileage, fuel consumption, and vehicle servicing.\n\tAssist with loading and unloading goods as required.\n\tCommunicate effectively with team members to ensure smooth operations.\n\tEnsure proper handling of company goods to avoid damage or loss.\n\n\nRequirements\n\n\n\tValid driver’s license with a clean driving record.\n\tMinimum of 3 years of experience as a professional driver.\n\tFamiliarity with routes in Lagos.\n\tAbility to drive manual and automatic vehicles.\n\tStrong understanding of vehicle maintenance and basic repairs.\n\tExcellent communication and interpersonal skills.\n\tMust be punctual, trustworthy, and able to work with minimal supervision.\n\n\nBenefits\n\n\n\tCompetitive salary.\n\tA supportive and respectful work environment.\n\tOpportunity to be part of a growing and impactful organization.\n\n\nApplication Closing Date: 15th July, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: htsfarmshumanresources@gmail.com using “Company Driver Lagos” as the subject of the email.\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Customer Experience Officer Job at Recore Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/customer-experience-officer-job-at-recore-limited",
    "pubDate": "Wed, 02 Jul 2025 21:14:32 GMT",
    "source": "JobGurus",
    "keyword": "recore limited",
    "duplicate": false,
    "classifications": [],
    "content": "Recore Limited is an outsourcing / consulting firm in human resources management.\n\nWe are recruiting to fill the position below:\n\nJob Position: Customer Experience Officer\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\n\nRequirements\n\n\n\tInterested candidates should possess a Bachelor's Degree with 2 years of work experience. \n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: jobs@recoreltdng.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Front Office & Revenue Manager Job at Alan & Grant",
    "link": "https://www.jobgurus.com.ng/jobs/view/front-office-revenue-manager-job-at-alan-grant",
    "pubDate": "Wed, 02 Jul 2025 21:14:32 GMT",
    "source": "JobGurus",
    "keyword": "alan & grant",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Alan & Grant - Our client is a luxury community offering nature-inspired hospitality resorts, in suite wellness, relaxation and recreation experience for both residents and visitors.\n\nThey are recruiting to fill the position below:\n\nJob Position: Front Office & Revenue Manager\n\nJob Location: Lagos\nJob type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are looking for a highly skilled and experienced Rooms Division / Guest Services / Revenue Manager to lead all aspects of our guest-facing departments while strategically managing room inventory, rate optimization, and revenue forecasting.\n\tThe ideal candidate will possess a deep understanding of hospitality operations, guest service excellence, and dynamic pricing strategies.\n\n\nKey Responsibilities\nRooms Division & Guest Services:\n\n\n\tOversee front office, housekeeping, concierge, and reservations departments to ensure flawless guest experiences across the estate\n\tCreate and implement service standards and SOPs across all Rooms Division departments\n\tLiaise closely with Maintenance and F&B to ensure smooth room turnovers and guest comfort\n\tMonitor guest satisfaction and handle escalations with tact and professionalism\n\tEnsure seamless communication between departments to optimize service delivery and efficiency\n\n\nRevenue Management:\n\n\n\tStrategically manage room inventory and pricing across all distribution channels\n\tAnalyze market trends, competitor performance, and historical data to optimize Average Daily Rate (ADR), occupancy, and RevPAR\n\tMaintain and update all OTA and direct booking platforms; coordinate with marketing to ensure rate parity and correct visibility\n\tPrepare weekly, monthly, and quarterly revenue reports and forecasts for management\n\tManage group and corporate booking agreements and identify upsell opportunities\n\tOptimize packages, discounts, and rate structures in line with seasonality and demand.\n\n\nRequirements\n\n\n\tDegree in Hospitality Management, Tourism, Business, or a related field preferred.\n\tMinimum 5+ years of experience using Opera PMS \n\tAt least 5 - 7 years’ experience in hospitality, including revenue management, front office, or rooms division roles\n\tStrong understanding of hotel revenue principles, forecasting, and pricing strategies\n\tProven leadership in managing cross-functional teams and guest-facing departments\n\tProficiency with Excel and data analysis tools; ability to create and interpret financial and performance reports\n\tFamiliarity with channel managers, OTAs, direct booking platforms, and rate parity tools\n\tExceptional communication, leadership, and organizational skills\n\tHighly detail-oriented with a strategic and analytical mindset.\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]