[
  {
    "title": "Human Resource Executive Job at Derive Communications Systems & Engr. Ltd",
    "link": "https://www.jobgurus.com.ng/jobs/view/human-resource-executive-job-at-derive-communications-systems-engr-ltd",
    "pubDate": "Sat, 07 Jun 2025 16:46:22 GMT",
    "source": "JobGurus",
    "keyword": "derive communications systems & engr. ltd",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Derive Communications Systems & Engr. Ltd is a fully indigenously owned company incorporated in 2010 with physical offices in Abuja and Lagos; and operates nationwide. An expert company and specialist in providing Extra Low Voltage solutions such as electronic security solutions, fire safety protection systems, Data Networking, Network Security and Information technology solutions, Building Management System, Communications systems and renewable energy solutions; the company is recruiting a Human Resource Executive to join the team.\n\nWe are recruiting to fill the position below:\n\nJob Position: Human Resource Executive\n\nJob Location: Abuja (FCT)\nEmployment Type: Full-time\n\nJob Role\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tEnsuring company culture is reflected throughout the employee lifecycle, enforcing the organization’s culture and adherence to the company’s code of conduct and external policies; carry out periodic surveys for improvement and stay up to date with information and best practices in Human Capital Management and Labor Law.\n\tManage the recruitment process, including candidate sourcing, reference checks, and onboarding.\n\tSchedule and coordinate meetings, interviews, and HR events.\n\tMaintain and update employee databases regularly.\n\tSet-up, preparation, feedback and documentation of performance review exercises and appraisals, and employee development and annual training programs; conduct orientations, facilitate trainings programs as at when required that will improve employee productivity\n\tMaintain employee records and ensure compliance with HR policies.\n\tSupport payroll processing by ensuring employee records are accurate and up to date.\n\tDrafting and implementing HR policies and procedures.\n\tManage employee engagement initiatives to promote a positive work environment.\n\tSupport performance management and training initiatives.\n\tHandle employee relations and workplace conflict resolution.\n\tConducting performance review, management and employee evaluations.\n\tMaintain proper documentation and filing of HR-related records (both hard and soft copies).\n\tCoordinate employee exit processes, including exit interviews and clearance documentation.\n\tMaintain the work structure by conducting job analysis and updating job requirements for all positions to meet the requirements of the unit and achieve the objective of the organization\n\tPerform other role-related duties as may be assigned by the company.\n\n\nQualifications and Experience\n\n\n\tMinimum of a B.Sc Degree in Human Resource Management or related field.\n\tMinimum of 4 years of relevant experience working in a generalist HR environment.\n\n\nSkills and Competencies:\n\n\n\tAbility to maintain and handle sensitive and confidential information.\n\tBroad knowledge and experience in employment law and HC practices.\n\tExcellent organizational and leadership skills\n\tOutstanding communication and interpersonal skills\n\tDiligent and firm with high ethical standards.\n\n\nSalary\nN100,000 - N150,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should forward their updated CV and a one-page cover letter in a single document to: engineersdcsel@gmail.com using the Job Position as the subject of the email.\n\nNote: Only shortlisted candidates will be contacted and should be ready for immediate interview.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Inventory Assistant Job at Maxitech Global Investment Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/inventory-assistant-job-at-maxitech-global-investment-limited-1",
    "pubDate": "Sat, 07 Jun 2025 16:46:22 GMT",
    "source": "JobGurus",
    "keyword": "maxitech global investment limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Maxitech Global Investment Limited, a leading ICT distribution company, is recruiting a detail-oriented and organized candidate to join their team in the capacity below:\n\nJob Position: Inventory Assistant\n\nJob Location: Ikeja, Lagos \nEmployment Type: Full-time\n\nJob Description\n\n\n\tThe ideal candidate will be responsible for managing and maintaining the company’s inventory, ensuring accuracy, and supporting efficient operations.\n\n\nKey Responsibilities\nInventory Management:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tMonitor and maintain accurate records of inventory levels.\n\tConduct regular stock counts and reconcile discrepancies.\n\tEnsure proper storage and organization of inventory items.\n\n\nStock Control:\n\n\n\tTrack stock movements (receipts, issues, and returns).\n\tMonitor stock levels to prevent overstocking or stockouts.\n\tCoordinate with procurement and sales teams to ensure timely replenishment of stock.\n\n\nReporting:\n\n\n\tPrepare and submit daily, weekly, and monthly inventory reports.\n\tAnalyze inventory data to identify trends and recommend improvements.\n\tMaintain up-to-date records of inventory transactions.\n\n\nQuality Assurance:\n\n\n\tInspect incoming goods for quality and quantity.\n\tEnsure damaged or defective items are reported and replaced promptly.\n\n\nProcess Improvement:\n\n\n\tIdentify and implement strategies to optimize inventory management processes.\n\tEnsure compliance with company policies and procedures.\n\n\nTeam Collaboration:\n\n\n\tWork closely with the warehouse, procurement, and sales teams to ensure smooth operations.\n\tProvide support during audits and stock-taking exercises.\n\n\nQualifications and Requirements\n\n\n\tEducation: Minimum of an HND/BSc in Business Administration, Supply Chain Management, or a related field.\n\tExperience: At least 2 years of experience in inventory management, preferably in an ICT distribution or retail environment.\n\n\nSkills:\n\n\n\tProficient in inventory management software and Microsoft Office Suite (Excel, Word).\n\tStrong analytical and problem-solving skills.\n\tExcellent organizational and time management abilities.\n\tAttention to detail and accuracy.\n\tGood communication and interpersonal skills.\n\n\nAttributes:\n\n\n\tHonest, reliable, and proactive.\n\tAbility to work independently and as part of a team.\n\tWillingness to work in a fast-paced environment.\n\n\nBenefits\n\n\n\tSalary: N150,000 - N200,000 / Month.\n\tOpportunities for professional growth and development.\n\tA supportive and collaborative work environment.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: olamilekan.sule@maxitechglobal.com using “Inventory Assistant Application\" as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]