[
  {
    "title": "Full-Stack AI Developer Job at Blucon Valley Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/full-stack-ai-developer-job-at-blucon-valley-limited",
    "pubDate": "Fri, 27 Jun 2025 18:21:39 GMT",
    "source": "JobGurus",
    "keyword": "blucon valley limited",
    "duplicate": false,
    "classifications": [
      "Software Engineering"
    ],
    "content": "Blucon Valley Limited is a dynamic and forward-thinking technology company committed to delivering cutting-edge software solutions tailored to meet the evolving needs of businesses across the globe. We specialize in the design, development, customization, implementation, and maintenance of high-quality software systems. Our services span across the full spectrum of the software development lifecycle, including rigorous testing and benchmarking to ensure optimal performance and reliability.\n\nWe are recruiting to fill the position below:\n\nJob Position: Full-Stack AI Developer\n\nJob Location: Remote or Lagos, Nigeria\nEmployment Type: Full-time\nCompany: Blucon Valley\nStart Date: Immediately\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Summary\n\n\n\tWe are looking for a talented and innovative Full-Stack AI Developer to join our growing team.\n\tYou’ll be responsible for building and deploying scalable, AI-powered web and mobile applications that transform how our clients work.\n\tIf you’re passionate about AI integration, automation, full-stack, and mobile development, we’d love to hear from you.\n\n\nKey Responsibilities\n\n\n\tBuild and deploy AI-integrated web and mobile applications using OpenAI, LangChain, and other LLM tools.\n\tDesign and maintain scalable front-end and back-end systems using frameworks like React, REST API, or FastAPI.\n\tDevelop and automate AI agents and workflows using n8n.\n\tBuild cross-platform mobile apps using React Native or Flutter.\n\tCollaborate with cross-functional teams (product, business, and design) to deliver client-ready solutions.\n\tDeploy services on cloud platforms and ensure reliable monitoring and performance.\n\tIntegrate third-party tools (e.g., Google Sheets, CRMs, WhatsApp APIs).\n\tOptimize development speed using AI IDEs like Cursor, Windsurf, or GitHub Copilot.\n\n\nRequirements\n\n\n\tInterested candidates should possess an SSCE / GCE / NECO qualification\n\tMinimum of 2 years of experience in full-stack development.\n\tExperience building mobile apps using React Native or Flutter.\n\tProficient with n8n, OpenAI APIs, LangChain, and prompt engineering.\n\tFamiliarity with tools and workflows for AI-based development and automation.\n\tAbility to work independently with a problem-solving and results-oriented mindset.\n\tStrong back-end skills and deep knowledge of servers and databases.\n\tSolid experience with API integration and cloud services.\n\tStrong analytical and creative thinking skills.\n\n\nPreferred Skills (Bonus Points):\n\n\n\tExperience in building LLM-powered chatbots or agents.\n\tBackground in machine learning or data science.\n\tKnowledge of DevOps practices for CI/CD deployment.\n\tStartup or fast-paced project experience.\n\n\nWhy Join Us?\n\n\n\tWork with a forward-thinking team on cutting-edge AI, automation, and mobile projects.\n\tFlexible remote work options or access to a Lagos-based workspace.\n\tOpportunity to make a real impact in a growing tech-driven company.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV, portfolio (if applicable), and a brief note on why they are a great fit for this role to: contact@bluconvalley.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "ChatGPT Content Creator Job at Kumesoft Technology",
    "link": "https://www.jobgurus.com.ng/jobs/view/chatgpt-content-creator-job-at-kumesoft-technology",
    "pubDate": "Fri, 27 Jun 2025 18:21:39 GMT",
    "source": "JobGurus",
    "keyword": "kumesoft technology",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance"
    ],
    "content": "Kumesoft Technology is a fast-growing digital marketing and technology agency focused on helping businesses harness AI to scale their marketing, content, and customer engagement. We develop SaaS platforms, custom AI solutions, and content services for clients across Africa and beyond.\n\nWe are recruiting to fill the position below:\n\nJob Position: ChatGPT Content Creator\n\nJob Location: Remote\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are looking for a creative and detail-oriented ChatGPT Content Creator to generate high-quality written content for blogs, websites, social media, and marketing campaigns using AI tools, primarily OpenAI’s ChatGPT.\n\tYou will be responsible for planning, generating, editing, and delivering engaging content tailored to target audiences and optimized for SEO.\n\tThe ideal candidate has excellent writing skills, is comfortable working with AI tools, and understands how to guide prompts to achieve clear and professional outputs.\n\n\nKey Responsibilities\n\n\n\t\n\tUse ChatGPT and other AI tools to produce a wide range of content, including:\n\n\t\n\t\tBlog articles\n\t\tWebsite copy\n\t\tSocial media posts\n\t\tProduct descriptions\n\t\tEmail newsletters.\n\t\n\t\n\tDevelop, test, and refine prompts to generate accurate, relevant, and engaging content\n\tEdit and polish AI-generated drafts to ensure clarity, tone, and brand consistency\n\tResearch topics and keywords to inform content strategy and support SEO objectives\n\tCollaborate with marketing and design teams to align content with campaign goals\n\tManage and prioritize multiple content requests and deadlines\n\tMaintain an organized library of prompts, templates, and generated materials\n\tProvide feedback and ideas to improve AI content workflows and processes.\n\n\nRequired Skills & Qualifications\n\n\n\tInterested candidates should possess a Bachelor's Degree\n\tMinimum of 2 years of professional experience in content writing, copywriting, or marketing\n\tStrong proficiency in English grammar, spelling, and style\n\tFamiliarity with AI writing tools (e.g., ChatGPT, Jasper, Copy.ai)\n\tExcellent attention to detail and ability to self-edit\n\tStrong organizational and time management skills\n\tExperience crafting effective prompts to guide AI-generated output\n\tBasic understanding of SEO principles and keyword usage\n\tProactive mindset and ability to work independently in a remote environment.\n\n\nNice to Have:\n\n\n\tExperience creating content for diverse industries (e.g., SaaS, e-commerce, finance)\n\tFamiliarity with content management systems (WordPress, Webflow)\n\tUnderstanding of social media strategy and trends\n\tKnowledge of additional AI tools for image or video content creation.\n\n\nWhat We Offer\n\n\n\tCompetitive salary (N50,000 - N70,000 monthly), based on experience\n\tFlexible remote work\n\tAccess to premium AI tools and resources\n\tSkill development and training in AI content creation\n\tSupportive and collaborative team environment\n\tOpportunities for career growth as we scale our AI services.\n\n\nMethod of Application\nInterested and qualified candidates should send their Resume, Writing Portfolio, and a brief Cover Letter highlighting relevant experience to: idoho.denis.tu@gmail.com using \"ChatGPT Content Creator\" as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Vacancies at Blume Distribution Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancies-at-blume-distribution-limited",
    "pubDate": "Fri, 27 Jun 2025 18:21:39 GMT",
    "source": "JobGurus",
    "keyword": "blume distribution limited",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Software Engineering",
      "Finance"
    ],
    "content": "Blume Distribution Limited is a marketer and distributor of unique brands that bring joy to millions of consumers across Africa. The company is a recognized market leader in tomato mix marketing sales and distribution of other range of Non Diary Creamer and Culinary products. Blume Nigeria Limited is a major marketer and distribution company for Sonia Foods Nigeria which is one of Nigeria's leading tomato mix, food and beverages manufacturers.\n\nWe are recruiting to fill the following positions below:\n\n1.) Van Sales Representative (VSRs)\n\nJob Location: Port Harcourt, Rivers\nEmployment Type: Part-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking proactive and results-driven Van Sales Representatives (VSRs) to join our sales team in Rivers State, the ideal candidate will be responsible for selling and delivering our products to existing and prospective customers, ensuring route coverage, and achieving daily and monthly sales targets.\n\n\nKey Responsibilities\n\n\n\tDrive the company’s sales van within the assigned territory (Port Harcourt).\n\tSell and distribute products to retail outlets, supermarkets, and other sales points.\n\tBuild and maintain strong customer relationships to encourage repeat business.\n\tEnsure daily sales targets are met or exceeded.\n\tMonitor stock levels in the van and ensure an optimal product mix is maintained.\n\tCollect payments and issue receipts accurately.\n\tKeep accurate records of all sales, deliveries, and customer feedback.\n\tEnsure products are properly merchandised at customer locations.\n\tSubmit daily reports on sales performance and market feedback to the sales supervisor.\n\n\nRequirements\n\n\n\tMinimum of SSCE / OND qualification.\n\t2–5 years of experience in FMCG or route-to-market sales is preferred.\n\tMust possess a valid driver’s license and any other required driving document in the state.\n\tFamiliarity with port Harcourt Road network and its environs is a strong advantage.\n\tGood communication, negotiation, and customer service skills.\n\tAbility to work independently and under pressure.\n\tHonest, reliable, and target-oriented.\n\n\nRemuneration\n\n\n\tSalary: N100,000 - N150,000 / month.\n\tAttractive salary with sales-based incentives, pension, and HMO.\n\n\nApplication Closing Date: 15th July, 2025.\n\nMethod of Application\nInterested and qualified candidates should forward their CV to: careers@blumedistribution.com CC: Oluchi.Sunday@blumedistribution.com using the Job Position as the subject of the mail.\n\n \n\n \n\n2.) Talent Acquisition Executive (with Data Analytical Expertise) \n\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe are seeking an experienced and data-savvy talent acquisition executive to join our growing HR team.\n\tThe ideal candidate will have a minimum of 5 years of hands-on experience in recruitment and talent management, combined with strong analytical skills and proficiency in Excel and/or other data analysis tools.\n\tThis role involves managing end-to-end recruitment processes while using data to evaluate sourcing channels, recruitment performance, and talent pipelines.\n\n\nKey Responsibilities\n\n\n\tManage full-cycle recruitment for various roles across departments, including sourcing, interviewing, and onboarding.\n\tDevelop and implement effective talent acquisition strategies to attract high-quality candidates.\n\tUse Excel, Google Sheets, or data analysis tools (e.g., Power BI, Tableau, Python, etc.) to track, analyze, and report on recruitment metrics such as time-to-hire, cost-per-hire, and sourcing effectiveness.\n\tPartner with hiring managers to understand workforce needs and ensure alignment with organizational goals.\n\tMaintain and update the Applicant Tracking System (ATS) and ensure data integrity for reporting purposes.\n\tBuild and maintain a talent pipeline through proactive sourcing and networking strategies.\n\tProvide data-driven insights to improve hiring decisions and processes.\n\tSupport employer branding initiatives and represent the organization at job fairs, campus drives, and industry events.\n\tConduct market mapping and competitor analysis to inform talent strategies.\n\tAssist in workforce planning and talent management projects.\n\n\nRequirements\n\n\n\tBachelor’s degree in human resources, business administration, statistics, or a related field.\n\tMinimum of 5 years of experience in talent acquisition, recruitment, or talent management.\n\tProficiency in Microsoft Excel (pivot tables, VLOOKUP, dashboards) and other data analysis/reporting tools.\n\tExcellent interpersonal and communication skills.\n\tAnalytical mindset with attention to detail and data accuracy.\n\tFamiliarity with Applicant Tracking Systems (ATS) and HRIS software.\n\tStrong understanding of recruitment best practices, employment laws, and HR trends.\n\tAbility to work in a fast-paced, dynamic environment and manage multiple priorities.\n\n\nPreferred Skills (Added Advantage):\n\n\n\tExperience using advanced analytics tools such as Power BI, SQL, or Python.\n\tKnowledge of diversity hiring practices and global talent acquisition trends.\n\tCertification in Talent Acquisition or HR Analytics\n\n\nWhat We Offer\n\n\n\tCompetitive salary and benefits package\n\tOpportunity to work with a dynamic and data-driven HR team\n\tProfessional development and career growth opportunities\n\tA culture that values innovation, collaboration, and continuous learning.\n\n\nApplication Closing Date: 20th July, 2025.\n\nMethod of Application\nInterested and qualified candidates should forward their CV to: Oluchi.Sunday@blumedistribution.com using the Job Position as the subject of the mail.\n\n \n\n \n\n3.) Digital Marketing Specialist\n\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe are seeking an experienced and innovative Digital Marketing Specialist with a proven track record in driving digital campaigns and brand visibility within the FMCG sector in Nigeria.\n\tThe ideal candidate will have a deep understanding of the local market, consumer behavior, and digital trends that influence purchasing decisions.\n\tThis role requires a strategic thinker who can blend creativity with data-driven marketing approaches to grow our digital footprint and deliver measurable ROI.\n\n\nKey Responsibilities\n\n\n\tDevelop and execute integrated digital marketing strategies across platforms (social media, SEO/SEM, email, web, mobile, influencer, and content marketing) tailored to the Nigerian FMCG landscape.\n\tPlan, manage, and optimize paid media campaigns (Google Ads, Facebook, Instagram, YouTube, TikTok, etc.) to drive brand awareness, engagement, and conversions.\n\tIdentify and engage digital influencers and KOLs to amplify brand presence and consumer loyalty.\n\tMonitor trends in digital marketing and FMCG competition to stay ahead of the curve.\n\tCollaborate with brand, sales, and product teams to align digital marketing efforts with business objectives and product launches.\n\tAnalyze digital performance metrics and provide actionable insights to improve reach, engagement, and ROI.\n\tManage and grow the company’s online community, maintaining brand voice and consistency across platforms.\n\tLead content development strategy—writing, editing, and commissioning impactful content in line with brand tone.\n\tManage digital agencies, media partners, and third-party service providers for campaign execution and optimization.\n\tPrepare monthly reports and dashboards for senior management on key digital KPIs and campaign effectiveness.\n\n\nQualifications and Requirements\n\n\n\tBachelor’s Degree in Marketing, communications, business administration, or related field. A relevant master’s degree or digital marketing certification is a plus.\n\tMinimum of 5 years of hands-on experience in digital marketing within the Nigerian FMCG industry.\n\tStrong expertise in paid media management, SEO/SEM, content creation, and performance analysis.\n\tProficient in tools such as Google Analytics, Meta Ads Manager, Google Ads, Hootsuite, Mailchimp, Canva, and similar platforms.\n\tDemonstrated ability to conceptualize and execute high-impact campaigns within tight deadlines and budget constraints.\n\tDeep knowledge of Nigerian consumer behavior and regional market dynamics.\n\tExcellent communication, analytical thinking, and stakeholder management skills.\n\tCreative flair with a passion for emerging trends in digital and consumer marketing.\n\n\nWhat We Offer\n\n\n\tA dynamic and inclusive work environment within a leading FMCG brand.\n\tOpportunities for growth, learning, and career advancement.\n\tCompetitive remuneration and performance-based incentives.\n\tExposure to cross-functional teams and innovative marketing projects.\n\n\nApplication Closing Date: 15th July, 2025.\n\nMethod of Application\nInterested and qualified candidates should forward their CV and a brief portfolio of successful digital campaigns to: Oluchi.Sunday@blumedistribution.com CC: careers@blumedistribution.com using the Job Position a sthe subject of the mail.\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]