[
  {
    "title": "Audit and Compliance Officer Job at BON Hotels Sunshine",
    "link": "https://www.jobgurus.com.ng/jobs/view/audit-and-compliance-officer-job-at-bon-hotels-sunshine",
    "pubDate": "Mon, 30 Jun 2025 22:15:47 GMT",
    "source": "JobGurus",
    "keyword": "bon hotels sunshine",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "BON Hotels is so much more than an African Hospitality Group run by Africans – we are renowned industry game changers with innovative solutions for the challenging and unique African hospitality landscape, consistently pushing boundaries and setting new benchmarks.\n\nWe are recruiting to fill the position below:\n\nJob Position: Audit and Compliance Officer\n\nJob Location: Abuja\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Audit and Compliance Officer is responsible for ensuring that BON Hotels’ operations and business activities comply with internal policies, relevant legal and regulatory standards, and best practice frameworks.\n\tThis role involves planning and conducting audits, risk assessments, and compliance reviews to identify areas for improvement, safeguard company assets, and ensure operational efficiency and integrity.\n\n\nKey Responsibilities\nAudit Functions:\n\n\n\tDevelop and implement an internal audit plan aligned with business risks and objectives.\n\tConduct regular internal audits of hotel operations, finance, procurement, inventory, and other key business areas.\n\tReview internal controls, processes, and procedures to identify gaps, weaknesses, and inefficiencies.\n\tEvaluate compliance with statutory regulations, internal policies, and standard operating procedures (SOPs).\n\tPrepare detailed audit reports with findings, risk assessments, and recommendations for corrective action.\n\tMonitor follow-up actions from audit findings and ensure timely remediation.\n\n\nCompliance Management:\n\n\n\tStay updated on relevant local, regional, and international regulations affecting the hospitality industry.\n\tEnsure compliance with legal and regulatory requirements, including tax, labor, environmental, and health & safety laws.\n\tAssist with the development and implementation of compliance programs, training, and awareness initiatives across the group.\n\tAct as a key contact for external regulatory audits or investigations and support management in preparing required documentation.\n\tMaintain and monitor BON Hotels’ compliance risk register and report on key compliance indicators.\n\n\nRisk Management:\n\n\n\tAssist in the development of risk management strategies, frameworks, and policies.\n\tConduct risk assessments and assist operational teams in mitigating identified risks.\n\tReport potential risks or breaches and support investigation processes.\n\n\nPolicy & Procedure Development:\n\n\n\tAssist in reviewing and updating internal policies and procedures to align with current business practices and regulatory expectations.\n\tEnsure all policies are communicated and accessible to relevant employees.\n\n\nQualifications & Experience\n\n\n\tBachelor's Degree in Accounting, Finance, Auditing, Risk Management, or related field.\n\tMinimum 3 - 5 years of experience in audit, compliance, or risk management, preferably within the hospitality industry or a similar service sector.\n\tProfessional certification such as CIA (Certified Internal Auditor), CFE (Certified Fraud Examiner), or equivalent is preferred.\n\tStrong knowledge of internal control frameworks, auditing standards, and regulatory compliance.\n\tFamiliarity with hotel operations, financial systems, and reporting standards is an advantage.\n\n\nKey Skills & Competencies:\n\n\n\tHigh ethical standards and professional integrity.\n\tExcellent analytical, investigative, and problem-solving skills.\n\tStrong attention to detail and accuracy.\n\tGood communication and interpersonal skills, with the ability to influence stakeholders.\n\tProficiency in MS Office and audit software tools (e.g., ACL, IDEA, or equivalent).\n\tAbility to manage multiple priorities and travel to hotel locations as needed.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: boniwahr@bonhotels.com and copy rsdmexec@bonhotelsinternational.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Assistant Finance Manager Job at Source Computers Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/assistant-finance-manager-job-at-source-computers-limited",
    "pubDate": "Mon, 30 Jun 2025 22:15:47 GMT",
    "source": "JobGurus",
    "keyword": "source computers limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "The Source Computers (TSC) Limited is one ofInformation Technology companies in Nigeria. Since its inception in 2001, TSC has recorded tremendous achievements as well as attained a certain level of confidence through our Value propositions and Premiun service the two key factors thatdifferentiates TSC from competition. Some of our solutions include: IT Infrastructure Solutions, Enterprse Software, IT Managed Services, Data Centre and Power Solutions.\n\nAt TSC, we pride ourselves in team work and staff empowement; engagingthe services of highly trained professionals committed to delivering solutions to our estimable customers.\n\nWe are recruiting to fill the position below:\n\nJob Position: Assistant Finance Manager\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Purpose\n\n\n\tTo assist in the monitoring of the day - to - day financial operations within the company.\n\n\nDuties and Responsibilities\n\n\n\tManage Sale Order approval process\n\tEnsure timely and accurate invoicing\n\tReconcile items delivered to customers, all returns and store records\n\tCross check items from store to ensure proper invoicing/debiting into customer’s account\n\tWork with Sales Team to ensure timely collection of payment due from customers\n\tMonitor and report on deviations from customer’s credit terms\n\tEnsure that the company’s standard template regarding invoice sample is in place for every customer and also conform to the standard\n\tConduct credit checks on all customers, establish and manage limits\n\tEnsure control of receivables through appropriate approvals and checks & balances\n\tMaintain customers files\n\tMonitor Posting of necessary Journals-Salary/HMO/Pension/PAYE & Others\n\tMaintain customers statement of account\n\tMaintain Inflows register\n\tMake recommendations to improve quality of invoicing and collection procedures.\n\tWeekly reporting of invoicing totals/aging totals/cash receipts/invoice adjustments\n\tManage Receivables on daily basis and produce weekly report\n\tProper recording and application of cash, management of outstanding invoices, and direct interfacing with customers on collection matters and dispute resolution\n\tAssist sales team to ensure finance and sales numbers are reconciled\n\tSupport in semi-annual and annual company audit for accounts receivables\n\tResponsible for monthly Bank Reconciliations\n\tMaintain schedule for Service Level Agreement\n\tKeep Fixed Assets Register\n\tKeep records of VAT and WHT\n\tAssist in documentation and monitoring of internal controls\n\tSupport Management by providing timely and accurate information on customer, payment and account standing information\n\tProvide financial reports and interpret financial information to managerial staff while recommending further courses of action.\n\tAdvise on investment activities and provide strategies that the company should take\n\tMaintain the financial health of the organization.\n\tAnalyze costs, pricing, variable contributions, sales results and the company’s actual performance compared to the business plans.\n\tDevelop trends and projections for the firm’s finances.\n\tConduct reviews and evaluations for cost-reduction opportunities.\n\tAssist in overseeing operations of the finance department, set goals and objectives, and design a framework for these to be met.\n\tManage the preparation of the company’s budget.\n\tSupervise Preparation of weekly departmental report\n\tCorrespond with other departments, discussing company plans and agreeing on future paths to be taken\n\tAnd any other task as assigned by your HOD.\n\n\nRequirements\n\n\n\tInterested candidates should possess an HND qualification with 7 - 8 years of work experience.\n\tProfessional Qualification: ACA OR ACCA.\n\n\nSkills and Competencies:\n\n\n\tAttention to details\n\tInformation Mangement\n\tCustomer Service Skills\n\tGood knowledge of Microsoft Excel, word and PowerPoint\n\tGood verbal and written communication skills\n\tProblem analysis and Problem Solving Skills.\n\n\nMethod of Application\nInterested and qualified candiddates should forward their CVs to: recruitment@tsc.com.ng using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Digital Banking Personnel, Bank Teller and Bank Marketer Job at Workforce Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/digital-banking-personnel-bank-teller-and-bank-marketer-job-at-workforce-group",
    "pubDate": "Mon, 30 Jun 2025 22:15:47 GMT",
    "source": "JobGurus",
    "keyword": "workforce group",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Workforce Group is an HR and Business consulting firm in Nigeria. We help you grow and sustain your business through crafting the right strategy, hiring and developing the right people, and achieving the right results. Our services include people, process, and project outsourcing, corporate training and development, recruitment and assessment, market research and entry, management consulting, and tech talent recruitment.\n\nWe are recruiting to fill the following positions below:\n\nJob Positios: Digital Banking Personnel, Bank Teller and Bank Marketer\n\nJob Location: Lagos Mainland / Island - Lagos\nEmployment Type: Full-time\nIndustry: Banking\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDigital banking refers to the provision of banking services through digital channels, primarily online and mobile platforms, rather than through traditional physical branches.\n\tIt involves using technology to access and manage financial accounts, conduct transactions, and access various banking services.\n\n\nRequirement\n\n\n\tQualification: HND and BSc\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Station Manager Job at Nepal Energies",
    "link": "https://www.jobgurus.com.ng/jobs/view/station-manager-job-at-nepal-energies",
    "pubDate": "Mon, 30 Jun 2025 22:15:47 GMT",
    "source": "JobGurus",
    "keyword": "nepal energies",
    "duplicate": false,
    "classifications": [],
    "content": "Nepal Energies is a leading player in the Downstream, midstream and upstream sector of the oil and gas industry in country , we have branches cut across different regions in the country and across africa.\n\nWe are recruiting to fill the position below:\n\nJob Position: Station Manager\n\nJob Location: Akure / Ogbese Express Way, Ondo\nEmployment Type: Full-time\n\nSummary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAre you ready to grow your career in the fuel retail industry?\n\tNepal Group is expanding and looking for talented professionals to join our team across multiple locations in Nigeria!\n\n\nRequirements\nA key Criteria for selection:\n\n\n\tInterested candidates should possess a Bachelor's Degree with 0 - 3 years of work experience\n\tMust reside on Akure / Owo Road, Ogbese\n\tMust have completed NYSC.\n\n\nMethod of Application\nInterested and qualified candidates should send their resume to: careers@nepalgroupng.com using the Job Position and Location as the subject of the mail (e.g., Station Manager – Akure, Ogbese Express way).    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Full Stack Web Developer (Laravel Framework) Job at Verus Consultants",
    "link": "https://www.jobgurus.com.ng/jobs/view/full-stack-web-developer-laravel-framework-job-at-verus-consultants",
    "pubDate": "Mon, 30 Jun 2025 22:15:47 GMT",
    "source": "JobGurus",
    "keyword": "verus consultants",
    "duplicate": false,
    "classifications": [
      "Software Engineering"
    ],
    "content": "Verus consultants is a Human resource consulting company with a head office in Lagos. Verus consultants is a Uniquely African and proudly Nigerian Company offering support and services in the area of Human resource solutions with service offerings that include world-class personnel outsourcing, recruitment, headhunting, training, and development.\n\nWe are recruiting to fill the position below:\n\nJob Position: Full Stack Web Developer (Laravel Framework)\n\nJob Location: Maryland, Ikeja - Lagos\nEmployment Type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe ideal candidate is a creative problem solver who will work in coordination with cross-functional teams to design, develop, and maintain our next-generation websites and web tools.\n\tYou must be comfortable working as part of a team while taking the initiative to take lead on new innovations and projects.\n\n\nResponsibilities\n\n\n\tRevise, edit, proofread & optimize web content\n\tWork cross-functionally to enhance the overall user experience of our platforms\n\tOwn various design tasks involved in the web development life cycle from start to finish\n\n\nQualifications\n\n\n\tBachelor's Degree or equivalent experience in Computer Science\n\tAt least 2 - 3 years of experience using HTML, CSS, and JavaScript\n\tKnowledge of multiple front-end languages and libraries (e.g. React Js, HTML/ CSS, JavaScript, Bootstrap, XML, jQuery)\n\tKnowledge of multiple back-end languages (e.g. Laravel, C#, jquery, Java, Json) and JavaScript frameworks (e.g. Angular, React, Node.js)\n\tAbility to multi-task, organize, and prioritize work.\n\n\nMethod of Application\nInterested and qualified candidates should forward their CV to: verusconsults@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]