[
  {
    "title": "Sales & Marketing Manager Job at Bureau Veritas",
    "link": "https://www.jobgurus.com.ng/jobs/view/sales-marketing-manager-job-at-bureau-veritas-3",
    "pubDate": "Wed, 18 Jun 2025 18:49:19 GMT",
    "source": "JobGurus",
    "keyword": "bureau veritas",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance"
    ],
    "content": "Bureau Veritas is a world leader in testing, inspection and certification services (TIC). Bureau Veritas is a Business to Business to Society service company that contributes to positively transforming the world we live in. We work closely with our clients to address the critical challenges they face and to link these to the emerging aspirations of society. We play a pivotal role in building and protecting companies' reputations, supporting them as they forge the foundations of trust that is built to last.\n\nWe are recruiting to fill the position below:\n\nJob Position: Sales & Marketing Manager\n\nJob ID: 182630\nJob Location: Lagos\nJob type:  Full time\nCategory: Sales\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nPurpose of the Position\n\n\n\tThe position performs in line with the Bureau Veritas Quality Assurance System, including the BV Code of Ethics and the BV Group policy.\n\tThe Sales Manager builds and manages all aspects of a sales department inclusive of leading management, account management, business analytics, and channel development.\n\tThe Nigeria Sales Manager also works closely with the following departments: Operations BU Managers, Finance, and other sales teams for the purpose of ensuring the delivery of first-class delivery experience.\n\tLead the Business Development for CIF Division across all markets and divisions: Oil & Gas (upstream, Mid-Stream & Down Stream), Power & Utilities, Metals & Minerals, Agri-Food, Building & Infrastructure, Industry.\n\n\nMajor Responsibilities\nBusiness Development Strategy:\n\n\n\tThe Sales Manager plays a strategic role in building creative sales strategies aligned with Operating Group priorities and local opportunities that are focused on consumer satisfaction and revenue generation for the business.\n\tIn this position, the Nigeria Sales Manager is accountable on delivering the sales and growth objectives within Nigeria market.\n\n\nSales Team Management:\n\n\n\tThe Sales Manager conducts reviews on the sales department and weighs them against results in order to identify areas of improvement. He/She subsequently relays this information to senior sales and operations management for consideration and approval.\n\tThe Sales Manager is animating the sales team within Nigeria, ensuring proper alignment to LEAP strategy as well as cross- selling.\n\tIn this position, the Nigeria Sales Manager also assesses and identifies the competencies and resources required by the sales department (recruitment, upskill) in order to achieve optimal performance, leading to financial benefit for the business.\n\n\nAnalytics:\n\n\n\t In collaboration with the region sales excellence manager, the Sales Manager also plays an analytical role in conducting research and performing analyses on the performance of the sales department ensuring prompt delivery and accuracy of various sales reporting.\n\tIn this position, the Sales Manager tracks sales activities and creates reports that he/she presents to senior sales management and senior management for use in strategic decision making.\n\tHe/ She is in charge of Sales Team objectives setting, monitoring and validation in collaboration with CCE.\n\n\nBusiness Development, Large Proposals Management and key stakeholders engagement:\n\n\n\tLead Business Development for all major/key opportunities for Nigeria. Development and maintenance of all projects, opportunities & tenders list for large opportunities.\n\tKey Stakeholders engagement: The Nigeria Sales Manager is responsible for building the right level of interactions and connections with key stakeholders within Nigeria.\n\tThe Nigeria Sales Manager develops and builds relationships and partnerships by being attentive, service-oriented, friendly, helpful, and courteous to customers, colleagues, external partners, and so forth.\n\n\nManaging Large Clients relationship within Nigeria:\n\n\n\tIn this capacity, the Nigeria Sales Manager acts as a brand ambassador, taking advantage of the relationships and connections that he/she has established to avidly represent the business, share its vision, increase awareness, and establish more relationships.\n\tIdentification, preparation and submission of pre-qualification, expression of interest, offers & tenders.  This includes offer and contract review.\n\tManagement and grow business with local key accounts within Nigeria.\n\tThe Nigeria Sales Manager also has a duty to represent the business of BV beyond the   sales department.\n\tThe Nigeria Sales Manager participates in tradeshows, sales workshops, sales seminars, and events on behalf of the business. This is for the purpose of collecting qualified leads and pertinent sales information as well as keeping up with market trends in order to ensure that the business does not lag behind of other players.\n\tThis is also for the purpose of establishing the business as a thought leader in the market, gaining the respect and trust of consumers and competitors alike.\n\tAt this capacity, the Nigeria Sales Manager will serve on industry boards and committees when appropriate and after Ethics Committee approval and maintain membership in local, national, and international industry organizations.\n\tHe/She will be supported by BV offices with marketing tools such as presentation material, profile, catalogue, reference list, completion/appreciation letters, etc.\n\tHe/She will interact with communication and marketing agencies whenever needed.\n\n\nCollaboration:\n\n\n\tThe Nigeria Sales Manager also plays a collaborative role, partnering up with the finance department to ensure availability of sufficient funds for the sales department in order to ensure optimal performance.\n\tHe also ensures that marketing is aligned with the strategies and objectives, ensuring that marketing initiatives support sales efforts and that these strategies are all aligned to the business’s overall objectives.\n\tIn his collaborative role, the Nigeria Sales Manager also works closely with senior operations management in the creation of new sales strategies and approaches.\n\n\nCriteria for Performance Evaluation (KPIs)\n\n\n\t3 years plan implementation\n\tNew sales objectives as per budget\n\tActual Sales, Revenue and Profitability versus budget.\n\tMaintenance of empanelled/pre-qualification/agency list with clients.\n\tDevelopment of sales capabilities and upskilling of sales team within Nigeria\n\n\nRequirements\nEducational Qualification: \n\n\n\tBachelor’s Degree (Master’s Degree preferred) in Communications, Business Administration, Business Management, Marketing, or any other related filed with an engineer background. An equivalent of this requirement in working experience is also acceptable.\n\n\nExperience: \n\n\n\tAt least 10 years in a sales position within a complex and fast-paced business environment\n\tMinimum of 3 years as a Sales Manager in Oil & Gas Industry.\n\tHe/She must have a good knowledge of Nigeria market in various sectors such as construction, manufacturing, agriculture, Power & Utilities,….\n\tA suitable candidate will also demonstrate experience in sales research and how raw information and data is processed to become useful insights that assist the sales department in establishing appropriate strategies that lead to the achievement of goals and targets.\n\tA suitable candidate will have established contacts and relationships within the business’s industry in addition to having experience working with sales account databases and CRM platforms like SalesForce. He/She will also have exceptional sales skills and a consistent track record in sales conversion success and performance\n\tShould have dealt with both Public sector companies and Private sector companies for tendering, negotiations and finalizations.\n\n\nSkills and Qualities:\nCommunications Skills: \n\n\n\tCommunication skills are a must have for this position, in both verbal and written form. These skills are especially necessary in building relationships with customers and external partners. Additionally, the clarity of communication between the Nigeria Sales Manager and the sales roles and collaborating personnel will also be a determinant of the overall performance in the department. The Nigeria Sales Manager must also be in a position to convey even the most complex information and insights in his reports in a simple, clear, and convincing manner, tailoring messages to suit various audiences.\n\tThe Nigeria Sales Manager must also be a story-teller who is able to sell the BV brand to potential clients and secure more sales for the business. In addition to this, the Nigeria Sales Manager must also be a great listener with ability to clarify and resolve issues and concerns of consumers, external partners, senior personnel, junior personnel etc.\n\tShould be a ‘Go to Market’ attitude personnel with ability to connect people, client contacts at higher level & should be able to convert contacts into business.\n\n\nAnalytics: \n\n\n\tA candidate for this position must also demonstrate strong analytical skills and an ability to assimilate complex data and information from disparate sources and process it to address a certain need or issue in the sales department. The candidate will be highly proficient with research solutions to sales as well as effectiveness measurement systems.\n\tIn this capacity, the Nigeria Sales Manager will conduct regular research and analyses on the business’s market and competitive environment, looking for opportunities to further the sales department’s goals by adjusting strategies and approaches that enhance efficiency and performance.\n\tMust be fluent in English and professional knowledge in French & Portuguese.\n\tMust be M360 fully literate and have good knowledge of CRM such as Salesforce\n\tTravel within the country/area as per business need.\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Junior Website Designer Job at TeamAce Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/junior-website-designer-job-at-teamace-limited-1",
    "pubDate": "Wed, 18 Jun 2025 18:49:19 GMT",
    "source": "JobGurus",
    "keyword": "teamace limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "TeamAce Limited- Our client, an Edutech firm, is recruiting to fill the position below:\n\nJob Position: Junior Website Designer\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tAs the Junior Website Designer, you will be responsible for designing, updating, and maintaining websites to ensure a seamless user experience and alignment with our brand.\n\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAssist in designing and developing responsive websites using WordPress.\n\tCustomize themes and plugins to meet project requirements.\n\tMaintain and update website content, ensuring accuracy and consistency.\n\tCollaborate with design, marketing, and development teams to execute web projects.\n\tTroubleshoot and resolve basic technical issues related to layout, formatting, or plugin compatibility.\n\n\nRequirements\n\n\n\tBachelor’s Degree in Computer Science, Information Technology, or a related field\n\tMinimum of 1 year of experience in web design with a strong focus on WordPress.\n\tFamiliarity with Adobe Creative Suite, Figma, or similar design tools is a plus.\n\n\nSalary\nNGN 200,000 - NGN250,000 per month.     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Virtual Assistant Job at Odixcity Consulting",
    "link": "https://www.jobgurus.com.ng/jobs/view/virtual-assistant-job-at-odixcity-consulting",
    "pubDate": "Wed, 18 Jun 2025 18:49:19 GMT",
    "source": "JobGurus",
    "keyword": "odixcity consulting",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Odixcity Consulting is an International Hr consulting and procurement firm. With expertise in Recruitment & Selection, Performance management, Training & Development, Compensation and benefits as well as Outsourcing of goods and services for organizations.\n\nWe are recruiting to fill the position below:\n\nJob Position: Virtual Assistant\nJob Location: Remote\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a highly organized and proactive Virtual Assistant to provide administrative, technical, and creative assistance.\n\tThe ideal candidate will be able to manage multiple tasks efficiently, communicate effectively, and work independently.\n\n\nResponsibilities\n\n\n\tManage emails and correspondence.\n\tSchedule appointments and manage calendars.\n\tConduct research and compile data.\n\tPrepare reports and presentations.\n\tManage social media accounts.\n\n\nQualifications\n\n\n\tProven experience as a Virtual Assistant.\n\tExcellent organisational and time management skills.\n\tStrong written and verbal communications.\n\tProficiency in Microsoft Office Suite and Google Workspace.\n\tExperience with social media platforms.\n\tAbility to work independently and remotely.\n\tHigh-speed internet and a reliable computer.\n\n\nPreferred Skills:\n\n\n\tExperience with project management tools (e.g, Asana, Trello).\n\tExperience with CRM software.\n\tGraphic design skills.\n\tExperience with content creation.\n\n\nSalary\nN400,000 Monthly (non-negotiable).\n\nMethod of Application\nInterested and qualified candidates should send their CV to: jobscandidate8@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "HSE Officer Job at Excel and Grace Consulting",
    "link": "https://www.jobgurus.com.ng/jobs/view/hse-officer-job-at-excel-and-grace-consulting-1",
    "pubDate": "Wed, 18 Jun 2025 18:49:19 GMT",
    "source": "JobGurus",
    "keyword": "excel and grace consulting",
    "duplicate": false,
    "classifications": [],
    "content": "Excel and Grace Consulting is a fast-paced business consulting organization with a track record of delivering exceptional business solutions to small and medium-scale enterprises in Nigeria, Ghana, Germany, Switzerland, Canada, etc. We are certified management consultants with the International Council of Management Consulting Institutes (CMC-Global) with over 18 years of experience. Our team of experts and consultants have authored over 20 books on business management, business structure, business operations, human resources, organizational structure, employee development, money management, and so on.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: HSE Officer\nJob Location: Port Harcourt, Rivers\nEmployment Type: Full-Time\nndustry: Marine Logistics\n\nJob Summary\n\n\n\tWe are seeking a proactive and detail-oriented HSE Officer to support the implementation and monitoring of Health, Safety, and Environmental policies across all marine operations.\n\tThe successful candidate will ensure compliance with industry regulations, promote a culture of safety, and assist in minimizing operational risks.\n\n\nKey Responsibilities\n\n\n\tImplement and monitor the company’s HSE policies, procedures, and programs.\n\tConduct regular safety inspections, risk assessments, and audits on vessels, facilities, and operational sites.\n\tMaintain and update HSE documentation, reports, and records in line with regulatory requirements.\n\tMonitor environmental impact and waste management practices in marine operations.\n\tEnsure compliance with applicable local and international HSE standards (e.g., NIMASA, ISM Code, SOLAS, MARPOL).\n\tInvestigate and report incidents, accidents, and near-misses, and recommend corrective actions.\n\tFacilitate HSE training, inductions, and toolbox talks for crew and onshore staff.\n\tParticipate in emergency response planning and drills.\n\tSupport the continuous improvement of safety culture and environmental responsibility throughout the organization.\n\n\nRequirements\n\n\n\tB.Sc./HND in Environmental Science, Engineering, Safety Management, or a related discipline.\n\tMinimum of 2–3 years of HSE experience, preferably in the marine or oil & gas logistics sector.\n\tHSE Level 1, 2 & 3 (or equivalent).\n\tNEBOSH or ISPON certification is an added advantage.\n\tStrong knowledge of HSE standards and marine safety regulations.\n\tExcellent observational, reporting, and documentation skills.\n\tStrong communication and interpersonal skills.\n\tAbility to work independently and under pressure in a dynamic environment.\n\n\nSalary\nN250,000 Monthly. \n\nMethod of Application\nInterested and qualified candidates should send their CV and a cover letter to: eandg.tprecruiters@gmail.com using \"HSE Officer - Port Harcourt\" as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]