[
  {
    "title": "Procurement Officer Job at PC Planet Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/procurement-officer-job-at-pc-planet-limited",
    "pubDate": "Mon, 23 Jun 2025 19:36:43 GMT",
    "source": "JobGurus",
    "keyword": "pc planet limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "PC Planet Limited is Nigeria’s leading Online IT vendor, offering a large variety of IT products and services, at unbeatable low prices while providing our customers a superior and exciting shopping experience.\n\nWe are recruiting to fill the position below:\n\nJob Position: Procurement Officer\n\nJob Location: Ikeja, Lagos\nJob Type: Full-time\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tSource and negotiate with vendors and suppliers for quality products and competitive pricing\n\tReview and analyze purchase requests, quotations, and specifications\n\tProcess and manage purchase orders, invoices, and delivery timelines\n\tEnsure compliance with company procurement policies and industry best practices\n\tEvaluate vendor performance and recommend improvements or alternatives\n\tMonitor stock levels and place orders as needed to avoid shortages or overstocking\n\tMaintain accurate records of purchases, pricing, delivery, and inventory\n\tWork closely with the finance, sales, and technical teams to ensure operational alignment\n\tStay updated on market trends and potential suppliers.\n\n\nRequirements\n\n\n\tA Bachelor’s Degree or equivalent from a recognized institution\n\tMinimum of 1–3 years of relevant experience in procurement or supply chain\n\tStrong analytical and negotiation skills\n\tExcellent verbal and written communication skills\n\tFamiliarity with ICT/computer hardware products is an added advantage\n\tProficient in Microsoft Excel, Google Workspace, and digital communication tools\n\tStrong attention to detail and organizational skills\n\tAbility to work independently and within a team\n\tMust reside in or around Ikeja or be willing to relocate\n\n\nSalary\nN150,000 - N200,000 / month.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hr@pcplaceng.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Accountant Job at R.A Think Design",
    "link": "https://www.jobgurus.com.ng/jobs/view/accountant-job-at-ra-think-design",
    "pubDate": "Mon, 23 Jun 2025 19:36:43 GMT",
    "source": "JobGurus",
    "keyword": "r.a think design",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "R.A Think Design is Nigeria's foremost manufacturer of custom interior designs. R.A. Think Design is an Israeli-Nigerian Interior Design and Custom-made Furniture company that caters to commercial and residential projects.\n\nWe are recruiting to fill the position below:\n\nJob Position: Accountant\n\nJob Location: Ketu Ikosi, Lagos\nEmployment Type: Full-time\n\nJob Descriptions\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDevelop and manage budgets, forecasts, and financial models.\n\tAnalyze financial performance and provide insights to senior management.\n\tIdentify areas for cost reduction and efficiency improvements, especially in production and logistics.\n\tMonitor and analyze inventory costs, stock levels, and wastage.\n\tWork closely with production and procurement to ensure cost-effective operations.\n\tImplement costing strategies for raw materials and finished goods.\n\tOversee daily accounting operations including AP/AR, general ledger, and payroll.\n\tEnsure accurate and timely preparation of monthly, quarterly, and annual financial reports.\n\tMaintain compliance with local tax laws, regulations, and accounting standards.\n\tMonitor cash flow to ensure sufficient liquidity for operations.\n\tManage banking relationships, payment processing, and cash forecasting.\n\tEstablish and enforce strong internal controls and audit trails.\n\tEnsure compliance with company policies, government regulations, and industry standards.\n\tLiaise with external auditors and regulatory bodies.\n\tProvide financial insights for strategic decisions (e.g., expansion, pricing, new product lines).\n\tSupport management in long-term business planning and investment decisions.\n\tContribute to procurement and pricing strategies, especially for raw materials and imported items.\n\tSupervise junior finance staff and accountants.\n\tTrain and mentor the finance team to improve efficiency and accuracy.\n\tFoster collaboration between finance, operations, sales, and production departments.\n\n\nJob Requirements\n\n\n\tB.Sc / MSc in Accounting, or related field\n\t3 years of experience in the field preferably manufacturing industry\n\tprofessional certified (ICAN), (ACCA)\n\tFiling of corporate tax returns.\n\tExperience in providing financial advice.\n\tExperience in Financial Auditing\n\tKnowledge of SAGE, QuickBooks and other accounting software\n\tDetail Oriented and good analytical skills\n\tDiligent and honest.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: admin@ra-nigeria.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Technical Procurement Officer Job at Eunisell Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/technical-procurement-officer-job-at-eunisell-limited",
    "pubDate": "Mon, 23 Jun 2025 19:36:43 GMT",
    "source": "JobGurus",
    "keyword": "eunisell limited",
    "duplicate": false,
    "classifications": [],
    "content": "Eunisell Limited is a specialty chemicals and engineering solutions company, supplying key chemicals and production solutions to a wide range of customers operating in the downstream oil and gas, automotive and industrial sectors in Africa.\n\nWe are a market leader in designing, formulating and producing oilfield chemicals for production and completions applications. With a focus on delivering differentiated chemical technologies to drive performance, we support customers and projects in 5 deep-water assets in Nigeria.\n\nWe are recruiting to fill the position below:\n\nJob Position: Technical Procurement Officer\n\nJob Location: Rivers\nEmployment Type: Full-time\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nKey Job Responsibilities\n\n\n\tResponsible for strategic sourcing, negotiation and procurement of engineering/technical equipment, materials,consumables, machines, services, and projects.\n\tThe job holder will work closely with internal stakeholders, suppliers, and vendors to ensure the timely and cost-effective acquisition of high-quality technical products and services.\n\n\nEssential Duties And Responsibilities\n\n\n\tEnsures prompt procurement of engineering spares, consumables, equipment, machines, services and projects in line with company’s procurement policy.\n\tLiaises with user departments and suppliers to ensure that items/services procured meet required specifications.\n\tConducts regular market/price intelligence survey to ensure competitiveness on items and services procured.\n\tEnsures purchase orders are executed promptly as required to foster effective delivery of purchased materials/services for uninterrupted operations.\n\tWorks with a cross-functional team to schedule and monitor assigned projects and ensure they are completed within the stipulated budget and time frame.\n\tPrepares monthly reports on procurement activities.\n\tAny other responsibility as assigned from time to time\n\tDevelop service level agreements with vendors and contractors.\n\tConducts the annual vendors’/contractors’ performance evaluation process, prepares the performance evaluation report and gives recommendations to concerned stakeholders.\n\tEstablishes mutually beneficial, ethical and healthy relationships with vendors/contractors to achieve quality standards and improvements on a continuous basis.\n\tSource, evaluate, and select suppliers for technical equipment, materials, and services.\n\tMonitor and track orders to ensure timely delivery and resolve any issues or delays.\n\n\nCompetencies Required For The Role:\n\n\n\tIn-depth knowledge of best practices in procurement and supply chain management\n\tExcellent oral and written communication skills\n\tStrong negotiation skill\n\tMust have an eye for detail, a drive for efficiency, and a passion for creativity and innovation\n\tAble to establish and maintain effective working relationships with external and internal stakeholders\n\tAnalytical and Proactive\n\tProficient in the use of Microsoft Office Suite, ERP – Microsoft Navision\n\n\nQualification\n\n\n\tA Bachelor’s Degree or HND qualification in Engineering or related discipline.\n\tMinimum of 4 years of cognate experience in similar role.\n\tMembership of relevant Professional bodies.\n\tStrong understanding of technical products, equipment, and services within the oil & gas & engineering sector.\n\tStrong analytical and problem-solving skills, with the ability to make data-driven decisions.\n\tHighly organized, detail-oriented, and able to manage multiple tasks simultaneously.\n\tKnowledge of industry regulations and best practices in procurement\n\n\nMethod of Application\nInterested and qualified candidates should send their updated CV to recruitment@eunisell.com using the Job Position as the subject of their mail    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Restaurant Manager Job at Greystone Consulting Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/restaurant-manager-job-at-greystone-consulting-limited-2",
    "pubDate": "Mon, 23 Jun 2025 19:36:43 GMT",
    "source": "JobGurus",
    "keyword": "greystone consulting limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Greystone Consulting Limited - Our client, a fast growing Restaurant company, is recruiting to fill the position below:\n\nJob Position: Restaurant Manager\nJob Location: Ejigbo, Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAre you passionate about food, customer service, and leading high-performing teams?\n\tOur client is hiring a Restaurant Manager to oversee the daily operations of our fast-food restaurant in Lagos.\n\tIf you’re goal-driven, energetic, and thrive in a fast-paced environment, we’d love to meet you!\n\tOur client is looking to add a Restaurant manager that would be responsible for driving revenue growth by identifying new business opportunities, maintaining relationships with clients, and promoting the restaurant’s offerings to corporate and individual customers.\n\tThis role combines sales expertise with deep knowledge of food and hospitality services to increase brand visibility and boost customer engagement.\n\n\nKey Responsibilities\n\n\n\tLead and supervise daily restaurant operations to ensure smooth service\n\tDrive customer satisfaction through excellent service delivery\n\tManage staff scheduling, training, and performance\n\tMaintain high standards of food quality, hygiene, and safety\n\tMonitor inventory and manage stock levels efficiently\n\tHandle customer complaints promptly and professionally\n\tAchieve sales targets and manage budgetary controls.\n\n\nRequirements\n\n\n\tMinimum of OND / HND / BSc in Hospitality, Business, or related field\n\tAt least 2 years of experience in a supervisory/managerial role in a fast-food or hospitality setting\n\tStrong leadership and people management skills\n\tSound knowledge of food safety and quality standards\n\tExcellent communication and problem-solving skills\n\tAbility to multitask and work under pressure.\n\n\nMethod of Application\nInterested and qualified candidates can send their CVs to: consultgreystone@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]