[
  {
    "title": "Legal Manager Job at Human Capital Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/legal-manager-job-at-human-capital-group",
    "pubDate": "Fri, 20 Jun 2025 18:48:05 GMT",
    "source": "JobGurus",
    "keyword": "human capital group",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Human Capital Group, a Financial Leasing Company, is recruiting to fill the position below:\n\nJob Position: Legal Manager\nJob Location: Lagos\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tIdentify and manage group legal risks\n\tProvide legal advice on the company’s transaction and other matters concerning the company\n\tManage the group companies’ relationships with external solicitors and ensure that the group is properly represented in all litigations concerning it.\n\tProvide statutory Company Secretarial services and act as Secretary to the Board of Directors and all standing committees of the group\n\tProvide advice on, interpret, and communicate all legal issues, opinions, laws, rules, guidelines statutes, especially as regards Group businesses, to staff and management\n\tProvide firm but fair opinions on all legal matters to the company\n\tReview, and draft MOUs, legal agreements, and security documentation between the group and external parties: and among the individual companies in the group\n\tLiaise with legal departments of external organizations\n\tLiaise with government agencies for the smooth running of the group (such as filing of papers at CAC etc.).\n\tContinuously monitor compliance with statutory obligations and advise management accordingly.\n\tMentor Staff of the Legal department, Lead and mentor the legal team, fostering a culture of excellence and collaboration.\n\n\nJob Requirements\n\n\n\tBachelor’s degree in Law (LLB).\n\tA minimum of 8 years of legal experience, with at least 4 years in a leadership role.\n\tExceptional contract negotiation and drafting skills.\n\tProven experience managing litigation and regulatory matters.\n\tExcellent analytical, problem-solving, and decision-making skills.\n\tStrong interpersonal and communication skills, with the ability to influence and build relationships at all levels.\n\tDemonstrated leadership and team management experience.\n\n\nSalary\nN400,000 per month.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: humancapitalgroupng@gmail.com using \"Legal Manager\" as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Content Creator Job at BlueBrain Services Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/content-creator-job-at-bluebrain-services-limited",
    "pubDate": "Fri, 20 Jun 2025 18:48:05 GMT",
    "source": "JobGurus",
    "keyword": "bluebrain services limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "BlueBrain Services Limited is a human resources services, capacity building, and development project management consulting firm managed by experienced corporate professionals in human resources management, financial services, project management, business development, capacity building, and knowledge management. We offer bespoke solutions and recent innovations to our clients in a bid to make them go ahead of their competition.\nWe aim to become one of the top five financial consulting firms in the country.\n\nOur ambition is to deliver quality support services to private and public sector organizations, especially in specialized areas supporting decision-making from operational results.\n\nWe are recruiting to fill the position below:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Position: Content Creator\n\nJob Location: Abeokuta, Ogun\nEmployment Type: Full-time\n\nJob Purpose\n\n\n\tThe Content Creators will update content for the organisation website and engage customers using the social media platform.\n\n\nJob Description\n\n\n\tWriting, reviewing, editing, and updating content for company websites, blogs, marketing materials, and similar platforms.\n\tConducting research and interviews to learn more about current trends, developments, and perceptions about the subject matter, and then contextualizing your findings.\n\tAssisting the creative team with the design of promotional materials.\n\tUsing social media to engage consumers, respond to questions or complaints, and to promote company initiatives.\n\tCollaborating with internal departments to establish campaign objectives, complete tasks, and identify and solve problems.\n\tMonitoring social media and company website metrics.\n\tExcellent writing and editing skills.\n\tAbility to create engaging and compelling content.\n\tKnowledge of SEO and content marketing strategies.\n\tUtilizing SEO methods to increase site traffic.\n\tSuggesting new ways to promote company offerings and to reach consumers.\n\tBe able to create content, and use electronic gadgets.\n\tExperience with content management systems.\n\tDevelop content strategies, script for documentaries.\n\tCreate and publish engaging content for various platforms such as website, social media, blog, etc.\n\tDevelop content that encourages community interaction, such as Q&A sessions, polls, challenges, live streams and webinars.\n\tConduct research to stay up-to-date with industry trends and best practices.\n\tCollaborate with other teams such as marketing and design to create content that aligns with the company’s goals and brand identity.\n\tOptimize content for search engines and social media platforms to increase visibility and reach.\n\tAnalyze content performance metrics such as views, engagement, and conversion rates to inform future content strategies.\n\n\nRequirements\n\n\n\tBachelor’s Degree in Mass Communication, Journalism or any related field.\n\tMinimum of 2 years of experience in the role.\n\tExperience in Agribusiness or farming-related field will be highly recommended.\n\tStrong I.T knowledge and experience (Word, Excel, PowerPoint, Outlook.\n\tExcellent Report Writing skills.\n\tAbility to meet deadline.\n\tHigh level of commitment, honesty and enthusiasm.\n\tExcellent problem-solving, analytical, skills.\n\tExcellent verbal, written communication and research skills.\n\tAbility to pay attention to detail.\n\tExcellent interpersonal skill.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Executive Assistant to the Managing Director (Male) Job at Human Capital Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/executive-assistant-to-the-managing-director-male-job-at-human-capital-group",
    "pubDate": "Fri, 20 Jun 2025 18:48:05 GMT",
    "source": "JobGurus",
    "keyword": "human capital group",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Human Capital Group, a Financial Leasing Company, is recruiting to fill the position below:\n\nJob Position: Executive Assistant to the Managing Director (Male)\n\nJob Location: Victoria Island, Lagos\n\nEmployment Type: Full-Time (Onsite)\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAs the Executive Assistant to the Managing Director, you will play a crucial role in ensuring the efficient operation of the executive office.\n\tYou will be responsible for a wide range of tasks that require meticulous attention to detail, excellent organizational skills, and the ability to handle sensitive information with discretion.\n\n\nKey Responsibilities\n\n\n\tProvide comprehensive administrative support to the Managing Director, including managing calendars, scheduling meetings, and coordinating travel arrangements.\n\tAct as the primary point of contact between the Managing Director and internal/external stakeholders. Handle correspondence, draft emails, and manage communication flow.\n\tConduct research and gather information to support decision-making processes. Provide analysis and summaries of key data.\n\tCoordinate company events, meetings, and conferences, ensuring all logistics are handled seamlessly.\n\tOrganize and prepare for meetings, including drafting agendas, taking minutes, and following up on action items.\n\tAssist in the planning and execution of special projects, ensuring timely completion and alignment with company objectives.\n\tPrepare, review, and organize documents, reports, and presentations. Maintain accurate and organized records and filing systems.\n\tHandle confidential information with utmost discretion and professionalism.\n\n\nJob Requirements\n\n\n\tBachelor’s Degree in Business Administration, Management, or a related field preferred.\n\tMinimum of 2 years of experience as an Executive Assistant, Secretary, Personal Assistant etc preferably supporting senior executives.\n\tExceptional organizational and time management skills.\n\tStrong written and verbal communication abilities.\n\tProficiency in Microsoft Office Suite (Word, Excel, PowerPoint, Outlook).\n\tAbility to prioritize and manage multiple tasks simultaneously.\n\tStrong problem-solving skills and attention to detail.\n\tAbility to work independently and as part of a team.\n\tProfessional demeanor and ability to handle sensitive information with discretion.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: humancapitalgroupng@gmail.com using \"Executive Assistant to the Managing Director\" as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Data Engineer Job at Dufil Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/data-engineer-job-at-dufil-group",
    "pubDate": "Fri, 20 Jun 2025 18:48:05 GMT",
    "source": "JobGurus",
    "keyword": "dufil group",
    "duplicate": false,
    "classifications": [
      "Software Engineering"
    ],
    "content": "Dufil Group has had a remarkable impact on the Nigerian culinary Landscape. Their Product, Indomie Instant Noodles which appeals to several demographic groups has grown to become a household name across the country. The group, which is a joint venture between Tolaram Group of Singapore and Salim Group of Indonesia, currently has 3 factories. The First; De United Foods Industries limited which was commissioned in 1995 in Ota Ogun State, is the First Instant Noodles Manufacturing Plant in Nigeria and the Largest in Africa\n\nWe are recruiting to fill the position below:\n\nJob Position: Data Engineer\nJob Location: Nigeria\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a skilled and experienced Data Engineer to join our Data and Analytics  team.\n\tThe ideal candidate will have a strong background in building and maintaining  scalable data pipelines, optimizing data flow, and working with various data infrastructure  technologies.\n\tThis role is critical in ensuring the seamless integration and accessibility of  data across the organization, enabling data-driven decision making and insights.\n\n\nKey Responsibilities\n\n\n\tData Pipeline Development\n\tData Integration and Management\n\tData Quality and Governance\n\tCollaboration and Support\n\tContinuous Improvement.\n\n\nRequirements / Qualifications\n\n\n\tBachelor’s Degree  (First class Graduate) in Computer Science, Information Technology,  Engineering, or a related field.\n\t2+ years of experience in data engineering or related roles\n\tMaster’s degree or relevant certification in data engineering, data  science, or big data technologies is a plus.\n\tProven track record of designing and implementing data pipelines and  ETL processes.\n\n\nTechnical Skills:\n\n\n\tProficiency in programming languages such as Python, Java, or Scala.\n\tStrong knowledge of SQL and experience with relational databases (e.g.,  MySQL, PostgreSQL) and NoSQL databases (e.g., MongoDB, Cassandra).\n\tExperience with data processing frameworks and tools such as Apache  Spark, Hadoop, or Kafka.\n\tFamiliarity with cloud platforms and services (e.g., AWS, Azure, Google  Cloud) for data storage and processing.\n\n\nAnalytical Skills: \n\n\n\t Excellent problem-solving skills and attention to detail.\n\tAbility to work with large datasets and perform data analysis to derive insights.\n\n\nSoft Skills:\n\n\n\tStrong communication and collaboration abilities.\n\tAbility to work in a fast-paced, dynamic environment and manage  multiple tasks effectively.\n\n\nNote: Only successful applicants will be contacted.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "HSE Manager Job at Human Capital Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/hse-manager-job-at-human-capital-group",
    "pubDate": "Fri, 20 Jun 2025 18:48:05 GMT",
    "source": "JobGurus",
    "keyword": "human capital group",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Human Capital Group, a Financial Leasing Company, is recruiting to fill the position below:\n\nJob Position: HSE Manager\n\nJob Location: Victoria Island, Lagos\nWork mode: On Site\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDevelop, implement, and maintain health, safety, and environmental policies and procedures in compliance with local, state, and federal regulations.\n\tInvestigate accidents or incidents to determine causes and to find ways to prevent future occurrences.\n\tUndertake risk assessments\n\tLiaise with external HSE regulatory bodies and ensure compliance with local, state, and federal environmental, health, and safety regulations\n\tEnsure proper documentation of HSE-related activities and events\n\tCarry out safety induction and safety awareness for new joiners\n\tConduct regular inspections and audits of facilities, equipment, and processes to identify potential hazards and ensure compliance with safety standards.\n\tCoordinate emergency response plans and procedures, including drills and training for emergency response teams.\n\tWork with the Facility Managers in the disposal of hazardous waste following legal and environmental requirements\n\tProvide training and support to employees on safety protocols, procedures, and best practices.\n\tMonitor and analyze safety data and metrics to identify trends and areas for improvement.\n\tCollaborate with cross-functional teams to integrate safety and environmental considerations into planning and decision-making processes.\n\n\nJob Requirements\n\n\n\tBachelor's Degree in Engineering, Environmental Science, or a related field.\n\tMinimum of Four years of experience as an HSE Officer, or a similar role.\n\tStrong knowledge of health, safety, and environmental regulations and standards.\n\tProven experience developing and implementing safety programs and initiatives.\n\tExcellent communication and interpersonal skills, with the ability to effectively engage with employees at all levels of the organization.\n\tStrong analytical and problem-solving skills, with the ability to identify risks and develop practical solutions.\n\tCertification in Occupational Health and Safety (e.g. HSE 123 NEBOSH, IOSH etc) will be an added advantage.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: humancapitalgroupng@gmail.com using \"HSE Manager\" as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]