[
  {
    "title": "Job Openings at Primly Premium Solutions Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-primly-premium-solutions-limited",
    "pubDate": "Fri, 26 Sep 2025 10:15:29 GMT",
    "source": "JobGurus",
    "keyword": "primly premium solutions limited",
    "duplicate": false,
    "classifications": [
      "Software Engineering",
      "Marketing"
    ],
    "content": "Primly Premium Solutions Limited is an indigenous company specialised in Information Technology using high level technology to identify gaps in systems and create innovative solutions to bridge those gaps. We offer other services and products such as Healthcare, Telecom, Manufacturing, and Business consulting.\n\nAt Primly Premium Solutions, we are passionate in the pursuit of excellence and financial success with uncompromising services and integrity which is why we are in the industry to make a positive mark.\n\nWe are recruiting to fill the following positions below:\n\n1.) IT Assistant\n\nJob Location: Abuja (FCT)\n\nSummary\n     \n\n            \n    \n\n\n\n\n\tPPS is seeking a trainable IT Assistant to provide administrative and first-level technical support to team members.\n\n\nJob Description\nOffice Assistance:\n\n\n\tAssist team members with organizing files, scanning documents, making photocopies, and scheduling meetings.\n\tProcess orders for equipment, including sourcing vendors, obtaining invoices, and processing requests.\n\tCollect and receive orders from vendors, distribute orders to various centers, and run other errands as needed.\n\tPerform clerical and administrative tasks to support the IT Team.\n\tRecord information in databases and generate reports and documents.\n\tAssist with the configuration and connection of peripheral equipment (e.g., printers, monitors, scanners) to computer systems.\n\tProvide basic equipment support across centers, including setup, troubleshooting, and cleaning of hardware.\n\tPerform routine checks on CCTV systems, attendance scanners, walkie-talkies, and other IT gadgets to ensure proper functionality.\n\tRun daily website downtime tests and generate monthly reports to track performance.\n\n\nBasic IT Support & Troubleshooting:\n\n\n\tAssist in the installation and configuration of Windows operating systems and software applications, ensuring systems are up-to-date.\n\tTroubleshoot and resolve basic hardware and software issues, escalating to senior IT staff when necessary.\n\n\nApplication Testing:\n\n\n\tTest and retest multiple web and mobile applications.\n\tIdentify bugs, software defects, and inconsistencies.\n\tRecord bugs, glitches, and other flaws identified during testing.\n\tCreate and regularly update logs to document testing phases and defects.\n\n\nOther:\n\n\n\tRecord and log all interactions (queries, incidents, and resolutions) in relevant logs.\n\tCreate and maintain reports using Google Sheets or Microsoft Excel, analyzing data and tracking IT-related performance metrics.\n\tMaintain a database of all equipment (Computers, Keyboards, Wireless Adapters, Routers, etc.).\n\tPerforms miscellaneous job-related duties as assigned.\n\n\nRequirements\n\n\n\tMinimum of a Diploma or equivalent in a relevant field.\n\tIT certifications (e.g., CompTIA, Microsoft) are an advantage.\n\tExperience with CCTV installation and maintenance.\n\tAbility to perform basic laptop repairs (e.g., replacing hard drives, system setup).\n\tProficient in Microsoft Excel, including the use of formulas.\n\tAbility to deliver basic training to staff.\n\tFamiliar with office equipment like printers, scanners, and copiers.\n\tMinimum typing speed of 45 words per minute.\n\tStrong communication skills (verbal and written).\n\tAbility to handle confidential information.\n\tPhysically able to lift equipment and work in various postures.\n\tCan manage high-pressure situations and pay attention to detail.\n\n\nApplication Closing Date: 1st November, 2025.\n\nMethod of Application\nInterested and qualified candidates should forward their CVs (PDF Format) to: jobs@primlypremiumsolutions.com.ng using the Job Position as the subject of the mail.\n\nNote: Feel free to include relevant certifications.\n\n \n\n \n\n2.) IT Operations & Web Specialist\n\nJob Location: Abuja (FCT) \nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe are seeking a versatile IT professional with strong web development experience who is also comfortable with systems administration, user support, and managing IT infrastructure across multiple organisations.\n\tYou’ll work closely with the IT Lead to support operations across multiple hospitals and business units within our group. If you enjoy working across development, IT operations, and projects that have real-world impact, we’d love to hear from you.\n\n\nKey Responsibilities\nWeb Development & Product Support:\n\n\n\tBuild, maintain, and update internal and external websites using Laravel, HTML, CSS, JavaScript\n\tWork closely with external developers on new product rollouts and updates\n\tMonitor the uptime and performance of all websites using monitoring tools\n\tSupport in app and web project testing, including bug logging, feedback collection, and user experience improvement\n\tMaintain project trackers, SOPs, and documentation\n\tServe as a liaison between IT, management, vendors, and end users\n\tTrack KPIs such as system uptime, resolution times, and adoption rates\n\n\nERP & System Deployment:\n\n\n\tLead or support the deployment of ERP systems to client organisations\n\tHandle data migration, user setup, and system configuration\n\tPlan and oversee multiple training sessions for staff across departments\n\tWork directly with end-user departments to ensure full adoption and ongoing support\n\tMaintain a centralized knowledge base (FAQs, guides, walkthroughs)\n\n\nCloud & Server Management:\n\n\n\tManage AWS EC2 servers and cloud infrastructure; monitor performance and billing\n\tOversee domain and DNS management, web hosting accounts, and server security\n\tUse cPanel and WHM to maintain hosting environments and handle deployment\n\n\nIT Infrastructure & Technical Support:\n\n\n\tProvide hands-on and remote technical support to staff across multiple locations\n\tSet up and troubleshoot laptops, network devices, printers, and peripherals\n\tManage and respond to tickets, escalating complex issues as needed\n\tAssist in maintaining basic cybersecurity protocols across devices and platforms\n\tSupport phishing simulations, password policies, and user awareness training\n\tDocument and monitor IT risks and coordinate with the IT Lead on response actions.\n\n\nQualifications\nRequired:\n\n\n\tBSc or HND in Computer Science, Information Technology, Engineering, or related field\n\t5 years of Web development experience in one or more of the following: HTML, CSS, JavaScript, PHP, Laravel, WordPress, React, or Vue\n\tExposure to version control systems like Git\n\tFamiliarity with APIs and basic database queries.\n\n\nYou might be a fit if:\n\n\n\tYou're a developer who’s also comfortable with broader IT responsibilities\n\tYou enjoy working on multiple systems, not just one product or tool\n\tYou want to grow into a leadership or senior IT role, not stay purely in development\n\tYou have experience supporting non-technical users and managing rollouts at scale\n\tYou like variety, working cross-functionally, and solving real-world business problems.\n\n\nApplication Closing Date: 1st November, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV (PDF Format) and a cover letter to: jobs@primlypremiumsolutions.com.ng using the Job Position as the subject of the mail. \n\nNote\n\n\n\tIf you are passionate about technology, we encourage you to apply!\n\tFeel free to include relevant certifications.\n\n\n \n\n \n\n3.) Senior IT Officer\n\nJob Location: Abuja (FCT) \n\nJob Summary\n\n\n\tThe ideal candidate will manage our websites, cloud services, and IT systems while providing hands-on technical support. This role requires a solid understanding of web technologies and cloud platforms like AWS and cPanel.\n\tExperience with hardware setup or repair, CCTV installation, and tools like 3CX is a strong advantage.\n\n\nKey Responsibilities\n\n\n\tDevelop and maintain websites using frameworks and tools such as Laravel, HTML, CSS, and JavaScript.\n\tKeep all websites running smoothly with minimal downtime; set up tools to monitor uptime and performance.\n\tManage domain names, web hosting accounts, DNS settings, and use tools like cPanel and WHM.\n\tMonitor and maintain our AWS cloud servers (ensure they are funded, online, and running efficiently).\n\tWork with the SEO team to improve website search rankings and technical performance.\n\tLead web and app projects, from idea stage to launch, including planning, setting milestones, testing, and working with external developers.\n\tProvide IT support to team members across multiple office locations (remotely or on-site).\n\tHelp with troubleshooting software, hardware, and connectivity issues.\n\tAssist in managing overall IT infrastructure with the internal team.\n\tSupport and coordinate other general IT tasks as needed across departments.\n\tSet up and troubleshoot email accounts (Outlook, Gmail), Google Drive, and other cloud-based applications used by the organisation.\n\tSupport in resolving helpdesk requests, prioritising urgent issues, and escalating when necessary.\n\tAssist with CCTV system installation, maintenance, and repairs.\n\tUse and support communication tools like 3CX VoIP phone systems.\n\tOther duties as assigned\n\n\nQualifications\n\n\n\tBachelor’s Degree in Computer Science, Information Technology, or a related field.\n\tStrong experience with Laravel, HTML, CSS, and general web development.\n\tKnowledge of cPanel, WHM, domain management, and web hosting.\n\tExperience managing AWS cloud infrastructure (especially EC2 instances).\n\tHands-on experience with IT support – troubleshooting laptops, software, network issues, etc.\n\tFamiliarity with CCTV setup and repair is an added advantage.\n\tExperience with 3CX or similar VoIP systems is a plus.\n\tAbility to communicate technical issues clearly to both technical and non-technical staff.\n\tRelevant IT certifications (Microsoft, CompTIA, AWS, Laravel, etc.) are a plus.\n\n\nApplication Closing Date: 30th September, 2025.\n\nMethod of Application \nInterested and qualified candidates should send their CV (PDF Format) and a cover letter to: jobs@primlypremiumsolutions.com.ng using the Job Position as the subject of the mail. \n\nNote\n\n\n\tIf you are passionate about technology, we encourage you to apply!\n\tFeel free to include relevant certifications.\n\n\n     \n\n    \n\n        Click here to Apply",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]