[
  {
    "title": "DevOps Engineer Job at Ecobank Nigeria Plc",
    "link": "https://www.jobgurus.com.ng/jobs/view/devops-engineer-job-at-ecobank-nigeria-plc",
    "pubDate": "Thu, 05 Jun 2025 13:50:30 GMT",
    "source": "JobGurus",
    "keyword": "ecobank nigeria plc",
    "duplicate": false,
    "classifications": [
      "Software Engineering"
    ],
    "content": "Ecobank Transnational Incorporated (ETI), a public limited liability company, was established as a bank holding company in 1985 under a private sector initiative spearheaded by the Federation of West African Chambers of Commerce and Industry with the support of the Economic Community of West African States (ECOWAS).\n\nWe are recruiting to fill the position below:\n\nJob Position: DevOps Engineer\n\nJob Identification: 953\nJob Location: Victoria Island, Lagos\nJob Type: Full-time\n\nJob Purpose\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe DevOps Engineer plays a pivotal role in designing, implementing, and managing the automation of development, testing, and deployment processes.\n\tThe role involves building scalable, reliable, and secure infrastructure, optimizing workflows, and ensuring seamless collaboration between development and operations teams.\n\tA successful candidate will have a strong technical background, a problem-solving mindset, and experience with modern DevOps tools and practices.\n\n\nKey Responsibilities\nCI/CD Pipeline Development and Maintenance:\n\n\n\tDesign, implement, and optimize Continuous Integration/Continuous Deployment (CI/CD) pipelines.\n\tCollaborate with development teams to automate code builds, tests, and deployments.\n\tInfrastructure Automation:\n\tDevelop Infrastructure-as-Code (IaC) solutions using tools like Terraform, CloudFormation, or Ansible.\n\tAutomate provisioning, configuration, and management of cloud and on-premises infrastructure.\n\n\nCloud Infrastructure Management:\n\n\n\tDeploy and manage cloud-based solutions on platforms such as AWS, Azure, Google Cloud Platform (GCP) or Oracle Cloud Infrastructure (OCI).\n\tEnsure scalability, reliability, and security of cloud-based infrastructure.\n\n\nMonitoring and Incident Management:\n\n\n\tSet up and maintain monitoring and alerting systems using tools like Prometheus, Grafana, Datadog, or CloudWatch.\n\tIdentify and resolve performance bottlenecks and ensure high system availability.\n\tParticipate in on-call rotations to respond to critical incidents.\n\n\nSecurity and Compliance:\n\n\n\tImplement security best practices, including vulnerability assessments and patch management.\n\tEnsure compliance with industry standards and organizational policies.\n\n\nCollaboration and Process Improvement:\n\n\n\tWork closely with software development, QA, and operations teams to align processes and practices.\n\tAdvocate for and implement DevOps best practices across the organization.\n\n\nContinuous Learning and Innovation:\n\n\n\tStay updated with emerging DevOps trends, tools, and technologies.\n\tEvaluate and integrate new tools and technologies to improve efficiency and reliability.\n\n\nKey Performance Indicators\n\n\n\tUptime and reliability of systems and infrastructure.\n\tEfficiency and effectiveness of CI/CD pipelines.\n\tSuccessful automation of infrastructure provisioning and management.\n\tReduction in incident resolution time and improved system performance.\n\tAdoption of DevOps best practices and tools across teams.\n\n\nKnowledge, Skills & Experience\nEducation:\n\n\n\tBachelor’s Computer Science, Software Engineering, or a related field.\n\tMaster’s degree in related field will be an added advantage.\n\n\nExperience:\n\n\n\t3 - 5+ years of hands-on experience in DevOps or related roles.\n\tProven experience in deploying and managing CI/CD pipelines and cloud infrastructure.\n\n\nTechnical Skills:\n\n\n\tProgramming & Scripting: Proficiency in scripting languages like Python, Bash, or PowerShell.\n\tVersion Control: Expertise with Git and repository management tools like GitHub, GitLab, or Bitbucket.\n\tCI/CD Tools: Proficiency with Jenkins, GitHub Actions, GitLab CI/CD, Azure DevOps, Rancher, ArgoCD, Spinnaker, or similar tools.\n\tContainerization & Orchestration: Strong experience with Docker and Kubernetes.\n\tInfrastructure-as-Code (IaC): Hands-on experience with Terraform, Ansible, or CloudFormation.\n\tCloud Platforms: Advanced knowledge of AWS, Azure, GCP, OCI services and architecture.\n\tMonitoring & Logging: Proficiency with tools like Dynatrace, Prometheus, Grafana, ELK Stack, Datadog, or CloudWatch.\n\tSecurity: Understanding of security best practices, including IAM, encryption, and vulnerability assessments.\n\n\nSoft Skills:\n\n\n\tStrong problem-solving and analytical skills.\n\tExcellent communication and collaboration abilities.\n\tAbility to work independently and take ownership of tasks.\n\tAttention to detail and commitment to delivering high-quality solutions.\n\tKey Performance Indicators (KPIs):\n\tUptime and reliability of CI/CD pipelines and infrastructure.\n\tEfficiency improvements in deployment processes and workflows.\n\tSuccessful implementation of automation and infrastructure improvements\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Farm Secretary Job at Fave Consulting",
    "link": "https://www.jobgurus.com.ng/jobs/view/farm-secretary-job-at-fave-consulting",
    "pubDate": "Thu, 05 Jun 2025 13:50:30 GMT",
    "source": "JobGurus",
    "keyword": "fave consulting",
    "duplicate": false,
    "classifications": [],
    "content": "Fave consulting is a Human Resources Management and consultancy firm that specializes in strategic HR management to enhance business growth, performance and transformation.\n\nWe are recruiting to fill the position below:\n\nJob Position: Farm Secretary\n\nJob Location: Kubwa, Abuja (FCT)\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe are looking for a dedicated and efficient Secretary to join our team.\n\tThe ideal candidate must be someone willing to work and stay in Kubwa.\n\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tCosting and ordering supplies\n\tEnsuring all payments are made on time\n\tStaying on top of general administrative duties\n\tPreparing accounts and budgets, and monitoring cash flows\n\tGetting quotes for machinery and other purchases\n\tDealing with suppliers and customers\n\tKeeping accurate records and storing them effectively\n\n\nRequirements\n\n\n\tSSCE, NCE, HND OR BSC.\n\tMinimum of 1 year of  working experience\n\tGood communication skills\n\tSecretarial skills.\n\n\nSalary\nN50,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV and Cover Letter in PDF to: recruitment@faveconsulting.com using the Job Position \"Secretary Position \" as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Vacancies at One Trust Asset Management Company",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancies-at-one-trust-asset-management-company",
    "pubDate": "Thu, 05 Jun 2025 13:50:30 GMT",
    "source": "JobGurus",
    "keyword": "one trust asset management company",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "One Trust Asset Management Company is a forward-thinking investment firm committed to delivering innovative financial solutions that drive sustainable wealth creation. Our focus spans across asset management, investment advisory, and portfolio optimization tailored to the evolving needs of individuals, institutions, and corporate clients.\n\nWe pride ourselves on a disciplined approach to investment, strong governance, and a deep understanding of market dynamics. At One Trust, we believe in integrity, transparency, and excellence—values that shape our client relationships and corporate culture.\n\nWe are recruiting to fill the following positions below:\n\n1.) Researcher\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Location: Lagos\n\nJob Role\nResponsibilities will include:\n\n\n\tConducting in-depth research andvaluations of companies listed and unlisted\n\tMaintaining industry/sector information, analysis and data\n\tConducting macro and micro, business and financial statementanalysis and develop strategic and tactical views on the markets\n\tPreparing feasibility/investment reports(including highlighting key transaction risks) from both a debtand equity funding perspective and making recommendations\n\tCash flow modelling, portfolio construction and analysis\n\n\nRequirements\n\n\n\tBachelor’s degree in any related field of study, a Master’s degree will be an added advantage\n\tPortfolio modelling and construction\n\tDuration Management\n\tValuation of Bonds, Treasury Bills and other fixed income instruments\n\tExecute Fixed Income transactions\n\tCredit modelling & monitoring.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: info@onetrustassetmanagement.com.ng using the Job Position as the subject of the email.\n\n \n\n \n\n2.) Head of Business Development\n\nJob Location: Lagos\n\nResponsiblities\n\n\n\tEnsure seamless onboarding of new clients, including KYC documentation, account setup, and platform navigation.\n\tProvide proactive investment advice, tailored recommendations, and portfolio diversification strategies based on client profiles and market trends.\n\tCollaborate with internal stakeholders including compliance, trading, operations, and legal to ensure timely trade execution and issue resolution.\n\tDrive client engagement through digital platforms, including assisting clients with the use of online trading platforms and digital communication tools.\n\tEnsure high levels of client satisfaction by addressing concerns promptly,\n\tResolving queries efficiently, and offering consistent support.\n\n\nRequirements\n\n\n\tBachelor’s Degree in any related field of study, a Master’s degree will be an added advantage.\n\tMinimum of 7 years of sales or relationship management experience\n\twithin a financial services or stockbrokerage environment.\n\tProven expertise in selling equities, bonds, and other investment instruments.\n\tStrong understanding of the Nigerian capital market and Fund portfolio operations\n\tDemonstrated ability to manage and grow client portfolios, especially among HNIs and institutional investors.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: info@onetrustassetmanagement.com.ng using the Job Position as the subject of the email.\n\n \n\n \n\n3.) Relationship Manager\n\nJob Location: Lagos\n\nResponsibilities\n\n\n\tUtilize referral networks and centres of influence to identify and pursue potential new clients,looking for ways to cultivate a long-term business relationship.\n\tEnsure customer documentation is complete and in compliance with the company/regulator’srequirements.\n\tUnderstand clients’ financial goals and provide tailored solutions to meet their needs.\n\tActively promote and cross-sell various products to customers in order to maximizerevenue and profitability.\n\tOffer products and services that meet the customer’s financial needs includingcredit facilities and investments.\n\tAssist customers in opening new accounts, manage their existing accounts, and resolve any account-related inquiries or issues.\n\n\nRequirements\n\n\n\tBachelor’s Degree in Finance, Economics, Business administration or a related field.\n\tProven experience as a Relationship Manager or in a similar role within finance industry.\n\tStrong knowledge of financial products, investment strategies,and market trends. Excellent communication, negotiation, and interpersonal skills.\n\tAbility to build rapport and maintain long-term client relationships.\n\tResults-driven mindset with a focus on achieving targets and goals.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: info@onetrustassetmanagement.com.ng using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Head of Business / Relationship Officer (Sales) and Entry Level Officer Job at Trident Microfinance Bank",
    "link": "https://www.jobgurus.com.ng/jobs/view/head-of-business-relationship-officer-sales-and-entry-level-officer-job-at-trident-microfinance-bank",
    "pubDate": "Thu, 05 Jun 2025 13:50:30 GMT",
    "source": "JobGurus",
    "keyword": "trident microfinance bank",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "Trident Microfinance Bank Limited (TMFB) is a financial institution licensed in October 2016, by the Central Bank of Nigeria (CBN) to engage in microfinance banking. As a microfinance bank, we provide financial services to micro, small and medium enterprises both formal and informal, and to underserved individuals who require affordable loans.\n\nWe are recruiting to fill the following positions below:\n\nJob Positions: Head of Business / Relationship Officer (Sales) and Entry Level Officer\n\nJob Location: Opposite Suleja General Hospital, Minna Road, Niger\nJob Field:Marketing / Sales / Business Development / Merchandiser\nEmployment Type: Full-time\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nGeneral Responsibilities\nThe relationship officer would be responsible for the following:\n\n\n\tMobilization of customers for small business loans within Abuja and its environs, majorly Wuse, Utako, Garki, Kubwa markets, etc.\n\tMobillize funds, account opening.\n\tLead (or be part of) a team that would develop the retail deposits of the bank. N150,000.00-300,000.00.\n\tDevelop and manage high network individual and corporate relationships.\n\tVerification of clientshome and shop addresses in compliance with company guidelines and procedures.\n\tParticipation in credit committee for loan appraisals where required.\n\tRecovery of overdue loans while ensuring cordial and long-term relationship with customers through excellent customer service.\n\tAppraising clientbusiness and capacity to service requested loan.\n\tCapture all required information (i.e. client & guarantorname, address & image. Business image and address).\n\tPost-disbursement monitoring.\n\tMaintaining a healthy portfolio.\n\tAny other responsibility assigned by the Bank.\n\n\nExperience\n\n\n\tB.Sc. / HND in any related field.\n\tExperience: 2 years for Entry level, Minimum of 7 years for head of business \n\t0-7 years experience preferably within a finacial institution (commercial / investment / microfinance banks or asse /wealth manager)\n\tStrong industry and HNI network.\n\tStrong presentation skills and excellent communication, negation skills.\n\tGood knowledge about the economy and ganeral market.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV in PDF to: hrrecruitment@tridentmfb.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Anti-Fraud Officer Job at PalmPay",
    "link": "https://www.jobgurus.com.ng/jobs/view/anti-fraud-officer-job-at-palmpay-1",
    "pubDate": "Thu, 05 Jun 2025 13:50:30 GMT",
    "source": "JobGurus",
    "keyword": "palmpay",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "PalmPay is an Africa-focused fintech firm, launched in 2019. PalmPay is a mobile payments platform that offers a number of financial services.\n\nWe are recruiting to fill the position below:\n\nJob Position: Anti-Fraud Officer\n\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are looking for an experienced Anti-Fraud Officer who is passionate about our mission of driving financial inclusion in Africa. \n\tThe ideal candidate will be responsible for processing and reconciling vendor and customer disputes. \n\tIn this career, you may also resolve merchant disputes associated with a previous transaction and analyse cases of chargeback fraud.\n\n\nResponsibilities\n\n\n\tCustomer's wallet review on suspicious transactions.\n\tReceive and incident in the complaint register all cases of Fraudulent Banking activities, Fraudulent Lending activities, Erroneous transfers, Business Gone Bad, and other fraud-related cases. To ensure all the fields/data requirements in the Complaint register are adequately populated.\n\tReview, investigate and resolve irregular transactions reported.\n\tIdentify business areas requiring increased security controls to protect the company and its end users from future incidents of fraud.\n\tKeep detailed records of suspicious activity, analyse trends, communicate security threats to management and provide recommendations for loss mitigation as needed.\n\tRespond to fraud queries across multiple channels\n\tUtilise various data analysis and accounting tools in collecting, sorting and analysing financial data to obtain results which reveal inconsistencies as well as possible suspects.\n\tConduct interviews to obtain information useful in resolving financial crimes.\n\tLiaise with internal teams, merchants, banks, transaction processors, regulatory bodies, law enforcement and any 3rd party involved.\n\tRestriction of reported wallet from other Banks.\n\tEscalation of fraudulent transactions from our customer's wallet to the beneficiary banks.\n\tAnd other tasks to be assigned by the Line Manager.\n\n\nRequirements\n\n\n\tBachelor's degree in any field\n\t2-3 years of experience in Anti-Fraud or any other related field\n\tSound Knowledge of fraud detection management, identity theft and information and security management\n\tMust have a deep knowledge of Fraud Management (Identity theft & Information & Security Management)\n\tProblem-solving and result-oriented.\n\tProficiency in Microsoft Office Packages and other work tools.\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]