[
  {
    "title": "Customer Experience Specialist Job at Eat 'N' Go Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/customer-experience-specialist-job-at-eat-n-go-limited-1",
    "pubDate": "Sat, 21 Jun 2025 11:37:03 GMT",
    "source": "JobGurus",
    "keyword": "eat 'n' go limited",
    "duplicate": false,
    "classifications": [],
    "content": "Eat 'N' Go Limited is a restaurant group on a mission to become the premier food operator in Africa. So far, our growing family consists of three international brands, Domino's Pizza, Cold Stone Creamery & Pinkberry.\n\nEat ‘N’ Go limited officially started operation in August 2012 with the premier store at 4, Saka Tinubu Victoria Island, Lagos. Today, Eat N' Go has about 100 stores (outlet) across Nigeria and still growing.\n\nWe are recruiting to fill the position below:\n\nJob Position: Customer Experience Specialist\n\nJob Location: Victoria Island, Lagos\nJob Type: Full Time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a highly motivated and experienced Customer Experience Specialist to lead and support our customer service team.\n\tThis role requires a detail-oriented professional passionate about delivering top-tier service, enhancing customer experience, and mentoring team members to achieve excellence.\n\tIf you thrive in a fast-paced environment and are ready to take ownership of customer satisfaction goals, we’d love to hear from you. \n\tFMCG experience is a major advantage.\n\n\nKey Responsibilities\n\n\n\tManage daily operations and workflow of the customer service department\n\tSupervise and mentor a team of customer service representatives\n\tRespond promptly and professionally to customer inquiries via phone, email, or chat\n\tEnsure timely resolution of customer issues; escalate when necessary\n\tPromote a customer-centric culture across the department\n\tProvide regular performance feedback and identify opportunities for upskilling\n\tCollect and analyze customer feedback to drive continuous service improvements\n\tTrack, monitor, and report key customer service metrics and KPIs\n\tHire, onboard, and train new customer service team members\n\tMaintain accurate records of customer interactions using CRM tools\n\tPerform other duties as assigned by management.\n\n\nRequirements\n\n\n\tBachelor’s Degree (BSc) in any relevant field\n\t3 - 5 years of experience in a customer service role, preferably in Nigeria\n\tStrong verbal and written communication and interpersonal skills\n\tCustomer Service Certification is an added advantage\n\tProven problem-solving ability and skill in managing customer expectations\n\tComfortable working in high-pressure, fast-paced environments\n\tDetail-oriented with strong data entry and organizational skills\n\tExperience with CRM systems and customer service software preferred\n\tFlexibility to work various shifts, including evenings and weekends\n\tAbility to maintain customer confidentiality and work collaborativel\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Web Frontend Engineer - JS, CSS, React, Flutter Job at Canonical Nigeria",
    "link": "https://www.jobgurus.com.ng/jobs/view/web-frontend-engineer-js-css-react-flutter-job-at-canonical-nigeria-2",
    "pubDate": "Sat, 21 Jun 2025 11:37:03 GMT",
    "source": "JobGurus",
    "keyword": "canonical nigeria",
    "duplicate": false,
    "classifications": [
      "Software Engineering"
    ],
    "content": "(adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\nCanonical - We deliver open source to the world faster, more securely, and more cost-effectively than any other company. We develop Ubuntu, the world’s most popular enterprise Linux from cloud to edge, together with a passionate global community of 200,000 contributors. Ubuntu means 'humanity to others. We chose it because it embodies the generosity at the heart of open source, the new normal for platforms and innovation. Together with a community of 200,000, we publish an operating system that runs from the tiny connected devices up to the world's biggest mainframes, the platform that everybody uses on the public cloud, and the workstation experience of the world's most productive developers. Secure and reliable, elegant and intuitive, and open for innovation - Ubuntu is the future of open source, which is why it's the fastest-growing Linux in the world despite already being the most widely deployed.\n\nWe are recruiting to fill the position below:\n\nJob Position: Web Frontend Engineer - JS, CSS, React, Flutter\n\nJob Location: Lagos (Remote)\n\nThe role entails\n\n\n\tDesign and implement well-tested and documented software in Web technologies or Flutter.\n\tDebug and fix issues encountered by your users\n\tParticipate in our engineering process through code and architectural reviews\n\tCollaborate with community and colleagues on technical specifications\n\tContribute to technical documentation to make it the best of its kind\n\tSeek improvements to engineering and operations practices\n\tDeploy and operate services developed by the team\n\tContribute to the success of your product through technical advocacy.\n\n\nWhat we are looking for in you\n\n\n\tAn exceptional academic track record from both high school and university\n\tUndergraduate degree in Computer Science or STEM, or a compelling narrative about your alternative path\n\tDrive and a track record of going above and beyond expectations\n\tWell-organised, self-starting and able to deliver to schedule\n\tProfessional manner in interacting with colleagues, partners, and community\n\tExperience designing and writing high-quality Web technologies\n\tExperience with and passion for Typescript, React or Flutter\n\tAn eye for accessibility and performance\n\tProfessional written and spoken English \n\tExperience with Linux (Debian or Ubuntu preferred) \n\tExcellent interpersonal skills, curiosity, flexibility, and accountability \n\tPassion, thoughtfulness, and self-motivation \n\tExcellent communication and presentation skills \n\tResult-oriented, with a personal drive to meet commitments \n\tAbility to travel twice a year, for company events for up to two weeks each.\n\n\nNice-to-have skills:\n\n\n\tExperience with container tech such as LXD, Docker and Kubernetes\n\tAttention to detail concerning user-centric UI development\n\tREST API design, development and governance\n\tPerformance engineering and security experience.\n\n\nWhat we offer colleagues\n\n\n\tWe consider geographical location, experience, and performance in shaping compensation worldwide. \n\tWe revisit compensation annually (and more often for graduates and associates) to ensure we recognise outstanding performance. In addition to base pay, we offer a performance-driven annual bonus or commission.\n\tWe provide all team members with additional benefits, which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.\n\tDistributed work environment with twice-yearly team sprints in person\n\tPersonal learning and development budget of USD 2,000 per year\n\tAnnual compensation review\n\tRecognition rewards\n\tAnnual holiday leave\n\tMaternity and paternity leave\n\tEmployee Assistance Programme\n\tOpportunity to travel to new locations to meet colleagues\n\tPriority Pass, and travel upgrades for long haul company    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Head of Business Development Job at Save the Children",
    "link": "https://www.jobgurus.com.ng/jobs/view/head-of-business-development-job-at-save-the-children",
    "pubDate": "Sat, 21 Jun 2025 11:37:03 GMT",
    "source": "JobGurus",
    "keyword": "save the children",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Save the Children is the leading independent organization for children in need, with programs in over 120 countries. We save children’s lives. We fight for their rights. We help them fulfil their potential. Save the Children is working in Nigeria because one in five children in Nigeria dies before their fifth birthday. About 40% of children miss out on school and have to work to survive while nearly 2 million children have lost one or both parents to an AIDS-related disease.\n\nWe are recruiting to fill the position below:\n\nJob Position: Head of Business Development\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob ID: 13208\nJob Location: Abuja\nEmployment Type: Full Time\nContract length: Fixed Term – 2 years (Renewable based on funding availability & performance)\nGrade: 2\nTeam / Programme: SC Nigeria\nJob Category: Programme, Development and Quality\nReports to: Deputy Country Director / Director Programme Development and Quality\nStaff directly reporting to this post:  3 (BD Manager, BD Coordinator & Costing Specialist)\nKey staff engaging directly with this post: Thematic Technical Specialists; Head of MEAL & Team; Advocacy, Campaigns, Communications & Media team (ACCM); Senior Management Team; Field/Programme  Managers;  and  members.\n\nChild Safeguarding\n\n\n\tLevel 3 - the responsibilities of the post may require the post holder to have regular contact with or access to children or young people.\n\n\nRole Purpose\n\n\n\tSave the Children is looking to add a dynamic, organized Head of Business Development who is passionate about being a part of a global team of individuals committed to improving the lives of children in Nigeria. \n\tThe Head of Business Development is a key position to support successful pursuit of new funding for the country program.\n\tHis/her actions and decisions in managing multi-divisional proposal response teams directly impact the quality and competitiveness of Save the Children’s proposals for new funding.\n\tThe Head of Business Development provides technical assistance, support, and training to technical advisors for new business development strategies and tasks from pre- positioning through proposal submission.\n\tThis position also oversees a unit that provides support to technical and cost proposals. \n\tStrategically, s/he will take the lead in coordinating appropriate internal advance planning in coordination and communication on potential new opportunities.\n\tS/he provides quality control and support to technical leads’ efforts to achieve greater program impact through the successful pursuit of larger and more strategic funding opportunities.\n\n\nKey Areas of Accountability\nGeneral Management:\n\n\n\tIdentify and track relevant upcoming funding opportunities – through advance intelligence gathering, partner relationships, and other available resources – and inform Country Office SMT and relevant technical leads.\n\tLead the development, implementation and consolidation of private sector engagement processes. Serve as a point of contact on area of responsibility with public, private and non-government stakeholders, when needed.\n\tCoordinate proposal development, including providing quality control to proposals through the design, implementation, and/or review of response strategies and action plans for technical and cost proposals, including writing, reviewing and editing proposal sections, graphics, work plans, budget spreadsheets and narratives; managing partner relations; and overseeing final proposal production for submission to donors.\n\tDevelop and/or maintain appropriate systems, procedures, policies, and materials to support the identification, selection and response to strategic opportunities.\n\tConduct ongoing proactive monitoring and research to identify potential partnerships with foundations, private sector and high net-worth philanthropic individual donors within the sector, both locally and internationally.\n\tFacilitate the development of innovative funding products, including but not limited to diversification into social venture initiatives and other funding channels that could improve the Country Office bottom line. \n\tManage major open solicitations and other proposal submissions, including teaming agreements, oversight of technical design and cost proposal, capacity statements, internal review/quality control processes, drafting sections of the proposal where appropriate.\n\tConduct prospecting visits to field offices to identify and prepare for upcoming funding opportunities.\n\tRepresent Save the Children as appropriate on strategic opportunities with donors, partners and others, participating as needed in meetings and conferences.\n\tStrengthen staff capacity to respond to strategic opportunities through the creation and/or delivery of formal and informal training and tools.\n\n\nStrategic Leadership:\n\n\n\tLead on the development of and updates of SC Nigeria’s country specific Funding Strategy and Donor Engagement Plan for the country program as a whole and for thematic, cross-sectoral and emergency response programs and projects.\n\tEnsure close collaboration and joint decision making with DPDQ, Director Programme Operations, ACCM Director and the Country Director and consultation with Members and Programme Funding leads on new (strategic) funding opportunities.\n\tEnsure timely strategic engagement with donors, partners, and other external stakeholders.\n\tEnsure funding is adequately channelled into the CO’s strategic objectives and towards innovations; ensure program development builds on learning and evaluation of previous project implementation.\n\n\nBusiness Analysis and Donor Engagement:\n\n\n\tRepresent the Nigeria CO in relevant donor fora, workshops and conferences where new business development opportunities can be formulated, as indicated by the line manager.\n\tEstablish effective relationships with external stakeholders, donors and potential partners for large scale or strategic funding opportunities, either as a prime or sub-recipient.\n\tCultivate excellent working relationships with and serve as focal point for SC Members and donor agencies at the regional and country level.\n\tEnsure key contacts, required formats and donor strategies are kept up-to-date at the country office level. ensures maintenance of donor and partner engagement tracking database.\n\tIdentify, research, and disseminate information on new funding opportunities from bilateral, multi-lateral, and other institutional and non-traditional donors (foundations, corporates etc.).\n\tExplore and test potential private sector and other new types of partnerships and keep abreast of local funding environment.\n\tEnsure tracking of active funding opportunities, submission deadlines, financing available. Ensure all appropriate donor and SC proposal formats are available in country. \n\tMonitor proposals pipeline and win rates, ensure that updated trackers are available for planning purposes, keep senior management informed.\n\n\nOversee Proposal Development:\n\n\n\tLead on the development of high-value or complex proposals for donor awards and bids for donor contracts. \n\tProvide leadership and co-ordination to the proposal development team, overseeing and ensuring quality and compliance with donor guidelines for all SC Nigeria proposals under development. \n\tInterface closely with Programme Operations, ACCM, HR and the Finance teams, as well as technical advisors, to ensure all information is produced in a way that ensures quality and integration of SCI interventions at the programme design and reporting stage.\n\tEnsure that concept notes and funding proposals align closely with Country Strategy Plan, Thematic plans, geographic priorities, master budgets and Monitoring & Evaluations, Accountability and Learning (MEAL) frameworks as well as SLT decisions.\n\tDevelop and track proposal development timelines and work closely with PDQ, Programme Operations, ACCM, Finance, HR, Security and Supply Chain to ensure adequate and timely input into proposal and budget development.\n\tIn collaboration with Members, when relevant, broker technical assistance and other resources to support proposal development. \n\tFacilitate engagement of consultants on large-scale proposals, or when technical specialists outside of Save the Children teams are needed. \n\tRepresent Save the Children generally (along with technical experts) in consortium meetings regarding proposal development.\n\tEnsure that Programme Quality Framework is addressed in all new proposals and that key elements of programme quality are included (e.g. child participation, child safeguarding, lessons learned from past proposals, accountability, risk assessments, and effective partnership strategy).\n\tEnsure all proposal and concept note submissions to donors are complete, done as per Save the Children and donors standards and guidelines, reviewed and approved by the SMT and other staff in country as appropriate before submission to the donor.\n\tIn collaboration with the Awards team, lead on maintaining the up-to-date database of proposals submitted, approved, rejected and reports submitted to donors/SC members. \n\tEnsure the Program Development team supports preparing all the relevant information for Prime system; the awards kick-off process and budget and proposal re-alignments throughout the implementation, as well as cost and no cost extensions, assuring initial proposal compliance\n\tWork with the Safeguarding Team to budget for Child Safeguarding Activities during proposal development and ensure that safeguarding activities are captured in project design and ensure inclusion of detailed Safeguarding narratives into all new proposals and opportunities.\n\n\nPeople Management, Mentoring and Development:\n\n\n\tSupport the DCD/DPDQ to proactively build and maintain technical skills and competencies required for leading and/or in-putting for first class programs.\n\tBe effective as a mentor and coach for the staff that report to this role, as well as other staff that contribute to developing proposals and writing reports.\n\tSupport the development of an organisational culture that reflects our broad-spectrum programming values, promotes accountability and high performance, encourages a team culture of learning, creativity and innovation, and frees up our people to deliver outstanding results for children and excellent customer service for our members and donors. \n\n\nQualifications & Experience\nEssential:\n\n\n\tMaster’s Degree in social sciences and any of the development sectors.\n\t8-10 years of experience in international development, including at least 5 years of experience in successful proposal development for institutional and corporate donors, including pre-solicitation preparation.\n\tExperience with major funding donor solicitations is required; substantive relevant experience in proposal development for other multilateral or bilateral donors may be considered within the years of experience sought.\n\tExperience training staff and creating training modules and materials.\n\tExperience managing a small team.\n\tMaster’s degree in international development or related field.\n\tPreference for a candidate with overseas field experience.\n\tMust be willing to travel to state offices up to 20%.\n\tAbility to coordinate multiple projects simultaneously, work well under pressure and meet deadlines.\n\tAbility to effectively communicate with and coordinate activities of multiple partners, including field-based staff.\n\tExcellent technical skills in writing, editing, formatting, research, negotiation, and verbal communications, and attention to detail required.\n\n\nSkills and Behaviours (Our Values in Practice)\nAccountability:\n\n\n\tUnderstands and respects the need for procedures, policies and planning for safety and security management in delivering humanitarian assistance\n\tHolds self accountable for making decisions, managing resources efficiently, achieving and role modelling Save the Children values\n\tHolds the team and partners accountable to deliver on their responsibilities - giving them the freedom to deliver in the best way they see fit, providing the necessary development to improve performance and applying appropriate consequences when results are not achieved\n\tCreates a managerial environment across the team to lead, enable and maintain our culture of child safeguarding\n\n\nAmbition:\n\n\n\tSets ambitious and challenging goals for themselves and their team, takes responsibility for their own personal development and encourages their team to do the same\n\tFuture orientated, thinks strategically and on a country-wide scale\n\n\nCollaboration:\n\n\n\tApproachable, good listener, easy to talk to; builds and maintains effective relationships with colleagues, Members and external partners and supporters\n\tValues diversity and different people’s perspectives, able to work cross-culturally.\n\n\nCreativity:\n\n\n\tDevelops and encourages new and innovative solutions\n\n\nIntegrity:\n\n\n\tHonest, encourages openness and transparency, builds trust and confidence\n\tDisplays consistent excellent judgement.\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]