[
  {
    "title": "Business Relationship Officer, Pay Attitude Job at Unified Payment Services Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/business-relationship-officer-pay-attitude-job-at-unified-payment-services-limited",
    "pubDate": "Fri, 13 Jun 2025 15:16:33 GMT",
    "source": "JobGurus",
    "keyword": "unified payment services limited",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "Unified Payment Services Limited is Nigeria’s premier Payments & Financial Technology company that operates as a shared infrastructure for the banking community in Nigeria and Payments Service Provider within and outside Nigeria, with a vision to be the most preferred e-payment service provider in Africa.\n\nWe are recruiting to fill the position below:\n\nJob Position: Business Relationship Officer, Pay Attitude\n\nJob Location: Lagos\n\nJob Objective(s)\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tTo develop a strong relationship with all relevant stakeholders in order to achieve all set business objectives for Payattitude.\n\n\nDuties & Responsibilities\n\n\n\tTo achieve company revenue goals by deepening existing relationships in assigned portfolio of merchants and acquire new business\n\tResponsible for addition of new Acquiring bank/Partner (ATM/WEB)\n\tResponsible for POS deployment and Monitoring particularly for ‘’A’’ rated Merchant\n\tMonitor stock level and ensure replenishment of stocks as at when due\n\tMonitoring of Project stages, development, UAT and delivery on all acceptance related projects (ATM, POS & WEB)\n\tEnsure proper testing after roll out\n\tVisit Merchants to confirm the deployment of POS and relevant decals\n\tCheck Banks ATMs at Random to ascertain service condition\n\tMaintain merchants’ relationships to ensure continual growth and sales targets.\n\tResponsible for ensuring Visibility in Merchant locations.\n\n\nJob Requirements\n\n\n\tFirst Degree in Business, Marketing, Social Science or other related courses.\n\tExperience: 2 - 5 years of post NYSC experience (Entry Level).\n\tProfessional Qualifications and/or MBA will be added advantage\n\n\nKey Competency Requirements\nKnowledge:\n\n\n\tGood knowledge of marketing\n\tGood knowledge of proposal drafting and presentation\n\tKnowledge of product development cycle.\n\n\nSkill / Competencies:\n\n\n\tStrong interpersonal skills.\n\tExcellent written/oral communication skills\n\tStrong analytical skills\n\tOrganizational skills Confident negotiator and ability to close the right type of business deals at the highest level.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: ademuyiwa.adetunji@up-ng.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]