[
  {
    "title": "Job Openings at Prime Pharmacy",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-prime-pharmacy",
    "pubDate": "Thu, 12 Jun 2025 13:50:49 GMT",
    "source": "JobGurus",
    "keyword": "prime pharmacy",
    "duplicate": false,
    "classifications": [],
    "content": "Prime Pharmacy is a Pharmaceutical company with superstores in all of its branches. We're a one-stop shop for all your medical and groceries needs. Currently, we have three branches that are currently functional and operational 24/7. The Asokoro Garki branch is the head branch while the other branches are located in Gwarimpa and Kubwa respectively.\n\nWe are recruiting to fill the following positions below:\n\n1.) Procurement Officer\n\nJob Location: Area 11 Garki, Abuja (FCT)\nEmployment Type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tEstimate and establish cost parameters and budgets for purchases.\n\tCreate and maintain good relationships with vendors/suppliers.\n\tMake professional decisions in a fast-paced environment.\n\tNegotiate the best deal for pricing and supply contracts.\n\tEnsure that the products and supplies are high quality.\n\tMaintain records of purchases, pricing, and other important data.\n\tReview and analyze all vendors/suppliers, supply, and price options.\n\tDevelop plans for purchasing equipment, services, and supplies.\n\tMaintain and update a list of suppliers and their qualifications, delivery times, and potential future development.\n\tWork with team members and procurement manager to complete duties as needed.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: primepharmacyjobs@gmail.com using the Job Position as the subject of the mail.\n\n \n\n2.) Driver \n\nJob Location: Area 11 Garki, Abuja (FCT) \nEmployment Type: Full-time\n\nJob Description\n\n\n\tDriving the staff to the market for purchase.\n\tCreate and maintain good relationships with staff.\n\tAny other job can be assigned to you by your supervisor.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: primepharmacyjobs@gmail.com using the Job Position as the subject of the mail.\n\n \n\n3.) Sales Executive\n\nJob Location: Area 11 Garki, Abuja (FCT) \nEmployment Type: Full-time\n\nJob Description\n\n\n\tSales Assistants are expected to work on store sales floors providing assistance directly to customers.\n\tThey must be knowledgeable of the store layout, inventory and company policies in order to provide accurate information to shoppers.\n\tSales Assistants help to locate product for customers, process transactions and keep the sales floor organized and well-stocked.\n\n\nJob Responsibilities\nYour responsibilities while in this role include but are not limited to:\n\n\n\tGreeting customers who enter the shop.\n\tAssisting shoppers to find the goods and products they are looking for.\n\tStocking shelves with merchandise.\n\tBagging of purchased items for customers.\n\tAttaching price tags to goods on the shelves. And update prices on price tags.\n\tScan and compute customer purchase on the computer. Print and issue receipts to customer.\n\tEnsure customers get all goods paid for are bagged accordingly\n\tProviding customers with advice on the right products for them\n\tReporting discrepancies and problems to the supervisor.\n\tMonitor and manage products on the shelf to ensure their purchase before expiration.\n\tReport challenges with customers purchases, payment, card defect to the supervisor.\n\tAnd any other responsibilities as suggested by your superior.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: primepharmacyjobs@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Sales Executive Job at ESV Global Consults",
    "link": "https://www.jobgurus.com.ng/jobs/view/sales-executive-job-at-esv-global-consults",
    "pubDate": "Thu, 12 Jun 2025 13:50:49 GMT",
    "source": "JobGurus",
    "keyword": "esv global consults",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance"
    ],
    "content": "ESV Global Consults is a premier human resource consulting firm dedicated to empowering organizations to achieve their full potential. With a passion for people and a commitment to excellence, we provide innovative HR solutions that drive business success. Our team of experienced HR professionals brings a wealth of knowledge and expertise to the table, with a proven track record of delivering tailored solutions that meet the unique needs of our clients. From recruitment and talent management to organizational development and change management, we offer a comprehensive range of services designed to optimize your workforce and drive business results.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nAt ESV Global Consults we believe that people are the heart of every organization, and that investing in your employees is the key to unlocking long-term success. That's why we're dedicated to helping you build a high-performing team that's engaged, motivated, and equipped to drive your business forward.\n\nWe are recruiting to fill the position below:\n\nJob Position: Sales Executive\nJob Location: Abuja (FCT)\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe are seeking dynamic and results-oriented Sales Executive with 3-6 years of proven sales experience, including a minimum of 2 years within the FMCG industry.\n\tThe ideal candidates will play a pivotal role in driving sales growth by promoting and selling our premium cashew products to a diverse clientele.\n\tThis position demands exceptional communication skills, a strategic sales mindset, and a demonstrated ability to cultivate and sustain strong customer relationships.\n\tIf you have a track record of exceeding sales targets, a passion for delivering exceptional customer experiences, and thrive in a fast-paced environment, we invite you to join our team and contribute to the continued success of our brand.\n\n\nKey Responsibilities\nSales and Revenue Generation:\n\n\n\tAchieve monthly, quarterly, and annual sales targets.\n\tIdentify new sales opportunities within assigned territories.\n\tEnsure product availability in retail outlets, supermarkets, or distributor warehouses.\n\n\nMarket Expansion & Promotions:\n\n\n\tExpand customer base by onboarding new distributors, retailers, or other clients.\n\tOpen new sales territories and penetrate underserved markets.\n\tConduct regular store visits to identify new opportunities\n\tExecute promotional activities, such as product sampling or discounts.\n\n\nCustomer Relationship Management:\n\n\n\tBuild and maintain strong relationships with existing stores and key accounts.\n\tAddress customer complaints and resolve issues promptly.\n\tProvide after-sales support like sales optimization\n\n\nMerchandising and Brand Visibility:\n\n\n\tEnsure proper placement and display of products in stores are done by in-store merchandisers.\n\tParticipate in promotional campaigns and in-store branding/activations.\n\tMonitor competitor activities and provide feedback to the team.\n\tMonitor promotions and recommend strategies needed for business growth.\n\n\nReporting and Analysis\n\n\n\tPrepare and submit sales reports, sales target breakdown and market feedback.\n\tAnalyse sales performance and recommend strategies for improvement.\n\tMonitor stock levels and ensure timely replenishment in stores.\n\n\nTerritory Management:\n\n\n\tManage a designated sales territory, ensuring effective coverage.\n\tPlan daily/weekly routes to maximize time and efforts.\n\tOptimize the use of resources to cover territory effectively.\n\n\nCompliance and Documentation:\n\n\n\tEnsure compliance with company policies, procedures, and regulatory requirements.\n\tMaintain accurate records of sales, invoices, and client communications.\n\n\nRequirements\n\n\n\tMinimum of Bachelor’s degree in Business Administration, Marketing, or a related field.\n\t3-6 years of proven experience as a Sales Executive with at least 2 years of solid experience in the FMCG industry.\n\tSolid understanding of sales techniques and pipeline management.\n\tAbility to work independently and as part of a team.\n\tProficiency in MS Office and CRM software.\n\tStrong negotiation and persuasion skills.\n\tExcellent communication and interpersonal skills.\n\tProven track record of achieving sales targets and driving business growth.\n\n\nBenefits\n\n\n\tCompetitive salary (N150,000 - N250,000 Monthly) with exclusive logistics & data allowance.\n\tNegotiable commission.\n\tOpportunity for career growth in a thriving industry.\n\n\nMethod of Application\nInterested candidates should send their CV to: Esvconsult25@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Receptionist Job at Esporta Suites Hotel and Resorts Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/receptionist-job-at-esporta-suites-hotel-and-resorts-limited-1",
    "pubDate": "Thu, 12 Jun 2025 13:50:49 GMT",
    "source": "JobGurus",
    "keyword": "esporta suites hotel and resorts limited",
    "duplicate": false,
    "classifications": [],
    "content": "At Esporta Hotels, we are committed to excellence in hospitality and service. Our property offers a warm and welcoming environment for both guests and staff. We believe in professionalism, teamwork, and providing opportunities for growth within our organization.\n\nWe are recruiting to fill the position below:\n\nJob Posiiton: Receptionist\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tGreet guests warmly and handle check-in/check-out procedures\n\tManage reservations, phone calls, and emails professionally\n\tProvide information about services, local attractions, and room availability\n\tHandle guest complaints and requests promptly and courteously\n\tMaintain a tidy and welcoming reception area\n\tCoordinate with housekeeping, bell desk, and other departments.\n\n\nRequirements\n\n\n\tCandidates should possess a Bachelor's Degree / HND / OND with 1 - 3 years of experience\n\tPrevious experience in a front office or customer service role preferred\n\tProficiency in basic computer systems (e.g., MS Office, PMS software)\n\tWell-groomed, professional appearance\n\tExcellent communication and interpersonal skills\n\tAbility to work in shifts, including weekends and holidays\n\tFluency in English; additional languages are a plus.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: jobs@esportahotels.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Officer, Client Service Job at Stanbic IBTC Bank",
    "link": "https://www.jobgurus.com.ng/jobs/view/officer-client-service-job-at-stanbic-ibtc-bank",
    "pubDate": "Thu, 12 Jun 2025 13:50:49 GMT",
    "source": "JobGurus",
    "keyword": "stanbic ibtc bank",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Stanbic IBTC Bank is a leading African banking group focused on emerging markets globally. It has been a mainstay of South Africa's financial system for 150 years, and now spans 16 countries across the African continent.\n\nStandard Bank is a firm believer in technical innovation, to help us guarantee exceptional client service and leading edge financial solutions. Our growing global success reflects our commitment to the latest solutions, the best people, and a uniquely flexible and vibrant working culture. To help us drive our success into the future, we are looking for resourceful individuals to join our dedicated team at our offices.\n\nWe are recruiting to fill the position below:\n\nJob Position: Officer, Client Service \n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Ref ID: 80434934A-0001\nJob Location: Lagos\nJob Type: Full-time\nBusiness Segment: Insurance & Asset Management\n\nJob Description\n\n\n\tTo provide an effective Query Resolution service in a professional, friendly manner. \n\tTo provide customer support and service to all customers and ensure customer satisfaction in all day to day activities.\n\tEnsure prompt customer renewal notification through telephone calls and emails.\n\tEffectively track and provide reports on all existing insurance policies\n\n\nQualifications\n\n\n\tCandidates should possess a First Degree in related discipline\n\t1 -2 years of post-NYSC experience \n\n\nBehavioural Competencies:\n\n\n\tEstablishing Rapport\n\tGenerating Ideas\n\tManaging Tasks\n\tPursing Goals\n\tUpholding Standard\n\tInteracting with People\n\tMaking Decisions\n\n\nTechnical Competencies:\n\n\n\tCustomer Understanding (Business Banking)\n\tProduct and Services Knowledge\n\tProduct Related Systems (Business Banking)\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Field Enumerator for Data Collection Job at International Fertilizer Development Center",
    "link": "https://www.jobgurus.com.ng/jobs/view/field-enumerator-for-data-collection-job-at-international-fertilizer-development-center",
    "pubDate": "Thu, 12 Jun 2025 13:50:49 GMT",
    "source": "JobGurus",
    "keyword": "international fertilizer development center",
    "duplicate": false,
    "classifications": [],
    "content": "The International Fertilizer Development Center (IFDC) is a public international organization active in 27 countries in Africa, Asia, and America. IFDC uniquely approaches the global issues of food security and poverty by bridging the gap between research and impact, combining science-based innovations, holistic market systems development, an enabling policy environment, and strategic partnerships to assist farmers and countries to identify and scale sustainable agricultural solutions, including improved nutrient use efficiency. These approaches are needed to boost soil health and crop productivity while reducing the environmental impact of fertilizer use.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nIFDC translates research into action by using locally driven, environmentally sound, and impact-oriented solutions. With our partners, we seek to close the yield gap, eradicate global hunger, safeguard the soil on which our lives depend, and generate economic resilience for farming households and the countries in which they live.\n\nWe are recruiting to fill the position below:\n\nJob Position: Field Enumerator for Data Collection\n\nJob ID: 20121471\nJob Locations: Adamawa, Kano, Jigawa and Sokoto\nEmployment type: Full-time / Regular\n\nAbout Program / Project\n\n\n\tThe International Food Policy Research Institute (IFPRI), with the support from Mastercard Foundation (MCF) is conducting a longitudinal youth cohort study in northern Nigeria.\n\tThe goal is to better understand the livelihood trajectories of young men and young women in rural areas, how the livelihood experiences that unfold among youth intersect with other domains (e.g., family formation, health, community/civic engagement), and the livelihoods-related barriers, opportunities, and risks face faced by young women and young men.\n\tThe Enumerators will have the primary responsibility of interviewing and collecting high quality data from participating households/individuals.\n\tThe Enumerator will work closely with the IFPRI research team and stakeholders within the project communities.\n\n\nResponsibilities\nThe field enumerator will:\n\n\n\tAttend a one-week training on data collection and provide feedback;\n\tGet familiar with the data collection tools and study manual;\n\tBehave professionally when working, dress in a modest and culturally appropriate manner;\n\tEnsure confidentiality and quality of data collected by adhering to IFPRI’s data collection policies;\n\tEnsure safe storage and handling of all IFPRI’s devices and equipment.\n\tConduct interviews with selected individuals and households in the communities only;\n\tMake re-visits to respondents who could not be located during previous visits;\n\tConduct listing exercise of households and individuals within the age bracket of 15 – 35 years in the selected communities;\n\tInform the Field Supervisor and/or project core team of progress and challenges encountered during the field activities and identify appropriate solutions;\n\n\nReporting and Work Relationships:\n\n\n\tEnumerators shall report IFPRI designated field supervisor.\n\n\nRequirements\n\n\n\tQualifications (HND, B.Sc., M.Sc.) in the fields of Economics, Agricultural Economics, Development Economics, Sociology, Development Studies, or Statistics;\n\tResidents of Adamawa, Kano, Jigawa, and Sokoto States are preferred;\n\tStrong command of English, and Hausa.\n\tProven skills in the use of mobile devices for data collection (SurveyCTO, ODK, Kobo Collect);\n\tExperience in conducting quantitative survey in Northern part of Nigeria;\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]