[
  {
    "title": "Territory Sales Executive Job at Oracle",
    "link": "https://www.jobgurus.com.ng/jobs/view/territory-sales-executive-job-at-oracle",
    "pubDate": "Tue, 08 Jul 2025 15:42:16 GMT",
    "source": "JobGurus",
    "keyword": "oracle",
    "duplicate": false,
    "classifications": [],
    "content": "Oracle provides the world's most complete, open, and integrated business software and hardware systems, with more than 370,000 customers including 100 of the Fortune 100 representing a variety of sizes and industries in more than 145 countries around the globe.\n\nWe are recruiting to fill the position below:\n\nJob Position: Territory Sales Executive\n\nJob Identification: 288618\nJob Location: Lagos\nJob Category: Sales\nRole: Individual Contributor\nJob Type: Regular Employee\n\nJob Description\nWhat you will do:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tPrimary job duty is to sell HCM, ERP, EPM and SCM cloud solutions and related services to prospective and existing Oracle customers, driving increased revenues of our Cloud SaaS Applications across different accounts within your territory.\n\tWinning new SaaS cloud revenue in HCM, ERP, EPM and SCM.\n\tGenerating and following up on leads, qualifying leads, and prioritizing opportunities.\n\tIdentifying and working with the appropriate people in Oracle and the Customer.\n\tDeveloping a strategy and sales plan to address the designated territory coverage. (FSI and Manufacturing)\n\tDriving the implementation of sales campaigns\n\tWorking with and influencing the activities of Oracle Partners as appropriate.\n\tMaintaining a complete and up-to-date understanding of competition in HCM, ERP, EPM and SCM line, and able to influence the sales process for developing proactive and counter actions for winning the deal.\n\n\nResponsibilities\n\n\n\tPrimary job duty is to sell business applications software/solutions and related services to prospective and existing customers.\n\tManage sales through forecasting, account resource allocation, account strategy, and planning.\n\tDevelop solution proposals encompassing all aspects of the application.\n\tParticipate in the development, presentation and sales of a value proposition.\n\tNegotiate pricing and contractual agreement to close the sale. Identify and develop strategic alignment with key third party influencers.\n\n\nRequirements\nWhat we are looking for:\n\n\n\tCareer Level - IC4 \n\tAt least 7 years of experience in Enterprise Sales\n\tStrong relationships with C-Level across key Industries ie FSI, Telco, Government, Healthcare, Education etc\n\tDemonstrated success in consistently meeting or exceeding sales targets in previous roles.\n\tAbility to understand and articulate complex software solutions and their benefits to potential clients.\n\tCapability to develop and implement strategic sales plans to penetrate target markets and industries effectively.\n\tStrong verbal and written communication skills, including the ability to deliver compelling presentations and negotiate contracts.\n\tAbility to collaborate effectively with cross-functional teams.\n\tFlexibility to adapt to changing market conditions, client requirements, and product offerings.\n\n\nWhat we will offer you\n\n\n\tA competitive salary with exciting benefits\n\tLearning and development opportunities to advance your career.\n\tAn Employee Assistance Program to support your mental health.\n\tEmployee resource groups that champion our diverse communities\n\tCore benefits such as life insurance, and access to retirement planning\n\tAn inclusive culture that celebrates what makes you unique\n\n\nNote:\n\n\n\tAt Oracle, we don’t just respect differences—we celebrate them.\n\tWe believe that innovation starts with inclusion and to create the future we need people with diverse backgrounds, perspectives, and abilities.\n\tThat’s why we’re committed to creating a workplace where all kinds of people can do their best work.\n\tIt’s when everyone’s voice is heard and valued that we’re inspired to go beyond what’s been done before.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Database Administrator (Oracle, MongoDB, Cassandra, MySQL) Job at BlueChip Technologies",
    "link": "https://www.jobgurus.com.ng/jobs/view/database-administrator-oracle-mongodb-cassandra-mysql-job-at-bluechip-technologies",
    "pubDate": "Tue, 08 Jul 2025 15:42:16 GMT",
    "source": "JobGurus",
    "keyword": "bluechip technologies",
    "duplicate": false,
    "classifications": [],
    "content": "BlueChip Technologies is a leading business application firm focused exclusively on assisting organizations in planning, designing, implementing and operating business application solutions and strategies that are central to creating and maintaining a competitive business advantage.\n\nWe are recruiting to fill the position below:\n\nJob Position: Database Administrator (Oracle, MongoDB, Cassandra, MySQL)\n\nJob Location: Lagos, Nigeria\nJob type: Full-time (Hybrid)\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAs part of our growth strategy, we are seeking an experienced and versatile Database Administrator (DBA) with expertise across Oracle, MongoDB, Cassandra, and MySQL to join our dynamic team. \n\n\nRole Overview \n\n\n\tWe are looking for a results-driven and detail-oriented Database Administrator to oversee the installation, configuration, performance, and security of our enterprise-grade databases.\n\tThe ideal candidate will bring extensive experience in relational and non-relational database technologies and a solid track record of implementing, maintaining, and optimizing critical data systems in high-availability environments. \n\n\nKey Responsibilities\nOracle Database Administration:\n\n\n\tInstall, configure, and maintain Oracle 10g/11g/12c/19c in single-instance and clustered environments. \n\tManage Real Application Clusters (RAC), Data Guard, Log Shipping, and Cloning. \n\tExecute backup and recovery procedures using RMAN. \n\tMonitor and optimize database performance; troubleshoot bottlenecks. \n\tApply security patches, upgrades, and manage database migrations. \n\tEnsure compliance with Oracle licensing and security standards. \n\n\nMongoDB & MySQL Administration:\n\n\n\tDeploy, configure, and support MongoDB and MySQL databases in production and staging environments. \n\tImplement replication, sharding, clustering, and indexing strategies. \n\tOptimize performance using profiling tools and query tuning techniques. \n\tDesign NoSQL schema models in MongoDB for scalable applications. \n\tPerform backup and restore using MongoDB Ops Manager and MySQL tools. \n\n\nCassandra Administration (Optional but Preferred):\n\n\n\tInstall and maintain Cassandra clusters. \n\tManage high-volume writes and reads, ensuring horizontal scalability. \n\tConfigure replication, consistency levels, and monitor cluster health. \n\n\nGeneral DBA Functions:\n\n\n\tDevelop and implement robust backup, restore, and disaster recovery strategies. \n\tConduct routine health checks and failover drills. \n\tHandle P1/P2 incident escalations and change management processes. \n\tCollaborate with development and infrastructure teams for data modeling and integration. \n\tEnsure accurate documentation of configurations and processes. \n\n\nQualifications & Requirements \n\n\n\tBachelor’s Degree in Computer Science, Information Technology, or related discipline. \n\tMinimum of 7 years hands-on experience managing Oracle, MongoDB, Cassandra, and MySQL databases. \n\tStrong expertise in: \n\tOracle RAC, RMAN, and performance tuning. \n\tMongoDB and MySQL replication, clustering, and schema design. \n\tNoSQL performance optimization and disaster recovery planning. \n\tProficiency in SQL, PL/SQL, and NoSQL query languages. \n\tExperience with cloud platforms (AWS, Azure, GCP) is highly desirable. \n\tCertifications such as: \n\t\n\t\tOracle Certified Professional (OCP) \n\t\tMongoDB Certified DBA \n\t\tMySQL Certified DBA; are a strong plus. \n\t\n\t\n\tExcellent analytical, troubleshooting, and documentation skills. \n\tStrong communication and teamwork abilities. \n\n\nWhat We Offer \n\n\n\tCompetitive and performance-driven salary package. \n\tComprehensive health, dental, and vision insurance. \n\tPension and retirement savings plan with company contributions. \n\tContinuous learning and development opportunities. \n\tA collaborative, innovative, and inclusive work environment. \n\tFlexible working arrangements and modern office facilities. \n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Cloud & AI Infrastructure Sales Executive (Public Sector & FSI) Job at Oracle",
    "link": "https://www.jobgurus.com.ng/jobs/view/cloud-ai-infrastructure-sales-executive-public-sector-fsi-job-at-oracle",
    "pubDate": "Tue, 08 Jul 2025 15:42:16 GMT",
    "source": "JobGurus",
    "keyword": "oracle",
    "duplicate": false,
    "classifications": [],
    "content": "Oracle provides the world's most complete, open, and integrated business software and hardware systems, with more than 370,000 customers, including 100 of the Fortune 100, representing a variety of sizes and industries in more than 145 countries around the globe.\n\nWe are recruiting to fill the position below:\n\nJob Position: Cloud & AI Infrastructure Sales Executive (Public Sector & FSI)\n\nJob Identification: 279176\nJob Locations: Abuja (FCT) & Lagos\nJob Category: Sales\nRole: Individual Contributor\nJob Type: Regular Employee\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tOracle is at the forefront of the digital transformation, empowering businesses with cutting-edge AI and Cloud Infrastructure solutions, encompassing both Infrastructure as a Service (IaaS) and Platform as a Service (PaaS).\n\tWe’re looking for a Cloud & AI Infrastructure Sales Executive to drive force behind advancing customer missions through the power of Oracle's comprehensive cloud portfolio.\n\n\nWhat you will do:\n\n\n\tEngage in strategic C-level conversations to uncover cloud transformation opportunities while conducting in-depth needs assessments and solution demonstrations. \n\tYou will collaborate with technical experts to craft tailored cloud proposals and negotiate complex contracts, and ensure seamless deal execution by:\n\t\n\t\tEvangelizing Oracle's Cloud Vision: Become a trusted advisor to C-level executives, demonstrating how Oracle's AI and Cloud Infrastructure solutions can transform their businesses and drive unprecedented success.\n\t\tLeading Transformational Deals: Orchestrate complex sales cycles, navigating technical intricacies and securing buy-in from multiple stakeholders.\n\t\tScaling Cloud Adoption Across Industries: Identify high-potential opportunities across diverse sectors, tailoring Oracle's cloud solutions to address unique challenges.\n\t\tForging Strategic Partnerships: Collaborate with Oracle's partner ecosystem to expand market reach and deliver comprehensive cloud solutions.\n\t\tBeing a Champion for Customer Success: Ensure seamless implementation and adoption of Oracle's cloud technology, fostering long-term customer relationships.\n\t\n\t\n\n\nResponsibilities\nYour Experience:\n\n\n\tProven Sales Acumen: several years of enterprise software/cloud sales experience, with a track record of exceeding targets and closing multi-million-dollar deals.\n\tC-Level Engagement: Demonstrated ability to build relationships and influence senior executives across various industries.\n\tCloud Passion and Expertise: Deep understanding of cloud technologies (IaaS, PaaS, AI) and their potential applications across different business functions.\n\tTechnical Fluency: Ability to articulate complex technical concepts in a clear and concise manner to both technical and non-technical audiences.\n\tCustomer-Centric Approach: Unwavering commitment to understanding customer needs and delivering exceptional value.\n\n\nOracle's Cloud Advantage:\n\n\n\tIndustry Leadership: Oracle's cloud solutions are recognized for their innovation, security, and scalability.\n\tUnmatched Data Security: Oracle's unique approach to data security ensures customer data remains protected throughout the cloud journey.\n\tCustomer-Centric Focus: Oracle is committed to partnering with customers to achieve their cloud goals and drive long-term success.\n\tCulture of Innovation: Oracle fosters a collaborative environment where employees are encouraged to push boundaries and unleash their full potential.\n\tComprehensive Portfolio: Oracle offers a complete suite of cloud solutions, including IaaS, PaaS, and AI, providing customers with a one-stop shop for their digital transformation needs.\n\n\nQualifications\n\n\n\tCareer Level - IC4.\n\n\nWhat we will offer you\n\n\n\tA competitive salary with exciting benefits\n\tFlexible working so you can do your best work\n\tLearning and development opportunities to advance your career\n\tAn Employee Assistance Program to support your mental health\n\tEmployee resource groups that champion our diverse communities\n\tCore benefits such as medical, life insurance, and access to retirement planning\n\tAn inclusive culture that celebrates what makes you unique.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Procurement Supervisor Job at BFBL",
    "link": "https://www.jobgurus.com.ng/jobs/view/procurement-supervisor-job-at-bfbl",
    "pubDate": "Tue, 08 Jul 2025 15:42:16 GMT",
    "source": "JobGurus",
    "keyword": "bfbl",
    "duplicate": false,
    "classifications": [],
    "content": "BFBL is one of the leading FMCG companies in Nigeria. We select high quality ingredients to produce the best quality products and our goal is to provide consumers with products of consistent superior quality that continuously meet their needs and expectations. This keeps the consumers at the center of our attention.\n\nWe are recruiting to fill the position below:\n\nJob Position: Procurement Supervisor\n\nJob Location: Lagos\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tTo lead and oversee the organisation’s procurement activities, ensuring efficient and cost-effective sourcing of goods and services, develop and implement procurement strategies, negotiate contracts, manage supplier relationships, and supervise a team of procurement.\n\n\nRequirements\n\n\n\tA good First Degree in Social Management / Physical Sciences. Possession of a postgraduate degree in Human Resources/Business Administration/Supply Chain Management or a related field is an added advantage\n\tAt least 1-2 years of Experience in a manufacturing company\n\tGood Analytical skills\n\tGood in Trouble shooting\n\tMust be Proactive\n\tGood Communication skills\n\tGood Interpersonal Relationship.\n\tAge: Not more than 32 years.\n\n\nMethod of Application\nInterested and qualified candidates should send their detailed resume to: Bobofood_hr@yahoo.com using the Job Position as the subject of the email.\n\nNote: Only shortlisted candidates would be called for an interview.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Lead, Industry Engagement and Employer Network Job at Mastercard Foundation",
    "link": "https://www.jobgurus.com.ng/jobs/view/lead-industry-engagement-and-employer-network-job-at-mastercard-foundation",
    "pubDate": "Tue, 08 Jul 2025 15:42:16 GMT",
    "source": "JobGurus",
    "keyword": "mastercard foundation",
    "duplicate": false,
    "classifications": [],
    "content": "Mastercard Foundation is a global foundation based across four hubs in Kigali, Rwanda, Nairobi, Kenya, Accra, Ghana and Toronto, Canada. Our programs promote financial inclusion and advance education and learning in Africa, primarily for young people, and in Canada for Indigenous youth. The Foundation was established in 2006 through the generosity of Mastercard when it became a public company. From inception, the Foundation was designed to be a separate entity and independent from Mastercard. Our policies, operations, and funding decisions are made by our President and Board of Directors.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nThe Foundation believes that youth employment is key to unlocking prosperity, both for youth and their societies. Enabling young women and men from disadvantaged communities to secure dignified and fulfilling work will ensure inclusive development and economic growth in Africa.\n\nWe are recruiting to fill the position below:\n\nJob Position: Lead, Industry Engagement and Employer Network\n\nJob Requisition ID: JR-0000000298\nJob Location: Lagos, Nigeria\nJob type: Full-time\n\nThe Opportunity\n\n\n\tThe Lead, Industry Engagement and Employer Network is responsible for executing and managing industry engagement initiatives within the Associate program for tertiary graduates and other placement programs by the Transitions team.\n\tThis role will focus on operationalizing employer engagement, maintaining relationships with industry partners, and supporting the execution of employer-driven initiatives.\n\tThe individual will also contribute to the design and implementation of the placement program for non-tertiary graduates.\n\tWorking closely with country teams, internal stakeholders, and employer partners, the Lead will ensure that industry engagement activities align with program goals and create meaningful employment opportunities\n\n\nResponsibilities\nWays You can Contribute:\n\n\n\tSupport the establishment and management of a robust employer network to connect industry leaders with Associates and create job opportunities.\n\tExecute employer outreach, onboarding, and engagement activities to ensure strong alignment between employer needs and program objectives.\n\tAct as a key liaison for employer stakeholders, ensuring consistent communication and coordination of engagement efforts.\n\tCoordinate with internal teams (e.g., Scholars, Alumni & Youth Engagement) to align employer engagement efforts with broader program initiatives.\n\tCollect, track, and analyze employer-related data within the Associate program to assess program effectiveness and inform improvements.\n\tPrepare reports on employer engagement trends and program performance for internal stakeholders.\n\tWork with the Associate engagement team to support the implementation of standardized learning experiences for Associates across regions.\n\tSupport the execution of the placement program for non-tertiary graduates by coordinating with industry partners, employers, and country teams.\n\tAssist in identifying employer needs and ensuring alignment between program offerings and market demands.\n\tProvide logistical and administrative support for placement activities, including tracking participation and ensuring smooth program execution.\n\tCoordinate engagement efforts with internal teams and external partners to facilitate seamless execution of employer engagement initiatives.\n\tWork collaboratively to ensure alignment between employer-led initiatives and broader workforce development programs.\n\tSupport advocacy efforts by maintaining strong employer relationships and ensuring engagement strategies align with program goals.\n\n\nRequirements\n\n\n\tMinimum of ten (7-9) years of  progressive experience in employer engagement, program management, or strategic partnership roles, workforce development, or a related sector.\n\tExperience in engaging with employer associations, civil society organizations, government, private sector etc., as well as young people.\n\tManaging multiple projects and delivering results in a fast-paced and fluid environment. \n\tExperience in designing and delivering leadership development programs for young people, in Africa.\n\tExperience with global grant making. This experience may come from working in another funding organization, corporation, government or an NGO. \n\tExperience working across cultures and geographies, living and working in Africa is highly desirable\n\tFlexible, adaptable, and able to execute a range of job duties and changing priorities.\n\tPossess excellent verbal, written, and presentation skills with the ability to articulate information to a variety of constituents across cultures.\n\tPossess professional maturity, sensitivity with different cultures, and impeccable integrity\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]