[
  {
    "title": "Human Resource Officer Job at Nosagie Holdings",
    "link": "https://www.jobgurus.com.ng/jobs/view/human-resource-officer-job-at-nosagie-holdings-1",
    "pubDate": "Tue, 01 Jul 2025 10:17:46 GMT",
    "source": "JobGurus",
    "keyword": "nosagie holdings",
    "duplicate": false,
    "classifications": [],
    "content": "Nosagie Holdings is an indigenous registered company, having its headquarters office located in Benin City, Edo State. It provides EPIC and Project Management Services for the Offshore/Onshore Oil & Gas, Refining and Petrochemicals Industries.\n\nWe are recruiting to fill the position below:\n\nJob Position: Human Resource Officer\n\nJob Location: Benin, Edo\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe HR Officer will play a key role in supporting the day-to-day operations of the Human Resources function within a diverse and fast-paced organization engaged in engineering, hospitality, FMCG, and facility maintenance.\n\tThe ideal candidate must possess strong HR operational knowledge and will be responsible for handling recruitment, onboarding, staff relations, compliance, documentation, performance tracking, and HR reporting across multiple subsidiaries.\n\tGiven the scale and variety of operations, a high level of organization, discretion, and multitasking ability is essential.\n\n\nKey Responsibilities\n\n\n\tManage end-to-end recruitment processes including job posting, screening, interviews, and onboarding.\n\tMaintain up-to-date employee records and ensure proper documentation in line with regulatory and internal standards.\n\tCoordinate employee relations activities and support in managing grievances, disciplinary actions, and conflict resolution.\n\tAssist in developing and coordinating staff training, performance evaluations, and career development initiatives.\n\tPrepare monthly and quarterly HR reports for management.\n\tSupport payroll processing and benefits administration by ensuring timely and accurate data submission.\n\tEnsure compliance with labor laws, company policies, and industry-specific HR requirements.\n\tOversee leave management, attendance tracking, and other HR documentation.\n\tCollaborate with department heads across subsidiaries to understand HR needs and provide appropriate solutions.\n\n\nRequirements\n\n\n\tBachelor’s Degree in Human Resources Management, Business Administration, or a related field.\n\tMinimum of 5 years of proven experience in a structured HR role, preferably in a multi-sector organization.\n\tMembership or certification from the Chartered Institute of Personnel Management (CIPM) is an added advantage.\n\tExcellent knowledge of Nigerian labor laws and HR compliance practices.\n\tStrong interpersonal, communication, and conflict resolution skills.\n\tProficiency in Microsoft Office tools and HR software systems.\n\tAbility to manage high volumes of work with strong attention to detail and confidentiality.\n\n\nSalary\nN230,000 Monthly. \n\nMethod of Application\nInterested and qualified candidates should send their CV and Portfolio to: nhrecruiters@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Graphic Designer (Volunteer) Job at Henosis International",
    "link": "https://www.jobgurus.com.ng/jobs/view/graphic-designer-volunteer-job-at-henosis-international",
    "pubDate": "Tue, 01 Jul 2025 10:17:46 GMT",
    "source": "JobGurus",
    "keyword": "henosis international",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Henosis International is recruiting suitable candidates to fillthe position below:\n\nJob Position: Graphic Designer (Volunteer)\n\nJob Location: Ibadan, Oyo\nEmployment Type: Volunteer\n\nJob Description \n\n\n\tAs a Graphic Designer, you’ll shape the visual identity of HEN’s Talk Ibadan — from event flyers to social media content, your work will help communicate our message powerfully.\n\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDesign creative, on-brand flyers, posters, and digital content \n\tTranslate ideas into impactful visual storytelling \n\tCollaborate with the content and publicity team on visual materials \n\tDeliver design materials in a timely and organized manner\n\n\nRequirements\n\n\n\tBasic to strong graphic design skills (Canva, Photoshop, or similar tools) \n\tEye for aesthetics, color, layout, and typography \n\tAbility to follow visual guidelines and also think outside the box \n\tCommitment to deadlines and attention to detail \n\tWillingness to learn, take feedback, and grow with the team.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "FTTH Design Manager Job at ZTE Devices",
    "link": "https://www.jobgurus.com.ng/jobs/view/ftth-design-manager-job-at-zte-devices",
    "pubDate": "Tue, 01 Jul 2025 10:17:46 GMT",
    "source": "JobGurus",
    "keyword": "zte devices",
    "duplicate": false,
    "classifications": [],
    "content": "ZTE Devices is recruiting suitably qualified candidates to fill the position below:\n\nJob Position: FTTH Design Manager\n\nJob Location: Lagos\nEmploymwnt Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDesign principles and template definitions\n\tDesign delivery plan development\n\tDesign progress control\n\tDesign quality control\n\tDesign team organization and management\n\tCoordination and communication between teams (Clients, Subcontractors, Internal)\n\tFollow up the progress of survey and design according to the arrangement of the design manager\n\tReview the quality of design documents and AS BUILD documents, and guide subcontractors to complete the output of documents when necessary\n\tGuide construction changes and complete plan modifications\n\tDirectly participate in site survey and design tasks when necessary\n\n\nRequirements\n\n\n\tBachelor’s Degree or above in Civil Engineering or related disciplines, with over 3 years of experience in structural or civil design at a design institute;\n\tStrong team spirit and learning ability, with the capability to work under pressure.\n\tFluent in English, with excellent verbal and written communication skills.\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Administrative Coordinator Job at Key Learning Solutions",
    "link": "https://www.jobgurus.com.ng/jobs/view/administrative-coordinator-job-at-key-learning-solutions",
    "pubDate": "Tue, 01 Jul 2025 10:17:46 GMT",
    "source": "JobGurus",
    "keyword": "key learning solutions",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance"
    ],
    "content": "Key Learning Solutions is a leading independent educational consulting company that has been in operation since 2006.KLSisdriven by its passion for improving the quality of education in Nigeria.\n\nWe are recruiting to fill the position below:\n\nJob Position: Administrative Coordinator\nJob Location: Lekki, Lagos\nEmployment Type:\n\nJob Overview\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Administrative Coordinator plays a critical role in ensuring smooth daily operations within the organization, overseeing all administrative functions, supporting academic and mentoring programs, and providing prompt, professional responses to social media inquiries.\n\tThis role also involves closing sales on social media platforms and efficiently handling customer escalations, contributing directly to client satisfaction and revenue growth.\n\n\nKey Responsibilities\nAdministrative Functions:\n\n\n\tOversee day-to-day administrative operations of the office and training centers.\n\tManage student and client records, class schedules, and examination preparations.\n\tSupport logistics for training sessions, workshops, seminars, and examinations.\n\tMaintain a filing system and ensure all documentation is accurate and up to date.\n\tCoordinate with internal teams (teachers, facilitators, marketing, finance) to support program delivery.\n\tAssist in inventory management of learning materials and office supplies.\n\n\nSocial Media & Sales Support:\n\n\n\tMonitor, respond to, and engage with inquiries on all social media platforms (WhatsApp, Instagram, Facebook, LinkedIn, etc.).\n\tProvide accurate information on programs, courses, and exams to prospective clients.\n\tConvert leads to enrollments through persuasive, value-driven communication.\n\tPrepare and share weekly reports on leads, conversions, and inquiries.\n\n\nCustomer Support & Escalation Management:\n\n\n\tAct as the first point of contact for escalated complaints or issues, ensuring prompt resolution.\n\tMaintain a high level of professionalism and empathy when handling customer concerns.\n\tFollow up with clients to ensure satisfaction after resolution.\n\tDocument all customer interactions and resolutions for continuous improvement.\n\n\nRequirements & Qualifications\n\n\n\tBachelor’s degree in Business Administration, Management, Education, or a related field.\n\tMinimum of 3 years of experience in administration, sales support, or client service roles.\n\tStrong organizational and multitasking skills.\n\tExcellent verbal and written communication skills.\n\tProficiency in social media management and online sales communication.\n\tCustomer-centric mindset with problem-solving skills.\n\tAbility to work independently and as part of a team in a fast-paced environment.\n\n\nKey Competencies:\n\n\n\tStrong interpersonal and relationship-building skills.\n\tHigh attention to detail and accuracy.\n\tSales and negotiation skills.\n\tProactive, self-motivated, and resourceful.\n\tProfessional demeanor and integrity.\n\n\nSalary\nN250,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their application to: hr@keylearningsolutions.net using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Senior Backend Engineer Job at Kuda Bank",
    "link": "https://www.jobgurus.com.ng/jobs/view/senior-backend-engineer-job-at-kuda-bank",
    "pubDate": "Tue, 01 Jul 2025 10:17:46 GMT",
    "source": "JobGurus",
    "keyword": "kuda bank",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Software Engineering"
    ],
    "content": "Kuda is a full service, app-based digital bank. Our mission is to be the go-to bank not just for those living on the African continent, but also for the African diaspora wherever they might live, anywhere in the world. Kuda is free of ridiculous banking charges and great at helping customers budget, spend smartly and save more. We raised the largest seed round ever seen in Africa, and completed a Series A funding round in February 2021, led by some of the world's smartest venture capital investors. With offices in London (our HQ), Lagos and Cape Town, and further offices opening across Africa during 2021, Kuda is fast becoming recognised as the leading 'Neobank' for Africans.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nTo help us grow into the company that can bring meaningful change to the way people across Africa get access to great financial products and services in order to take control of their personal finances, we are actively looking for bright, talented, driven people who are excited by our mission. If this sounds like a great way to spend your valuable time, then please get in touch with us.\n\nWe are recruiting to fill the position below:\n\nJob Position: Senior Backend Engineer\n\nJob Location: Lagos\nJob type: Full-time (Hybrid)\n\nJob Role\n\n\n\tWe are looking for a result-driven and analytical senior software engineer (backend) who will troubleshoot and improve existing backend applications and processes.\n\tS/he will use his or her understanding of programming tools and languages to analyze current codes, formulate more efficient processes, solve problems and create a more seamless experience for users.\n\n\nResponsibilities\n\n\n\tBuild high-quality reusable code that can be used in the future\n\tDevelop functional and sustainable web applications with clean codes\n\tTroubleshoot and debug applications\n\tConduct tests and optimise performance\n\tWork together with engineers building client-facing applications to integrate UI elements with server-side logic\n\tTrain and support internal teams\n\tInteract with developers, designers and system administrators to identify new features\n\tImplement modern technologies to improve legacy applications\n\tCollect, analyse and address technical and design requirements\n\tHelp to create reusable code and libraries for future use\n\tStay informed about emerging technologies\n\n\nRequirements\n\n\n\tBachelors or higher in Computer Science or a related field or equivalent\n\t5+ years of industry experience\n\tExperience with DevOps principles\n\tExperience with Microservices and Event-Driven architecture\n\tStrong computer science fundamentals, algorithms, and data structures background\n\tModel of software engineering best practices, including agile development, unit testing, code reviews, design documentation, debugging, and troubleshooting\n\tSolid experience with C#, .Net, .Net Core\n\tStrong computer science fundamentals, algorithms, and data structures background\n\tA deep understanding of Source Code Management\n\tPossess an in-depth understanding of Cloud Technologies (Azure, AWS)\n\tA great understanding of databases and SQL\n\tAn in-depth understanding of REST APIs, SOAP & RPC\n\tStrong understanding of the Software Development Life Cycle (SDLC)\n\tExperience in technical writing and API documentation\n\tFamiliar with project management tools (e.g Trello, Jira, etc)\n\n\nBenefits\nAt Kuda, our people are the heart of our business, so we prioritize your welfare. We offer a wide range of competitive benefits in areas including but not limited to:\n\n\n\tA great and upbeat work environment populated by a multinational team\n\tPension\n\tCareer development & growth\n\tCompetitive annual leave plus bank holidays\n\tCompetitive paid time off (Parental, Moving day, Birthday, Study leave etc)\n\tGroup life insurance\n\tMedical insurance\n\tWell-fare package (Wedding, Compassionate and etc)\n\tPerkbox\n\tGoal - employee wellness app\n\tAward winning L&D training\n\tWe are advocates of work-life balance, working in a hybrid in office schedule\n\n\nNote\n\n\n\tKuda is proud to be an equal-opportunity employer.\n\tWe value diversity and anyone seeking employment at Kuda is considered based on merit, qualifications, competence and talent.\n\tWe don't regard colour, religion, race, national origin, sexual orientation, ancestry, citizenship, sex, marital or family status, disability, gender, or any other legally protected status.\n\tIf you have a disability or special need that requires accommodation, please let us know.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]