[
  {
    "title": "Quality Assurance Officer Job at D-Degree Digital Hub Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/quality-assurance-officer-job-at-d-degree-digital-hub-limited",
    "pubDate": "Mon, 07 Jul 2025 12:33:02 GMT",
    "source": "JobGurus",
    "keyword": "d-degree digital hub limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "D-Degree Digital is a Google Partner in Africa (Ghana and Nigeria). The company’s reputation has speedily grown to become a must-stop point for most major digital and media projects in Africa. It provides soft-landing leverage for developmental digital and media exercises across the shores of the sub-Sahara region. Aside, we are a Digital Project Facilitation, Digital Marketing, and Fintech Solution Company with years of experience and uncommon achievements.\n\nWe are recruiting to fill the position below:\n\nJob Position: Quality Assurance Officer\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Location: Ogba, Ikeja, Lagos, Hybrid (Onsite at D-Degree HQ, Ogba, Lagos & Remote)\nEmployment Type: Full-time\nDepartment: Technology / Product Development\nReports To: Product Lead / CTO\n\nJob Summary\n\n\n\tD-Degree Digital Hub is seeking a detail-oriented and proactive Quality Assurance Specialist (QAS) to join our team in ensuring the reliability, usability, and excellence of the DDSA (Direct Digital Sales Agent) application.\n\tThe QAS will be responsible for testing, identifying bugs, verifying fixes, and validating performance across the DDSA mobile and web platforms.\n\tThe ideal candidate must have a passion for quality, a critical eye for detail, and the discipline to enforce product standards as DDSA scales across Nigeria and beyond.\n\n\nKey Responsibilities\n\n\n\tDevelop and execute manual and automated test cases for the DDSA app\n\tConduct functional, usability, UI/UX, performance, regression, and security testing\n\tIdentify, document, and track bugs using issue management tools (e.g., Jira, Trello, ClickUp)\n\tCollaborate with developers, designers, and product managers to validate fixes and improvements\n\tEnsure cross-device and cross-platform compatibility (Android, iOS, Web)\n\tSimulate user scenarios (agent onboarding, transaction flow, recovery path, etc.)\n\tProvide QA reports, test coverage metrics, and product health feedback\n\tParticipate in release planning, sprint reviews, and post-launch assessments\n\tRecommend enhancements and provide input on app stability and user experience\n\n\nRequirements\n\n\n\tProven experience as a QA Tester or QAS, preferably on digital platforms or fintech apps\n\tFamiliarity with mobile testing tools, platforms, and bug tracking systems\n\tStrong understanding of Agile/Scrum environments and QA methodologies\n\tExcellent attention to detail and analytical thinking\n\tAbility to communicate clearly with technical and non-technical teams\n\tBonus: Experience testing agent or onboarding systems, digital wallets, or financial platforms\n\n\nPreferred Qualifications:\n\n\n\tB.Sc. in Computer Science, Software Engineering, or related field\n\tCertification in Quality Assurance (e.g., ISTQB, CSTE) is a plus\n\tFamiliarity with HTML, APIs, or basic scripting a plus (but not required).\n\n\nWhy Join Us?\n\n\n\tBe part of Nigeria’s first all-sector Digital Financial Inclusion platform\n\tContribute to a product with national impact and millions of end users\n\tGrow with an innovation-driven team at the heart of digital transformation\n\n\nMethod of Application\nInterested and qualified candidates should send their Application and CV to: info@d-degreedigital.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Software Engineer (Frontend) Job at Interswitch",
    "link": "https://www.jobgurus.com.ng/jobs/view/software-engineer-frontend-job-at-interswitch",
    "pubDate": "Mon, 07 Jul 2025 12:33:02 GMT",
    "source": "JobGurus",
    "keyword": "interswitch",
    "duplicate": false,
    "classifications": [
      "Software Engineering"
    ],
    "content": "Interswitch is an Africa-focused integrated digital payments and commerce company that facilitates the electronic circulation of money as well as the exchange of value between individuals and organisations on a timely and consistent basis. We started operations in 2002 as a transaction switching and electronic payments processing company, and have progressively evolved into an integrated payment services company, building and managing payment infrastructure as well as delivering innovative payment products and transactional services throughout the African continent. At Interswitch, we offer unique career opportunities for individuals capable of playing key roles and adding value in an innovative and fun environment.\n\nWe are recruiting to fill the position below:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Position: Software Engineer (Frontend)\n\nJob Location: Lagos\n\nJob Purpose\n\n\n\tOur Innovation Hub is seeking an experienced Senior Front End Software Engineer who will play a crucial role in driving our team's technical capabilities to deliver innovative products.\n\tThe ideal candidate will be passionate about front-end development and user experience, have experience working with a range of technologies, and have a proven track record of delivering high-quality web applications\n\n\nResponsibilities\n\n\n\tDevelop and maintain responsive web applications and user interfaces that are visually appealing and intuitive to use.\n\tCollaborate with cross-functional teams to identify and prioritize features, requirements, and technical solutions that will drive innovation.\n\tLead the design and implementation of scalable and maintainable software architecture that meets functional and non-functional requirements.\n\tDrive the adoption of modern front-end technologies and best practices within the team, including performance optimization, accessibility, and security.\n\tMentor and coach other team members to improve their technical skills and contribute to the overall success of the team.\n\tParticipate in code reviews, debugging, and troubleshooting to ensure that software is reliable, maintainable, and performs optimally.\n\tStay up-to-date with the latest trends, technologies, and best practices in front-end development.\n\n\nRequirements\n\n\n\tBachelor's or Master's degree in Computer Science or a related field.\n\t3+ years of experience in front-end software engineering.\n\tExpertise in React Native\n\tExperience with responsive design and mobile-first development.\n\tUnderstanding of software development methodologies, including agile and DevOps.\n\tStrong problem-solving and analytical skills.\n\tExcellent verbal and written communication skills.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "General Manager Job at Uncle Stan's Foods",
    "link": "https://www.jobgurus.com.ng/jobs/view/general-manager-job-at-uncle-stans-foods",
    "pubDate": "Mon, 07 Jul 2025 12:33:02 GMT",
    "source": "JobGurus",
    "keyword": "uncle stan's foods",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Uncle Stan's Foods is a small chops company known for it's unique finger food taste all over Lagos. Our brand makes us unique.\n\nWe are recruiting to fill the position below:\n\nJob Position: General Manager\n\nJob Location: Lagos\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are looking for a self-motivated and results-driven General Manager to direct and manage our organization's business activities and to develop and implement effective business strategies and programs.\n\tDuties for the general manager will include allocating budget resources, formulating policies, coordinating business operations, monitoring and motivating staff, managing operational costs, ensuring good customer service, improving administration processes, engaging with vendors, hiring and training employees, identifying business opportunities, and monitoring financial activities.\n\tYour entrepreneurial spirit and vision in directing business functions will assist our organization in maintaining relationships with clients, generating new business, increasing staff productivity, improving service, ensuring sustainability, and meeting business objectives.\n\tThe successful candidate for this role should possess excellent communication skills, superior knowledge of business functions, exceptional budgeting, and finance skills, and strong leadership qualities.\n\tThe noteworthy general manager should account for all business activities, support staff development, enhance efficiency, drive sales and improve revenue, maintain relationships with clients, enhance the organization's image, and meet overall growth objectives.\n\n\nResponsibilities\n\n\n\tOverseeing daily business operations.\n\tDeveloping and implementing growth strategies.\n\tTraining low-level managers and staff.\n\tCreating and managing budgets.\n\tImproving revenue.\n\tHiring employees.\n\tEvaluating performance and productivity.\n\tAnalyzing accounting and financial data.\n\tResearching and identifying growth opportunities.\n\tGenerating reports and giving presentations.\n\n\nRequirements\n\n\n\tCandidates should posess a Degree in Business Management or a Master's Degree in Business Administration.\n\tGood knowledge of different business functions.\n\tStrong leadership qualities.\n\tExcellent communication skills.\n\tHighly organized.\n\tStrong work ethic.\n\tGood interpersonal skills.\n\tMeticulous attention to detail.\n\tComputer literate.\n\tProactive nature.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hrunclestansfoods@gmail.com using the Job Positon as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Inventory and Sales Officer Job at MN Global Ventures",
    "link": "https://www.jobgurus.com.ng/jobs/view/inventory-and-sales-officer-job-at-mn-global-ventures",
    "pubDate": "Mon, 07 Jul 2025 12:33:02 GMT",
    "source": "JobGurus",
    "keyword": "mn global ventures",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance"
    ],
    "content": "MN Global Ventures - We are a reputable company that imports and supplies high-quality medical equipment to top hospitals and healthcare centers across Nigeria. We are committed to improving lives through reliable medical solutions and efficient service delivery.\n\nWe are recruiting to fill the position below:\n\nJob Position: Inventory and Sales Officer\nJob Location: Ago Palace Way - Okota, Lagos\nEmployment Type: Full-time\nIndustry: Medical Equipment Supply\nWork Schedule: Monday to Friday, 8:00 AM – 5:00 PM\nBranch Visits: Twice a month to Idumota branch (logistics covered by company)\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking an organized and proactiveInventory and Sales Support Officerto manage inventory records, promote products online, support customer engagement, and handle basic sales documentation.\n\tThis role requires someone who is reliable, detail-oriented, and able to work independently while supporting the team’s operations.\n\n\nKey Responsibilities\n\n\n\tTrack and maintain accurate records of warehouse inventory.\n\tUpload and promote company products on social media platforms.\n\tLog all sales and stock movements on the system promptly.\n\tAttend to walk-in customers and provide excellent service.\n\tDraft invoices and support preparation of contracts or client documentation.\n\tCollaborate with warehouse and sales teams for smooth order fulfillment.\n\tVisit the company’s Idumota branch twice monthly (logistics covered).\n\n\nRequirements\n\n\n\tFemale candidates only (ages 22–35 preferred).\n\t1+ year of experience in inventory, customer service, or admin roles is an advantage.\n\tOND, HND, or Bachelor’s Degree in Business Administration, Marketing, or related field.\n\tProficient in Microsoft Word and basic inventory management software.\n\tExcellent communication and interpersonal skills.\n\tAbility to multitask, stay organized, and work with minimal supervision.\n\tFamiliar with using social media for business promotion.\n\tMust be honest, hardworking, and committed to maintaining confidentiality at all times.\n\n\nWhat We Offer\n\n\n\tSalary: N100,000 - N120,000 monthly.\n\tA supportive and team-driven environment\n\tReal-world experience in the healthcare and medical equipment space\n\tCompany-covered logistics for scheduled branch visits\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and a brief cover letter to: princessojiaku37@gmail.com using \"Inventory and Sales Support Officer Application\" as the subject of the email.\n\nProximity Notice\n\n\n\tApplicants must reside in or around Ago Palace Way, Isolo, Amuwo-Odofin, Festac, and its environs.\n\tProximity is important and will be a key factor in the selection process.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Data Entry Officer Job at D-Degree Digital Hub Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/data-entry-officer-job-at-d-degree-digital-hub-limited",
    "pubDate": "Mon, 07 Jul 2025 12:33:02 GMT",
    "source": "JobGurus",
    "keyword": "d-degree digital hub limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "D-Degree Digital Hub is a leading Nigerian innovation and technology company dedicated to digital inclusion, fintech enablement, digital product development, and capacity building. Founded with the vision to empower communities and bridge the digital divide, D-Degree operates at the intersection of technology, finance, education, and entrepreneurship.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are the creators of DDSA (Direct Digital Sales Agent) — Nigeria’s first all-sector Digital Financial Inclusion platform — designed to power job creation, agent network systems (ANS), and seamless multi-sector digital access across rural and urban communities. Through strategic partnerships with national institutions and grassroots stakeholders, D-Degree Digital Hub is helping to activate millions of empowered digital agents, transform how services reach the underserved, and foster a truly inclusive digital economy.\n\nWe are recruiting to fill the position below:\n\nJob Position: Data Entry Officer\nJob Location: Ogba / Ikeja, Lagos\nEmployment Type: Full-Time / Contract\nDepartment: Operations / Admin\nReports To: Operations Manager\n\nJob Summary\n\n\n\tWe are seeking a highly accurate and reliable Data Entry Officer to support the day-to-day backend operations of the DDSA (Direct Digital Sales Agent) platform.\n\tThe ideal candidate will be responsible for entering, updating, and managing large volumes of data related to agents, transactions, field activities, and onboarding documentation, ensuring accuracy, confidentiality, and quick turnaround.\n\n\nKey Responsibilities\n\n\n\tAccurately enter and update agent registration data into the DDSA system\n\tReview and validate agent profiles, forms, and supporting documents\n\tTrack data inconsistencies and work with field teams for correction/resolution\n\tMaintain proper digital filing systems and backups\n\tGenerate daily or weekly data reports for internal reviews\n\tFlag errors, duplicates, and suspicious entries to supervisors\n\tAssist in cleaning, organizing, and migrating historical data into the DDSA database\n\tMaintain confidentiality and secure handling of sensitive agent and user records.\n\n\nPreferred Qualifications\n\n\n\tOND / HND / B.Sc. in Business Admin, Computer Science, or related discipline\n\tPrior experience in data entry, admin support, or digital onboarding roles\n\tBonus: Experience in financial inclusion, agent registration, or fintech fieldwork.\n\n\nRequirements:\n\n\n\tStrong attention to detail and accuracy\n\tFast and error-free typing skills (minimum 40 WPM preferred)\n\tExperience with Excel, Google Sheets, and online form tools\n\tFamiliarity with CRM tools, dashboards, or entry platforms is an added advantage\n\tAbility to work with minimal supervision and meet deadlines\n\tExcellent organization and time management skills\n\tStrong written and verbal communication skills.\n\n\nWhy Join Us?\n\n\n\tSalary: N50,000 Monthly.\n\tBe part of a national movement powering digital jobs and financial access\n\tJoin a growing team committed to innovation, impact, and inclusion\n\tGain valuable experience working within a tech-enabled ecosystem\n\n\nMethod of Application\nInterested and qualified candidates should send their Application and CV to: info@d-degreedigital.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]