[
  {
    "title": "Software Developer (Full Stack) Job at Krystal Digital Solutions Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/software-developer-full-stack-job-at-krystal-digital-solutions-limited-3",
    "pubDate": "Tue, 10 Jun 2025 13:51:21 GMT",
    "source": "JobGurus",
    "keyword": "krystal digital solutions limited",
    "duplicate": false,
    "classifications": [
      "Software Engineering"
    ],
    "content": "Krystal Digital is a full service ICT company which specializes in the development, research, deployment and creation of customized and service oriented software applications.Our organization has a strong competence in providing secure and continuously available Information technology/infrastructure solutions to organizations, institutions and parastatals as required which helps its clients drive efficiency and improve its service delivery. The company has several notable products; Krystal IT Academy, Central Billing System, iLearnNG and Myskool portal to her credit alongside other non-disclosed works.\n\nWe are recruiting to fill the position below:\n\nJob Position: Software Developer (Full Stack)\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Location: Wuse, Abuja (FCT)\nEmployment Type: Full-time\n\nResponsibilities\n\n\n\tWrite clean, efficient, and maintainable code while following industry best practices.\n\tShould have a strong background in the following programming languages;PHP (Laravel, Livewire, CodeIgniter),JavaScript (Vue, Nuxt, Alpine.Js, jQuery),CSS (Tailwind, Bootstrap),Database (MySQL),Server Management (Linux/Ubuntu - Digital Ocean and Laravel Forge experience is a plus).\n\tMaintain technical documentation, code documentation, and knowledge sharing within the team.\n\tFoster a collaborative and innovative development environment.\n\n\nQualifications\n\n\n\tBachelor's or Master's Degree in Computer Science, Software Engineering, or a related field.\n\t4 - 6 years of experience as a full-stack developer\n\tStrong leadership and team management skills.\n\tExcellent problem-solving and analytical abilities.\n\tStrong communication and interpersonal skills.\n\tKnowledge of software development best practices and emerging trends.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: careers@krystalng.com using \"Full Stack Developer\" as the subject of the email.\n\nNote: Only shortlisted candidate will be contacted and it is not a Remote job.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Customer Service Officer Job at Traydah Global Resources Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/customer-service-officer-job-at-traydah-global-resources-limited-1",
    "pubDate": "Tue, 10 Jun 2025 13:51:21 GMT",
    "source": "JobGurus",
    "keyword": "traydah global resources limited",
    "duplicate": false,
    "classifications": [],
    "content": "Traydah is an online platform where users sell digital assets for naira.\n\nWe are recruiting to fill the position below:\n\nJob Position: Customer Service Officer\n\nLocation: Oyo\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a dedicated and proactive Customer Service Representative to join our dynamic team in Ibadan.\n\tThe ideal candidate must live near Eleyele or Dugbe, be between 20 and 25 years old, and possess intermediate computer skills.\n\tThis role requires a commitment to providing exceptional customer service and the flexibility to work 12-hour rotational day and night shifts.\n\n\nResponsibilities\n\n\n\tHandle customer inquiries and complaints via phone, email, and chat.\n\tAttend to customers' online transactions.\n\tResolve customer issues promptly and effectively.\n\tKeep records of customer interactions, transactions, comments, and complaints.\n\tCommunicate and coordinate with colleagues as necessary.\n\tFollow organizational procedures, guidelines, and policies.\n\n\nRequirements\n\n\n\tFirst Degree or equivalent.\n\tMust reside in Ibadan, preferably near Jericho..\n\tIntermediate computer skills, including proficiency in MS Office.\n\tExcellent communication and interpersonal skills.\n\tAbility to work a 12-hour shift.\n\tWillingness to work rotational day and night shifts.\n\tAge between 20 and 25 years\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: traydah.notifications@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Human Resource (HR) Executive Job at Garment Care Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/human-resource-hr-executive-job-at-garment-care-limited",
    "pubDate": "Tue, 10 Jun 2025 13:51:21 GMT",
    "source": "JobGurus",
    "keyword": "garment care limited",
    "duplicate": false,
    "classifications": [],
    "content": "Garment Care Limited was incorporated in 1999 and has emerged to be Nigeria’s premier dry-cleaning company. We are the first European style dry cleaning and Laundry Company to be established in Nigeria.\n\nWe are recruiting to fill the position below:\n\nJob Position: Human Resource (HR) Executive\n\nJob Location: Lagos\nEmoloyment type: Full time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a dynamic and detail-oriented HR Executive to join our team.\n\tThe ideal candidate will be responsible for managing HR operations and ensuring the smooth implementation of policies and practices to support the organization.\n\n\nJob Description\n\n\n\tCoordinate daily HR operations and ensure accurate and timely documentation.\n\tMaintain and update employee records, ensuring compliance with company policies.\n\tSupport recruitment activities, including interviewing and onboarding new staff.\n\tAssist in managing employee benefits, and other HR-related processes.\n\tEnsure compliance with labour laws and maintain a positive work environment.\n\tProvide support to management in addressing employee relations issues.\n\n\nBasic Requirements:\n\n\n\tA Bachelor’s Degree in social sciences, or related field.\n\tProven experience as an HR Executive or in a similar role.\n\tKnowledge on micro soft packages\n\tExcellent attention to detail, with the ability to identify and resolve issues.\n\n\nSalary\nN100,000 (net) + other benefits\n\nMethod of Application\nInterested and qualified candidates should send their CV to: talentportal01@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Media Training Manager Job at Bisimkha TV",
    "link": "https://www.jobgurus.com.ng/jobs/view/media-training-manager-job-at-bisimkha-tv",
    "pubDate": "Tue, 10 Jun 2025 13:51:21 GMT",
    "source": "JobGurus",
    "keyword": "bisimkha tv",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Bisimkha TV is a fast-growing, multi-channel media platform based in Abuja, operating three powerful online content arms:Bisimkha Kingdom Network (BKN) – focused on Christian faith, worship, and revival.Bisimkha Inspiration TV (BITV) – focused on business, career growth, leadership, and entrepreneurship.Bisimkha Homes TV (BHTV) – focused on real estate education, wealth-building, and property investment. We are expanding our team and seeking creative, driven, and purpose-aligned individuals to join us in building a media hub that speaks to the heart, mind, and marketplace.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Media Training Manager\nJob Location: Garki, Abuja (FCT) \nEmployment Type: Full-time\n\nJob Description\n\n\n\tDesign and Facilitate media traning programs for aspiring creators.\n\n\nRequirements\n\n\n\tB.Sc or HND in media, communication, Education or related field.\n\t2 - 4 years of work experience.\n\tOther requirement: Experience in tranning, mentoring, or coaching roles,public speaking and facilitatoion skills required.\n\n\nSalary\nN100,000 - N150,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV and letter of application to: bisimkhatv@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Assistant Manager - EHS, Base and District Operations Job at Oando Plc",
    "link": "https://www.jobgurus.com.ng/jobs/view/assistant-manager-ehs-base-and-district-operations-job-at-oando-plc",
    "pubDate": "Tue, 10 Jun 2025 13:51:21 GMT",
    "source": "JobGurus",
    "keyword": "oando plc",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Software Engineering"
    ],
    "content": "Oando Plc is one of Africa’s largest integrated energy solutions providers with a proud heritage. It has a primary listing on the Nigerian Stock Exchange and a secondary listing on the Johannesburg Stock Exchange with shared values of Teamwork, Respect, Integrity, Passion and Professionalism (TRIPP).\n\nWe are recruiting to fill the position below:\n\nJob Position: Assistant Manager - EHS, Base and District Operations\n\nJob Location: Port Harcourt, Rivers\nJob Type: Full Time \nReports to: Safety Manager\nSupervises: EHS Officers - Port Harcourt Base\nInterfaces: Base and District Management, Regulatory Agencies, Contractors\n\nJob Purpose\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Assistant Manager EHS, Base and District Operations, will oversee and implement Environmental, Health, and Safety (EHS) programs and policies for the company’s Port Harcourt base and district operations and implement the safe transportation of personnel, equipment, and materials across land, marine, and air modes.\n\tThe role will ensure compliance with regulatory requirements, industry standards, and company policies.\n\n\nMajor Responsibility Area\n\n\n\tDevelop, implement, and maintain EHS policies and procedures specific to Port Harcourt base operations\n\tEnsure alignment with company EHS policies, regulatory requirements, and industry standards.\n\tConduct regular EHS awareness campaigns to promote a safety-first culture\n\tInvestigate EHS incidents in Port Harcourt base operations, including transport-related incidents, near misses, and accidents, identifying root causes and implementing corrective actions.\n\tCollaborate with cross functional teams to develop and implement risk mitigation strategies\n\tDesign , implement, and monitor transport safety plans, procedures, and standards to ensure compliance with regulatory requirements and company policies\n\tIdentify, assess, and mitigate transport-related hazards and risks, ensuring that all transport operations are conducted safely.\n\tTrack and analyze transport-related EHS performance metrics, providing regular reports to management and recommending improvement initiatives.\n\tCollaborate with internal stakeholders(e.g. Operations, Maintenance, and Logistics), regulatory agencies, and industry partners to share best practices and ensure alignment with industry standards\n\tEnsure adherence to relevant laws, regulations, and industry standards governing land, marine, and air transportation.\n\tOversee the selection, evaluation , and management of transport contractors and service providers, ensuring they meet company EHS standards.\n\tDevelop and deliver training programs to transport personnel, contractors, and stakeholders on EHS issues, procedures and best practices\n\tMonitor and analyse EHS performance metrics for Port Harcourt base operations. Report EHS performance to Corporate EHS\n\tEnsure that base safety procedures are developed , implemented , and maintained.\n\tFoster a strong EHS culture by engaging with teams, contractors, and community stakeholders, promoting accountability and proactive safety practices.\n\tEnsure readiness for regulatory inspections and manage relationships with relevant government agencies and industry bodies.\n\tTrack and close out of HSE action items, including actions from internal and external audit findings.\n\tConduct regular audits, inspections, and reviews of base operations to identify opportunities for continuous improvement in EHS performance.\n\tDevelop and execute the HSE strategy for the operational base, aligning with corporate objectives, IOC standards, and regulatory requirements.\n\tEstablish and monitor performance metrics to measure HSE effectiveness and drive continuous improvement.\n\tEnsure full compliance with local, national, and international HSE regulations (e.g. ISO 39001, ISO 14001, ISO 45001) and IOC policies.\n\tPromote a strong EHS culture through continuous education and awareness initiatives.\n\tOversee and ensure the EHS performance of contractors and suppliers working at the Port Harcourt base. Ensure that all contractors adhere to the company’s EHS policies and procedures.\n\tMentor and guide Base EHS Officers and teams, enhancing their technical and leadership capabilities.\n\tOversee environmental management programs, including waste management, emissions monitoring, and spill response, ensuring adherence to sustainability objectives and regulatory requirements.\n\tDrive initiatives to reduce the base’s environmental footprint, including energy efficiency and pollution control measures.\n\tLead the adoption of HSE innovations and best practices, leveraging industry trends and technological advancements to enhance safety performance.\n\tDrive a culture of continuous learning by reviewing lessons learned from internal and external incidents and implementing improvements.\n\tPerform any other duty assigned by the Safety Manager.\n\n\nJob Specification\n\n\n\tBachelor’s Degree in Chemical, Mechanical or Process Engineering (or a related field).\n\tMinimum 10 years of experience in base safety operations, preferably in the oil and gas industry\n\tA master's degree in a related discipline is an added advantage.\n\tExperience in risk management, emergency response, monitoring, and compliance reporting\n\tMembership of a relevant professional body (e.g. ISPON, NES, IOSH, COREN, MNSE, IIRSM, etc.)\n\tStrong knowledge of process safety management systems, regulations, and industry standards (e.g. OSHA, API, ISO)\n\tNEBOSH International General Certificate in Occupational Health and Safety\n\tPossession of ISO 45001 and 14001 Lead Auditor Certifications is desirable\n\tCandidates holding a NEBOSH International Diploma in Occupational Health and Safety will have an advantage\n\tStrong knowledge of Nigerian and international EHS regulations and standards\n\tGood written & oral communication skills.\n\tAdministrative skills, including proficiency in typical MS Office applications (e.g. Word, Excel, PowerPoint, etc.)\n\n\nFunctional Skills and Competencies:\n\n\n\tStrong project management skills with experience in EPCIC projects\n\tExcellent analytical, problem-solving, and decision-making skills.\n\tEffective leadership, communication, and team management capabilities.\n\tAbility to manage and prioritize multiple tasks under pressure\n\tFamiliarity with risk assessment methodologies and tools.\n\tShould possess expertise in contractor EHS management.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]