[
  {
    "title": "Store and Inventory Officer Job at Accor Hotels",
    "link": "https://www.jobgurus.com.ng/jobs/view/store-and-inventory-officer-job-at-accor-hotels",
    "pubDate": "Tue, 10 Jun 2025 13:30:11 GMT",
    "source": "JobGurus",
    "keyword": "accor hotels",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Accor Hotel is a French multinational hospitality company that owns, manages, and franchises hotels, resorts, and vacation properties. It is the largest hospitality company in Europe and the sixth-largest hospitality company worldwide.\n\nWe are recruiting to fill the position below:\n\nJob Position: Store and Inventory Officer\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking an organized and efficient Store and Inventory Officer to join our team in Lagos, Nigeria.\n\tThe successful candidate will be responsible for managing and optimizing our inventory processes, ensuring accurate stock levels, and maintaining a well-organized storage facility.\n\n\nResponsibilities\n\n\n\tOversee daily inventory operations, including receiving, storing, and distributing goods\n\tConduct regular stock counts and reconcile discrepancies\n\tMaintain accurate inventory records using specialized software and Microsoft Excel\n\tImplement and maintain inventory control procedures to minimize losses and ensure accuracy\n\tPrepare and submit regular inventory reports to management\n\tAnalyze inventory data to identify trends, forecast demand, and prevent stockouts\n\tCollaborate with purchasing and logistics teams to optimize stock levels and reduce costs\n\tEnsure compliance with safety regulations and maintain a clean, organized warehouse\n\tCoordinate with suppliers and vendors for efficient inventory management\n\n\nQualifications\n\n\n\tBachelor's degree in Business Administration, Supply Chain Management, or related field\n\t2-3 years of experience in inventory management or a similar role\n\tProficiency in inventory management software and Microsoft Office Suite, especially Excel\n\tStrong analytical and problem-solving skills with attention to detail\n\tExcellent organizational and time management abilities\n\tIn-depth knowledge of warehouse operations and supply chain processes\n\tExperience with various inventory control methods and best practices\n\tAbility to work independently and collaboratively in a fast-paced environment\n\tStrong communication skills, both verbal and written.\n\n\nAdditional Information:\n\n\n\tExperience is an asset\n\tAbility to work shifts , including weekends and holidays . \n\tMust be physically fit to handle tools , equipment , and manual task.\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Head of Procurement Job at Ariosh Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/head-of-procurement-job-at-ariosh-limited",
    "pubDate": "Tue, 10 Jun 2025 13:30:11 GMT",
    "source": "JobGurus",
    "keyword": "ariosh limited",
    "duplicate": false,
    "classifications": [],
    "content": "Ariosh Limited delivers engineering and construction services in the onshore, offshore and subsea segment of the oil and gas sector in Nigeria, West Africa. Our people, assets, specialist technical partners and cordial relationship with the communities in which we operate enable us to deliver projects on schedule, safely and with unparalleled quality. We have successfully built long term trust-based relationships with our clients, thereby making us the partner of choice for the delivery of engineering and construction projects.\n\nWe are recruiting to fill the position below:\n\nJob Position: Head of Procurement\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nRequirements\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tBachelor's degree in Engineering or related fields.\n\tMinimum of 6 years of relevant experience in the Oil and gas industry\n\tBroad of the Engineering and Construction industry.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: careers@ariosh.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Sea & Air Shipping Officer Job at Benmaris Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/sea-air-shipping-officer-job-at-benmaris-limited",
    "pubDate": "Tue, 10 Jun 2025 13:30:11 GMT",
    "source": "JobGurus",
    "keyword": "benmaris limited",
    "duplicate": false,
    "classifications": [],
    "content": "Benmaris Limited started as a professional manpower providers, financial consultants and general works contractor in 2007. It is a wholly owned Nigerian Company. Over the years, it has undertaken many challenging projects and accumulated skills, know-how and experiences in Facilities Management, Procurement and Supply Services, Design and Build Solutions, Project Management Services, Building Construction and related engineering works.\n\nWe are recruiting to fill the position below:\n\nJob Position: Sea & Air Shipping Officer\n\nJob Location: Port Harcourt, Rivers\nEmployment Type: Full-Time\n\nAbout the Role\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tOpen & Close shipment (Sea & Air freight) hardcopy files.\n\tApply for Sea & Air freight Import SONCAP Certificates & follow up.\n\tApply for Sea & Air freight Import PAAR & follow up with Bank\n\tCommunicates PAARs & other Shipping documents to LCAs.\n\tReconciles & responds to Customs DNs & other queries.\n\tFollow up with LCAs on PAAR utilization.\n\tUpdates PAAR progress on the W-Drive\n\tPrepares weekly PAAR application status & monthly PAAR utilization reports.\n\tUpdates Transit E-archive.\n\tAny other activity or Service function assigned to me by the Manager of the Department.\n\n\nRequirements\n\n\n\tDegree in Social Science or Engineering course\n\tComputer literate: Use of Microsoft applications and database management software\n\tKnowledge of SAP is an added advantage.\n\tInterfaces with contractors and should be capable of speaking and writing good English.\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "IT / Technical Assistant Job at Mediflex Industries PVT Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/it-technical-assistant-job-at-mediflex-industries-pvt-limited",
    "pubDate": "Tue, 10 Jun 2025 13:30:11 GMT",
    "source": "JobGurus",
    "keyword": "mediflex industries pvt limited",
    "duplicate": false,
    "classifications": [
      "Software Engineering"
    ],
    "content": "Mediflex Industries PVT Limited is a Manufacturing Company that is involved in the manufacturing of quality medical consumables like medical hand-gloves, face masks and other supplies used in hospitals, laboratories and medical outfits. We are driven by a passion to provide high-quality medical supplies and equipment to healthcare providers and consumers. Our commitment is to improve patient outcomes by ensuring that our products meet the highest standards of safety, quality, and effectiveness.\n\nWe are recruiting to fill the position below:\n\nJob Position: IT / Technical Assistant\n\nJob Location: Idu Industrial Area, Abuja (FCT) \nEmployment Type: NYSC\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nPosition Summary\n\n\n\tAs an IT and Technical Assistant Intern, you will assist in the maintenance, troubleshooting, and optimization of our systems, networks, and technical operations.\n\tThis is an excellent opportunity to develop foundational skills in IT support and system administration\n\n\nKey Responsibilities\n\n\n\tAssist with installing, configuring, and troubleshooting hardware, software, and network systems.\n\tProvide first-level technical support to end-users (in person or remotely).\n\tSupport regular maintenance of IT infrastructure including backups, updates, and patch management.\n\tSupport in implementing basic cybersecurity measures and data protection protocols.\n\tCollaborate with cross-functional teams on technical requirements for ongoing projects.\n\tMaintain and update inventory of IT equipment and software licenses.\n\tAssist in setting up new employee workstations, including email accounts, user credentials, and device configuration.\n\tDocument technical processes, procedures, and solutions for internal knowledge base.\n\tStay up to date with IT trends and recommend improvements to enhance system performance.\n\n\nQualifications & Skills\n\n\n\tRecently completed a Degree in Computer Science, Information Technology, or related field.\n\tBasic understanding of computer systems, networks, and common software applications (Windows, macOS, Microsoft 365, etc.).\n\tFamiliarity with troubleshooting tools and IT support best practices.\n\tStrong problem-solving skills with a keen attention to detail.\n\tExcellent communication and interpersonal skills.\n\tAbility to prioritize and manage multiple tasks in a fast-paced environment.\n\tEagerness to learn and take initiative in challenging situations.\n\n\nDesirable (Not Mandatory):\n\n\n\tKnowledge of cybersecurity fundamentals.\n\tFamiliarity with cloud services (e.g., AWS, Google Cloud, Azure).\n\tBasic scripting or programming knowledge (Python, PowerShell, etc.).\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Grants Manager Job at International Rescue Committee",
    "link": "https://www.jobgurus.com.ng/jobs/view/grants-manager-job-at-international-rescue-committee-1",
    "pubDate": "Tue, 10 Jun 2025 13:30:11 GMT",
    "source": "JobGurus",
    "keyword": "international rescue committee",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "The International Rescue Committee (IRC) responds to the world’s worst humanitarian crises and helps people to survive and rebuild their lives. Founded in 1933 at the request of Albert Einstein, the IRC offers lifesaving care and life-changing assistance to refugees forced to flee from war or disaster. At work today in over 40 countries and 22 U.S. cities, we restore safety, dignity and hope to millions who are uprooted and struggling to endure. The IRC leads the way from harm to home.\n\nWe are recruiting to fill the position below:\n\nJob Position: Grants Manager\n\nJob Id: req58275\nJob Location: Maiduguri, Borno\nSector: Grants\nJob Type: Full Time\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nScope of work \n\n\n\tBased in Maiduguri, Nigeria the Grants Manager will provide grant management, business development and reporting support across the Nigeria portfolio. \n\tThe Grants Manager will work closely with program, M&E finance, operations and senior management team (SMT) staff to ensure quality management of both pre and post award grants functions. \n\tThe Grants Manager will support donor compliance, timely reporting, high quality proposal development, project document filing, preparing donor briefs and donor/internal visibility. \n\tThe position holder will be supervised by the Senior Grants Coordinator and will work closely with other grants, partnerships, and communications managers. \n\n\nAreas of Responsibilities\nInformation management:\n\n\n\tAct as custodian of documentation of institutional knowledge and program activities in coordination with relevant sector supervisors and coordinators. \n\tMaintain comprehensive electronic files for programs, and ensure IRC colleagues and have access to relevant records and information.\n\n\nDonor relations and communications:\n\n\n\tLiaise with donors and potential donors, and other operational partners, including through attendance at meetings, and representing IRC and IRC’s interests by maintaining positive and constructive relations.\n\tIn coordination with relevant colleagues, respond to requests from donors for compliance information and respond to donor compliance questions as needed.\n\tEnsure that relevant staff members are aware of all donor communications, changes in regulations, and meetings or events.\n\tFacilitate and participate in donor visits and/ or meetings.\n\tDevelop external communication materials including factsheets and program updates\n\n\nCompliance:\n\n\n\tMaintain up to date comprehensive knowledge of donor guidelines relevant to  the Nigeria portfolio, including but not limited to: USAID, FCDO, ECHO, UNOCHA.\n\tProvide training to IRC staff on compliance and donor-specific compliance requirements.\n\tClosely monitor grants for internal or donor compliance issues, and flag concerns in a timely manner. \n\n\nGrant management and business development:\n\n\n\tWith the support of the Senior Grants Coordinator, coordinate the development of quality proposals and narrative reports with relevant teams, including acting as lead writer when necessary.\n\tLiaise with HQ units (Regional Unit, Awards Management Unit, Technical Units) to ensure proposals meet internal standards and are responsive to donor requirements.\n\tSupport program staff to assess funding opportunities in line with IRC Nigeria’s strategic objectives and the local context, advising on these as required.\n\tWork with program coordinators and managers to coordinate the timely development of high quality new funding proposals and reports.\n\tWork closely with other members of the grants unit to proactively support grants management processes across the portfolio. \n\tMonitor and support the use of grant/project management tools  to ensure accurate tracking of opportunities, reporting and programmatic adjustments through the project life cycle.\n\tProvide technical guidance on IRC and donor regulations to ensure compliance across IRC Nigeria, proactively raising and resolving issues.\n\tManage all reporting deadlines, and coordinate and consolidate reports as necessary to ensure documents are of the highest quality and in line with donor requirements.\n\tAct as a focal point for HQ grants administration and compliance colleagues, including maintaining submissions on IRC’s online opportunity management tracking system (OTIS).\n\tContribute proactively to Project Cycle Meetings in collaboration with relevant project leads to ensure timely, quality implementation of project.\n\tPerform other duties as may be assigned by the Senior Grants Coordinator.\n\n\nKey working relationships:\n\n\n\tPosition reports to:  Senior Grants Coordinator.\n\tPosition directly supervises: N/A\n\tInternal contacts: Grants, Partnerships, Communications, Finance, M&E, HR, Supply Chain, Safety and Security, Field Coordinators, Base Managers, AMU, Technical Units, and others as appropriate.\n\tExternal contacts: Partners, donors, and others as appropriate. \n\n\nPerson Specification\n\n\n\tBachelor's degree or equivalent in international affairs, development, international political economy or other relevant subject\n\t2-3 years of working in grants management and proposal/ business development/ design\n\tKnowledge of donor compliance regulations (BHA, USAID, ECHO, FCDO, GAC, etc)\n\tProven previous successful experience developing projects, writing proposals and donor reports.\n\tGood communicator with strong organizational, time management and analytical skills\n\tFluency in English, spoken and written\n\tStrong writing and editing skills with close attention to detail\n\tDemonstrated attention to detail, ability to follow procedures but also use own initiative, meet deadlines, and work independently and cooperatively with team members\n\tFlexibility to adapt to changing requirements and circumstances\n\tAbility to juggle competing priorities, meet deadlines and work under pressure in an insecure environment\n\tAptitude to adapt to a different context regarding security, culture, climate or health issues\n\tWillingness to travel \n\tCommitment to women’s rights and IRC’s vision, mission and values, including sensitivity to cultural settings\n\n\nSpecific Security Situation / Housing:\n\n\n\tThe Grants Manager will be based in Maiduguri, Borno, Nigeria with travel throughout the sites where IRC has a presence. \n\tThe security situation in North East Nigeria continues to be volatile; candidates should be prepared to implement programming in insecure environments. This is a non-accompanied position. \n\n\nNote: Nigerian candidates are strongly encouraged to apply.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]