[
  {
    "title": "Software Engineer Job at Verto",
    "link": "https://www.jobgurus.com.ng/jobs/view/software-engineer-job-at-verto",
    "pubDate": "Tue, 01 Jul 2025 15:41:59 GMT",
    "source": "JobGurus",
    "keyword": "verto",
    "duplicate": false,
    "classifications": [
      "Software Engineering"
    ],
    "content": "Verto is a global B2B payments solution that helps businesses send money to anyone, anywhere. Using a purposefully built tech infrastructure and payment rails, you can instantly send and receive money in over 200 countries. Today, Verto helps 1000+ customers from startups, SMEs to large corporate companies convert millions of dollars per year. Using our liquidity and price discovery marketplace solution, new customers can convert between 49 currencies, open bank account or wallets in seconds and make payments on a single platform.\n\nWe are recruiting to fill the position below:\n\nJob Position: Software Engineer\n\nJob Location: Lagos\nEmployment type: Full time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDesign RESTful APIs\n\tWork with other team members to develop and test highly scalable web applications and services as part of a suite of products in the Data governance domain working with petabyte-scale data\n\tDesign and create services and system architecture for your projects, and contribute and provide feedback to other team members\n\tUse AWS to set up geographically agnostic systems in the cloud.\n\tExercise your strong skills & working knowledge of MySQL and relational databases\n\tPrototype and develop new ideas and participate in all parts of the lifecycle from research to release\n\tWork within a small team owning deliverables for our web APIs and front end.\n\tUse development tools such as AWS Codebuild, git, npm, Visual Studio Code, Serverless framework, Swagger Specs, Angular, Flutter, AWS Lambda, MongoDB, MySQL, Redis, SQS, Kafka etc.\n\tDesign and develop dockerized applications that will be deployed flexibly either on the cloud or on-premises depending on business requirements\n\n\nRequirements\n\n\n\t2+ years of professional development experience using any object-oriented language\n\tHave developed and delivered at least one application using NodeJS\n\tExperience with modern web application building libraries such as Angular, Polymer, React\n\tSolid OOP and software design knowledge – you should know how to create software that’s extensible, reusable and meets desired architectural objectives\n\tExcellent understanding of HTTP and REST standards\n\tExperience with relational as well as MySQL databases\n\tGood experience writing unit and acceptance tests\n\tProven experience in developing highly scalable distributed cloud applications on a cloud system, preferably AWS\n\tYou’re a great communicator and are capable of not just doing the work, but teaching others and explaining the “why” behind complicated technical decisions.\n\tYou aren’t afraid to roll up your sleeves: This role will evolve, and we’ll want you to evolve with it!\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Executive Accounts Manager Job at Hobark International Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/executive-accounts-manager-job-at-hobark-international-limited",
    "pubDate": "Tue, 01 Jul 2025 15:41:59 GMT",
    "source": "JobGurus",
    "keyword": "hobark international limited",
    "duplicate": false,
    "classifications": [],
    "content": "Hobark International Limited (HIL) is the parent company of the Hobark group operating in the oil and gas industry. The company was incorporated in 1998, starting as a staffing agency based in Port Harcourt. Currently we have offices in 4 countries with our head office in Lagos.\n\nWe are recruiting to fill the position below:\n\nJob Position: Executive Accounts Manager\n\nJob Location: Lagos / Rivers\nJob Type: Permanent / Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tResponsible for assigned customer activity forecast in system of record and rig chart update.\n\tIdentify sales leads and opportunities.\n\tPromote development of cross-BU and integrated opportunities.\n\tDevelop, own and update Sales Account Plan, aligned with overall Company and BU drivers.\n\tCoordinate the Company’s executive visits with customer.\n\tOwn and maintain master/global service agreements between OEMs and customers\n\n\nRequirements\n\n\n\tCandidate should possess a minimum of a Bachelor’s Degree or HND in Mechanical / Petroleum / Electrical Engineering\n\tMinimum of 10 years of sales experience and exposure to Energy Sector (Oil & Gas, Power Industry Verticals)\n\tPrevious exposure to assigned account.\n\tStrong customer relationship acumen. \n\tDemonstrable ability to communicate, present and influence key stakeholders at all levels of an organization, including executive and C-level.\n\tAbility to identify and deliver client-focused solutions to customer needs.\n\tExcellent listening, presentation and negotiation skills.\n\tGood Written and oral communication skills and computer skills (Microsoft suite)\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Business Development Officer Job at Bridgemead HR. and Advisory",
    "link": "https://www.jobgurus.com.ng/jobs/view/business-development-officer-job-at-bridgemead-hr-and-advisory",
    "pubDate": "Tue, 01 Jul 2025 15:41:59 GMT",
    "source": "JobGurus",
    "keyword": "bridgemead hr. and advisory",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "Bridgemead HR provides customized HR solutions to optimize workforce productivity and profitability. Our expert trainers design bespoke training programs, innovative HR strategies, and efficient payroll systems tailored to each client’s unique needs.\n\nWe are recruiting to fill the position below:\n\nJob Position: Business Development Officer\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tYou will lead growth initiatives within our Investment Securities division, identifying and pursuing business opportunities, expanding our client base, and driving revenue growth through strategic partnerships and trading activities.\n\tYou will combine financial acumen, industry expertise, and exceptional relationship management skills to achieve organizational objectives.\n\n\nKey Responsibilities\n\n\n\tDevelop and implement strategic business development plans to achieve revenue and market share goals.\n\tTrade the mandates/jobbing request for client.\n\tActivate the database of the company with view to updating dormant accounts.\n\tActivated accounts should be harnessed to becoming trading accounts for business development.\n\tHandhold the accounts units for proper and timely deliverables.\n\tIdentify and pursue new business opportunities, including institutional and retail clients, partnerships, and distribution channels.\n\tConduct market research to identify trends, competitor strategies, and emerging opportunities in the investment securities sector.\n\tCollaborate with internal teams to design and promote investment products tailored to client needs.\n\tPrepare and present business proposals, pitches, and detailed financial projections to stakeholders and prospective clients.\n\tEnsure compliance with trading regulations, internal policies, and ethical standards.\n\tProvide clients with timely updates on market movements, trading activities, and investment opportunities.\n\tLead cross-functional teams to execute business development initiatives effectively.\n\tOversee trading activities, ensuring alignment with client objectives and market conditions.\n\tCollaborate with the trading desk to execute trades, monitor portfolio performance, and manage risks.\n\tAnalyze market trends, securities performance, and macroeconomic factors to inform trading strategies.\n\tProvide mentorship and training to junior staff, fostering a culture of continuous improvement.\n\tCollaborate with compliance, operations, and risk management teams to ensure smooth execution of business activities.\n\tConduct client onboarding, including due diligence, risk profiling, and documentation.\n\tRegularly meet with clients to assess their investment goals and provide tailored solutions.\n\tWork closely with the sales and marketing teams to develop campaigns that attract and retain clients\n\n\nRequirements\n\n\n\tBachelor’s Degree in Social Sciences, Business Management or any other related field.\n\t3 - 5 years of experience in marketing financial product, particularly stocks, bonds and treasury bills.\n\tStrong knowledge of financial markets, investment products, and trading platforms.\n\tProficiency in financial modeling, market analysis, and CRM tools.\n\tFamiliarity with regulatory frameworks and compliance requirements in the securities industry.\n\tStockbroking (ACS) qualification is an added advantage.\n\tProficiency in MS Office (Word, Excel, PowerPoint).\n\n\nSalary\nN350,000 - N500,000 / month.\n\nMethod of Application\nInterested and qualified candidates should send their CV and Cover Letter to: Careerbridgemeadnghr@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Receptionist Job at Taybuwtah International",
    "link": "https://www.jobgurus.com.ng/jobs/view/receptionist-job-at-taybuwtah-international",
    "pubDate": "Tue, 01 Jul 2025 15:41:59 GMT",
    "source": "JobGurus",
    "keyword": "taybuwtah international",
    "duplicate": false,
    "classifications": [],
    "content": "Taybuwtah International is a secondary school and sixth form based in Owerri, Nigeria. Our mission is to provide a dynamic and supportive learning environment that encourages academic excellence, personal growth, and global citizenship. We are committed to nurturing the next generation of leaders and innovators.\n\nWe are recruiting to fill the position below:\n\nJob Position: Receptionist\n\nJob Location: Owerri, Mbieri Achi - Imo\nEmployment Type:\n\nAbout the Role\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a friendly, organized, and professional Receptionist to be the first point of contact for our school.\n\tYou will handle front desk duties, manage calls, welcome visitors, and support basic administrative tasks to ensure smooth daily operations.\n\n\nKey Responsibilities\n\n\n\tGreet and attend to visitors, parents, and students professionally.\n\tAnswer incoming calls, take messages, and redirect them appropriately.\n\tMaintain the reception area, keeping it tidy and welcoming.\n\tReceive, sort, and distribute incoming correspondence.\n\tProvide clerical and administrative support to staff as needed.\n\tSchedule appointments and assist in managing calendars.\n\tMaintain accurate visitor and attendance records.\n\n\nRequirements\n\n\n\tMinimum of OND or equivalent qualification.\n\t1–2 years of relevant experience preferred.\n\tExcellent communication and interpersonal skills.\n\tProficient in MS Office (Word, Excel, Outlook).\n\tProfessional appearance and customer service mindset.\n\tMust reside within or close to Mbieri Achi or be willing to commute.\n\n\nWhat We Offer\n\n\n\tA supportive work environment\n\tCompetitive salary\n\tOpportunity to grow within a reputable educational setting\n\n\nMethod of Application\nInterested and qualified candidates should submit their CV and a brief Cover Letter to: HR@taybuwtahinternational.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Haulage Operations Manager Job at AA Rescue Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/haulage-operations-manager-job-at-aa-rescue-limited",
    "pubDate": "Tue, 01 Jul 2025 15:41:59 GMT",
    "source": "JobGurus",
    "keyword": "aa rescue limited",
    "duplicate": false,
    "classifications": [],
    "content": "AA Rescue is a multi-service organization founded in 2003 with the prime focus of giving comfort, removing distress and protecting the Nigerian populace by providing prompt emergency roadside assistance to stranded motorist in cases of vehicular breakdowns and accidents.\n\nWe are recruiting to fill the position below:\n\nJob Position: Haulage Operations Manager\n\nJob Location: Jakande, Lekki - Lagos\nEmployment Type: Full-time\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tPlan, schedule, and monitor truck movement to ensure timely delivery of goods.\n\tCoordinate vehicle dispatch based on logistics requirements and delivery priorities.\n\tMonitor real-time vehicle tracking and address route issues as needed.\n\tEnsure optimal vehicle utilization across all routes and projects.\n\tOversee routine and preventive maintenance of all trucks and haulage vehicles.\n\tManage and supervise drivers, mechanics, and other haulage personnel.\n\tEnsure compliance with driving and operational policies, including safety and regulatory requirements.\n\tConduct performance evaluations and recommend improvements.\n\tWork closely with in-house technicians or external service providers to resolve breakdowns promptly.\n\tMaintain accurate maintenance records and ensure vehicle roadworthiness and compliance with safety standards.\n\tApprove and monitor repair costs, spare part usage, and servicing schedules.\n\tMaintain up-to-date records for each vehicle, including service history, fuel consumption, and operational logs.\n\tEnsure compliance with transport laws and internal policies.\n\tMonitor fuel usage and vehicle efficiency to minimize waste and costs.\n\n\nRequirements\nEducation & Experience:\n\n\n\tBachelor’s Degree in Transport Management, Mechanical Engineering, Business Administration, or related field.\n\tMinimum of 6–8years of relevant experience in fleet or haulage operations, with at least 4years in a supervisory role.\n\n\nSalary\nN450,000 - N600,000 / month. \n\nMethod of Application\nInterested and qualified candidates should send their CV to: careers@aarescuenigeria.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]