[
  {
    "title": "Social Media and Content Creator Job at Home Bargains Nigeria Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/social-media-and-content-creator-job-at-home-bargains-nigeria-limited-3",
    "pubDate": "Tue, 01 Jul 2025 16:49:16 GMT",
    "source": "JobGurus",
    "keyword": "home bargains nigeria limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Home Bargains Nigeria Limited is a gift and decor store situated in Abuja, Nigeria.\n\nWe are recruiting to fill the position below:\n\nJob Position: Social Media and Content Creator\n\nJob Location: Wuse Zone 1, Abuja (FCT)\nEmployment Type: Full-time\nWorking Schedule: Four times a week\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tIn this role, you will create engaging content to showcase our unique gift products and enhance our brand presence.\n\tYou'll be responsible for producing content for social media and promotional materials that connect with customers.\n\tIf you’re passionate about gifts and content creation, we’d love to have you on board!\n\n\nResponsibilities\n\n\n\tCreate engaging video content for social media platforms (Instagram, TikTok, Facebook, etc.) that showcases products, store promotions, and seasonal offerings.\n\tProduce high-quality product videos, including unboxings, demonstrations, tutorials, and customer testimonials, to highlight the unique features of gift items.\n\tDesign promotional videos and ads to support sales campaigns, new arrivals, and special events, ensuring videos are aligned with the brand’s aesthetic and goals.\n\tCollaborate with the marketing team to develop content strategies that increase online visibility and drive traffic to the store.\n\tEdit and optimize videos for each platform, ensuring content is tailored to platform-specific formats and engagement trends.\n\tCreate attention-grabbing video content that showcases store events, product launches, or exclusive offers to entice customers.\n\tDesign eye-catching promotional materials(such as banners, flyers, and social media posts) to support video content and store promotions.\n\tMonitor performance of video content across platforms, analysing metrics to improve future content and drive higher sales conversions.\n\tKeep up with trends in video marketing and social media to continuously evolve content and stay relevant to the target audience\n\tMore tasks as may be required.\n\n\nRequirements\n\n\n\tMinimum of an HND qualification\n\t3 years of experience.\n\n\nSalary\nN100,000 monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV and Cover letter to: ad.homebargains@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Content Creator Job at Tilden Development Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/content-creator-job-at-tilden-development-limited",
    "pubDate": "Tue, 01 Jul 2025 16:49:16 GMT",
    "source": "JobGurus",
    "keyword": "tilden development limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Tilden Development Limited is a development company that specializes in innovative residential hospitality and commercial developments in Lagos. Our aim is to harness investments in the real estate sector and provide our investors with transparency, quality customer satisfaction, and timely service delivery.\n\nWe are recruiting to fill the position below:\n\nJob Position: Content Creator\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a creative and dynamic Content Creator to join our team.\n\tThe ideal candidate will be responsible for producing engaging and high-quality content for our brand, including articles, videos, blog posts, social media updates, and other digital media.\n\tAs a content creator, you will play a pivotal role in crafting content that resonates with our target audience, promotes brand awareness, and supports our marketing strategies.\n\n\nKey Responsibilities\n\n\n\tContent Creation: Develop original, engaging, and informative content for various platforms, including websites, blogs, social media, and marketing materials.\n\tContent Strategy: Collaborate with the marketing team to develop and execute content strategies aligned with the company’s goals and audience preferences.\n\tAudience Engagement: Interact with followers and audiences across platforms, responding to comments and messages, and fostering community engagement.\n\tContent Editing: Edit and proofread content to ensure accuracy, clarity, and consistency in style and tone.\n\tAnalytics and Reporting: Track the performance of content, analyze audience engagement metrics, and adjust strategies based on insights.\n\tCollaborative Work: Work with designers, marketers, and other team members to create cohesive and visually appealing content.\n\tResearch industry-related topics and identify content for promotional use.\n\tConduct keyword research and use SEO to improve web traffic.\n\tStay updated on content trends, software, and best practices.\n\n\nSkills and Qualifications\n\n\n\tProven experience as a content creator, copywriter, or similar role.\n\tStrong writing, editing, and proofreading skills with an eye for detail.\n\tExperience in content creation for different platforms (blogs, social media, websites, videos).\n\tProficiency in video editing software (e.g., Adobe Premiere Pro, Final Cut Pro) and graphic design tools (e.g., Canva, Adobe Creative Suite).\n\tKnowledge of SEO best practices and web traffic metrics.\n\tAbility to work independently and meet deadlines while managing multiple projects.\n\tExcellent communication and interpersonal skills.\n\tCreativity, adaptability, and a passion for staying up-to-date with digital trends.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hr2@tildenng.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Civil Engineer Job at Crescent Rice Mill Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/civil-engineer-job-at-crescent-rice-mill-limited",
    "pubDate": "Tue, 01 Jul 2025 16:49:16 GMT",
    "source": "JobGurus",
    "keyword": "crescent rice mill limited",
    "duplicate": false,
    "classifications": [],
    "content": "Crescent Rice Mill Limited is a leading rice processing company located at KM 15, Kano - Gumel Road, Jogana, Kano, Nigeria. With a vision to provide high-quality rice products to homes and businesses across Nigeria, we leverage advanced milling technology and a dedicated workforce to meet our customers' demands. We specialize in producing a variety of rice products, including Head Rice, Broken Rice, Reject Rice, Khus-Khus Rice, and Rice Bran. Our operations are strategically located in Kano, Nigeria’s commercial hub, enabling us to maintain efficient distribution channels across the nation.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nFounded with a commitment to excellence and sustainability, Crescent Rice Mill Limited collaborates with local farmers to source premium rice paddy, ensuring that our processes support the agricultural community and promote economic development.\n\nWe are recruiting to fill the position below:\n\nJob Position: Civil Engineer\n\nJob Location: Kano\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tThe Civil Engineer will be responsible for supervising and maintaining the structural integrity, layout, and civil works within our rice milling facility.\n\tThis includes overseeing factory construction, site development, repair works, drainage systems, utility structures, and collaborating with the maintenance and operations teams to ensure safety and efficiency of the infrastructure.\n\n\nKey Responsibilities\n\n\n\tOversee all civil engineering projects within the factory premises including buildings, foundations, drainage, concrete floors, and factory layouts.\n\tProvide technical advice on structural load, stress points, and durability of factory buildings and silos.\n\tPrepare and review engineering drawings, and site progress reports.\n\tEnsure that all factory structures comply with regulatory and safety standards.\n\tMonitor civil works to ensure proper use of materials, adherence to specifications, and cost efficiency.\n\tCollaborate with facility maintenance, mechanical, and utility teams to support cross-functional factory operations.\n\tSupervise and maintain all structural and civil components of the rice mill facility, including production buildings, paddy yards, silos, drying floors, drainage, and internal roads.\n\tMaintain accurate documentation of all site inspections, work completed, and repairs conducted.\n\tManage documentation for regulatory compliance and ensure factory structures meet SON, and factory safety requirements.\n\n\nRequirements\n\n\n\tCandidates should possess a Bachelor's / Master's Degree with 5 - 8 years of experience.\n\n\nSalary\nN200,000 - N300,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hr.crescentricemill@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Executive Assistant Job at West Africa Vocational Education (WAVE)",
    "link": "https://www.jobgurus.com.ng/jobs/view/executive-assistant-job-at-west-africa-vocational-education-wave-2",
    "pubDate": "Tue, 01 Jul 2025 16:49:16 GMT",
    "source": "JobGurus",
    "keyword": "west africa vocational education (wave)",
    "duplicate": false,
    "classifications": [],
    "content": "West Africa Vocational Education is solving what is arguably the biggest challenge on the continent: youth unemployment. In West Africa, 40-85% of youth, more than 50 million, are either unemployed or underemployed. Meanwhile, job creation in the region is on the rise. The disconnect between work-ready youth and the employment market must be bridged.\n\nWe are recruiting to fill the position below:\n\nJob Position: Executive Assistant\n\nJob Location: Lekki, Lagos\nEmployment Type: Full Time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tManage calendars, schedule meetings, and organize appointments for senior executives\n\tCoordinate travel arrangements, including booking flights, accommodations, and transportation\n\tDraft, proofread, and manage professional correspondence, reports, and presentations\n\tMaintain and organize files, records, and confidential documents\n\tServe as a liaison between executives, staff, and external stakeholders\n\tTake meeting minutes and follow up on action items and deadlines\n\tAssist in planning and coordinating internal and external events\n\tPerform general office management tasks such as ordering supplies and managing vendors\n\tSupport ad-hoc administrative projects and tasks as assigned.\n\n\nRequirements\n\n\n\tBachelor’s Degree in Business Administration, Office Management, or a related field preferred\n\t1–2 years of experience as an Executive Assistant, Administrative Assistant, or similar role\n\tStrong written and verbal communication skills\n\tProficiency in Microsoft Office Suite (Word, Excel, PowerPoint) and Google Workspace tools\n\tExcellent time management and organizational skills\n\tHigh level of discretion and confidentiality\n\tAbility to multitask and work under pressure in a fast-paced environment\n\tStrong attention to detail and problem-solving skills.\n\n\nSalary\nN150,000 - N200,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: recruitments@waveacademies.org using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]