[
  {
    "title": "Administrative Officer Job at Lington & Bernie Consulting Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/administrative-officer-job-at-lington-bernie-consulting-limited",
    "pubDate": "Wed, 02 Jul 2025 19:12:24 GMT",
    "source": "JobGurus",
    "keyword": "lington & bernie consulting limited",
    "duplicate": false,
    "classifications": [],
    "content": "Lington & Bernie Consulting Limited was established on October 8, 1999 to provide efficient and qualitative consulting services to the oil and gas industry as well as banks and financial institutions in the areas of human resources placement and management, human resources consulting services, tax administration and payroll services as well as oil and gas fiscal and contractual terms advisory services.\n\nWe are recruiting to fill the position below:\n\nJob Position: Administrative Officer \n\nJob Location: Ikoyi, Lagos\nEmployment Type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are looking to hire a highly organised administrative officer to perform all administrative and clerical duties necessary for effective office management.\n\n\nResponsibilities\n\n\n\tReceiving and processing communication channels, including email, phone, and physical mail.\n\tOrganising and managing schedules and calendars for staff\n\tEnsure functionality of necessary office equipment, and requisition of new equipment and supplies as needed.\n\tCreating reports and memos.\n\tSystematically filing important company documents.\n\tForwarding all correspondence, such as letters and packages, to staff members.\n\tHiring maintenance vendors to repair or replace damaged office equipment.\n\tOffer other assistance as requested\n\n\nRequirements\n\n\n\tMinimum of HND or B.Sc degree in a relevant field.\n\t2 - 4 years of experience is required for this position.\n\tWorking knowledge of necessary productivity tools, including Microsoft Office Suite.\n\tProven experience being able to handle multiple tasks at the same time.\n\tThe ideal candidate should be between 20 – 30 years.\n\tCandidate must reside close to Lagos Island (Obalende, Ikoyi, CMS, V.I. etc). Proximity to the office (Ikoyi) is very important because of the nature of the work\n\n\nMethod of Application:\nInterested and qualified candidates should send their CV to: jobs@lingtonandbernie.com using Job Position as the subject of the email.\n\nNote: Preferred candidate must have integrity, be passionate, smart, healthy, resilient, hardworking and must exhibit broad and wide thinking skills.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Quality Control Manager (Furniture Manufacturing) Job at LD&D Consulting",
    "link": "https://www.jobgurus.com.ng/jobs/view/quality-control-manager-furniture-manufacturing-job-at-ldd-consulting",
    "pubDate": "Wed, 02 Jul 2025 19:12:24 GMT",
    "source": "JobGurus",
    "keyword": "ld&d consulting",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "LD&D Consulting is a project management consulting firm that specialises in turning key projects into success by working collaboratively with clients and key stakeholders. Our specialist project management team consists of seasoned consultants across various industries.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe offer project management consulting, recruiting, Training and Development, HR outsourcing, and payroll servicesacross various industries, including Telecoms, IT, Construction, Transportation, Energy, Sports, Environmental and Health care, Banking & Finance, Services, and Consulting in both private and public sectors. We provide the best candidates for your recruiting needs by leveraging 25 years of experience working in various industries and closely working with you to understand your requirements.\n\nWe are recruiting to fill the position below:\n\nJob Position: Quality Control Manager (Furniture Manufacturing)\n\nJob Location: Ajah, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe are seeking an experienced and detail-oriented Quality Control Manager to oversee and ensure the quality standards of all furniture produced at our factory.\n\tThe ideal candidate will have a strong background in the furniture production industry and a keen eye for identifying defects, implementing improvements, and maintaining production excellence.\n\n\nKey Responsibilities\n\n\n\tSupervise and coordinate quality control operations across all stages of furniture production.\n\tDevelop and implement quality assurance policies, standards, and procedures to meet company and customer expectations.\n\tInspect raw materials, in-process items, and finished products to ensure they meet required specifications and standards.\n\tTrain and guide production staff on quality procedures, material handling, and finishing best practices.\n\tMonitor equipment and tools to ensure optimal performance and reduce quality deviations.\n\tIdentify quality issues, analyze root causes, and recommend corrective actions to reduce defects and improve production consistency.\n\tWork closely with the production team to ensure compliance with quality standards at each stage of manufacturing.\n\tMaintain accurate and up-to-date quality records, inspection reports, and compliance documentation.\n\tCommunicate effectively with management regarding quality concerns, customer feedback, and continuous improvement strategies.\n\tEnsure compliance with health, safety, and environmental regulations as they relate to production quality.\n\n\nRequirements\n\n\n\tCandidates should possess a Bachelor's Degree with a minimum of 5 years’ hands-on experience in the furniture production industry, particularly in quality assurance or control roles.\n\tIn-depth knowledge of furniture materials (wood, metal, upholstery, hardware), production techniques, and finishing processes.\n\tStrong attention to detail with the ability to detect flaws and irregularities.\n\tExcellent analytical and problem-solving skills.\n\tGood leadership and team management skills.\n\tEffective communication skills, both verbal and written.\n\tFamiliarity with quality control tools, checklists, and inspection processes.\n\tAbility to work independently and under pressure in a factory environment.\n\n\nSalary\n\n\n\tN180,000 - N200,000 / Month (based on experience)\n\tAccommodation\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: precious@ldd-consulting.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Procurement Officer Job at Calibration and Non-Destructive Services Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/procurement-officer-job-at-calibration-and-non-destructive-services-limited-2",
    "pubDate": "Wed, 02 Jul 2025 19:12:24 GMT",
    "source": "JobGurus",
    "keyword": "calibration and non-destructive services limited",
    "duplicate": false,
    "classifications": [],
    "content": "Calibration and Non-Destructive Services Limited is recruiting suitably qualified candidates to fill the position below:\n\nJob Position: Procurement Officer\n\nJob Location: Lekki, Lagos\nEmployment Type: Full-time\n\nJob Description\n\n\n\tWe require the services of a Sourcing Officer who has a deep knowledge and experience in procurement of oil and gas equipment, and can always liaise with the clients and the vendors.\n\n\nJob Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tEstimate and establish cost parameter and budget for purchase\n\tCreate and maintain good relationship with vendors/suppliers\n\tMake decisions in a fast-paced environment\n\tMaintain records of purchasing, pricing and other important data\n\tReview and analyze all vendors/suppliers, supply and price options\n\tDevelop plans for purchasing equipment, services and supplies\n\tDevelop bid proposals for contracts\n\tSource for prospective suppliers by making use of internet\n\tMaintain and update list of suppliers and their qualifications, delivery times, and potential future development\n\tWork with team members and procurement manager to complete duties as needed.\n\n\nJob Qualifications and Requirements\n\n\n\tMinimum of a B.Sc / HND qualification in Procurement and Logistics, Management and Engineering courses.\n\tMinimum of 0-2 years of working experience as sourcing or procurement position\n\tExperienced in sourcing on-line for commodity and oil and gas equipment\n\tHave the ability to think and process outside the box\n\tMust be very proactive and efficient\n\tGood knowledge of computer e.g Excel, Word, etc.\n\tExcellent communication skills.\n\n\nMethod of Application\nInterested and qualified candidates should send their Cover Letters and Resumes to: recruitment@calibrationservicesltd.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Reception Engineer / Workshop Admin Job at TAK Logistics Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/reception-engineer-workshop-admin-job-at-tak-logistics-limited",
    "pubDate": "Wed, 02 Jul 2025 19:12:24 GMT",
    "source": "JobGurus",
    "keyword": "tak logistics limited",
    "duplicate": false,
    "classifications": [],
    "content": "TAK Logistics Limited is a top-tier transportation firm based in Port Harcourt, offering unparalleled logistics solutions to our clients. Our expertise lies in efficiently transporting cargoes from production sites to storage facilities across Nigeria, ensuring a smooth and reliable delivery process every time.\n\nWe are recruiting to fill the position below:\n\nJob Position: Reception Engineer / Workshop Admin\n\nJob Location: Rivers\n\nResponsibilities\nThe Reception Engineer is responsible for managing the flow of vehicles or equipment needing repair or maintenance, coordinating related tasks, and ensuring efficient operations at the front end of the repair process\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tCarry out estimates for repair, contact and liaise with accident repair agents and internal departments relating to insurance claims/work.\n\tEnsure documentation used is current and controlled under the Quality Management System and makes contingencies for times when the Fleet Management System (FMS) is unavailable.\n\tBe able to complete the inventory of trucks & trailers and diagnose the parts/systems functioning so that the inventory form gives the complete picture of repairs & buildup needs to be carried out.\n\tKeep a record of in & out inspections carried out and maintain a record of both truck admissions and releases respectively.\n\tEnsure that trucks and trailers are released only after being certified by the QC Inspector/safety personnel.\n\tEnsure that printout of spares consumed is attached to the QC inspection form & job card, duly signed by the QC Inspector/safety personnel while releasing the truck after major overhauls, buildup and reactivations.\n\tSymptom-Defect analysis of articulated trucks & trailers.\n\tCarry out inspections of vehicles arriving on site, either for repair or reactivation (Vehicle condition survey) or brand-new vehicles for delivery.\n\tCarry out weekly checks on available trucks in the Workshop, ensure an up-to-date inventory of trucks inside the Workshop with their locations.\n\tPositively contributes to a safe work environment ensuring compliance with Health and Safety, Risk Management, Business Continuity and Safeguarding policy and procedure. Protect all personal information in adherence with the Data Protection Act 1998.\n\tDaily updating of admissions and releases on the FMS, liaise with Supervisors and Stores to get up-to-date status of work to ensure data on the FMS is current and accurate.\n\tEnsure documentation used is current and controlled under the Quality Management System and make contingencies for times when the Fleet Management System (FMS) is unavailable.\n\tAny other duties commensurate with the responsibilities and grading of the post.\n\n\nRequirements\n\n\n\tBSc Degree / HND in Automobile/Mechanical Engineering.\n\tMinimum of 5 years of experience of physically handling or supervising the repairs/buildup of Articulated Trucks & Trailers.\n\tExperience in automobile quality inspections is desirable.\n\tExposure to FMS and Advanced MS Office will be an added advantage.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: humanresources@ilsfleetmgt.com using the Job Position as th subject of their mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Internal Control Officer Job at Teal Harmony Nigeria Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/internal-control-officer-job-at-teal-harmony-nigeria-limited",
    "pubDate": "Wed, 02 Jul 2025 19:12:24 GMT",
    "source": "JobGurus",
    "keyword": "teal harmony nigeria limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Teal Harmony Nigeria Limited is an interior design and renovation firm with a principal focus of providing cutting edge design solutions for private, business and commercial projects. We have grown over the years, providing services in Interior design, Interior Architecture, Consultation, Project Management, Furniture Production and Retail experience earning our place as an innovative, forward thinking interior design firm in Nigeria, our vision was built for noble intention, to be a yellow-page for interior design needs.\n\nWe are recruiting to fill the position below:\n\nJob Position: Internal Control Officer\nJob Location: Victoria Island, Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are looking for an experienced Internal Control Officer to oversee and strengthen the internal control processes within our production and retail operations.\n\tThe ideal candidate will ensure compliance, mitigate risks, and enhance operational efficiency in our architectural and interior design firm.\n\n\nKey Responsibilities\n\n\n\tDevelop and implement internal control policies and procedures for production and retail outlets.\n\tConduct regular audits to ensure compliance with financial and operational standards.\n\tIdentify and address risks in production processes and retail transactions.\n\tMonitor inventory controls, ensuring accuracy in stock levels and material usage.\n\tCollaborate with management to improve internal processes and safeguard company assets.\n\tPrepare detailed reports on control findings and recommend corrective actions.\n\n\nQualifications\n\n\n\tBachelor’s degree in Business Administration, Finance, or a related field.\n\t3–5 years of experience in internal control, preferably in production and retail environments.\n\tStrong understanding of risk management and process improvement.\n\tExcellent analytical and problem-solving skills.\n\tProficiency in audit tools and software (e.g., QuickBooks, Excel, etc.).\n\tHigh integrity and attention to detail.\n\n\nSalary\nN150,000 - N200,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: bunmi@teal-harmony.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]