[
  {
    "title": "Job Vacancies at BhEERHUGZ",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancies-at-bheerhugz",
    "pubDate": "Mon, 30 Jun 2025 11:14:12 GMT",
    "source": "JobGurus",
    "keyword": "bheerhugz",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "BhEERHUGZ as popularly known, is a leisure and entertainment spot for urban, fun seeking people to unwind, meet and lounge. You are guaranteed a unique lounge and dining experience.\n\nWe are recruiting to fill the following positions below:\n\n1.) Account Clerk\n\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Account Clerk is responsible for maintaining accurate financial records and supporting the daily financial operations of the lounge.\n\tThis includes handling accounts receivable and payable, recording transactions, managing petty cash and ensuring compliance with financial policies and procedures.\n\n\nKey Responsibilities\n\n\n\tRecord all financial transactions in the accounting system accurately and timely\n\tProcess invoices, receipts, and payment vouchers\n\tMonitor and reconcile lounge income, including bar sales, food sales, and other services\n\tMaintain and reconcile petty cash and ensure all expenses are properly accounted for\n\tFollow up on customer payments and outstanding balances (if applicable)\n\tEnsure proper documentation and filing of all financial records\n\tPrepare daily and weekly sales summaries and submit reports to Finance Manager\n\tAssist in preparing monthly financial statements and expense reports\n\tLiaise with external auditors or consultants as needed\n\tReport any discrepancies or financial concerns to the Finance Manager or Lounge Manager.\n\n\nQualifications and Skills\n\n\n\tMinimum of OND / HND / B.Sc Degree in Accounting, Finance, or related field\n\tAt least 1 - 2 years of accounting or bookkeeping experience, preferably in the hospitality industry\n\tProficiency in accounting software (e.g., QuickBooks, Sage) and Microsoft Excel\n\tGood understanding of basic accounting principles and procedures\n\tHigh level of accuracy and attention to detail\n\tStrong organizational and communication skills\n\tIntegrity and ability to handle confidential information professionally\n\n\nSalary\nN80,000 monthly.\n\nApplication Closing Date: 28th July, 2025.\n\nClick here to apply online\n\n \n\n \n\n2.) Kitchen Assistant\n\nJob Location: Lekki, Lagos\nEmployment Type: Full-time\n\nResponsibilities\n\n\n\tPromptly resumes for the shift and registers appropriately in the Attendance tracking device.\n\tSets up stations, count food stock and collect all necessary supplies to prepare menu for service.\n\tArrange kitchen utensils and equipment in attractive and functional displays.\n\tWashes, cuts and prepares food designated for cooking.\n\tMaintains a prepared and sanitary work area always.\n\tKeeps the work area clean and tidy all through the shift.\n\tResponsible for carrying out basic food preparation tasks, such as washing and peeling food.\n\tArrange sauces and supplementary garnishes for allocated stations.\n\tAssist in the preparation of meal by chopping vegetables, making salads and putting together entries.\n\tMeasure ingredients for specific food items being prepared\n\tDo basic food preparation and make sure that the cook and chefs have everything they need to prepare meals.\n\tResponsible for washing kitchen appliances, work surfaces, floors and walls and keeping the kitchen clean.\n\tOrganize the store room as well as unloading deliveries from suppliers \n\tEnsure the Kitchen is always kept sanitary for the preparation of meals\n\tClean food preparation areas, kitchen surfaces and utensils.\n\tClean dirty food preparation utensils and return to the appropriate area.\n\tCollect and dispose of kitchen waste.\n\tResponsible for Maintaining sanitation health and safety standards in the work place.\n\tAssist the Chef and Cook to carry out a great deal of functions.\n\tClean, stock and restock work stations and display cases.\n\tResponsible for carrying out task quickly and competently.\n\tDisposes off leftover food properly. ? Adhere to grooming and appearance standards consistently.\n\tEnsure that the dishes and the working area are clean always.\n\tComplies with the company set out Policy and Procedures\n\tAssist with all duties as assigned by the Cook or Chef.\n\n\nSalary\nN70,000 Monthly.\n\nApplication Closing Date: 11th July, 2025.\n\nClick here to apply online\n\n \n\n3.) Pastry Chef\n\nJob Location: Lekki, Lagos\nEmployment Type: Full-time\n\nJob Descriptions\n\n\n\tPrepare a wide variety of goods such as cakes, cookies, pies, pizzas, bread etc. following traditional and modern recipes\n\tCreate new and exciting desserts to renew our menus and engage the interest of customers\n\tDecorate pastries using different icings, toppings etc. to ensure the presentation will be beautiful and exciting\n\tMonitor stocks for baking ingredients such as flour, sugar etc. and make appropriate orders within budget\n\tCheck quality of material and condition of equipment and devices used for cooking\n\tGuide and motivate pastry assistants and bakers to work more efficiently\n\tIdentify staffing needs and help recruit and train personnel\n\tMaintain a lean and orderly cooking station and adhere to health and safety standards\n\tWeighing and measuring ingredients\n\tContributing ideas to the menu\n\n\nOther Requirements:\n\n\n\tProven experience as Pastry Chef, baker or relevant role\n\tGreat attention to detail and creativity\n\tOrganizing and leadership skills\n\tWillingness to replenish professional knowledge\n\tIn depth knowledge of sanitation principles, food preparation and baking techniques and nutrition\n\tWorking knowledge of baking with ingredient limitations (pastries that are gluten free, sugarless etc.)\n\tCertificate in culinary arts, pastry-making, baking or relevant field will be an added advantage.\n\n\nSalary\nN80,000 - N100,000 Monthly.\n\nApplication Closing Date: 11th July, 2025.\n\nClick here to apply online\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Direct Sales Executive Job at Premium Human Resource Solution Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/direct-sales-executive-job-at-premium-human-resource-solution-limited-2",
    "pubDate": "Mon, 30 Jun 2025 11:14:12 GMT",
    "source": "JobGurus",
    "keyword": "premium human resource solution limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Premium Human Resource Solution—Our client, a top banking institution in Lagos State, is recruiting to fill the position below:\n\nJob Position: Direct Sales Executive\nJob Locations: Surulere, Costain, Yaba, Tejuosho, Akoka,Suru-Alaba, Ilupeju, Ibafon (Oshodi-Apapa Expressway), Apapa, Festac, Ikeja, Agege, Egbeda, Alagbado, Oshodi, Ejigbo, Oniru and Lekki - Lagos\nEmployment Type: Full-time\n\nRequirements\n\n\n\tQualification: NCE / OND / HND / BSC\n\tAge: Not more than 35 years.\n\tExperience: A Minimum of 1 year of experience is required.\n\n\nBenefits\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tSalary: N115,000 - N130,000Monthly.\n\tRobust commission\n\tHMO\n\tPension\n\t13th-month allowance\n\tOther benefits.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Data Analyst Job at D2H Services Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/data-analyst-job-at-d2h-services-limited",
    "pubDate": "Mon, 30 Jun 2025 11:14:12 GMT",
    "source": "JobGurus",
    "keyword": "d2h services limited",
    "duplicate": false,
    "classifications": [],
    "content": "D2H Services Limited was incorporated under the corporate commission of Nigeria in 2015. D2H is an Exporter, Importer & Traders\nImporters of Agricultural Equipment’s, Power Solution Equipment and Agric related products suiting to the Nigerian Agriculture Sector. We deal in premium LED lighting and power back-up solutions for various types of requirements and technologies. These products are designed and manufactured to comply with the most stringent global quality standards.\n\nWe are recruiting to fill the position below:\n\nJob Position: Data Analyst\n\nJob Location: Ikenne, Ogun\nEmployment Type: Full-time\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tCreate and manage Excel spreadsheets for data analysis.\n\tDevelop and maintain complex formulas and macros.\n\tAnalyze and interpret data to inform business decisions.\n\tGenerate reports and dashboards using Excel.\n\tCollaborate with teams and attend walking customers at ikenne factory\n\n\nRequirements\n\n\n\tInterested candidates should possess an HND qualification with 2 - 5 years of work experience.\n\tStrong Excel skills (formulas, pivot tables, macros).\n\tAttention to detail and accuracy.\n\tAbility to work with large datasets.\n\tProficiency in MS Office.\n\n\nSalary\nN70,000 - N80,000 monthly.\n\n \n\nNote: Person should be staying around shagamu or ikenne closer to factory can resume on time .    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "General Manager Job at Olam Agri",
    "link": "https://www.jobgurus.com.ng/jobs/view/general-manager-job-at-olam-agri",
    "pubDate": "Mon, 30 Jun 2025 11:14:12 GMT",
    "source": "JobGurus",
    "keyword": "olam agri",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance"
    ],
    "content": "Olam Agri is a market-leading, differentiated food, feed, and fiber agri-business with a global origination footprint, processing capabilities, and deep understanding of market needs built over 33 years. With a strong presence in high-growth emerging markets and products across grains & oilseeds, animal feed & protein, rice, edible oils, specialty grains & seeds, cotton, wood products, rubber and commodity financial services.\n\nOlam Agri is at the heart of global food and agri-trade flows with more than 40 million MT in volume traded annually. Focused on transforming food, feed and fiber for a more sustainable future, it aims at creating value for customers, enabling farming communities to prosper sustainably, and strive for a food-secure future.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: General Manager - National Category Manager, Sales\n\nJob Location: Iganmu, Lagos\nEmployment Type: Full-time\n\nJob Description\n\n\n\tNational Category Manager heads Sales (GM Sales) and Trade Marketing for Beverages category for Nigeria covering all channels.\n\tThe incumbent would be responsible for developing the category sales strategies, undertake channel development and coach & lead the Beverages sales team to achieve the sales AOP plans & KPIs.\n\tThe incumbent will be based in Lagos and will lead a dedicated Beverages team of Regional Managers, Assistant RSMs, ASMs & SOs. This role reports into the Vice President – Sales, Nigeria.\n\n\nKey Deliverables\n\n\n\tDevelop sales strategies for Nigeria Beverages category by identifying trade insights and growth opportunities to drive incremental volume growth. Contribute to Annual Operating Plan (AOP) exercise development by identifying medium to long term growth pillars to position Olam to gain share in a competitive and ambiguous environment\n\tUndertake complete ownership of Beverages monthly sales plan achievement (Volume, Distribution and Secondary KPIs) for all channels of Nigeria. Oversee Van operations with the help of National Fleet Manager and identify ways to drive effectiveness of Van capacity utilization\n\tDevelop a robust trade promotion plan via a nuanced approach of brand, pack, channel and geography strategy and cascade to regional teams with granular plans & milestones. Monitor and drive the plan execution through robust weekly reviews with regional teams\n\tCollaborate with Marketing to roll-out Shopper interventions and Trade Activation plans to dial-up Visibility, Shelf share and Tertiary sales\n\tContinually evaluate and optimize the Beverages GTM by developing deep channel, customer & category understanding via trade visits\n\tEffectively utilize Trade Spends budget to achieve category goals. Oversee monthly reconciliation and timely trade payout settlements by liaising with Finance\n\tContinually monitor and strengthen commercial hygiene of sales reporting, trade claims, asset tracking\n\tEstablish and embed a daily Sales Ops rhythm with the help of Sales Enablers and Performance score cards. Leverage Sales Analyst to drive reporting Systems including DSRs, Retail cards, Activation trackers, Monthly reporting, Trade claims, Damage & Shortage claims\n\tMonitor the Category redistribution aspects on a regular basis (Outlet Mapping, Coverage, Attendance, PJP Compliance, Bill Productivity) and identify plans to strengthen our distribution\n\tOversee Distributor Management policies and identify ways to improve efficiency on Order Management, Stock Management, Credit Management and Profitability. Build rapport with top distributors across Nigeria and continually engage with them to identify & translate emerging trends into sales plans\n\tLead & coach the field sales team members through in-market presence and role-model Olam values. Work with the National Capability Lead to identify ongoing capability development needs of the Beverages category team and embed regular training & up-skilling to improve effectiveness. Lead the annual Sales DC (Development Center) exercise to build talent pipeline\n\tIn-charge of Field-force Sales Incentive plans and R&R programs\n\n\nRequirements\n\n\n\tTier 1 Premier Institute MBA preferred.\n\tMinimum of 12+ years of work experience in leading Foods & Beverages company.\n\tPreference would be given to those who have demonstrated experience – in part or full – of Beverages industry\n\tCandidate with extensive experience of Sales, Trade Marketing, and/or Route to Market & Sales Capability Development across multiple geographies/ cities\n\tMust have experience of designing & implementing Trade Activation programs and demonstrated experience of rolling out initiatives to win share in competitive markets.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]