[
  {
    "title": "Human Resource Officer Job at DMOT Enterprises",
    "link": "https://www.jobgurus.com.ng/jobs/view/human-resource-officer-job-at-dmot-enterprises",
    "pubDate": "Mon, 23 Jun 2025 10:18:21 GMT",
    "source": "JobGurus",
    "keyword": "dmot enterprises",
    "duplicate": false,
    "classifications": [],
    "content": "DMOT Enterprises - Our client, a Recruitment and Training Company, is recruiting to fill the position below: \n\nJob Position: Human Resource Officer\n\nJob Location: Water Factory, Sagamu - Ogun\nEmployment Type: Full-time\n\nRequirements\n\n\n\tWe expect candidate with 2 years of HR experience.\n\tExperience in manufacturing setting will be good\n\tShould be good in recruitment, payroll and usage of excel\n\tShould be ready to work in Sagamu and attend interviews.\n\n\nSalary\nN280,000 Monthly plus other benefits.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: ayomaku@yahoo.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Frontend Developer Job at Bretty Consultancy Services",
    "link": "https://www.jobgurus.com.ng/jobs/view/frontend-developer-job-at-bretty-consultancy-services",
    "pubDate": "Mon, 23 Jun 2025 10:18:21 GMT",
    "source": "JobGurus",
    "keyword": "bretty consultancy services",
    "duplicate": false,
    "classifications": [
      "Software Engineering"
    ],
    "content": "Bretty Consultancy Services - Our client, a rapidly growing Edutech firm in Abuja, is recruiting to fill the position below:\n\nJob Position: Frontend Developer\nJob Location: Garki, Abuja\nEmployment Type: Contract\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAre you a passionate Frontend Developer with a knack for building intuitive and engaging user experiences? Do you thrive in a fast-paced, innovative startup environment?\n\tBretty Consultancy is excited to announce an opening for a talented Frontend Developer to join our client, a rapidly growing Edutech firm in Abuja!\n\tThis is a fantastic opportunity to be a key player in a company that's revolutionizing education through technology. You'll work on cutting-edge products, bringing designs to life for both web and mobile platforms.\n\n\nAbout the Role\n\n\n\tAs a Frontend Developer, you'll be instrumental in creating the interactive and visually appealing interfaces that power our educational platforms.\n\n\nYour responsibilities will include:\n\n\n\tDeveloping and maintaining high-quality user interfaces using React.js for web applications.\n\tBuilding robust and performant mobile applications with React Native.\n\tCollaborating closely with UI/UX designers to translate wireframes and mockups into functional, responsive, and aesthetically pleasing code.\n\tWorking with backend developers to integrate frontend components with APIs.\n\tOptimizing applications for maximum speed and scalability across various devices and browsers.\n\tWriting clean, well-documented, and maintainable code.\n\tParticipating in code reviews and contributing to a culture of continuous improvement.\n\tTroubleshooting and debugging issues to ensure a seamless user experience.\n\n\nRequirements\nThe ideal candidate will have:\n\n\n\tA Bachelor's degree in Computer Science, Software Engineering, or a related field (or equivalent practical experience).\n\t2+ years of professional experience as a Frontend Developer, with a strong portfolio showcasing your work.\n\tProven expertise in React.js and React Native is essential.\n\tSolid understanding of modern JavaScript (ES6+), HTML5, and CSS3.\n\tExperience with state management libraries (e.g., Redux, Zustand, Context API).\n\tFamiliarity with version control systems, especially Git.\n\tAbility to write clean, modular, and reusable code.\n\tStrong problem-solving skills and attention to detail.\n\tExcellent communication and teamwork abilities.\n\tExperience in a startup environment or fast-growing company is a plus.\n\n\nWhy Join Our Team?\n\n\n\tSalary: N150,000 - N2000,000 Monthly.\n\tBe a part of a fast-growing Edutech startup that's making a real difference in education.\n\tWork on exciting and impactful projects with modern technologies.\n\tJoin a dynamic, collaborative, and innovative team where your ideas are valued.\n\tSignificant opportunities for professional growth and career advancement as we scale.\n\tCompetitive salary and a vibrant work environment in Abuja.e\n\n\nMethod of Application\nInterested and qualified candidates should send their Resume, Cover Letter, and a link to your portfolio / GitHub profile to: brettyconsultancyservices@gmail.com using \"Frontend Developer - [Your Name]\" as the subject of the mail.\n\nNote\n\n\n\tOnly shortlisted candidates will be contacted.\n\tIf you're a self-starter with a passion for frontend development and a desire to contribute to the future of learning, we'd love to hear from you!\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Assistant Human Resources Officer Job at Skylight Professional Services and Partners",
    "link": "https://www.jobgurus.com.ng/jobs/view/assistant-human-resources-officer-job-at-skylight-professional-services-and-partners",
    "pubDate": "Mon, 23 Jun 2025 10:18:21 GMT",
    "source": "JobGurus",
    "keyword": "skylight professional services and partners",
    "duplicate": false,
    "classifications": [],
    "content": "Skylight Professional Services and Partners considers its reputation of professional excellence and integrity to be of paramount importance.\n\nWe avail our staff with appropriate and up to date trainings. Our role as successful financial planners, management consultants and course facilitators are enhancing our reputation in the financial and business world, and as such contributing significantly to the growth of our firm.\n\nWe are recruiting to fill the position below:\n\nJob Position: Assistant Human Resources Officer\n\nJob Location: Lagos\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAn Assistant Human Resources Officer provides administrative and operational support to the HR department, assisting with tasks such as recruitment, employee relations, and HR policy implementation.\n\tThey handle a variety of duties, from maintaining employee records and coordinating interviews to assisting with onboarding and training new employees.\n\n\nRequirement\n\n\n\tInterested candidates should possess an OND / NCE / HND / B.Sc Degree in relevant qualifications with relevant experience.\n\n\nMethod of Application\nInterested and qualified candidates should send their Resume to: skylightkonsulting@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Executive General Manager Job at NeoHomes Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/executive-general-manager-job-at-neohomes-limited",
    "pubDate": "Mon, 23 Jun 2025 10:18:21 GMT",
    "source": "JobGurus",
    "keyword": "neohomes limited",
    "duplicate": false,
    "classifications": [],
    "content": "NeoHomes Limited is a leading real estate company with a vision to become a globally recognized brand. We're seeking an experienced Executive General Manager to join our leadership team and drive business growth, innovation, and excellence.\n\nWe are recruiting to fill the position below:\n\nJob Position: Executive General Manager\n\nJob Location: Abuja (FCT) \nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAs an Executive General Manager, you'll be responsible for overseeing the overall strategy, operations, and performance of our company.\n\tYou'll lead cross-functional teams, drive business development, and ensure that our company delivers exceptional customer experiences and achieves its business objectives.\n\n\nResponsibilities\n\n\n\tDevelop and execute business strategies that drive growth, innovation, and profitability.\n\tOversee daily operations, ensuring efficiency, productivity, and quality.\n\tIdentify and pursue new business opportunities, partnerships, and revenue streams.\n\tLead and develop high-performing teams, fostering a culture of excellence and innovation.\n\tBuild and maintain strong relationships with stakeholders, including customers, investors, and partners.\n\n\nRequirements\n\n\n\t15+ years of experience in real estate or a related industry\n\tProven track record of leadership and business growth\n\tStrong strategic thinking and problem-solving skills\n\tExcellent communication and interpersonal skills\n\tStrong business acumen and financial management skills\n\n\nSkills:\n\n\n\tExperience in global business operations\n\tKnowledge of real estate market trends and regulations\n\tNetwork of industry contacts and partnerships.\n\n\nBenefits\n\n\n\tCompetitive salary\n\tOpportunity to lead a dynamic and growing company\n\tCollaborative and innovative work environment\n\tProfessional development and growth opportunities\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and cover letter to: humanresources@neohomesltd.com using the Job Position as the subject of the mail.\n\n\n\n\nNote\n\n\n\tIf you're a seasoned leader with a passion for real estate and business growth, we'd love to hear from you! Join our team and help shape the future of NeoHomes Limited.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Accountant Job at Brooks Insights Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/accountant-job-at-brooks-insights-limited",
    "pubDate": "Mon, 23 Jun 2025 10:18:21 GMT",
    "source": "JobGurus",
    "keyword": "brooks insights limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Brooks Insights Limited (Brooks Insights) is an independent consulting firm committed to providing evidence-based insights for improved health and development through research, program monitoring and evaluation, knowledge product development, capacity building, and technical support.\n\nWe are recruiting to fill the position below:\n\nJob Position: Accountant\n\nJob Location: Abuja (FCT) \nEmployment Type: Full-time\n\nResponsibilties\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tMaintain accurate records of financial transactions using approved accounting software.\n\tPrepare monthly, quarterly, and annual financial statements and management reports.\n\tReconcile bank statements and general ledger accounts.\n\tEnsure timely preparation of trial balances, income statements, and balance sheets.\n\tManage accounting for donor-funded projects, ensuring strict compliance with donor policies and requirements.\n\tEnsure proper allocation of shared costs across grants and operational activities.\n\tAssist in the preparation of project budgets, annual budgets, forecasts, and financial plans.\n\tMonitor budget performance and report variances with explanations.\n\tTrack expenditures against project budgets and funding agreements.\n\tPrepare and submit donor financial reports as required.\n\tMonitor grant burn rates and advise program teams on budget utilization.\n\tProcess invoices, payments, and staff expense reimbursements accurately and timely.\n\tMonitor receivables, follow up on outstanding balances, and ensure timely collections.\n\tEnsure compliance with local tax laws and regulations (VAT, WHT, CIT, etc.).\n\tLiaise with external auditors, tax consultants, and regulatory bodies as required.\n\tPrepare and file statutory returns and remittances on time.\n\tMaintain and enforce internal financial controls and policies.\n\tRecommend and implement improvements to accounting systems and procedures.\n\tConduct periodic reviews to ensure financial integrity.\n\tPrepare monthly payroll, including deductions and statutory remittances.\n\tMaintain accurate payroll records and ensure compliance with labor regulations.\n\tAssist in procurement processes and ensure financial compliance in vendor payments.\n\tProvide financial support to project teams during proposal development and project implementation.\n\tTrain non-financial staff on financial procedures, donor compliance, and budget monitoring.\n\n\nQualifications and Skills\n\n\n\tBachelor's Degree in Accounting, Finance, or related field (ICAN/ACCA certification is an advantage).\n\t3 - 5 years of accounting experience, preferably in a donor-funded or service-based organization.\n\tStrong knowledge of donor regulations (GCC, USAID, EU, UN, etc.) is a plus.\n\tProficiency in accounting software (e.g., QuickBooks, Sage, or similar).\n\tExcellent Excel and analytical skills.\n\tHigh integrity, attention to detail, and ability to manage multiple tasks under pressure.\n\tStrong interpersonal and communication skills.\n\n\nMethod of Application\nInterested and qualified candidate should send their two-page CV to: recruitment@brooksinsights.org using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]