[
  {
    "title": "Job Vacancies at Glow FM",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancies-at-glow-fm",
    "pubDate": "Wed, 18 Jun 2025 11:37:58 GMT",
    "source": "JobGurus",
    "keyword": "glow fm",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance"
    ],
    "content": "Glow FM Akure is a vibrant and popular radio station broadcasting from the heart of Akure, Ondo State, Nigeria. With a frequency of 99.1 FM, the station has become a household name in the region, entertaining and informing a wide audience of listeners.\n\nWe are recruiting to fill the following positions below:\n\n1.) General Manager\n\nJob Location: Akure, Ondo\nStatus: Executive Management | Contract-Based\n\nThe Role\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe general manager is the engine room of the station – responsible for overall operations, strategic growth, compliance, finance, marketing, and staff performance.\n\tYou will work directly with the Chairman/CEO and regulatory bodies to ensure operational excellence.\n\n\nQualifications (as per NBC)\n\n\n\tA Bachelor’s degree or higher in Mass Communication, Business Administration, management, or related fields.\n\tMinimum of 10 years of relevant experience, with at least 5 years in a leadership role in broadcasting or media\n\tSound knowledge of NBC regulations, industry standards, and media business dynamics\n\tStrong administrative, marketing, financial, and people management capabilities.\n\tDemonstrated ability to lead with innovation, integrity, and influence.\n\n\nBonus Points:\n\n\n\tMBA or equivalent professional qualification.\n\tProven track record in revenue generation and media strategy.\n\n\nApplication Closing Date: 30th July, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV and Cover Letter to: glowfmcareers@gmail.com using the Job Position as the subject of the mail. (E:g - Subject line: position – your full name (e.g, head of news - John Doe).\n\nNote\n\n\n\tOnly shortlisted candidates will be contacted\n\tGlow FM 99.1 is an equal opportunity employer. We value integrity, professionalism, and passion above all.\n\tGlow Fm 99.1 - Illuminating Minds, Inspiring Change.\n\n\n \n\n \n\n2.) Head of News & Current Affairs\n\nJob Location: Akure, Ondo\nEmployment Type: Full-time (Senior Management)\n\nJob Summary\n\n\n\tAs we expand our reach and impact, we are calling on bold visionaries and seasoned professionals to take the lead. Are you ready to shape the sound of tomorrow?\n\n\nThe Role\n\n\n\tAs Head of News and Current Affairs, you will lead a dynamic newsroom, ensuring credible, objective, and compelling news content that resonates with truth, balance, and national interest. You will manage news teams, enforce editorial standards, and uphold NBC’s broadcast code\n\n\nQualifications (as per NBC)\n\n\n\tA minimum of a Bachelors Degree in mass communication, journalism, or a related field\n\tMinimum of 5 years of experience in news production or editorial management in a reputable broadcast media house\n\tDeep understanding of the Nigerian Broadcasting Code and ethical journalism\n\tExcellent editorial judgment, team leadership, and content strategy skills.\n\tMust be tech-savvy with competence in digital newsrooms and multimedia platforms\n\n\nBonus Points:\n\n\n\tExperience with investigative reporting, election coverage, and radio documentaries.\n\tMembership of NUJ or relevant professional bodies.\n\n\nApplication Closing Date: 30th July, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV and Cover Letter to: glowfmcareers@gmail.com using the Job Position as the subject of the mail. (E:g - Subject line: position – your full name (e.g, head of news – John Doe).\n\nNote\n\n\n\tOnly shortlisted candidates will be contacted\n\tGlow FM 99.1 is an equal opportunity employer. We value integrity, professionalism, and passion above all.\n\tGlow Fm 99.1 – Illuminating Minds, Inspiring Change\n\n\n \n\n \n\n3.) On Air Personality\n\nJob Location: Akure, Ondo\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tGot the gift of gab? The kind of voice that turns heads and lifts spirits.\n\tGlow FM 99.1 is turning up the volume, and we want you behind the mic.\n\tWe are searching for a bold, magnetic, and unstoppable on-Air-personality to bring fire, favor and unforgettable vibes to our show.\n\n\nRequirements\nIf you’ve got:\n\n\n\tExperience 2-5 Years\n\tQualification – Minimum OND in any discipline\n\tA voice that vibes\n\tA mind full of fresh ideas\n\tAnd a heart that beats for the people\n\tGood in Yoruba or English or both\n\tLocation – Akure, Ondo State\n\tSalary – Depends on qualification, Competitive\n\tWe help with housing\n\n\nSalary\nN50,000 - N100,000 Monthly.\n\nApplication Closing Date 19th July, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV and Demo to: glow991fm@gmail.com using the Job Position as the subject of the mail.\n\nNote: Glow FM 99.1 – More than radio. It’s a movement. Be the voice of it.\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]