[
  {
    "title": "Human Resources Assistant Job at Première Urgence Internationale",
    "link": "https://www.jobgurus.com.ng/jobs/view/human-resources-assistant-job-at-première-urgence-internationale",
    "pubDate": "Mon, 07 Jul 2025 13:30:26 GMT",
    "source": "JobGurus",
    "keyword": "première urgence internationale",
    "duplicate": false,
    "classifications": [
      "Software Engineering"
    ],
    "content": "Join our Cohort 32 and Become a Software Developer            \n        \n\n        \n            \n\n                        Moat Academy  \n            \n                         Software/ Programming / Web development  \n             \n                         Abuja\n                                     and 2 other locations\n                            \n        \n\n        Our Cohort 31 is currently ongoing. Ifeoluwa was a member of our Cohort 30, and he developed Peddle, a web application for bicycle rentals, at the boot camp. In an interview with him, he stated, \"I've…\n    \n\n    \n        Apply\n        13th July, 2025",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Procurement Officer Job at Transsion Holdings",
    "link": "https://www.jobgurus.com.ng/jobs/view/procurement-officer-job-at-transsion-holdings",
    "pubDate": "Mon, 07 Jul 2025 13:30:26 GMT",
    "source": "JobGurus",
    "keyword": "transsion holdings",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Transsion Holdings is the parent company of TECNO, Infinix, and itel, and a leading smartphone manufacturer in Africa and emerging markets. With a focus on innovation tailored to local needs, Transsion also manages accessory, appliance, and after-sales brands like Oraimo, Syinix, and Carlcare\n\nWe are recruiting to fill the position below:\n\nJob Position: Procurement Officer\n\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\n\nSummary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are looking for a highly organized and detail-oriented Procurement Officer to manage our company's procurement process and supply chain activities.\n\tThe Procurement Officer will be responsible for sourcing suppliers, negotiating contracts, and managing vendor relationships to ensure timely and cost-effective procurement of goods and services.\n\tThis role requires strong negotiation skills, analytical thinking, and the ability to work collaboratively with internal and external stakeholders.\n\n\nResponsibilities\n\n\n\tDevelop and implement procurement strategies to optimize sourcing and supplier selection processes.\n\tIdentify potential suppliers, conduct supplier evaluations, and negotiate contracts and pricing terms.\n\tManage vendor relationships and monitor supplier performance to ensure compliance with contractual agreements and quality standards.\n\tCoordinate with internal stakeholders, such as production, finance, and operations, to align procurement activities with business needs.\n\tMaintain accurate records of procurement transactions, contracts, and vendor information.\n\tMonitor inventory levels and forecast demand to ensure adequate stock levels while minimizing carrying costs.\n\tStay abreast of market trends, industry developments, and regulatory requirements to inform procurement decisions.\n\tIdentify opportunities for cost savings and process improvements within the procurement function.\n\n\nQualifications and Requirements\n\n\n\tBachelor's Degree in Business Administration, Supply Chain Management, or related field.\n\t3+ years of experience in procurement or supply chain roles.\n\tStrong negotiation and contract management skills.\n\tExcellent communication and interpersonal abilities.\n\tProficiency in procurement software and Microsoft Office Suite.\n\tAnalytical thinking and problem-solving skills.\n\tAbility to work independently and as part of a team.\n\n\nRequired Skills:\n\n\n\tNegotiation skills\n\tAnalytical skills\n\tCommunication\n\tOrganizational skills\n\tProblem-solving\n\tAttention to detail\n\tKnowledge of procurement processes.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: oyeleke.adebimpe@transsion.com using \"Application - procurement officer'' as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Facility / Logistics Manager Job at DANSOL",
    "link": "https://www.jobgurus.com.ng/jobs/view/facility-logistics-manager-job-at-dansol",
    "pubDate": "Mon, 07 Jul 2025 13:30:26 GMT",
    "source": "JobGurus",
    "keyword": "dansol",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "At DANSOL, We are set to teach children to depend on the manifold wisdom of God in order to achieve excellence. We believe that the Word of God can and does affect and mold lives. Teachers are expected to be shining examples to the students.\n\nWe are recruiting to fill the position below:\n\nJob Position: Facility / Logistics Manager\n\nJob Location: Lagos\nJob Type: Full Time\n\nJob Description\n\n\n\tWe also seek a highly organised and proactive Facility/Logistics Manager to oversee our school operations.\n\n\nKey Responsibilities\nThe Facility/Logistics Manager will be responsible for:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tOverseeing and coordinating the cleaning/sanitation, maintenance/repairs, transportation, and security units of the schools.\n\tEnsuring safety and risk management.\n\tManaging space allocation and utilisation.\n\tEnsuring compliance with regulations, codes of conduct, and terms of usage of school facilities.\n\tManaging and ensuring the sustainability of resources.\n\tDriving continuous improvement and innovation.\n\tHandling vendor management and contract administration.\n\n\nKey Performance Indicators (KPIs)\n\n\n\tSuccess in this role will be measured by:\n\tFacility uptime and availability\n\tMaintenance backlog and response time\n\tEnergy consumption and cost reduction\n\tSecurity and safety levels\n\tCapital project delivery and budget variance\n\tSpace utilisation and optimisation\n\tVendor performance and contract compliance\n\tContinuous improvement and innovation initiatives.\n\n\nQualifications\n\n\n\tA First Degree or HND in any engineering discipline.\n\tAt least 3 years of cognate experience in a similar role.\n\tProfessional Certifications are an added advantage.\n\tExcellent communication, relational, and emotional skills.\n\tStrong leadership and management skills, with the ability to coordinate teams.\n\n\nMethod of Application\nInterested and qualified candidates should send their Letter of Application and updated CV to: career@dansolschools.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Junior Analyst Job at Midland Construction and Energy",
    "link": "https://www.jobgurus.com.ng/jobs/view/junior-analyst-job-at-midland-construction-and-energy",
    "pubDate": "Mon, 07 Jul 2025 13:30:26 GMT",
    "source": "JobGurus",
    "keyword": "midland construction and energy",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Software Engineering"
    ],
    "content": "Midland Construction and Energy (Nig) Ltd began its operations in 2018 as a multifaceted engineering company that elicits perfection in architectural and structural services, and later as a renewable energy service provider. We recognize the importance of electricity to the economic growth of a nation, therefore strive to bridge the energy gap Nigeria and other developing countries are facing by providing clean sustainable energy together with structural projects. We believe this will help to reduce the dependence on the national grid. Our energy services are affordable and reliable, and our experienced and well trained engineers ensure deliverables.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Junior Analyst\nJob Locations: Lagos\n\nAbout the Role\n\n\n\tMidland Construction & Energy is seeking a motivated Junior Analyst with hands-on experience in the energy sector.\n\tIn this role, you will utilize your industry expertise to produce innovative and impactful research tailored to the Nigerian energy market.\n\tCollaborating with Midland's data, analytics, and product teams, you will play a crucial role in designing data-driven solutions that empower stakeholders across the power industry.\n\tOur vision is to develop tools that enable organizations to finance, construct, evaluate, and manage energy systems effectively.\n\tAs a Junior Analyst, you will have the opportunity to work with a team and influence not only Midland's strategy but also the broader energy landscape in Africa and emerging markets.\n\tThis is an exciting chance to contribute to groundbreaking products that industry professionals rely on.\n\n\nKey Responsibilities\n\n\n\tDelivering insightful, data-backed analysis and content on power markets, including reports, articles, and videos, to engage and inform Midland’s audience.\n\tEstablishing and nurturing professional relationships within the energy sector, while staying updated on the latest trends and developments.\n\tCollaborating with cross-functional teams to align Midland’s product development, research, and user engagement initiatives.\n\tIdentifying and analyzing trends in market data to inform strategy and add value to Midland’s goals.\n\n\nQualifications\n\n\n\tGraduate or early-career professional with a Degree in Engineering, Physics, Environmental Science, Economics or any related field.\n\tA minimum of 1 year of experience in the power market, with deep insight into the workings of electricity systems and power trading.\n\tFamiliarity with solar energy and battery technologies is highly desirable.\n\tProficiency in data analysis using Python, excel, Power BI, with a demonstrated ability to interpret and present complex datasets.\n\tStrong analytical and quantitative skills, enabling you to uncover trends and share valuable insights.\n\tExceptional critical thinking, combined with the ability to ask thought-provoking questions and develop innovative approaches.\n\n\nDesirable Skills:\n\n\n\tStrong written communication abilities, with a talent for simplifying complex ideas into accessible, clear language.\n\tExperience producing high-quality content that resonates with a professional audience.\n\n\nWhy Join Midland\n\n\n\tThis role offers a platform to influence Midland’s future direction while becoming a recognized thought leader in the energy industry.\n\tYou’ll contribute to meaningful projects that shape the future of energy systems, all while collaborating with a passionate and innovative team.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and cover letter to: operations@midlandafrica.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Head of Marketing Job at De Koolar Nigeria Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/head-of-marketing-job-at-de-koolar-nigeria-limited",
    "pubDate": "Mon, 07 Jul 2025 13:30:26 GMT",
    "source": "JobGurus",
    "keyword": "de koolar nigeria limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "De Koolar Nigeria Limited is a 100% owned indigenous HVAC Company with over two decades of industry experience. We are leading Nigerian manufacturers and suppliers of a range of Ice Block Making Machine, Cold room, Blast Freezer, Display Chiller Fridge, Industrial Ovens, Refrigerators and Air Conditioners, among other domestic and industrial heat transfer equipment. Our services include all aspects of design, installation, maintenance and repairs of domestic, commercial and industrial systems.\n\nWe are recruiting to fill the position below:\n\nJob Position: Head of Marketing\n\nJob Location: Agege, Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Head of Marketing will be responsible for the strategic development, implementation, and oversight of De Koolar’s national marketing, sales, and customer engagement efforts.\n\tThis role will drive business growth through demand generation, strategic brand positioning, and performance marketing while leading a cross-functional team across physical and digital channels.\n\tThe ideal candidate must be an experienced marketing leader with a proven track record in selling physical engineering/manufactured products, leading distributed teams, and using data to drive decisions.\n\n\nKey Responsibilities\nStrategic Marketing & Business Growth:\n\n\n\tDesign and execute a national marketing and sales strategy that drives revenue, brand visibility, and market expansion.\n\tIdentify and pursue market opportunities in new sectors and geographies, including agriculture, logistics, healthcare, and FMCGs.\n\tDevelop annual marketing plans and sales forecasts aligned with corporate goals and expansion targets.\n\tMonitor competitor activities, market trends, and customer feedback to proactively adjust strategies.\n\n\nLeadership & Team Management:\n\n\n\tLead and manage the Business Development Executives and Officers across all regional offices (North, South-West, South-East, etc.).\n\tSupervise and align the efforts of the Digital Marketing and Customer Relationship teams to ensure integrated customer outreach.\n\tBuild and maintain a high-performance marketing department through clear KPIs, regular coaching, and team development.\n\n\nBrand & Digital Strategy:\n\n\n\tOversee the company’s online presence across all platforms – website, SEO/SEM, social media, paid ads, and email marketing.\n\tChampion the storytelling and brand positioning strategy of De Koolar as a leading innovator in cold storage and engineering solutions.\n\tCollaborate with content creators, designers, and IT to ensure messaging consistency across digital and offline channels.\n\n\nCustomer Relationship Management:\n\n\n\tEnsure the ERP/CRM system is effectively utilized to track leads, conversions, customer communications, and satisfaction.\n\tGuarantee the accuracy and daily reporting of customer data and insights across all channels and branches.\n\tDesign programs for customer retention, referral programs, and after-sales engagement.\n\n\nSales Enablement:\n\n\n\tServe as the Lead Corporate Sales Executive responsible for initiating and closing high-value B2B deals with corporate clients, distributors, government bodies, and institutions.\n\tPersonally manage and grow strategic accounts, ensuring long-term client satisfaction and repeat business.\n\tWork hands-on with the Business Development Executives, Officers, Digital Marketers, and Customer Relationship Officers — all of whom are involved in direct sales — to coordinate sales activities across physical and digital channels.\n\tDesign and deliver training, pitch tools, sales scripts, and customer engagement strategies to equip all front-line sales staff for performance excellence.\n\tProvide senior-level oversight of major project quotations, contract negotiations, and deal finalization.\n\tMonitor and report weekly/monthly sales performance across branches and product lines.\n\n\nKey Performance Indicators (KPIs)\n\n\n\tMonthly and quarterly sales target achievement by region and product.\n\tNumber and value of corporate B2B deals closed.\n\tGrowth in qualified leads generated (offline and digital).\n\tCustomer satisfaction and retention scores.\n\tAccuracy and timeliness of CRM data reporting.\n\n\nQualifications and Requirements\n\n\n\tBachelor’s Degree in Marketing, Engineering, Business Administration, or related field (Engineering/Technical background is a strong plus).\n\t5-8 years of progressive experience in marketing, preferably in manufacturing, engineering, or B2B sectors.\n\tProven experience leading a national marketing or sales team with measurable results.\n\tStrong grasp of traditional and digital marketing tools, CRM platforms, and analytics tools (e.g., Google Analytics, ERP Dashboard, Google Ads, SEO & Display).\n\tExcellent leadership, communication, and people management skills.\n\tHigh integrity, result-oriented mindset, attention to detail, and a drive to break barriers.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: career@dekoolar.com using the Job Position as the subject of email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]