[
  {
    "title": "Customer Service Manager Job at Outsource Nigeria",
    "link": "https://www.jobgurus.com.ng/jobs/view/customer-service-manager-job-at-outsource-nigeria-1",
    "pubDate": "Mon, 09 Jun 2025 11:14:02 GMT",
    "source": "JobGurus",
    "keyword": "outsource nigeria",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Outsource Nigeria is a full-service Human Resources agency, specializing in providing outsourced turnkey manpower solutions to growing companies. Our solution include HR Services, Recruiting, Accounting, IT Support, Business Intelligence, Developers, and Operations including management and field / phone / automated based resources. The core of Outsource Nigeria’s success is its people.\n\nWe are recruiting to fill the position below:\n\nJob Position: Customer Service Manager\nJob Location: Head Office or Regional Office - Lekki, Lagos\nEmployment Type: Full-time\nReports to: Head of Operations / Director of Client Services\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Customer Service Manager leads the customer service team to deliver prompt, professional, and effective support to clients and partners.\n\tThis includes overseeing customer touchpoints across channels and resolving escalated complaints.\n\n\nKey Responsibilities\n\n\n\tLead and manage a team of customer service officers, ensuring KPIs are met.\n\tDevelop and enforce service standards, response time protocols, and escalation processes.\n\tHandle complex customer complaints and ensure resolution within SLA.\n\tRecruit, train, and supervise customer service staff and corpers.\n\tPrepare detailed reports on customer queries, complaints, and service trends.\n\tLiaise with operations, technical, and finance departments to resolve systemic issues.\n\tMonitor customer satisfaction through surveys, feedback tools, and analytics.\n\tRecommend improvements to systems and processes to enhance the customer experience.\n\n\nRequirements\n\n\n\tBachelor’s Degree in Business, Communication, or related field.\n\t5–7 years of experience in customer service roles; 2+ years in a managerial capacity.\n\tStrong problem-solving, people management, and communication skills.\n\tFamiliarity with CRM platforms, helpdesk tools, and customer analytics.\n\n\nSalary Budge\nN200,000 Monthly + PFA + HMO.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: jobs@outsourcenigeria.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Tax and Compliance Lead Job at Seven-Up Bottling Company Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/tax-and-compliance-lead-job-at-seven-up-bottling-company-limited",
    "pubDate": "Mon, 09 Jun 2025 11:14:02 GMT",
    "source": "JobGurus",
    "keyword": "seven-up bottling company limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Seven-Up Bottling Company Ltd is one of the largest manufacturing companies in Nigeria, producing and distributing some of the nation’s most- loved beverages in the country like; Pepsi, 7Up, Mirinda, Teem, Mountain Dew, H2oH!, Lipton Ice Tea and Aquafina premium drinking water. SBC has recently entered into Home & Personal Care category with the 2SURE brand and launched its first product, a Hand & Surface Sanitizer. Seven Up boasts of nine bottling plants with state-of-the-art manufacturing facilities strategically located across various regions in the country.\n\nWe are recruiting to fill the position below:\n\nJob Position: Tax and Compliance Lead\nJob Location: Lagos\nEmployment Type: Full-time\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Brief\n\n\n\tWe are hiring for an experienced Tax and Compliance Lead who'll oversee all tax-related activities within the company, ensuring compliance with tax laws and regulations, timely remittances, accurate financial reporting, and proactive management of tax risks.\n\n\nResponsibilities\n\n\n\tManage all tax compliance aspects, including income tax, VAT, and withholding taxes (State and Federal), ensuring accurate and timely remittances before due dates.\n\tCoordinate with external auditors during tax audits, meeting audit requirements, and implementing recommendations to enhance internal controls.\n\tFacilitate the process and obtain a Certificate of Fixed Asset Addition (CAFA)\n\tHandle VAT remittances for foreign transactions and other income, ensuring compliance with tax laws and regulations.\n\tStay updated on changes in tax laws and regulations, communicating relevant updates to the finance team and ensuring full compliance.\n\tCompute and review Company income taxes and non-company income taxes, filing them as due.\n\tMonitor tax notices and audits across all regions, ensuring timely resolution and compliance.\n\tEnsure appropriate WHT deduction/provision on logistic services monthly, complying with regulatory requirements.\n\tUpdate and track excise duty remittances, ensuring timely submission and compliance.\n\tPrepare and share inventory disposal letters as needed, adhering to tax regulations and internal policies.\n\tOversee annual tax and transfer pricing audits, implementing necessary changes and improvements.\n\tConduct quarterly compliance audits and ensure ERP setup complies with tax regulations.\n\n\nRequirements\n\n\n\tB.Sc / HND\n\t5 years+ experience in a tax lead role\n\tACCA/ACA/CITN professional certification\n\tExperience in the FMCG sector.\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Customer Service Representative (Igbo & English) Job at Seven-Up Bottling Company Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/customer-service-representative-igbo-english-job-at-seven-up-bottling-company-limited-1",
    "pubDate": "Mon, 09 Jun 2025 11:14:02 GMT",
    "source": "JobGurus",
    "keyword": "seven-up bottling company limited",
    "duplicate": false,
    "classifications": [],
    "content": "Seven-Up Bottling Company Ltd is one of the largest manufacturing companies in Nigeria, producing and distributing some of the nation’s most- loved beverages in the country like; Pepsi, 7Up, Mirinda, Teem, Mountain Dew, H2oH!, Lipton Ice Tea and Aquafina premium drinking water. SBC has recently entered into Home & Personal Care category with the 2SURE brand and launched its first product, a Hand & Surface Sanitizer. Seven Up boasts of nine bottling plants with state-of-the-art manufacturing facilities strategically located across various regions in the country.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Customer Service Representative (Igbo & English)\nJob Location: Ijora, Lagos\nJob Type: Full Time\n\nJob Summary\n\n\n\tCustomer Service Representative is the front line of support for the company's customers.\n\tYou'll be responsible for answering customer questions, resolving customer problems, and providing excellent customer service.\n\n\nResponsibilities\n\n\n\tAnswer customer questions about products or services\n\tResolve customer problems and complaints in a timely manner\n\tProvide customer support via various channels\n\tEscalate complex customer issues to management\n\tCollect and record customer feedback\n\tHelp to improve the customer experience.\n\n\nQualifications\n\n\n\tBachelor's Degree in Business Administration or relevant field.\n\tA minimum of 2 years of proven experience in a customer service position in a manufacturing industry or relevant industry\n\tMust be proficient in Igbo language and fluent in English\n\tOutstanding written and verbal communication skills.\n\tGood understanding of management practices and techniques.\n\tProficiency in Microsoft Office and customer service software.\n\tMust be open to working on a shift schedule\n\tExcellent leadership and interpersonal skills.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: careers@sevenup.org using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Bank Reconciliation Officer Job at LemFi (YC S21)",
    "link": "https://www.jobgurus.com.ng/jobs/view/bank-reconciliation-officer-job-at-lemfi-yc-s21",
    "pubDate": "Mon, 09 Jun 2025 11:14:02 GMT",
    "source": "JobGurus",
    "keyword": "lemfi (yc s21)",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "LemFi (YC S21) is building the neobank for African diaspora in North America & Europe. We provide our users with a multi-currency account that allows them to hold, send, and receive money from Africa in any currency for their business and personal banking needs. We are a fast-paced startup with entities in the UK, USA, Canada and Nigeria and you would be required to familiarize yourself with necessary statutory and regulatory requirements in these locations.\n\nWe are recruiting to fill the position below:\n\nJob Position: Bank Reconciliation Officer\n\nJob Location: Nigeria\nEmployment Type: Full time\n\nAbout The Role\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tYou are a candidate who would thrive in a fintech startup environment like ours, where we readily accept individuals with a humble, yet uplifting attitude alongside a diligent sense of work ethic.\n\tThe teams here at Lemonade Finance are passionate about their work and fields of expertise, but also lend hands on cross-functional responsibilities to ensure the success of the company and the satisfaction of our clientele.\n\n\nWhat You’ll Be Doing\n\n\n\tThe role of the Bank Reconciliation Officer, Nigeria, is a fully remote position within LemFi’s Finance team.\n\tIn this role, you should have a demonstrated knowledge of Accounting and IFRS best practices with, at minimum, 2 years relevant experience in the finance industry.\n\n\nResponsibilities Are As Follows\n\n\n\tEnsure daily reconciliation of all bank accounts within the company.\n\tEnsure daily reconciliation of inter account fund movements within the company.\n\tEnsure all GL entries are backed up with documentation and approvals.\n\tWork closely with the Finance and Reconciliation team to ensure prompt resolution of all outstanding items.\n\tEnsure prompt posting of all bank related transactions.\n\tSending periodic summary statements of accounts movements to the Financial Accountant\n\tEngage in cross-functional responsibilities and assist the Financial Controller where needed.\n\n\nRequirements\n\n\n\tBachelor's Degree in finance, Accounting, or any related discipline.\n\tMinimum of 2 years of relevant experience in an accounting role at a FinTech or financial institution.\n\tProfessional certification such as ACCA, ICAN or relevant qualification will be an added advantage.\n\tStrong knowledge of IFRS\n\tUnderstanding of the local and global financial services industry.\n\tExcellent mathematical and statistical skills.\n\n\nSalary\nN6,000,000 - N7,200,000 / Annum.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Hotel Manager (Male) Job at Efezi Southsea Nigeria Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/hotel-manager-male-job-at-efezi-southsea-nigeria-limited",
    "pubDate": "Mon, 09 Jun 2025 11:14:02 GMT",
    "source": "JobGurus",
    "keyword": "efezi southsea nigeria limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Efezi Southsea Nigeria Limited - Established in 2009, Efezi Southsea Nigeria Limited is a hospitality consultancy firm specializing in providing expert services to small and medium-sized hotels.\n\nWe are recruiting to fill the position below:\n\nJob Position: Hotel Manager (Male)\n\nJob Location: Ikeja, Lagos\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tOversee daily hotel operations and ensure all departments function smoothly.\n\tDevelop and implement strategies to enhance guest satisfaction and overall experience.\n\tManage budgets, financial plans, and cost control measures to maximize profitability.\n\tMonitor occupancy rates and revenue trends to develop marketing and promotional strategies.\n\tEnsure compliance with health, safety, and security regulations.\n\tSupervise and train hotel staff, ensuring high levels of performance and customer service.\n\tMaintain hotel standards in line with company policies and industry regulations.\n\tHandle guest complaints and feedback to ensure prompt and professional resolutions.\n\tBuild and maintain relationships with vendors, suppliers, and key stakeholders.\n\tImplement and improve operational procedures for greater efficiency.\n\n\nRequirements\n\n\n\tCandidates should possess an HND in relevant fields with 5 years of work experience.\n\n\nBenefits Attached\n\n\n\tService charge – yes\n\tLayover - yes\n\tStaff meal - yes\n\n\nMethod of Application\nInterested and qualified candidates should send their Applications to: efezisouthsea2000@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]