[
  {
    "title": "Job Openings at Work Dey HR Services",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-work-dey-hr-services-2",
    "pubDate": "Fri, 13 Jun 2025 10:17:21 GMT",
    "source": "JobGurus",
    "keyword": "work dey hr services",
    "duplicate": false,
    "classifications": [],
    "content": "Work Dey HR Services offers a wide range of HR Consulting Services to Organizations and Individuals. We match Suitable ans employable applicants to Genuine Vacancies in Nigeria.\n\nWe are recruiting to fill the following positions below:\n\n1.) Grill Chef\n\nJob Location: Central Area, Abuja (FCT)\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tThe successful candidate will be responsible for preparing high-quality grilled dishes, maintaining kitchen safety and sanitation, and contributing to a positive kitchen environment.\n\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tPrepare and cook grilled meats, vegetables, and other menu items to perfection.\n\tMaintain grill stations, equipment, and utensils.\n\tEnsure food safety and sanitation protocols are followed.\n\tCollaborate with other kitchen staff to ensure seamless service.\n\tDevelop new recipes and menu ideas.\n\n\nRequirements\n\n\n\tCulinary training or experience in grilling.\n\t3+ years of experience as a Grill Chef or similar role.\n\tStrong attention to detail and ability to work under pressure.\n\tGood communication and teamwork skills.\n\n\nWhat We Offer\n\n\n\tCompetitive salary (N80,000 - N100,000 monthly) and benefits.\n\tOpportunities for growth and development.\n\tDynamic work environment.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: career.wsl@gmail.com using the Job Position as the subject of the mail.\n\n \n\n \n\n2.) Human Resources (HR) / Legal Officer\n\nJob Location: Abuja (FCT)\nEmployment Type: Full-time\n\nKey Responsibilities\n\n\n\tProvide HR services and functions within the company\n\tProvide legal guidance and support on contractual matters, ensuring compliance with relevant laws and regulations.\n\tDraft, review, and negotiate a variety of contracts, including vendor agreements, client contracts, and subcontractor agreements.\n\tConduct legal research to support decision-making and ensure the company's practices align with current legal standards.\n\tDevelop and deliver legal training programs to enhance the legal awareness of internal teams.\n\tAdvise on intellectual property matters and contribute to the protection of the company's legal interests.\n\tCollaborate with cross-functional teams to assess legal risks and provide strategic advice to mitigate potential issues.\n\tStay informed about changes in legislation and legal precedents that may impact the contracting firm's operations.\n\tAssist in the resolution of legal disputes, including participating in negotiations and liaising with external legal counsel when necessary.\n\tMaintain and update legal documentation, contracts, and records systematically.\n\tSupport the development and implementation of corporate policies and procedures to ensure legal compliance.\n\n\nQualifications\n\n\n\tA Degree in Law from a recognized institution.\n\tAdmission to the bar and a valid license to practice law in the relevant jurisdiction.\n\tProven experience in contract law and legal counsel roles, preferably within the contracting or construction industry.\n\tStrong knowledge of business and commercial law.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: career.wsl@gmail.com using the Job Position as the subject of the mail.\n\n \n\n \n\n3.) Project Manager\n\nJob Location: Abuja (FCT)\nEmployment Type: Full-time\n\nResponsibilities\n\n\n\tLead and manage projects from initiation to completion.\n\tDevelop and implement project plans, ensuring goals and objectives are met.\n\tEffectively allocate resources, manage budgets, and track project timelines.\n\tCollaborate with cross-functional teams and stakeholders for project success.\n\tIdentify and mitigate risks to ensure smooth project delivery.\n\n\nRequirements\n\n\n\tBachelor’s Degree in project management, Quantity Surveying, Civil Engineering, or related field.\n\tMinimum of 5 years of experience in the construction industry.\n\tProject management experience is compulsory.\n\tExperience in Road & Drainage construction is compulsory.\n\n\nSkills:\n\n\n\tStrong leadership and organizational skills.\n\tExcellent communication and interpersonal abilities.\n\tProficiency in project management tools and software.\n\tProblem-solving and decision-making skills.\n\n\nSalary\nN150,000 - N250,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: career.wsl@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Vacancies at Longbridge Technologies Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancies-at-longbridge-technologies-limited",
    "pubDate": "Fri, 13 Jun 2025 10:17:21 GMT",
    "source": "JobGurus",
    "keyword": "longbridge technologies limited",
    "duplicate": false,
    "classifications": [
      "Software Engineering"
    ],
    "content": "Longbridge Technologies Limited - At LONGBRIDGE, by offering competent management and a distinctive approach, we strive to position businesses for sustainable growth. This is driven by our core objective which is focused on creating and sustaining growth for individuals and enterprises through innovation.\n\nWe are recruiting to fill the following positions below:\n\n1.) Human Resources and Admin Manager\n\nJob Location: Lagos \nEmployment Type: Full-time\n\nAbout the Role\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking an experienced and motivated HR and Admin Manager to lead our people operations and administrative functions.\n\tThis role is instrumental in shaping our company culture, managing our workforce, and ensuring the smooth execution of administrative processes.\n\n\nResponsibilities\n\n\n\tPeople Operations Leadership: Develop and execute HR strategies, policies, and programs that align with the company's goals and foster a positive workplace culture.\n\tTalent Acquisition: Oversee the recruitment process, working closely with department managers to identify staffing needs, conducting interviews, and ensuring a seamless onboarding experience for new hires.\n\tEmployee Relations: Address employee concerns, provide guidance on company policies, and promote a collaborative and inclusive work environment.\n\tPerformance Management: Implement and manage performance appraisal processes, providing feedback and coaching to employees and managers to drive professional growth and development.\n\tTraining and Development: Identify training needs, develop training programs, and facilitate learning opportunities to enhance employee skills and competencies.\n\tCompensation and Benefits: Administer compensation and benefits programs, ensuring competitive and fair compensation packages while staying current with industry trends.\n\tHR Compliance: Ensure compliance with labor laws and regulations, keeping abreast of legal requirements and making necessary adjustments to company policies and practices.\n\tAdmin Operations: Oversee administrative functions such as office management, facilities, vendor relationships, and procurement to maintain an efficient and productive workplace.\n\tRecords and Documentation: Maintain accurate and up-to-date employee records, contracts, and other relevant documentation, adhering to data privacy and confidentiality guidelines.\n\n\nQualifications\n\n\n\tBachelor's Degree in Human Resources, Business Administration, or a related field; HR certification is a plus.\n\tProven experience as an HR professional, with at least 5 years of experience in HR management roles.\n\tStrong understanding of HR best practices, labour laws, and regulations.\n\tExceptional communication and interpersonal skills, with the ability to engage with employees at all levels.\n\tAbility to maintain confidentiality, exercise good judgment, and handle sensitive matters with discretion.\n\tEffective leadership skills, capable of guiding and mentoring a team to achieve HR and admin goals.\n\tProficiency in HRIS systems and Microsoft Office Suite.\n\n\nApplication Closing Date: 27th June, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their resume and a cover letter outlining their relevant experience and explaining why they are an ideal fit for this role to: HR@longbridgetech.com using the Job Position as the subject of the mail.\n\n \n\n \n\n2.) Senior Backend / Full Stack Java Software Developer\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nKey Responsibilities\n\n\n\tArchitect and lead the design of scalable, secure, and high-performing enterprise-grade applications.\n\tDevelop and maintain robust back-end services and APIs using Java (Java 8+), Spring Boot, Hibernate, and other modern Java technologies.\n\tDesign and optimize database models and queries in Oracle and MS SQL, ensuring high performance and data integrity.\n\tCollaborate with stakeholders to define system architecture, scalability, and security requirements.\n\tIntegrate with front-end technologies such as React.js, Vue.js, or Angular where applicable.\n\tImplement and manage reporting functionalities using JasperReports or similar tools.\n\tConduct code reviews and provide architectural guidance to the development team.\n\tTroubleshoot complex technical issues and ensure application reliability and performance.\n\tMentor junior developers and contribute to engineering best practices and continuous improvement.\n\tStay abreast of industry trends, tools, and technologies, and recommend innovations that drive product quality and business efficiency.\n\n\nRequirements\n\n\n\tBachelor’s Degree in Computer Science, Software Engineering, or a related field.\n\t7+ years of professional experience in Java-based software development.\n\tProven experience in designing and developing enterprise applications.\n\tFamiliarity with JasperReports or other enterprise reporting tools.\n\tExperience integrating with modern front-end frameworks (React, Vue, or Angular).\n\tSolid understanding of software architecture, data modeling, and software design patterns.\n\tExpert knowledge of Java 8+, Spring Boot, Spring Security, Spring Cloud, Hibernate, and JPA.\n\tStrong experience with RESTful API design, microservices architecture, and service-oriented systems.\n\tDeep knowledge of MS SQL and Oracle, including stored procedures, performance tuning, and complex queries.\n\tExcellent analytical, debugging, and problem-solving skills.\n\tStrong communication and leadership skills.\n\n\nNice to Have:\n\n\n\tExperience with cloud platforms (AWS, Azure) and containerization (Docker, Kubernetes).\n\tDevOps knowledge including CI/CD pipelines, Jenkins, GitLab CI.\n\tJava certification(s) or architectural certifications (e.g., TOGAF, AWS Certified Architect).\n\tExperience with Agile/Scrum environments and tools like Jira or Azure DevOps.\n\n\nApplication Closing Date: 31st July, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: HR@longbridgetech.com using the Job Position as the subject of the mail.\n\nNote: If you are an accomplished Java developer ready to architect and lead enterprise-level projects, we invite you to apply.\n\n \n\n3.) Senior Front-End Software Developer\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nKey Responsibilities\n\n\n\tDevelop and maintain complex, responsive, and scalable user interfaces using Vue.js and other modern frameworks like React.js or Angular.\n\tArchitect reusable front-end components and ensure maintainable code structures.\n\tCollaborate with back-end developers and designers to translate business requirements into functional web applications.\n\tOptimize applications for performance, speed, and cross-browser/device compatibility.\n\tIntegrate with RESTful APIs and ensure seamless interaction with server-side systems.\n\tLead code reviews, maintain coding standards, and mentor junior front-end engineers.\n\tContribute to DevOps, CI/CD, and automation of front-end workflows.\n\n\nRequirements\n\n\n\tBachelor’s degree in Computer Science, Engineering, or related field.\n\t7+ years of professional front-end development experience.\n\tExpertise in Vue.js is mandatory, including experience with Vuex or Pinia and Vue Router.\n\tStrong proficiency in JavaScript (ES6+), HTML5, and CSS3.\n\tProven experience working with React.js, Angular, or other modern front-end frameworks.\n\tDeep understanding of front-end best practices, performance optimization, and responsive design.\n\tExperience with front-end tooling like Vite, Webpack, Babel, and testing tools such as Jest or Cypress.\n\tFamiliarity with version control (Git) and Agile software development practices.\n\tStrong communication skills and ability to work collaboratively in a fast-paced environment.\n\n\nNice to Have:\n\n\n\tExperience with UI libraries like Vuetify, Tailwind CSS, or Bootstrap.\n\tFamiliarity with DevOps tools and CI/CD pipelines (GitLab CI, Jenkins, etc.).\n\tExperience with accessibility (WCAG), internationalization (i18n), or mobile-first design.\n\tExposure to Docker, RESTful service design, and Figma for design hand-offs.\n\tA portfolio or examples of front-end projects or contributions to open-source.\n\n\nApplication Closing Date: 25th June, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV and any portfolio links to: HR@longbridgetech.com using the Job Position as the subject of the mail.\n\nNote: If you're a senior developer passionate about building intuitive and high-performance user interfaces using Vue.js and other modern tools, we encourage you to apply!\n\n \n\n \n\n4.) Intermediate Mobile Application Developer (Android / iOS)\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nResponsibilities\n\n\n\tDesign, build, and maintain user-friendly mobile applications for Android and/or iOS using Kotlin, Java, Swift, or Flutter\n\tCollaborate with designers, backend engineers, and product managers to implement features and refine app functionality\n\tTranslate UI/UX wireframes into high-performance, responsive mobile applications\n\tOptimize applications for maximum speed, performance, and usability\n\tDiagnose and resolve application bugs and performance bottlenecks\n\tIntegrate applications with RESTful APIs and third-party SDKs\n\tWrite clean, maintainable, and well-documented code\n\tConduct unit testing and participate in end-to-end testing before deployment\n\tKeep up with emerging mobile trends and technologies to improve development workflow\n\tMaintain existing mobile apps with regular fixes, updates, and feature enhancements\n\tParticipate in code reviews and share feedback with team members\n\tContribute to improving mobile development standards and best practices\n\n\nRequirements\n\n\n\tBachelor's Degree in Computer Science, Software Engineering, or a related discipline\n\t2–4 years of hands-on experience building Android and/or iOS applications\n\tProficiency in Kotlin, Java (Android) or Swift (iOS); experience with Flutter or React Native is a strong advantage\n\tDemonstrated experience in publishing applications to Google Play Store or Apple App Store\n\tSolid understanding of mobile architecture, application lifecycle, and state management\n\tComfortable working with RESTful APIs, JSON, and common mobile libraries\n\tExperience with Git or other version control systems\n\tFamiliarity with Agile methodologies and sprint-based development\n\tStrong debugging, problem-solving, and analytical skills\n\tGood communication skills and ability to work collaboratively in a team\n\tUnderstanding of mobile app security best practices and performance tuning\n\tExperience with mobile-focused cloud services (e.g. Firebase, AWS Amplify, Azure App Center)\n\tPortfolio of live apps or contributions to open-source mobile projects\n\tCapacity to deliver in a dynamic, deadline-driven environment\n\tExperience with Flutter, React Native, or Xamarin for cross-platform development\n\tExposure to mobile DevOps tools such as Fastlane, CodeMagic, GitHub Actions, or Bitrise\n\tFamiliarity with mobile store review guidelines and release management.\n\n\nApplication Closing Date: 20th June, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV and a short Cover Letter to: HR@longbridgetech.com using the Job Position as the subject of the mail.\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Electrical / Electronics Engineer Job at Sales Force Consulting",
    "link": "https://www.jobgurus.com.ng/jobs/view/electrical-electronics-engineer-job-at-sales-force-consulting",
    "pubDate": "Fri, 13 Jun 2025 10:17:21 GMT",
    "source": "JobGurus",
    "keyword": "sales force consulting",
    "duplicate": false,
    "classifications": [],
    "content": "Sales Force Consulting - Our client is a major manufacturing company that majors in diverse polyethylene and cellophane packaging materials with two factories located in Asaba.\n\nAs part of their expansion program, they are recruiting experienced candidates to fill the position below:\n\nJob Position: Electrical / Electronics Engineer\n\nJob Location: Asaba, Delta\nEmployment Type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tCandidate must possess basic experience in the design installation, assembly and repairs of diverse electrical machines\n\tDesign electronic systemsand components for industrial and commercial applications.\n\tCreate testing procedures and maintenance for electronic equipment and components.\n\tRecommend design modifications and equipment repair.\n\tInspect electronic systems, instruments and equipment to ensure they meet applicable regulations and safety standards.\n\n\nRequirements\n\n\n\tHND in Electrical / Electronic Engineering.\n\tPossess a minimum of 8 years of practical experience preferably from plastics products related or a manufacturingcompany\n\tCandidate must be an experienced Electrical / ElectronicsEngineer\n\tMust be less than 45years of age\n\tHND graduates only.\n\n\nOther Conditions:\n\n\n\tThey must be very hardworking, target oriented, with high level of integrity\n\tThere is accommodation so the ideal candidateshould be ready to reside in Asaba.\n\tHe must preferably have worked or is currently working in a manufacturing company with organized systems and procedures\n\tThey must be ready to be interviewed and resume immediately.\n\n\nSkill Set:\n\n\n\tAbility to work independently with little supervision.\n\tAttention to details\n\tLeadership skills.\n\n\nInterview Mode:\n\n\n\tPhysical (In the Asaba factory).\n\n\nBenefits\n\n\n\tSalary: N300,000 - N400,000 / Month.\n\tThere is accommodation.\n\n\nMethod of Application\nInterested and qualified candidates should send their updated CV (PDF or Word) to: salesforceconsultingng@gmail.com using “Electrical / Electronics Engineer - Asaba\" as the subject of the email.\n\nNote\n\n\n\tEnquiries: Text or Whatsapp 08120796570 (No calls pls)\n\tOnly candidates who meet set criteria shall be shortlisted for invitation.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Human Resources and Admin Manager Job at Longbridge Technologies Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/human-resources-and-admin-manager-job-at-longbridge-technologies-limited",
    "pubDate": "Fri, 13 Jun 2025 10:17:21 GMT",
    "source": "JobGurus",
    "keyword": "longbridge technologies limited",
    "duplicate": false,
    "classifications": [],
    "content": "Longbridge Technologies Limited - From its inception, Longbridge Technologies has been driven by a bold vision: to transform the operational landscape of businesses. Specializing in bespoke software solutions, the company caters to the diverse needs of its clientele with precision and expertise.\n\nBacked by a team of seasoned professionals across various domains, Longbridge Technologies takes pride in delivering top-notch products and services. Its offerings are meticulously crafted to enhance efficiency, boost productivity, and foster growth across diverse sectors.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nFuelled by an unwavering commitment to innovation and customer satisfaction, Longbridge Technologies is dedicated to empowering businesses with the tools they require to flourish in today's competitive climate. Whether it's crafting tailor-made software solutions, streamlining processes through automation and system integration, implementing Enterprise Solutions, or providing Managed Services and Support, Longbridge Technologies remains steadfast in its mission to enable clients to realize their ambitions and maximize their potential.\n\nWe are recruiting to fill the position below:\n\nJob Position: Human Resources and Admin Manager\n\nJob at Location: Lagos \nEmployment Type: Full-time\n\nAbout the Role\n\n\n\tWe are seeking an experienced and motivated HR and Admin Manager to lead our people operations and administrative functions.\n\tThis role is instrumental in shaping our company culture, managing our workforce, and ensuring the smooth execution of administrative processes.\n\n\nResponsibilities\n\n\n\tPeople Operations Leadership: Develop and execute HR strategies, policies, and programs that align with the company's goals and foster a positive workplace culture.\n\tTalent Acquisition: Oversee the recruitment process, working closely with department managers to identify staffing needs, conducting interviews, and ensuring a seamless onboarding experience for new hires.\n\tEmployee Relations: Address employee concerns, provide guidance on company policies, and promote a collaborative and inclusive work environment.\n\tPerformance Management: Implement and manage performance appraisal processes, providing feedback and coaching to employees and managers to drive professional growth and development.\n\tTraining and Development: Identify training needs, develop training programs, and facilitate learning opportunities to enhance employee skills and competencies.\n\tAdmin Operations: Oversee administrative functions such as office management, facilities, vendor relationships, and procurement to maintain an efficient and productive workplace.\n\tCompensation and Benefits: Administer compensation and benefits programs, ensuring competitive and fair compensation packages while staying current with industry trends.\n\tHR Compliance: Ensure compliance with labor laws and regulations, keeping abreast of legal requirements and making necessary adjustments to company policies and practices.\n\tRecords and Documentation: Maintain accurate and up-to-date employee records, contracts, and other relevant documentation, adhering to data privacy and confidentiality guidelines.\n\n\nQualifications\n\n\n\tBachelor's Degree in Human Resources, Business Administration, or a related field; HR certification is a plus.\n\tProven experience as an HR professional, with at least 5 years of experience in HR management roles.\n\tStrong understanding of HR best practices, labour laws, and regulations.\n\tExceptional communication and interpersonal skills, with the ability to engage with employees at all levels.\n\tAbility to maintain confidentiality, exercise good judgment, and handle sensitive matters with discretion.\n\tEffective leadership skills, capable of guiding and mentoring a team to achieve HR and admin goals.\n\tProficiency in HRIS systems and Microsoft Office Suite.\n\n\nMethod of Application \nInterested and qualified candidates should send their resume and a cover letter outlining their relevant experience and explaining why they are an ideal fit for this role to: HR@longbridgetech.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]