[
  {
    "title": "Content Creator Job at Wetinuneed Services Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/content-creator-job-at-wetinuneed-services-limited",
    "pubDate": "Wed, 11 Jun 2025 10:44:44 GMT",
    "source": "JobGurus",
    "keyword": "wetinuneed services limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Wetinuneed Services Limited is a first of its kind 100% indigenous on-line advertising company proudly founded, owned and managed by Nigerians for Nigerians. Our aim is to become Nigeria’s No.1 advertising platform by providing a next to none service that will not only exceed the advertising expectations of the Nigerian market but subsequently exceed the expectations of advertisers in the sub-Saharan region.\n\nWe are recruiting to fill the position below:\n\nJob Position: Content Creator\nJob Location: Lagos \nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking an experienced, creative, and passionate Content Creator with strong storytelling and videography skills to craft engaging content and amplify our brand voice. If you are a talented wordsmith and videographer, we would love to hear from you!\n\n\nWhat You Will Do\n\n\n\tVideo Production: Ability to plan, shoot, and edit high-quality videos and reels for multiple platforms.\n\tPhotography: Skilled in capturing and editing compelling images that align with brand aesthetics.\n\tWriting & Copywriting: Strong command of grammar and the ability to craft clear, persuasive, and engaging content tailored for various audiences and platforms.\n\tStorytelling: A natural storyteller who can shape brand narratives and communicate messages effectively through different media.\n\tOn-Camera Presence: Confident, charismatic, and articulate when hosting or presenting on video or during live streams.\n\tAudio Content Creation: Familiarity with voiceovers, podcasts, or sound editing to support multimedia projects.\n\tSEO Knowledge: Understanding of search engine optimization techniques to improve content visibility and ranking.\n\tContent Strategy: Ability to plan and execute content calendars aligned with brand goals and audience engagement.\n\n\nQualifications & Skills\n\n\n\tEducation: Bachelor’s degree in Communications, English, Journalism, Marketing, or related fields.\n\tExperience: Proven track record as a Content Creator, with samples of engaging, high-impact content.\n\tExceptional writing, editing, and proofreading skills.\n\tStrong storytelling ability to connect with diverse audiences.\n\tDetail-oriented, organized, and deadline-driven.\n\tKnowledge of social media and content trends.\n\n\nSalary\nN200,000 - N250,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: wetinuneedng@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Inventory Officer (Male or Female) Job at Prince OJ Global Services Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/inventory-officer-male-or-female-job-at-prince-oj-global-services-limited",
    "pubDate": "Wed, 11 Jun 2025 10:44:44 GMT",
    "source": "JobGurus",
    "keyword": "prince oj global services limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Prince OJ Global Services Limited is a fast consumer goods company incorporated in Nigeria with head office in Onitsha Anambra state, We deal on importation and distribution of top quality wines and spirits, spices, tomato, spaghetti, oil, margarine, baking powder, liquid milk and many more...\n\nWe are recruiting to fill the position below:\n\nJob Position: Inventory Officer (Male or Female)\n\nJob Location: Onitsha, Anambra\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tRecord and keep accurate information on stock\n\tOverseeing daily/weekly/monthly updating of stock movement\n\tEnsure that warehouse staff are up to date with their records (book)\n\tPrompt distribution of products to branches and outlets as requested.\n\tEnsure periodic stock-taking and submission of stock reconciliation report\n\t•Safeguard the warehouses\n\tEnsure there is no damage of products arising from personal handling.\n\tProvide stock reports as and at when needed\n\tMonitoring of sales of products through branch stock report before releasing products\n\tMonitor stock level to avoid over stocking or shortages\n\tEnsure products are picked up for delivery to branches as at when due.\n\tTraining - Provide training and understanding to various departments regarding stock control.\n\tOther ad hoc projects relating to stock and system management.\n\n\nRequirements\n\n\n\tMinimum of a Degree in a related field\n\tAt least 1 year of experience\n\tMust be computer literate\n\tExcellent communication skills, both oral and verbal\n\tGreat interpersonal skills\n\tCustomer service and relationship-building skills\n\tTeamworking skills\n\tStrong attention to details\n\tAnalytical Skills.\n\n\nSalary\nN70,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: careers@ojglobalservices.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Accounting Manager Job at Moniepoint",
    "link": "https://www.jobgurus.com.ng/jobs/view/accounting-manager-job-at-moniepoint",
    "pubDate": "Wed, 11 Jun 2025 10:44:44 GMT",
    "source": "JobGurus",
    "keyword": "moniepoint",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Moniepoint Incorporated is a global business payments and banking platform and recently became QED Investors’ first investment in Africa. We are the partner of choice for over 600,000 businesses of all sizes, powering the dreams of SMBs and providing them with equal access to the tools they need to grow and scale.\n\nWe are recruiting to fill the position below:\n\nJob Position: Accounting Manager\n\nJob Location: Nigeria (Remote)\n\nAbout the role\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tIn this role, you will manage accounting operations focusing on holding company and consolidated entity reporting.\n\tYou will help manage the company’s global accounting operations, focusing on consolidations, intercompany transactions, and accurate reporting of shared costs across regions.\n\n\nResponsibilities\n\n\n\tPerform monthly, quarterly, and annual financial close processes, ensuring timely and accurate consolidation\n\tManage intercompany transactions, reconciliations, and eliminations, ensuring alignment with the holding company’s financial reporting requirements.\n\tPrepare consolidated financial statements and ensure compliance with IFRS and local statutory requirements.\n\tCollaborate with finance operations to implement efficient intercompany transactions and reconciliations\n\tSupport audit processes and ensure compliance with internal controls for holding company\n\tEnsure compliance with statutory requirements\n\tDrive efficient systems and processing for entity accounting operations\n\tExperience working with companies operating within the UK financial and regulatory landscape is essential\n\tDemonstrable expertise in UK financial regulations and tax compliance, including VAT, corporate tax, and payroll.\n\n\nWhat we can offer you\n\n\n\tCulture - We put our people first and prioritize the well-being of every team member. We’ve built a company where all opinions carry weight and where all voices are heard. We value and respect each other and always look out for one another. Above all, we are human.\n\tLearning - We have a learning and development-focused environment with an emphasis on knowledge sharing, training, and regular internal technical talks.\n\tCompensation - You’ll receive an attractive salary, pension, health insurance, annual bonus, plus other benefits.\n\n\nWhat to expect in the hiring process\n\n\n\tA preliminary phone call with one of our recruiters.\n\tTake home assessment\n\tA panel technical interview with existing Directors of Product Management and Business Leaders.\n\tA behavioural and technical interview with a member of the Executive team.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Content Creator Job at First Excelsia Professional Services Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/content-creator-job-at-first-excelsia-professional-services-limited",
    "pubDate": "Wed, 11 Jun 2025 10:44:44 GMT",
    "source": "JobGurus",
    "keyword": "first excelsia professional services limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "First Excelsia Professional Services Limited - Our client, a full-service Construction firm, is recruiting to fill the position below:\n\nJob Position: Content Creator\nJob Location: Yaba, Lagos\nEmployment Type: Full-time\nIndustry: Construction / Engineering\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDevelop and execute a content strategy aligned with marketing goals and brand voice.\n\tCreate engaging and informative written, visual, and video content related to construction projects, trends, and services.\n\tWork closely with project managers, engineers, and site teams to gather insights and translate them into accessible content.\n\tManage content calendars and ensure timely delivery of campaigns.\n\tOptimize content for SEO and audience engagement.\n\tCapture on-site photos and videos of projects in progress and completed works.\n\tMonitor and analyze content performance metrics and adjust strategies as needed.\n\n\nPerson Specification\n\n\n\tBachelor’s degree in mass communication or relevant field of study.\n\tMinimum of 3 years of experience as a Content Creator, Copywriter, or similar role in the construction or related industry.\n\tStrong writing, editing, and storytelling skills.\n\tProficiency in content creation tools (Canva, Adobe Creative Suite, Final Cut Pro, etc.).\n\tKnowledge of SEO and social media marketing strategies.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and portfolio to: alentsearch@firstexcelsia.com using \"Content Creator\" as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]