[
  {
    "title": "Internal Auditor Job at D’Vin Integrated Services",
    "link": "https://www.jobgurus.com.ng/jobs/view/internal-auditor-job-at-dvin-integrated-services",
    "pubDate": "Mon, 30 Jun 2025 14:15:40 GMT",
    "source": "JobGurus",
    "keyword": "d’vin integrated services",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "(adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\nD’Vin Integrated Services is a dynamic and innovative consulting firm dedicated to empowering businesses to reach their full potential. Our expertise spans two core areas: Recruitment: We connect top talent with forward-thinking organizations, fostering meaningful relationships that drive success. Training program: To develop a highly skilled and knowledgeable workforce that drives business excellence, innovation, and sustainability for entrepreneurs and gives a clear career path for business executives. Business Structuring: We help entrepreneurs and executives navigate complex business challenges, providing strategic guidance on structure, operations, and growth. With a passion for excellence and a commitment to delivering exceptional results, our team of seasoned professionals works closely with clients to understand their unique needs and goals. Whether you're seeking to build a high-performing team or transform your business model, we offer tailored solutions that drive lasting impact. Let us help you build a stronger, more resilient business. Contact us today to explore how our expertise can elevate your success.\n\nWe are recruiting to fill the position below:\n\nJob Position: Internal Auditor\n\nJob Location: Iyana-Ipaja, Lagos\nEmployment Type: Full-time\nIndustry: Distribution / FMCG / Consumable Products\n\nPosition Summary\n\n\n\tWe are seeking a highly analytical and detail-driven Internal Auditor to lead the internal audit function for our company, a major player in the distribution of consumable products.\n\tThe Internal Auditor will be responsible for developing and implementing risk-based audit plans, assessing internal controls, ensuring regulatory compliance, and recommending improvements to enhance operational efficiency and financial integrity.\n\tThis role is critical in supporting the organization’s commitment to transparency, accountability, and governance.\n\n\nKey Responsibilities\n\n\n\tDevelop and execute a comprehensive annual audit plan based on risk assessments and business priorities.\n\tLead and perform audits across operational, financial, inventory, and compliance areas, ensuring adherence to internal controls and policies.\n\tEvaluate the effectiveness of internal controls and identify areas of improvement or potential risks.\n\tPrepare detailed audit reports and present findings and recommendations to senior management and the audit committee.\n\tMonitor the implementation of audit recommendations and follow up on corrective actions.\n\tBuild and manage the internal audit team, providing direction, coaching, and development.\n\tFoster a strong ethical culture and internal awareness of controls and audit readiness across departments.\n\tProvide recommendations for risk mitigation and process improvements, especially across logistics, warehousing, procurement, and sales.\n\tEnsure the company’s operations comply with applicable laws, industry standards, and internal policies, particularly around consumable goods handling.\n\tMonitor compliance with financial regulations, tax obligations, and corporate governance standards.\n\tIdentify inefficiencies and recommend enhancements in processes, systems, and workflows.\n\tStay up to date with industry best practices, regulatory changes, and emerging risks relevant to the distribution and consumables sectors.\n\n\nQualifications & Experience\n\n\n\tBachelor’s Degree in Accounting, Finance, Business Administration, or related field (CPA, ACA, ACCA, or CIA certification preferred).\n\t7+ years of progressive audit experience, with at least 3 years in a managerial role, ideally in FMCG, distribution, or logistics sectors.\n\tDeep understanding of internal control frameworks, risk management, and financial reporting standards.\n\tExperience with inventory audits, logistics operations, and ERP systems (e.g., SAP, Oracle).\n\tStrong leadership, analytical, and communication skills.\n\n\nMethod of Application\nInterested and qualified candidates should submit their CV to:  eandg.tprecruiters@gmail.com using \"Internal Auditor-Iyana-Ipaja\" as the subject of the    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Procurement Manager Job at RSIN Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/procurement-manager-job-at-rsin-group",
    "pubDate": "Mon, 30 Jun 2025 14:15:40 GMT",
    "source": "JobGurus",
    "keyword": "rsin group",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "RSIN was founded in 2003 and is headquartered in Fuzhou, Fujian Province. We mainly conduct business in Nigeria and other Western African countries. Over the past 20 years of development, we have become a multinational corporation with diversified industrial clusters of iron and steel, textile, fiber, chemical and lead-acid battery manufacturing based on the construction of a circular economy industrial park.\n\nWe are recruiting to fill the position below:\n\nJob Position: Procurement Manager\nJob Locations: Minna - Niger & Ilorin / Offa - Kwara\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tCoordinate the overall strategy of the purchasing department, formulate purchasing plan and budget, and optimise the supplier resource pool.\n\tPerforming all procurement activities including pre-qualification, negotiating supplier agreements, preparation of contracts and tender management\n\tLeading bulk purchase negotiation,, ensuring supply chain stability and cost control.\n\tDelegating tasks and supervising the work of Purchasing\n\tIdentifying emerging markets to find new opportunities\n\tDocument and report on daily operations and production metrics\n\tSupervise the operation of the business team and dispatching team (customer maintenance, procurement negotiation, fleet dispatching).\n\n\nRequirements\n\n\n\tMust be a BSc/HND holder in Purchasing/Supply, Marketing or any Mining related courses\n\tMust have a cognate experience in sales/procurement (at least 3 years)\n\tMust have worked or have experience in a mining firm\n\tMust be computer literate\n\tMust have managerial experience with good quality leadership traits.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: rsingrouphr@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Warehouse Team Leader Job at International Breweries Plc",
    "link": "https://www.jobgurus.com.ng/jobs/view/warehouse-team-leader-job-at-international-breweries-plc-1",
    "pubDate": "Mon, 30 Jun 2025 14:15:40 GMT",
    "source": "JobGurus",
    "keyword": "international breweries plc",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "International Breweries Plc - Our Dream is to bring people together for a better world. Beer, the original social network, has been bringing people together for thousands of years. We are committed to building great brands that stand the test of time and to brewing the best beers using the finest natural ingredients.\n\nOur diverse portfolio of well over 400 beer brands includes global brands Budweiser, Corona and Stella Artois; multi-country brands Beck’s, Castle, Castle Lite, Hoegaarden, and Leffe; and local champions such as Aguila, Bud Light, Jupiler, Klinskoye, Modelo Especial, Quilmes, Skol, and Victoria.\n\nWe are recruiting to fill the position below:\n\nJob Position: Warehouse Team Leader\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Requisition ID: 30084326\nJob Location: Port Harcourt, Rivers\nJob Type: Full-time\n\nSummary\n\n\n\tThe Key Purpose of this role is to directly supervise, manage and optimize warehouse operations (Receipt, Storage, Replenishment, Shipping and Returns) to meet and exceed set goals.\n\tThis function oversees and coordinates daily warehousing activities by implementing quality, productivity, production, and customer service standards.\n\n\nKey Roles and Responsibilities\n\n\n\tManage and drive improvements in daily warehouse operations - Receipt, Storage, Offloading, Loading.\n\tOptimize all warehouse processes to ensure satisfactory and on-time delivery to customers.\n\tManage warehouse Inventory with focus on driving inventory accuracy.\n\tProcess customer receipts and pass customer credit.\n\tProcess inter-depot and inter-warehouse transfers.\n\tManage all critical products affecting Downtime Caused by Logistics e.g. Sorting and FLT availability.\n\tManage the inflow and outflow of products (Full Products and Containers).\n\tDrive achievement of warehouse PI’s and KPI’s.\n\tParticipate in annual target setting and cascading.\n\tCascade Team and Individual Goals and Manage Team Performance (Daily Performance Tracking, Monthly One on One’s).\n\tDevelop and Implement process standards: SOPs, OPL’s OWDs etc.\n\tManage Warehouse stock to ensure quality and availability to customers (Internal and External).\n\tMaintain and improve safety by driving the correct safety behaviors on the shop-floor.\n\tEnsure optimal asset utilization (Warehouse, Forklifts, Human Resources)\n\tEnsure accuracy of inventory and shipments.\n\tFacilitate Team dynamics.\n\tSupervise Daily Stock Counts.\n\tManage internal and external customer complaints.\n\tEngage with the Plant regarding their VPO/DPO dream by driving VPO/DPO on the shop floor.\n\tRepresentation during milestone audits will be necessary to support the Plant’s VPO/DPO dream.\n\tCollate and Submit daily PI/KPI data as per requirement by the Warehouse Controller.\n\n\nMinimum Requirements\n\n\n\tMinimum of B.Sc / B.Tech / HND qualification in a related field.\n\t2 years of experience in Logistics and Supply Chain Management.\n\n\nKey Attributes and Competencies:\n\n\n\tComputer Literate \n\tMS Office/Excel\n\tStrong and assertive\n\tCompliance driven\n\tCreativity\n\tStrong work ethic: Setting and achieving goals\n\tDependable: Consistently following through\n\tPositive attitude: Creating a good environment.\n\tSelf-motivated: Working effectively with little direction\n\tTeam-oriented: Making the most out of collaboration.\n\n\nAdditional Information:\n\n\n\tBand: VIII.\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Sales Executive (Salary Loan / Wealth Management) Job at Rosabon Financial Services",
    "link": "https://www.jobgurus.com.ng/jobs/view/sales-executive-salary-loan-wealth-management-job-at-rosabon-financial-services-5",
    "pubDate": "Mon, 30 Jun 2025 14:15:40 GMT",
    "source": "JobGurus",
    "keyword": "rosabon financial services",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Rosabon Financial Services (RFS) Limited is an Award winning Rosabon Financial Services is member of the Concept Group is licensed by the Central Bank of Nigeria, CBN on April 22, 1993, and being a long-standing member of the Equipment Leasing Association of Nigeria (ELAN), the organization has evolved into Nigeria’s leading Non-Banking Financial Intermediary and Equipment Leasing firm focused on niche and general markets.\n\nWe are recruiting to fill the position below:\n\nJob Position: Sales Executive (Salary Loan / Wealth Management)\n\nJob Location: Anambra\nEmployment Type: Full-time\n\nScope and Impact\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe candidate will be tasked with the responsibility of selling various loan products.\n\tHe / She will act as liaison between customers and our financial institution and will help qualified applicants acquire loans in a timely manner.\n\n\nJob Summary\n\n\n\tThe Rosabon Sales Executive is required to collect and prepare all materials needed to process transactions (loans and investments).\n\tHe/ She will also be responsible for reviewing loan applications and evaluating the potential risks of granting loans to applicants.\n\n\nDuties and Responsibilities\n\n\n\tEvaluate credit worthiness by processing loan applications and documentation within specified limits\n\tInterview applicants to determine financial eligibility and the feasibility of granting loans\n\tDetermine all applicable ratios and metrics, and set up debt payment plans\n\tCommunicate with clients either to request or to provide information\n\tJustify decisions (approvals/rejections) and report on them\n\tComplete loan contracts and counsel clients on policies and restrictions\n\tUpdate job knowledge on types of loans and other financial services\n\tAssess customer needs, explore all options and introduce different types of loans\n\tReview loan agreements to ensure that they are complete and accurate according to policy\n\tUpdate account records, compute payment schedules and transactions on ERP\n\tConfer with underwriters to aid in resolving loan application problems.\n\tDevelop referral networks, suggest alternate channels and cross-sell products and services to accomplish quotas\n\tGo the “extra mile” to build trust relationships, customer loyalty and satisfaction throughout the underwriting process\n\tOperate in compliance with laws and regulations and adhere to lending compliance guidelines\n\tDeposit mobilization to meet set targets\n\n\nKey Performance Indicators\n\n\n\tMeet Set Monthly loan and investment Targets\n\tReduced number of Non-Performing loans\n\tCustomer retention rate of a minimum of 90% across loan and investment products\n\n\nRequirements\n\n\n\tCandidates should possess a B.Sc Degree in Finance, Economics or a related field\n\tProven working experience as a Loan Officer\n\tFamiliarity with computers and banking applications/software\n\tSolid understanding of direct/indirect lending products and practices\n\tCustomer satisfaction orientation and sales competencies\n\tAbility to work in a goal-oriented environment and meet set targets.\n\n\nSalary\nN110,000 - N180,000 / Month.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Branch Manager Job at MFS Financial Services Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/branch-manager-job-at-mfs-financial-services-limited",
    "pubDate": "Mon, 30 Jun 2025 14:15:40 GMT",
    "source": "JobGurus",
    "keyword": "mfs financial services limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "MFS Financial Services Limited (formerly Mainstreet Financial Services Limited) is a newly established microfinance institution (MFI), seeking to recruit a formidableteam to strengthenes its business operations. Its main focus of operation is to grant loans, mobilize savings and investments from its potential clients through Group Lending Model (GLM). These products and services are meant to reach out to market groups, co-operative societies, organized unions, organized private sectors etc. The business office is located along Lekki – Epe expressway, Lagos State, Nigeria.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Branch Manager\nJob Location: Bogije, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tThe Branch Manager (BM) is responsible for the overall management, growth, and strategic direction of the Microfinance Institution.\n\tThe BM provides leadership across all operational, financial, and administrative functions, ensuring that the institution achieves its mission of financial inclusion, sustainable growth, and client empowerment.\n\tThe BM also ensures compliance with regulatory requirements and fosters a culture of high performance, integrity, and innovation. Reports to the Managing Director.\n\n\nKey Responsibilities\nStrategic Leadership & Planning:\n\n\n\tDevelop and implement strategic plans that align with the MFI's vision and mission.\n\tLead the execution of the institution’s business strategy with a focus on portfolio growth, financial sustainability, and client outreach.\n\tIdentify market opportunities and emerging trends to position the MFI for competitive advantage.\n\n\nOperational Management:\n\n\n\tOversee daily operations.\n\tEstablish and monitor performance standards, operational procedures, and customer service quality.\n\n\nFinancial Management & Sustainability:\n\n\n\tEnsure sound financial management, including budgeting, forecasting, and cost control.\n\tMonitor portfolio quality (e.g., PAR, write-offs) and implement credit risk mitigation strategies to ensure optimal performance.\n\tEnsure consistent profitability, sustainable cost of funds, and optimal asset-liability management.\n\n\nBusiness Development & Client Outreach:\n\n\n\tLead the expansion of services into new markets and underserved communities.\n\tDevelop innovative products (loans, savings, microinsurance, etc.) tailored to client needs.\n\tStrengthen partnerships with regulators, donors, investors, and other stakeholders.\n\n\nCompliance & Risk Management:\n\n\n\tEnsure full compliance with regulatory requirements (e.g., CBN, NDIC).\n\tImplement risk management frameworks covering credit, operational, financial, and reputational risks.\n\tEnsure timely internal and external audit processes are conducted with proper follow-up on findings.\n\n\nHuman Resources & Organizational Development:\n\n\n\tFoster a performance-driven, inclusive, and ethical work environment.\n\tLead recruitment, talent management, and staff development programs.\n\tDefine KPIs for departments and ensure ongoing staff coaching, evaluation, and motivation.\n\n\nReporting & Board Engagement:\n\n\n\tProvide regular operational and financial performance reports to the Board of Directors through the Managing Director.\n\tAdvise the Board on strategic issues, market dynamics, and policy decisions.\n\tEnsure transparent governance and the implementation of Board resolutions.\n\n\nKey Performance Indicators (KPIs)\n\n\n\tGrowth in client base and loan/savings portfolio\n\tPortfolio at Risk (PAR) and loan recovery rate\n\tProfitability and cost-to-income ratio\n\tStaff productivity and retention\n\tRegulatory compliance and audit outcomes\n\tCustomer satisfaction and retention rates\n\n\nQualifications\n\n\n\tBachelor’s degree in Finance, Economics, Business Administration, (Relevant Professional certifications (e.g., ACIB, CIBN, ACA) is an added advantage.\n\tA minimum of 10 years of experience in financial services, including over 5 years in a senior management position within microfinance or banking.\n\tDemonstrated success in managing microfinance operations, encompassing credit, risk, and financial performance.\n\tThorough understanding of microfinance regulations, trends in financial inclusion, and best practices.\n\tExcellent leadership, strategic planning, and interpersonal skills are essential for success.\n\n\nKey Competencies:\n\n\n\tStrategic thinking and problem-solving\n\tFinancial and risk management\n\tExcellent communication and negotiation\n\tDecision-making and conflict resolution\n\tClient and impact orientation\n\tTechnological adaptability (especially digital finance tools)\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: myrecruitments22@gmail.com using the Job Positionas the subject of the mail.\n\nNote\n\n\n\tOnly the shortlisted candidate shall be contacted.\n\tApplicants residing around Victoria Island, Lekki, Ajah, Lakowe, Epe and its environs will be most preferrable.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]