[
  {
    "title": "HR / Admin Officer Job at Ziba Consulting",
    "link": "https://www.jobgurus.com.ng/jobs/view/hr-admin-officer-job-at-ziba-consulting",
    "pubDate": "Wed, 18 Jun 2025 14:15:56 GMT",
    "source": "JobGurus",
    "keyword": "ziba consulting",
    "duplicate": false,
    "classifications": [],
    "content": "Ziba Consulting is a dynamic recruitment and consulting firm committed to connecting top talent with the right opportunities. Our mission is to help businesses streamline their hiring processes while supporting job seekers in achieving their career goals.\n\nWe are recruiting to fill the position below:\n\nJob Position: HR / Admin Officer\n\nJob Location: Lekki Phase I, Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThis role is ideal for someone who understands how to manage people, track team performance, and maintain administrative order.\n\tYou will work closely with leadership to ensure operational efficiency, track staff performance, and uphold company policies. A strong background in administration and a firm but fair approach to people management is key.\n\n\nResponsibilities\n\n\n\tMaintain and update trackers for attendance, performance, and task compliance.\n\tMonitor daily employee activities and follow up with team members to ensure productivity.\n\tMaintain accurate staff records, schedules, and administrative documentation.\n\tSupport leadership in creating a high-performing work culture.\n\tAssist with internal communications, team check-ins, and coordination of meetings.\n\tCompile and share weekly/monthly performance reports with management.\n\tSupport employee evaluation processes and provide documentation for performance reviews.\n\tCommunicate HR policies clearly and ensure company guidelines are followed.\n\tProvide general administrative support across departments.\n\n\nRequirements\n\n\n\tBachelor’s Degree in Human Resources, Business Administration, or related field.\n\t1 – 3 years of experience in a similar HR or administrative role.\n\tStrong organizational and people management skills.\n\tAbility to track performance metrics and take initiative in addressing issues.\n\tConfident communicator with a firm and professional presence.\n\tProficient in basic office tools (Excel, Word, Google Suite, etc.).\n\tSelf-starter, detail-oriented, and able to work with minimal supervision.\n\n\nBenefits\n\n\n\tN150,000 Monthly salary.\n\tOpportunity for professional growth and leadership exposure\n\tHands-on experience in a performance-focused environment\n\tDiverse projects and a collaborative team culture.\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Cashier Job at the Borough Lagos",
    "link": "https://www.jobgurus.com.ng/jobs/view/cashier-job-at-the-borough-lagos-4",
    "pubDate": "Wed, 18 Jun 2025 14:15:56 GMT",
    "source": "JobGurus",
    "keyword": "the borough lagos",
    "duplicate": false,
    "classifications": [],
    "content": "The Borough Lagos - Nestled in the heart of Lagos, our boutique hotel offers unparalleled luxury and service. Whether you’re in Lagos working, relocating or traveling with your family, our boutique hotel will delight you with plush amenities with upscale décor. The Borough Lagos is already the trusted choice for the world’s leading corporations, international organizations, and discerning private clients who want to relax in the stylish comfort and feel of their own home while on a long or short stay in the Lagos area.\n\nWe are recruiting to fill the position below:\n\nJob Position: Cashier\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nAbout the job\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe're seeking to hire friendly, efficient, and customer-focused cashiers to join our team.\n\tAs a cashier, you'll provide exceptional service, ensure a positive experience for all guests visiting our recreational center, process transactions accurately, and maintain an organized workspace.\n\n\nResponsibilities\n\n\n\tProcess customer requests and payments efficiently and accurately\n\tProvide exceptional customer service and respond to customer inquiries\n\tCollaborate with other team members to ensure smooth operations throughout the center\n\tHandle cash, credit card transactions, and mobile payments\n\tMaintain a clean and organized workspace, including the cashier area and surrounding environment\n\tManage the cash register, handle cash drops, and reconcile receipts\n\tAnswer phone calls and respond to customers' inquiries\n\tPerform basic math calculations and handle customer complaints\n\n\nRequirements\n\n\n\tPrevious cashier experience\n\tExcellent communication and customer service skills\n\tAbility to work in a fast-paced environment\n\tBasic math skills and accuracy with handling cash\n\tAvailability to work flexible hours\n\tTeam player with a positive attitude\n\tComfortable working in a lively and sometimes noisy environment.\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Corporate Banking Officer Job at Polaris Bank Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/corporate-banking-officer-job-at-polaris-bank-limited",
    "pubDate": "Wed, 18 Jun 2025 14:15:56 GMT",
    "source": "JobGurus",
    "keyword": "polaris bank limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Polaris Bank was established by the Central Bank of Nigeria (CBN) on September 21, 2018 to offer commercial banking services to the Nigerian public. The bank commenced services on the same day, having purchased the assets and assumed certain liabilities of the defunct Skye Bank.With a footprint of over 350 branches across the country, Polaris Bank prides itself in delivering exceptional customer experience, leveraging best in class/state of the art Information Communication Technology (ICT). By focusing on ICT solutions across multiple service delivery channels (mobile banking, ATMs, POS and online platforms) Polaris Bank maintains a pivotal role in the Nigerian banking industry, providing customers with simple, convenient and secured banking services.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Corporate Banking Officer\n\nJob Location: Lagos\nEmployment Type: Full Time\n\nJob Description\n\n\n\tThe Corporate Banking Officer is responsible for developing and maintaining strong relationships with corporate clients, offering tailored banking solutions, managing credit portfolios, and contributing to the bank's overall profitability.\n\tThe role involves assessing clients’ financial needs, structuring credit facilities, and ensuring compliance with regulatory standards.\n\n\nRequirements\n\n\n\tBachelor’s Degree in Finance, Accounting, Business Administration, Economics, or related field. A Master’s degree or professional certification (e.g., CFA, ACCA) is an advantage.\n\t3–7 years of experience in corporate or commercial banking, credit analysis, or relationship management.\n\tStrong understanding of financial products and corporate banking services.\n\tExcellent financial analysis, credit assessment, and risk management skills.\n\tProficiency in Microsoft Office and financial modeling tools.\n\tStrong interpersonal, communication, and negotiation skills.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Commercial Banking Officer Job at Polaris Bank Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/commercial-banking-officer-job-at-polaris-bank-limited",
    "pubDate": "Wed, 18 Jun 2025 14:15:56 GMT",
    "source": "JobGurus",
    "keyword": "polaris bank limited",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Software Engineering"
    ],
    "content": "Polaris Bank was established by the Central Bank of Nigeria (CBN) on September 21, 2018 to offer commercial banking services to the Nigerian public. The bank commenced services on the same day, having purchased the assets and assumed certain liabilities of the defunct Skye Bank.With a footprint of over 350 branches across the country, Polaris Bank prides itself in delivering exceptional customer experience, leveraging best in class/state of the art Information Communication Technology (ICT). By focusing on ICT solutions across multiple service delivery channels (mobile banking, ATMs, POS and online platforms) Polaris Bank maintains a pivotal role in the Nigerian banking industry, providing customers with simple, convenient and secured banking services.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Commercial Banking Officer\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nResponsibilities\nProducts Development:\n\n\n\tIdentify types of retail & commercial banking and financial service products and services that best serve specific needs and objectives customers.\n\tPropose relevant financial or banking instruments to serve specific customer needs and objectives.\n\tAnalyze the risks and profitability of various retail & commercial banking and financial services of products.\n\tIdentify the impact of market forces on the performance of the Bank’s products and services.\n\n\nMarket Place Knowledge, Strategic and Conceptual Selling:\n\n\n\tPossesses a comprehensive understanding of relationship management strategies and techniques.\n\tDemonstrates skill in building and nurturing client relationships.\n\tConducts regular client meetings and discussions to understand their needs and preferences.\n\tCollaborates with internal teams to deliver exceptional client service and support.\n\n\nCredit Risk Management:\n\n\n\tEvaluate customer financial strength based on reputation of customers, repayment history, adequacy of equity capital, volatility in sources of funds intended to be used by customers for repayment of loan along with interest, value of collateral and dependence level on economic condition of customers.\n\tEvaluate credit rating or scoring by conducting detailed analysis on customer character and matching of facility characteristics to be extended.\n\tDevelop the terms and conditions such as interest rates, payment period and payment options etc. according to customer’s needs and results of risk assessments.\n\n\nCustomer Relationship Management:\n\n\n\tUnderstand the principles and steps in handling customers’ complaints in order to resolve the case independently.\n\tUnderstand the importance of complaints handling and the possible impacts on the bank.\n\tObtain more information about the complaints and resolve customers’ grievances.\n\tTake customers’ complaints as opportunities to identify insufficient service areas and react positively to enhance service delivery.\n\tIdentify the expectations of customers and demonstrate a customer-centric mindset.\n\n\nKey Accounts Management:\n\n\n\tExhibits strong interpersonal and communication skills to build and nurture relationships with key clients.\n\tDemonstrates an understanding of client needs and effectively aligns banking solutions to their business objectives.\n\tBuilds trust, credibility, and rapport with clients through active engagement and attentive listening.\n\tConducts regular client reviews and proactively addresses client concerns and challenges.\n\n\nBanking Operations Policies & Procedures:\n\n\n\tEnsure that operations procedures of different retail banking transactions designed could be able to facilitate the daily operations running smoothly and all procedures are following regulatory requirements.\n\tEnsure that the models for evaluating the effectiveness of operational procedures are designed.\n\tCarry out review and evaluation of operational procedures and make necessary adjustments.\n\n\nBranch Operations and Management:\n\n\n\tExhibits a deep understanding of advanced branch operations functions and their interdependencies.\n\tProvides expert guidance on complex operational matters, such as cash management, vault operations, and security protocols.\n\tImplements process improvement initiatives to streamline branch operations and enhance customer experience.\n\tImplements initiatives to enhance the customer experience and drive customer engagement in the branch.\n\tContributes to the development and implementation of branch management policies and procedures.\n\n\nDigital Banking and Technology:\n\n\n\tKeep track of the digital banking development and financial technology utilization trend in financial service industries; review current practices of the bank and propose enhancement measures accordingly.\n\tRecommend general banking management solutions and digital channels or eCommerce products by utilizing updated development including forefront technology, products and services development trend, etc. in digital banking channel.\n\tManage data mapping function and compile requirements definition for new initiatives.\n\tLiaise with relevant business and operation units to optimize digital banking channels.\n\n\nCommercial Lending and Relationship Management:\n\n\n\tUnderstanding of commercial lending processes, policies, and regulations.\n\tDemonstrates knowledge of credit underwriting, financial analysis, and loan structuring.\n\tConducts thorough analysis of financial statements and prepares credit proposals.\n\tDemonstrates knowledge of customer segmentation, needs assessment, and relationship building strategies.\n\tCollaborates with internal stakeholders to identify cross-selling opportunities and deliver comprehensive banking solutions.\n\n\nKey Performance Indicators\nProducts Development:\n\n\n\tNumber of new retail and commercial banking products successfully developed and launched within a financial year.\n\tThe average time it takes to develop and launch new retail and commercial banking products.\n\tPercentage increase in revenue generated from retail and commercial banking products.\n\tCustomer satisfaction levels are specifically related to newly launched retail and commercial banking products.\n\tThe number or percentage of new customers acquired specifically through the bank's newly launched retail and commercial banking products.\n\n\nMarket Place Knowledge, Strategic and Conceptual Selling:\n\n\n\tThe percentage of qualified leads that result in successful sales within the retail and commercial banking department.\n\tThe average value of deals closed by the retail and commercial banking department.\n\tThe success rate of utilizing conceptual selling techniques in sales engagements.\n\tThe percentage of successful sales opportunities won against competitors within the retail and commercial banking department.\n\tThe growth in sales revenue generated by the retail and commercial banking department over a specific period.\n\n\nCredit Risk Management:\n\n\n\tThe percentage of non-performing loans in the retail and commercial banking portfolio.\n\tThe percentage of loans within the retail and commercial banking portfolio that have achieved the desired credit rating or risk classification.\n\tThe level of credit exposure to specific sectors, industries, or individual borrowers within the retail and commercial banking portfolio.\n\tThe average time taken to process and approve loan applications within the retail and commercial banking department.\n\tThe level of adherence to internal credit policies and external regulatory requirements within the retail and commercial banking department\n\tThe accuracy, timeliness, and comprehensiveness of credit risk reports generated by the retail and commercial banking department.\n\n\nCustomer Relationship:\n\n\n\tThe level of customer satisfaction with the services and interactions provided by the retail and commercial banking department through surveys or feedback mechanisms.\n\tThe average revenue generated from each retail and commercial banking customer.\n\tThe average time taken to resolve customer complaints is within the retail and commercial banking departments.\n\tThe percentage of new customers acquired through customer referrals within the retail and commercial banking department.\n\n\nKey Accounts Management:\n\n\n\tThe growth in revenue generated from key accounts within the retail and commercial banking department.\n\tThe level of customer satisfaction that is specifically related to key accounts within the retail and commercial banking department.\n\tThe percentage of key accounts retained within the retail and commercial banking department.\n\tThe profitability of individual key accounts within the retail and commercial banking department.\n\tThe performance of relationship managers in managing and growing key account relationships within the retail and commercial banking department.\n\tThe effectiveness of key account planning and the execution of strategic initiatives within the retail and commercial banking department.\n\n\nBanking Operations Policies & Procedures:\n\n\n\tLevel of adherence to regulatory guidelines and requirements within the retail and commercial banking department.\n\tThe accuracy of transaction processing within the retail and commercial banking department.\n\tThe department's compliance with SLAs established for various operational processes, such as account opening, loan processing, customer inquiries, and complaint resolution.\n\tThe average time taken to complete key operational processes within the retail and commercial banking department.\n\tThe efficiency of operational processes within the retail and commercial banking department in terms of cost per transaction or cost per unit of output.\n\tThe quality of customer service provided by the retail and commercial banking department.\n\tThe number and impact of continuous improvement initiatives implemented within the retail and commercial banking department.\n\n\nBranch Operations and Management:\n\n\n\tLevel of customer satisfaction with the services provided by the branch.\n\tThe average time taken to complete customer transactions and service requests at the branch.\n\tThe accuracy and security of cash handling processes at the branch.\n\tThe level of adherence to operational policies, procedures, and guidelines at the branch.\n\tthe productivity of branch staff in terms of transactions processed, customer interactions, and service requests handled per staff member.\n\tThe efficiency of branch operations in terms of cost per transaction or cost per unit of output\n\tThe branch's compliance with security protocols, including physical security, data security, and fraud prevention measures.\n\n\nDigital Banking and Technology:\n\n\n\tThe percentage of customers who actively use digital banking services and platforms provided by the bank.\n\tThe number of transactions conducted through online and mobile banking platforms.\n\tThe percentage of new customers onboarded digitally through online account opening processes.\n\tThe percentage of customer inquiries and service requests handled through self-service channels, such as chatbots, interactive voice response (IVR) systems, or knowledge bases Percentage of strategic decisions successfully implemented within the agreed timeline, with a target implementation rate of 90%.\n\tThe uptime and availability of digital banking systems and platforms.\n\n\nCommercial Lending and Relationship Management:\n\n\n\tThe percentage increase in the bank's commercial loan portfolio over a specific period.\n\tThe average time taken to approve commercial loan applications.\n\tThe percentage of non-performing loans or loans with delinquencies within the commercial loan portfolio.\n\tThe number of new client acquisitions, client retention rates, and revenue generated per relationship manager.\n\tThe percentage of existing commercial clients who have availed additional banking products and services, such as treasury management, cash management, or trade finance.\n\tMeasure the department's effectiveness in managing credit risk within the commercial lending portfolio.\n\tMeasure the department's adherence to internal lending policies and external regulatory guidelines governing commercial lending activities.\n\tThe level of portfolio concentration within the commercial loan portfolio.\n\n\nRequirements\n\n\n\tBachelor's Degree in Banking & Finance, Economics, Business Administration or in any related field.\n\tAt least 0 - 8 years of cognate experience.\n\tAdditional academic qualification is an added advantage.\n\tRelevant professional qualification e.g., CIBN, ICAN, ACA, ACCA etc. is an added advantage.\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Sales Executive Job at CIG Motors Company Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/sales-executive-job-at-cig-motors-company-limited",
    "pubDate": "Wed, 18 Jun 2025 14:15:56 GMT",
    "source": "JobGurus",
    "keyword": "cig motors company limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "CIG Motors Company Limited is one of the African subsidiaries of Choice International Group. We are the exclusive premiere representative of leading Chinese automotive giants, including GAC Motors, JMC Motors, Dongfeng Motors, FAW Group, and Wuling Motors, within the Nigeria and Africa market.\n\nWe are recruiting to fill the position below:\n\nJob Position: Sales Executive\n\nJob Location: Victoria Island, Lagos\nJob Type: Full-Time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tCIG Motors is seeking a driven and results-oriented Sales Executive with hands-on experience in automobile sales.\n\tThe role involves selling vehicles to individual, corporate, and government clients (B2C, B2B, B2G), meeting personalized monthly targets, and maintaining strong customer relationships to ensure repeat business and referrals.\n\n\n Key Responsibilities\n\n\n\tSell a range of vehicles to B2C, B2B, and B2G clients.\n\tConsistently achieve monthly individual sales targets.\n\tRepresent the brand at sales events, exhibitions, and meetings.\n\tProvide top-notch after-sales support to drive satisfaction and loyalty.\n\tBuild a sales pipeline and manage the full sales cycle from lead generation to closing.\n\tDevelop and maintain strong relationships with new and existing customers.\n\tPrepare and submit timely activity and sales reports to management.\n\n\nRequirements\n\n\n\tBachelor's Degree in Business, Marketing, or related field is an advantage.\n\tMinimum of 2 years of experience in automobile sales.\n\tProven success in B2C, B2B, or B2G sales.\n\tStrong negotiation and communication skills.\n\tConfidence, resilience, and a passion for sales.\n\tProficiency in Microsoft Office and CRM tools.\n\n\nBenefits\n\n\n\tCompetitive Salary\n\t13th Month Allowance\n\tLeave Allowance\n\tMonthly Performance Bonus\n\tRetirement Savings\n\tMedical Coverage\n\tOpportunity to work in a fast-paced and dynamic environment\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]