[
  {
    "title": "Accountant Job at Excellent Jobs",
    "link": "https://www.jobgurus.com.ng/jobs/view/accountant-job-at-excellent-jobs-4",
    "pubDate": "Tue, 01 Jul 2025 08:49:42 GMT",
    "source": "JobGurus",
    "keyword": "excellent jobs",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Excellent Jobs is a consulting andrecruitment firm, dedicated to hiring and managing great talents for its clients.\n\nWe are recruiting to fill the position below:\n\nJob Position: Accountant\n\nJob Location: Magboro, Ogun\nEmployment Type: Full-time\n\nJob Description\n\n\n\tAs an Account Officer, you will play a crucial role in ensuring the financial health and compliance of our organization.\n\tYou will be responsible for managing financial transactions, maintaining accurate records, and collaborating with other departments to support the overall financial operations.\n\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tMaintain accurate and up-to-date financial records for the organization.\n\tRecord daily financial transactions, including expenses, revenue, and bank deposits.\n\tAssist in the preparation and management of budgets to ensure efficient financial planning and control.\n\tAssist in financial audits by providing relevant documentation and explanations to auditors.\n\tPrepare regular financial reports, including income statements, balance sheets, and cash flow statements, for management and stakeholders.\n\tInvestigate and explain discrepancies between budgeted and actual financial performance.\n\tAnalyze financial data to identify trends, variances, and opportunities for cost savings or revenue generation.\n\tPrepare and file tax returns, ensuring compliance with tax laws and regulations.\n\tHandle payroll activities, including calculating salaries, deductions, and tax withholdings.\n\tMonitor and control expenses to ensure they align with the budget and company policies.\n\tUse historical data and financial trends to forecast future financial performance.\n\tUtilize accounting software and tools to streamline financial processes and maintain data accuracy.\n\tEnsure compliance with accounting standards, laws, and regulations in financial reporting and transactions.\n\tManage cash flow by monitoring accounts receivable and payable and optimizing cash reserves.\n\tProvide financial advice and recommendations to management for decision-making, such as investment opportunities or cost-saving strategies.\n\n\nQualifications / Skills\n\n\n\tBachelor's Degree or its equivalent in Accounting, Finance, or a related field.\n\tProfessional certification such as Certified Public Accountant (CPA) or Chartered Accountant (CA).\n\tProficiency in accounting software (e.g., QuickBooks, SAP, Oracle) and Microsoft Excel.\n\tStrong analytical skills and attention to detail.\n\tKnowledge of relevant accounting principles and regulations.\n\tExcellent communication and interpersonal skills.\n\tAbility to work independently and as part of a team.\n\tEthical behavior and a commitment to maintaining confidentiality.\n\n\nSalary\nN120,000 - N150,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV and Cover Letter to: excellentjobs95@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Civil Engineer Job at Primovet Engineering Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/civil-engineer-job-at-primovet-engineering-limited",
    "pubDate": "Tue, 01 Jul 2025 08:49:42 GMT",
    "source": "JobGurus",
    "keyword": "primovet engineering limited",
    "duplicate": false,
    "classifications": [],
    "content": "Primovet Engineering Limited is a proactive engineering construction company built on a culture of excellence and innovation.\n\nWe are recruiting to fill the position below:\n\nJob Position: Civil Engineer\n\nJob Location: Lekki Phase 1, Lagos\nEmployment Type: Full-time\n\nRequirements\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tBachelor’s Degree in Civil Engineering or Structural Engineering.\n\tMinimum of 2 years of relevant experience in structural design and site supervision\n\tMust know how to do structural drawings.\n\tStrong command of structural design software and AutoCAD/Revit.\n\tSolid knowledge of construction practices, materials, and industry standards.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: royalrecruitment77@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Social Media Officer Job at Alaba Shonibare & Co",
    "link": "https://www.jobgurus.com.ng/jobs/view/social-media-officer-job-at-alaba-shonibare-co",
    "pubDate": "Tue, 01 Jul 2025 08:49:42 GMT",
    "source": "JobGurus",
    "keyword": "alaba shonibare & co",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Alaba Shonibare & Co is a privately held real estate development and management firm based in Lagos, Nigeria. Established in 1990, the company has a rich history rooted in the development of Shonibare Estate, one of Nigeria’s earliest private housing estates, founded by Chief S. O. Shonibare over 60 years ago.\n\nWe are recruiting to fill the position below:\n\nJob Position: Social Media Officer\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Overview\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a creative and results-driven Social Media Manager to lead our real estate brand’s online presence.\n\tThe ideal candidate will be responsible for developing, curating, and managing high-quality content and graphics across all social media platforms to increase brand awareness, drive traffic, and generate leads for our property listings and real estate services.\n\n\nKey Responsibilities\n\n\n\tDevelop and execute a monthly social media content calendar aligned with marketing goals.\n\tManage social media page and content for all new and existing projects of the Firm.\n\tCreate and publish engaging content including property listings, client testimonials, real estate tips, market updates, and behind-the-scenes footage.\n\tCreate graphic designs and videos of high quality for our socials.\n\tManage day-to-day activities across platforms (Instagram, Facebook, TikTok, Twitter, LinkedIn, YouTube, etc.).\n\tSchedule, post, and monitor all content to ensure consistency in branding and messaging.\n\tMonitor, respond to, and engage with audience comments and messages in a timely and professional manner.\n\tGrow followers organically through strategic engagement and community management.\n\tProvide monthly reports and recommendations for content strategy improvement.\n\n\nQualifications & Skills\n\n\n\tBachelor’s degree in Marketing, Communications, or a related field.\n\tProven experience as a Social Media Manager or Digital Marketer, preferably in real estate or property marketing.\n\tStrong understanding of social media platforms, trends, and best practices.\n\tProficient in content creation tools (Canva, Adobe Suite, CapCut, etc.).\n\tExcellent writing, communication, and organizational skills.\n\tKnowledge of SEO and social media algorithms is a plus.\n\tPhotography and video editing skills are an added advantage.\n\n\nSalary\nN120,000 - N150,000 per month. \n\nMethod of Application\nInterested and qualified applicants should send their portfolio and CV to: hr.ashoco@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Call Center Manager Job at Xora Technolgies Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/call-center-manager-job-at-xora-technolgies-limited",
    "pubDate": "Tue, 01 Jul 2025 08:49:42 GMT",
    "source": "JobGurus",
    "keyword": "xora technolgies limited",
    "duplicate": false,
    "classifications": [],
    "content": "Xora Technolgies limited is one of the leading indigenous information communications technology company involved in proffering effective solutions. We offer full and advanced solutions in ICT for homes, offices and government establishments. Our products and services offer flexible, scalable, upgradeable,expandable and efficient solutions for voice, video,data and internet communications spanning the small, medium or wide areas of needs within the country.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nToday, Xora Technolgies limited boasts of it's regional offices in port Harcourt Abuja and Lagos.We are renowned for our professionalism in providing solutions to satisfy customers both locally and overseas.The company strives for more challenges on growing and expanding technologies systems to match markets requirements.\n\nWe are recruiting to fill the position below:\n\nJob Position: Call Center Manager\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\n\nJob Description\n\n\n\tWe are looking for a skilled Call center manager to supervise daily operations and personnel aiming for maximum efficiency and cost-effectiveness.\n\n\nResponsibilities\n\n\n\tDevelop objectives for the call center’s day-to-day activities\n\tConduct effective resource planning to maximize the productivity of resources (people, technology etc.)\n\tHire, coach and provide training to personnel to maintain high customer service standards\n\tMonitor and improve ordering, telephone handling and other procedures\n\tCollect and analyze call-center statistics (sales rates, costs, customer service metrics etc.)\n\tAssume responsibility of budgeting and tracking expenses\n\tEvaluate performance with key metrics (accuracy, call-waiting time etc.)\n\tPrepare reports for different departments or upper management\n\n\nRequirements\n\n\n\tInterested candidates should possess an OND / HND qualification. \n\tEffective customer service skills\n\tKnowledge of performance evaluation and customer service metrics\n\tSolid understanding of reporting and budgeting procedures\n\tExperience in basic financial analysis (cost-effectiveness, cost-benefit etc.)\n\tOutstanding communication and interpersonal skills\n\tExcellent organizational and leadership skills with a problem-solving ability\n\tPositive and patient.\n\n\nSalary\nN100,000 - N150,000 per month. \n\nMethod of Application\nInterested and qualified candidates should send their CV to: Xoratechnologieshr@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]