[
  {
    "title": "Job Openings at Yemsays Properties and Investment Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-yemsays-properties-and-investment-limited-1",
    "pubDate": "Wed, 27 Aug 2025 10:15:36 GMT",
    "source": "JobGurus",
    "keyword": "yemsays properties and investment limited",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance"
    ],
    "content": "Yemsays Properties and Investment Limited is a leading real estate firm based in Lagos, Nigeria, specializing in property development, investment, and marketing. We are committed to providing top-notch services that connect clients with the best real estate opportunities, ensuring transparency, innovation, and excellence in all our dealings.\n\nAt Yemsays, we pride ourselves on our dynamic team, which works tirelessly to deliver exceptional results. We foster a collaborative and professional work environment where every team member’s input is valued and growth is encouraged.\n     \n\n            \n    \n\n\n\nOur services include property sales, real estate investment consultancy, and development projects tailored to meet diverse client needs. As we continue to expand, we are dedicated to empowering our workforce and building a team that shares our vision of transforming lives through real estate.\n\nWe are recruiting to fill the following positions below:\n\n1.) Videographer\n\nJob Location: Lekki, Lagos\nEmployment Type: Full-time\n\nDescription\n\n\n\tWe are seeking a talented and detail-oriented Videographer to capture, edit, and produce high-quality video content that aligns with our brand and marketing objectives.\n\tThe ideal candidate will have strong technical expertise, creativity, and the ability to tell compelling visual stories across multiple platforms.\n\n\nKey Responsibilities\n\n\n\tPlan, shoot, and edit video content for marketing campaigns, social media, events, and corporate communications.\n\tCollaborate with the content and creative teams to develop concepts, scripts, and storyboards.\n\tOperate and maintain video equipment, cameras, lighting, and audio gear.\n\tEnsure all video content is edited and delivered in line with project deadlines and brand guidelines.\n\tCapture behind-the-scenes, interviews, and promotional footage as required.\n\tStay up to date with video trends, editing software, and storytelling techniques.\n\tManage video files, archives, and backups for easy retrieval.\n\tWork with graphic designers, photographers, and other creatives to ensure cohesive production.\n\n\nQualifications & Requirements\n\n\n\tBachelor’s Degree / HND in Film Production, Media Arts, Communications, or a related field (preferred but not mandatory with strong portfolio).\n\tProven experience as a videographer or video editor.\n\tProficiency in video editing software (Adobe Premiere Pro, Final Cut Pro, After Effects, or DaVinci Resolve).\n\tStrong knowledge of camera operations, lighting setups, and sound recording.\n\tA portfolio showcasing creative and technical video work.\n\tAbility to work under tight deadlines and manage multiple projects.\n\n\nKey Skills & Competencies:\n\n\n\tCreativity & Storytelling.\n\tTechnical Expertise in Videography.\n\tAttention to Detail.\n\tTeamwork & Collaboration.\n\tTime Management & Organization.\n\tAdaptability & Problem-Solving.\n\n\nSalary\nN70,000 - N120,000 / Month.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: emmanueltami7@gmail.com using the Job Position as the subject of the email.\n\n \n\n \n\n2.) Front Desk Representative\n\nJob Location: Lekki, Lagos\nEmployment Type: Full-time\n\nSummary\n\n\n\tWe are looking for a personable and organized Front Desk Representative to be the first point of contact for our company.\n\tThe ideal candidate will handle reception duties, manage incoming calls, assist visitors, and provide administrative support to ensure smooth day-to-day operations.\n\n\nKey Responsibilities\n\n\n\tWelcome and attend to clients, visitors, and guests in a professional manner.\n\tManage the reception area and ensure it is tidy, professional, and presentable.\n\tAnswer, screen, and forward phone calls; respond to inquiries via email and in person.\n\tMaintain visitor records and issue visitor passes where necessary.\n\tHandle incoming and outgoing correspondence (letters, packages, deliveries).\n\tProvide administrative support such as filing, photocopying, scheduling, and maintaining office supplies.\n\tCoordinate with other departments to ensure smooth communication and support.\n\tUphold confidentiality and handle sensitive information with discretion.\n\n\nQualifications & Requirements\n\n\n\tOND / HND / Bachelor’s Degree in Business Administration, Office Management, or related field.\n\t1 - 2 years of proven experience as a front desk representative, receptionist, or similar role is an advantage.\n\tProficiency in MS Office Suite (Word, Excel, Outlook) and basic office equipment.\n\tStrong verbal and written communication skills.\n\tExcellent organizational and multitasking abilities.\n\tProfessional appearance and customer service-oriented mindset.\n\n\nKey Skills & Competencies:\n\n\n\tCommunication & Interpersonal Skills\n\tCustomer Service Orientation\n\tTime Management & Organization\n\tAttention to Detail\n\tProblem-Solving\n\tProfessionalism & Confidentiality.\n\n\nSalary\nN70,000 - N80,000 monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: emmanueltami7@gmail.com using the Job Position as the subject of the mail.\n\n \n\n \n\n3.) Graphic Designer\n\nJob Location: Lekki, Lagos\nEmployment Type: Full-time\n\nSummary\n\n\n\tWe are seeking a highly creative and detail-oriented Graphic Designer to produce engaging and on-brand designs for a variety of media.\n\tThe ideal candidate will be responsible for bringing ideas to life through visual concepts that inspire, inform, and captivate our audience while maintaining brand consistency across all projects.\n\n\nKey Responsibilities\n\n\n\tDesign and produce a wide variety of marketing materials, including social media graphics, flyers, banners, brochures, and presentations.\n\tCollaborate with the marketing/content team to develop creative concepts for campaigns.\n\tEnsure all designs align with brand guidelines and enhance brand identity.\n\tEdit and manipulate images, graphics, and video content as required.\n\tPrepare design drafts, present ideas, and incorporate feedback.\n\tStay updated on design trends, tools, and technologies to bring fresh ideas to projects.\n\tWork with external printers, vendors, or agencies when needed to ensure quality and timely delivery of materials.\n\n\nQualifications & Requirements\n\n\n\tBachelor’s Degree or HND in Graphic Design, Fine Arts, Visual Communication, or related field.\n\t1 - 3 years of proven work experience as a Graphic Designer or similar role.\n\tProficiency in design software such as Adobe Creative Suite (Photoshop, Illustrator, InDesign, After Effects), CorelDRAW, or Canva.\n\tStrong portfolio showcasing design skills across various media.\n\tKnowledge of typography, color theory, and layout principles.\n\tExcellent communication, creativity, and attention to detail.\n\tAbility to work under tight deadlines and manage multiple projects.\n\n\nKey Skills & Competencies:\n\n\n\tCreativity & Innovation\n\tTime Management & Organization\n\tAttention to Detail\n\tTeam Collaboration\n\tProblem-Solving\n\tAdaptability.\n\n\nSalary\nN70,000 - N120,000 monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: emmanueltami7@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Openings at PC Place Nigeria",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-pc-place-nigeria",
    "pubDate": "Wed, 27 Aug 2025 10:15:36 GMT",
    "source": "JobGurus",
    "keyword": "pc place nigeria",
    "duplicate": false,
    "classifications": [
      "Software Engineering",
      "Finance",
      "Marketing"
    ],
    "content": "PC Place Nigeria is a leading ICT retail and B2B solutions provider dedicated to delivering top-quality technology products and services across Nigeria. Established with a vision to bridge the gap between people and technology, we specialize in the supply of laptops, desktops, printers, accessories, networking equipment, and enterprise IT solutions to individuals, corporate clients, and institutions nationwide.\n\nWith a strong presence in Lagos and a growing footprint across the country, PC Place Nigeria has become a trusted name known for authentic products, competitive pricing, and excellent after-sales support.\n\nWe are recruiting to fill the position below:\n\n1.) Procurement Officer\n     \n\n            \n    \n\n\n\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tPC Place Nigeria is seeking a detail-oriented and proactive Procurement Officer to join our growing team.\n\tThe ideal candidate will be responsible for sourcing, negotiating, and procuring ICT equipment and services to meet our customer and internal demands, ensuring best value and timely delivery.\n\tYou will work closely with sales, logistics, and vendor teams to streamline our supply chain process.\n\n\nKey Responsibilities\n\n\n\tSource suppliers/vendors for laptops, tech products, and ICT-related equipment.\n\tNegotiate pricing, credit terms, and delivery schedules.\n\tProcess purchase requisitions and maintain accurate records of procurement activities.\n\tEvaluate vendor performance and ensure compliance with quality standards.\n\tMonitor stock levels and coordinate with the inventory team.\n\tPrepare and issue Purchase Orders (POs) and ensure timely deliveries.\n\tMaintain strong relationships with OEMs, wholesalers, and distributors.\n\tKeep up with market trends and product pricing.\n\tAssist in maintaining procurement documentation and contracts.\n\tWork with the finance team on payment follow-ups and supplier account reconciliation.\n\tEnsure compliance with company procurement policies and procedures.\n\n\nRequirements\n\n\n\tInterested candidates should possess a Bachelor's Degree with 2 - 6 years of work experience\n\tStrong negotiation and analytical skills.\n\tSolid knowledge of ICT hardware, laptops, accessories, and consumer electronics.\n\tFamiliarity with vendor management and product sourcing.\n\tExcellent communication and organizational abilities.\n\tGood knowledge of Microsoft Excel, Word, and basic procurement software.\n\tAbility to work under pressure and meet deadlines.\n\n\nSalary\nN150,000 - N200,000 per month.\n\nMethod of Application\nInterested and qualified candidates should send their CV and  a brief Cover Letter to: pcplacenigeria@gmail.com using the Job Position as the subject of the email.\n\n \n\n\n2.) Business Development Executive\n\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\n\nJob Overview\n\n\n\tWe are seeking a motivated and results-driven Business Development Executive to join our dynamic team. In this role, you will be responsible for identifying new business opportunities, building relationships with potential clients, and driving sales growth.\n\tThe ideal candidate will possess strong communication skills and a keen understanding of market trends, enabling them to effectively promote our services and solutions.\n\n\nKey Responsibilities\n\n\n\tStrategic Planning: Developing and implementing business development strategies to achieve sales targets and expand market reach.\n\tMarket Research: Analyzing market trends, competitor activities, and customer needs to identify potential opportunities.\n\tSales and Business Development: Generating leads, presenting products and services, negotiating contracts, and closing deals.\n\tClient Relationship Management: Building and maintaining strong relationships with existing and potential clients, understanding their needs, and providing solutions.\n\tCollaboration: Working with marketing, product development, and other teams to support business growth and ensure client satisfaction.\n\tReporting and Analysis: Preparing sales reports, forecasts, and providing insights to improve business development strategies.\n\n\nQualifications\n\n\n\tB.Sc or HND in Business Administration or a related field is desirable.\n\tProven experience in business development or sales, preferably within a related industry.\n\tDemonstrated ability to work independently as well as part of a team in a fast-paced environment.\n\tICT knowledge is an added advantage.\n\n\nSkills:\n\n\n\tSales and Negotiation: Proven ability to sell, negotiate contracts, and close deals.\n\tCommunication: Excellent verbal and written communication skills to effectively present and articulate product value.\n\tMarket Knowledge: Understanding of ICT industry trends, technologies, and competitive landscape.\n\tStrategic Thinking: Ability to develop and implement effective business development strategies.\n\tRelationship Management: Strong interpersonal skills to build and maintain client relationships.\n\tAnalytical Skills: Ability to analyze data, identify trends, and make data-driven decisions.\n\tProject Management: Ability to manage multiple projects and ensure timely delivery.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and a Cover Letter to: pcplacenigeria@gmail.com using \"Business Development Executive\" as the subject of the mail.\n\n \n\n \n\n3.) Programmer\n\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\n\nJob Description\n\n\n\tPC Place Nigeria is seeking a talented and proactive Programmer to join our team.\n\tThis role is crucial in maintaining and optimizing our e-commerce platform while developing innovative systems and programs that can scale up our business operations.\n\tIf you’re passionate about technology, problem-solving, and building solutions that drive growth, this position is for you.\n\n\nKey Responsibilities\n\n\n\tManage, maintain, and enhance the company’s e-commerce website to ensure smooth functionality and excellent user experience.\n\tDevelop, test, and deploy custom applications, software tools, and automation systems to support business processes.\n\tCollaborate with internal teams to identify pain points and design scalable solutions.\n\tImplement performance optimization strategies for web applications and back-end systems.\n\tIntegrate third-party tools, APIs, and payment gateways into the website.\n\tEnsure website security, perform regular backups, and monitor for vulnerabilities.\n\tMaintain technical documentation and provide support to staff when needed.\n\n\nQualifications\n\n\n\tBachelor’s degree in Computer Science, Software Engineering, or a related field.\n\tProven experience managing and developing e-commerce websites (experience with platforms like Shopify, WooCommerce, Magento, or custom PHP solutions is an advantage).\n\tStrong proficiency in programming languages such as PHP, JavaScript, Python, or similar.\n\tKnowledge of web development technologies (HTML, CSS, React/Vue).\n\tExperience with database management systems (MySQL, PostgreSQL).\n\tFamiliarity with SEO best practices and site optimization.\n\tStrong analytical and problem-solving skills.\n\tAbility to work independently and handle multiple projects.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and a cover letter, to: pcplacenigeria@gmail.com using \"Application for Programmer Position\" as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]