[
  {
    "title": "Sales Executive Job at Recruit with Adenike",
    "link": "https://www.jobgurus.com.ng/jobs/view/sales-executive-job-at-recruit-with-adenike",
    "pubDate": "Mon, 30 Jun 2025 13:51:38 GMT",
    "source": "JobGurus",
    "keyword": "recruit with adenike",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance"
    ],
    "content": "Recruit with Adenike is a recruitment and talent solutions brand committed to connecting high-performing professionals with forward-thinking organizations across diverse industries. From entry-level roles to executive placements, we help businesses attract, engage, and retain the right talent to fuel growth and success. Our approach is efficient, personalized, and rooted in a deep understanding of people and business needs.\n\nWe are recruiting to fill the position below:\n\nJob Position: Sales Executive\nJob Location: Lagos Island, Lagos\nEmployment Type: Full-time\n\nRole Overview\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Sales Executive will be responsible for driving user adoption of our digital financial products—including E-wallets, cards, and other payment solutions—and for acquiring new customers in the designated region.\n\tThis role requires developing and executing strategies to increase transaction volume and product utilization, while building strong client relationships to ensure sustained growth.\n\n\nKey Responsibilities\n\n\n\tDevelop a deep understanding of the company’s products and confidently communicate their advantages to customers.\n\tResearch and identify new business opportunities, including new markets, growth areas, trends, customers, partnerships, and channels.\n\tConduct face-to-face meetings with customers and clients.\n\tBuild and maintain strong relationships with both new and existing customers.\n\tSet goals and develop detailed plans for business and revenue growth.\n\tWork strategically, including planning and executing initiatives for strong market penetration.\n\tDiscuss and implement promotional strategies and activities; provide feedback on daily experiences and challenges, and suggest solutions.\n\tBe familiar with the assigned region of operation to effectively drive sales and adoption.\n\tManage the sales process from initial contact to final closure.\n\n\nJob Requirements\n\n\n\tEducation: NCE, ND, HND, or B.Sc. in Business Administration, Marketing, or related fields.\n\tExperience:\n\tMinimum 1–2 years of experience as a Business Development Executive, ideally in Merchant Acquiring, banking sales, or direct sales in a commercial bank.\n\tEntry-level candidates with strong sales drive will also be considered.\n\tProven track record in sales or business development, especially driving adoption of financial products.\n\tStrong communication and presentation skills.\n\tExcellent marketing, engagement, and negotiation skills.\n\tKnowledge of or familiarity with the Lagos Island market is an added advantage\n\n\nCompensation Package\n\n\n\tSalary: N70,000 (Gross Monthly)\n\tCommission: Up to N135,000 (Gross Monthly)\n\tTransport Allowance\n\tHealth Maintenance Organization (HMO)\n\tPension Plan\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: recruitmentforce.africa@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Managing Director Job at Highland Integrated Electricity Services Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/managing-director-job-at-highland-integrated-electricity-services-limited",
    "pubDate": "Mon, 30 Jun 2025 13:51:38 GMT",
    "source": "JobGurus",
    "keyword": "highland integrated electricity services limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "(adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\nHighland Integrated Electricity Services Limited (HIESL) is an Investment Holding Company with significant interest in the Electricity Distribution business in Nigeria. The Company is the core investor/majority shareholder in Jos Electricity Distribution (JED Plc). As part of its strategic objectives, the Company is positioned to make investments in the Power Sector and provide Consultancy Services for Power-Related Transactions. Highland Integrated Electricity Services (HIESL) is a privately-owned company with a Board of Directors that ensures proper oversight over key investments especially JED Plc to deliver stakeholder value. Accordingly, it continuously reviews the performance of JED Plc and other investments and formulates strategic plans to be implemented by JED Plc Board and Management. The Board is supported by the Executive Management Team that oversees the day-to-day running and implementation of the board decisions in line with the organization's core values, vision, and mission.\n\nWe are recruiting to fill the position below:\n\nJob Position: Managing Director\n\nJob Location: Wuse 2, Abuja (FCT)\nEmployment Type: Full-time\n\nJob Description\n\n\n\tThe MD/CE will lead the development and implementation of relevant structures (processes, People, and systems) to support the achievement of the Discos' vision, goals, and strategic objectives.\n\tThe MD shall be responsible for the overall success of the Company, measured by the achievement of the financial goals, Innovation, customer connection, and efficiency, among others.\n\tThe candidate is also expected to collaborate with relevant stakeholders in meeting the Discos' regulatory obligations.\n\n\nRequirements\nThe suitable candidate is required to possess the following qualifications:\n\n\n\tFirst Degree equivalent.\n\tMinimum of 15 years of work experience with at least 4 years in a similar role \n\tProfessional Qualification will be an added advantage.\n\tKnowledge of business principles, operations, and transformation experience.\n\tKnowledge of utility sector operations and the Nigerian Electricity Supply Industry is a key requirement.\n\n\nMethod of Application\nInterested and qualified candidates should submit their CV and Cover Letter only to: info@highland.com.ng using \"Managing Director\" as the subject of the email.\n\nA hard copy of the application should be submitted to: \nThe Managing Director,\nHighland Integrated Electricity Services Limited,\n24, Thaba Taoka Bluetoothing,\nWuse 2,\nAbuja (FCT).\n\nNote\n\n\n\tOnly applications sent directly to the above email address and that follow the above instructions will be considered.\n\tOnly suitable qualified candidates will be    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Procurement Officer Job at Max Drive",
    "link": "https://www.jobgurus.com.ng/jobs/view/procurement-officer-job-at-max-drive-1",
    "pubDate": "Mon, 30 Jun 2025 13:51:38 GMT",
    "source": "JobGurus",
    "keyword": "max drive",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Max Drive - We are a team of passionate people and a leading technology-enabled company driven by a vision to solve the mobility challenges in Africa. We want to get people and goods to their destinations hitch-free. It is personal for us because we understand the frustration of epileptic transportation. We are making mobility safe, affordable, accessible, and sustainable through the deployment of high-performance technologies and operators.\n\nWe are recruiting to fill the position below:\n\nJob Position: Procurement Officer\n\nJob Location: Lagos\nEmploymwnt Type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are looking to hire a detail-oriented, thorough, and organized Procurement Officer who will be responsible for evaluating suppliers, products, and services, negotiating contracts, and ensuring that approved purchases are cost-efficient and of high quality.\n\n\nWhat You’ll Do\n\n\n\tCreate RFQs and POs on the ERP platform (Odoo).\n\tCommunicate Purchase Order with vendors to determine terms and availability of goods/services.\n\tTrack pending orders assigned to vendors.\n\tTrack vendor payment with the Account unit.\n\tCarryout supplier’s core competence assessment and evaluate performance.\n\tTrack delivery of imported orders with the clearing agent.\n\tGenerate and analyze spend reports as may be required.\n\tCarry out other Procurement/Supply Chain functions that may be assigned.\n\tPrepare reports on purchases, including cost analyses\n\tSource for better and alternative cost to what is currently being gotten from existing vendors.\n\tNegotiate vendor's quote.\n\tVendor management.\n\tMonitor stock levels and place orders as needed\n\tMake professional decisions in a fast-paced environment.\n\n\nWhat You’ll Need\n\n\n\tBachelor’s degree\n\tMinimum of 2+ years of working experience\n\tExperience in the Procurement/Supply Chain space.\n\tExperience in Importation will be an added advantage.\n\tHands-on experience with purchasing software (e.g.Odoo)\n\tUnderstanding of supply chain procedures\n\tSolid analytical skills, with the ability to create financial reports and conduct cost analyses\n\tNegotiation skills\n\tStrong communication and negotiation skills.\n\tGood analytical and strategic thinking skills.\n\n\nBenefits\n\n\n\tCompetitive Pay\n\tOpportunity for Learning and Development\n\tHybrid work structure\n\tInsurance.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Digital Marketing Strategist Job at JAAD Hospital Needs Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/digital-marketing-strategist-job-at-jaad-hospital-needs-limited",
    "pubDate": "Mon, 30 Jun 2025 13:51:38 GMT",
    "source": "JobGurus",
    "keyword": "jaad hospital needs limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "JAAD Hospital Needs Limited is the sole representative of 365Healthcare UK LTD in West Africa; manufacturers of industry-leading hospital consumables. We are dedicated to providing the highest level of service and value through 365healthcare range of medical and surgical products.\n\nWe are recruiting to fill the position below:\n\nJob Position: Digital Marketing Strategist\n\nJob Location: Ikeja, Lagos (Hybrid work environment)\nEmployment Type: Part-time (2/3days)\n\nWho we need\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are looking to add a talented Digital Marketing Strategist with a “can do” attitude to join our dynamic, growing, and passionate team.\n\tThis is a full-time role.\n\n\nThe responsibilities will include\n\n\n\tManage business or corporate paid campaigns across a variety of platforms\n\tDefine relevant social media KPIs, measure, and analyze ongoing progress for future optimizations.\n\tOversee social media content development, including ideation, creation, social copywriting, content calendar management, and publishing of social-first content.\n\tCreate and manage social media ads to maximize impact and minimize costs.\n\tWork with multi-media designers to ensure content is informative, engaging, and entertaining.\n\tStrong understanding of social paid media to ensure content is timely, engaging, and targeted to the relevant audience.\n\tStay up to date with the latest social media best practices, partners, trends, tools, and technology\n\tHelp teams implement changes effectively\n\tOversee multiple client projects, ensuring timely delivery, budget adherence, and high client satisfaction.\n\tHelp build a productive environment where team members ‘own’ the product and enjoy working on it\n\tHelping the product owner and development team to achieve customer satisfaction\n\tPerform other tasks as assigned.\n\n\nWhat you bring\nWe are looking for a Digital Marketing Strategist with the following experience and skills:\n\n\n\tBachelor’s Degree in Marketing, Communications, or related fields\n\t3 years of experience in Marketing, Social Media Marketing and Social Media Content Creation\n\tExpertise in media platforms (i.e. Facebook, Instagram, TikTok, YouTube) and website development tools.\n\tProficient in writing, content creation and editing for digital marketing platforms and printed materials.\n\tProven ability to develop and execute social media strategies in fast-paced environments.\n\tActively provide support by executing various marketing campaigns across digital channels, including digital flyers and promotional activities, ensuring timely and accurate deployment.\n\tPassion for digital marketing, event planning, and community engagement.\n\tEffective Communication skills\n\tStrong organizational and time management abilities\n\tExperience with social media analytics tools\n\tPassion for healthcare and knowledge of the healthcare industry is a plus.\n\n\nMethod of Application\nInterested and qualified candidates should send their resume along with a portfolio, in any format that best showcases your skills and expertise to: info@jaad365healthcare.com using “Digital Marketing Strategist” as the subject of the email.\n\nWhat happens next:\n\n\n\tOnce we receive your application (resume and portfolio), our hiring team will review it and invite shortlisted candidates for an interview.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Warehouse Officer Job at Distritec Distribution",
    "link": "https://www.jobgurus.com.ng/jobs/view/warehouse-officer-job-at-distritec-distribution-1",
    "pubDate": "Mon, 30 Jun 2025 13:51:38 GMT",
    "source": "JobGurus",
    "keyword": "distritec distribution",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Distritec Distribution has been in System Integration & Business Continuity since 1994. What Distritech envisages: The right mix of Products, services, People, infrastructure, and technical expertise Today,\n\nWe have invested Millions of Naira in establishing core service and delivery infrastructure and developing a specialized Technology Consulting Team across Pan Nigeria for better services and reachability to our valued customers.\n\nWe are recruiting to fill the position below:\n\nJob Position: Warehouse Officer\n\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAssist with monthly stock count with the internal auditor and external auditor.\n\tMovement of products within the warehouse.\n\tStacking and scanning of products.\n\tEnsure requested/received products internally/externally have accurate quantity, and quality are in good condition.\n\tEscalate dent or damaged products in the warehouse for inventory review.\n\tProduct Sorting and cross-docking.\n\tOut bounding for Sales.\n\tCompliance with warehouse SOP\n\tEnsure proper handling of products to record zero damages.\n\tPre-receiving activities such as arranging and rearranging the warehouse.\n\tAlpha facility management.\n\tAdherence to all HSC protocols.\n\tSend activity reports daily.\n\n\nRequirements\n\n\n\tAbility to Commute\n\tLagos (Required) - Ability to Relocate or Relocate before starting work.\n\n\nSalary\nN100,000 monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: retentionrecruitment01@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]