[
  {
    "title": "Account Executive Expert Job at SAP Nigeria",
    "link": "https://www.jobgurus.com.ng/jobs/view/account-executive-expert-job-at-sap-nigeria",
    "pubDate": "Mon, 02 Jun 2025 21:15:27 GMT",
    "source": "JobGurus",
    "keyword": "sap nigeria",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "At SAP, we enable you to bring out your best. Our company culture is focused on collaboration and a shared passion to help the world run better. How? We focus every day on building the foundation for tomorrow and creating a workplace that embraces differences, values flexibility, and is aligned to our purpose-driven and future-focused work. We offer a highly collaborative, caring team environment with a strong focus on learning and development, recognition for your individual contributions, and a variety of benefit options for you to choose from.\n\nWe are recruiting to fill the position below:\n\nJob Postion: Account Executive Expert\nJob Location: Lagos\nJob type: Full time\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nRole Description\n\n\n\tThe Account Executive Expert leads and orchestrates in a team selling environment and, where necessary, works with senior management on assigned or local accounts in a geographic territory.\n\tThe AE helps identify and qualify opportunities; execute account strategy; and generate product, service, and training revenue.\n\tThe AE facilitates and maintains successful relationships with SAP® customers – relationships that are measured by their ability to be referenced and customer satisfaction levels.\n\n\nExpectations And Tasks\nRelationship management:\n\n\n\tBuild strong customer relationships by consistently setting realistic expectations early in each sales campaign and meeting or exceeding those expectations through successful execution of the customer engagement model (CEM) at SAP®.\n\tFacilitate customer satisfaction through proper deployment of appropriate SAP resources to execute the CEM successfully.\n\tParticipate in account transitions to ensure proper and consistent communication with customers and virtual account team members.\n\tAttend and participate in customer team meetings and communicate regularly with consulting staff to ensure customer satisfaction.\n\tMaintain successful business relationships with SAP’s strategic partners.\n\n\nOpportunity management:\n\n\n\tIdentify, pursue, and close sales opportunities through successful execution of the CEM.\n\tPosition SAP to win sales opportunities by executing and communicating effective sales strategies.\n\tDiscuss and communicate account strategy routinely with other members of the virtual account team.\n\tMaintain an accurate and documented customer relationship management (CRM) pipeline of opportunities (prospects and suspects) and provide appropriate communication of such to SAP management.\n\tGather knowledge on competitors and how to position SAP solutions effectively against them.\n\tLeverage and communicate solution maps to broaden the SAP footprint.\n\n\nTerritory management:\n\n\n\tManage the details of all assigned accounts.\n\tMaintain an up-to-date recorded inventory of all your named accounts, including opportunities, contacts, and history.\n\tStrive to grow each new sale into a strong account reference for SAP.\n\tSeek to expand and strengthen SAP’s presence within each account in the territory by establishing proactive relationships with influential people – within the customer and among third parties.\n\tSupport (through direct and active participation) all SAP promotions and events in the territory, including (but not limited to) SAPPHIRE®, industry solution days, executive events, and industry initiatives.\n\tDevelop an extensive knowledge base of all assigned accounts, including their business profile, key players, application and technology footprint, buying process, compelling events, political environment, and strategies.\n\n\nAdministrative management:\n\n\n\tProvide accurate and timely updates to the CRM forecast pipeline system on an ongoing basis.\n\tComply with all SAP personnel, sales, proposal, and contract policies.\n\tComply in a timely manner with all time sheet, travel, and expense policies.\n\tMaintain appropriate levels of involvement in customer issues requiring resolution, including invoices for license fees, maintenance, consulting, and training.\n\n\nPersonal development:\n\n\n\tDevelop an individual business plan that includes business and personal goals and objectives; discuss, confirm, and review the plan on an ongoing basis with your manager.\n\tContinue to build and grow your personal knowledge of industry trends, company product offerings, and general business awareness.\n\tReview, establish, and implement a personal training plan to facilitate your ongoing growth and professional development at SAP.\n\tProactively seek to contribute to SAP’s growth objectives by providing mentoring to new AEs.\n\n\nRequirements\nWork Experence:\n\n\n\tMinimum 5 years of specific experience in Account Managemente\n\n\nEducation And Qualification / Skills And Competencies:\n\n\n\tBachelor’s degree in engineering or technology from an accredited institutions. \n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "PR / Media Director Job at Choice Talents NG",
    "link": "https://www.jobgurus.com.ng/jobs/view/pr-media-director-job-at-choice-talents-ng-1",
    "pubDate": "Mon, 02 Jun 2025 21:15:27 GMT",
    "source": "JobGurus",
    "keyword": "choice talents ng",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Choice Talents NG is Nigeria’s preferred talents management company. Our goal is to help build successful businesses through effective talent, resource and process management.\n\nWe are recruiting to fill the position below:\n\nJob Position: PR / Media Director\n\nJob Location: Abuja (FCT)\nEmployment Type: Full-time\n\nAbout the Job\n\n\n\tWe are looking for a very senior editor well-experienced with print, radio and TV media, to manage the public relations responsibilities of an international NGO.\n\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDevelop and maintain strong relationships with key media outlets, journalists, and influencers to secure positive press coverage.\n\tDraft and distribute press releases, media advisories, and pitch materials.\n\tRespond to media inquiries and coordinate media interviews with company spokespeople.\n\tWork with senior leadership to develop and execute PR strategies that align with the company’s goals and objectives.\n\tEstablish and maintain a clear and consistent voice for the brand across all communication channels.\n\tProvide strategic counsel to executives on media interactions and public appearances.\n\tOversee the creation of compelling, media-friendly content, ensuring alignment with objectives.\n\tPlan and coordinate press events, conferences, and other public relations activities.\n\tRepresent the organization at industry events, media interviews, and public speaking engagements.\n\tDevelop and implement crisis communication plans and manage communication during sensitive or critical situations.\n\tAct as the company’s spokesperson during a crisis, providing clear, timely, and accurate information to the media.\n\tWrite press releases, articles, speeches, blog posts, op-eds, articles, and other communication materials as needed.\n\tTrack media coverage and report on the effectiveness of PR campaigns and media outreach.\n\tAnalyze trends in media coverage and public opinion to adapt strategies and improve outcomes.\n\tLead and mentor junior PR team members, providing guidance and support in their professional development.\n\tCollaborate with marketing, social media, and other internal teams to ensure cohesive and effective communication strategies.\n\n\nRequirements\n\n\n\tBachelor’s Degree in Public Relations, Communications, Journalism, or a related field (Master’s degree preferred).\n\t15+ years of experience in public relations, with a focus on media relations and corporate communications.\n\tProven track record of developing and executing successful PR campaigns and securing positive media coverage.\n\tExceptional written and verbal communication skills, with the ability to craft compelling narratives.\n\tStrong media relationships with local, national, and trade press.\n\tExperience in crisis communication and handling sensitive issues.\n\n\nMethod of Application\nInterested and qualified candidates should send their Application to: jobs@choicetalents.com.ng using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Human Resource Officer Job at Greengrass Investment Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/human-resource-officer-job-at-greengrass-investment-limited-1",
    "pubDate": "Mon, 02 Jun 2025 21:15:27 GMT",
    "source": "JobGurus",
    "keyword": "greengrass investment limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Greengrass Investment Limited (GGI) is an emerging player in the Nigerian Extractive Industry with over 3 years of business excellence and mining operations, head-quartered in Keffi, Nasarawa State, Nigeria. GGI strives to make significant contributions to Nigeria's social-economic and industrial development while also focusing on nurturing and developing the local community.\n\nWe are recruiting to fill the position below:\n\nJob Position: Human Resource Officer\n\nJob Location: Warra, Ngaski LGA - Kebbi\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a dedicated Human Resource Officer to join our dynamic mining operations team in Kebbi state, North-West Nigeria. \n\tIn this role, you will work along other HR professionals, Outsourcing firms and Consultants to manage key HR functions on-site and ensure the seamless delivery of HR services that support our fast-paced project environment. \n\tThis position requires immediate resumption, so we encourage only qualified and interested candidates to apply.\n\n\nKey Responsibilities\n\n\n\t\n\tTalent Sourcing & Recruitment:\n\n\t\n\t\tConduct headhunting and talent sourcing for key roles.\n\t\tOversee the recruitment and selection process, ensuring compliance with Nigerian Labour Laws and employment contracts.\n\t\tManage the entire employment life-cycle (Recruitment-Offboarding).\n\t\n\t\n\t\n\tEmployee Relations, On-boarding & Off-boarding:\n\n\t\n\t\tManage employee relations to foster a positive work environment.\n\t\tCoordinate effective onboarding processes to integrate new hires smoothly.\n\t\tInterface with department heads to resolve any issues that may arise.\n\t\tManage termination processes effectively and efficiently to ensure all parties are mutually satisfied with the process.\n\t\n\t\n\t\n\tIndustrial Relations:\n\n\t\n\t\tServe as a liaison for industrial relations, ensuring adherence to legal standards and harmonious workplace practices.\n\t\tLead the proposal to ensure the organization is a great place to work.\n\t\n\t\n\t\n\tCompensation & Benefits:\n\n\t\n\t\tAdminister compensation, benefits, and performance management systems in alignment with company policies.\n\t\tCarry out payroll computation for both temporary and permanent workers that is compliant with statutory obligations (PAYE, Pension, ITF, NSITF, etc).\n\t\n\t\n\t\n\tHR Administration:\n\n\t\n\t\tMaintain accurate HR records and utilize HIRS (Human Resource Information System) for data management.\n\t\tEnsure policies and procedures meet legal requirements and best practices.\n\t\n\t\n\n\nQualifications\n\n\n\tA Bachelor’s Degree in Human Resource Management, Business Administration, Public Administration, or a related Social Science discipline.\n\tMinimum of 2 years of experience in an HR role, with proven expertise in the areas mentioned above.\n\tPrior experience in a production facility will be an added advantage.\n\tProficiency with HR software systems, particularly HIRS.\n\tStrong knowledge of Nigerian Labour Laws and employment contracts.\n\tProven training in HR Fundamentals.\n\tMust be adaptable to working on-site at our project location and ready to resume immediately.\n\tWillingness to relocate; company accommodation and a relocation subsidy are provided.\n\n\nSalary\nN150,000 - N200,000 Monthly.\n\nWhat We Offer:\n\n\n\tCompetitive salary and benefits package.\n\tCompany-provided accommodation at the project site.\n\tMonthly Airtime and Data allowances\n\tOpportunities for professional growth and development in a challenging, fast-paced environment.\n\n\nMethod of Application\nInterested and qualified candidates should send their Cover Letter and Resume to: hr.greengrassnigeria@gmail.com using the Job Position (HR Officer) as the subject of the email.\n\nNote\n\n\n\tThis is a field-based position, therefore candidates will be expected to stay at the company provided accomodation at our project site in Libata, Kebbi State. \n\tDue to the urgency of this position, application will be reviewed on a rolling basis and the position may be filled before therecruitment closing date.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Officer - Bank Reconciliations and Charges Job at Promasidor",
    "link": "https://www.jobgurus.com.ng/jobs/view/officer-bank-reconciliations-and-charges-job-at-promasidor",
    "pubDate": "Mon, 02 Jun 2025 21:15:27 GMT",
    "source": "JobGurus",
    "keyword": "promasidor",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Promasidor - We are an African company proud of our heritage and totally committed to the continent. We manufacture, market and sell unique brands which bring practicality and pleasure to millions of consumers across Africa.\n\nWe are recruiting to fill the position below:\n\nJob Position: Officer - Bank Reconciliations and Charges\n\nJob Location: Lagos\nJob Type: Full-time\n\nAbout The Job\nThe ideal candidate will be responsible for:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tEnsuring all bank accounts are reconciled on a daily and monthly basis\n\tPrompt and adequate follow up and resolution of all reconciliation items\n\tIdentifying unknown lodgement and act accordingly in line with the company policy\n\tPrompt identification of payment not on NAV and advise accordingly\n\tDetection and reporting of all irregular entries identified in the bank statements and ledger\n\tInterfacing between PNG customers and the Bank on deposit confirmation\n\tPrompt posting of all bank charges\n\tPrompt verification and recovery of excess bank charges.\n\n\nEducation & Experience\n\n\n\tHND / B.Sc Degree in Accounting / Finance\n\t1 - 2 years of relevant work experience.\n\n\nKnowledge & Skills:\n\n\n\tReconciliation\n\tKnowledge of accounting policies and procedures\n\tComputer proficiency\n\tFinancial regulations.\n\n\nPersonal Attributes:\n\n\n\tAnalytical\n\tInterpersonal skills\n\tAttention to detail\n\tIntegrity & honesty\n\tProblem solving skills\n\tProbity and Accountability\n\tGood Communication skills.\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Business Development Manager Job at JC International",
    "link": "https://www.jobgurus.com.ng/jobs/view/business-development-manager-job-at-jc-international-1",
    "pubDate": "Mon, 02 Jun 2025 21:15:27 GMT",
    "source": "JobGurus",
    "keyword": "jc international",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "JC International provides World Class specialist Asset Integrity Assurance and Training services throughout the Asset life-cycle.\n\nWe are recruiting to fill the position below:\n\nJob Position:  Business Development Manager\n\nJob Location: Lagos\n\nAbout The Job\n\n\n\tJC International is seeking a highly driven and strategic Business Development Manager with strong leadership skills to spearhead business initiatives, build lasting client relationships, and drive revenue expansion.\n\n\nResponsibilities\nAs the Business Development Manager (BDM), you will be responsible for:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tLead and mentor the business development team\n\tIdentify and secure high-value business opportunities\n\tDevelop and execute strategic growth plans\n\tBuild and maintain strong client and industry relationships\n\tTracking, analysing, and communicating key quantitative metrics and business trends as they relate to partner relationships.\n\tEstablishing new accounts by developing and expanding sales through client visits/telephone inquiries/email and electronic communication\n\tSelling and generating revenue for the JC International Service offerings\n\tConducting market research to evaluate gaps, opportunities, and clients’ needs\n\tDeveloping marketing and sales strategy to increase revenue\n\tMeeting with potential clients and growing long-lasting relationships by understanding their needs\n\tEnsuring Business expansion and increase in market share index through networking and effective marketing.\n\tWorking with the digital marketing team to showcase the service in the limelight\n\tPreparing presentations and pitches for prospective Clients & Regulators\n\tEnsuring prompt response to client’s requests and accurate billing/invoicing.\n\tThe prompt renewal of running contracts Ensure vendor registration with key clients\n\tEnsuring prompt and seamless mobilization to sites for job call-out\n\tFor the company’s business processes & regulatory compliance, tender preparation, packaging, and timely submission.\n\tParticipating in setting Sales budgets for the division Support the company’s realization of its corporate mission.\n\n\nRequirements\n\n\n\tBEng. or BSC in any field\n\tAt least 10 years of work experience in sales and business development\n\tProven experience in business development, sales, or a related field\n\tStrong leadership and team management skills\n\tStrong negotiation skills.\n\tStrong communication and presentation skills.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hr@jcinternationalng.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]