[
  {
    "title": "Social Media Manager - Assistant (Volunteer) Job at Powered By Health Initiative",
    "link": "https://www.jobgurus.com.ng/jobs/view/social-media-manager-assistant-volunteer-job-at-powered-by-health-initiative",
    "pubDate": "Thu, 05 Jun 2025 11:37:09 GMT",
    "source": "JobGurus",
    "keyword": "powered by health initiative",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance"
    ],
    "content": "Powered By Health Initiative (PBHI) is a global organization focused on advancing health equity and social justice by empowering vulnerable communities. We provide integrated healthcare services, advocate for policy reforms, and address the social determinants of health. PBHI works to eliminate barriers to healthcare, promote gender equality, and create economic opportunities, ensuring that every individual has access to quality care and the resources to thrive. Our mission is to foster lasting change through community-driven solutions and systemic advocacy, making healthcare a universal right for all.\n\nWe are recruiting to fill the position below:\n\nJob Position: Social Media Manager - Assistant (Volunteer)\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Location: Nigeria\nSlot: 2 Openings\n\nJob Description\n\n\n\tThis role is designed for individuals who can blend creativity with strategy, understand social algorithms, manage data-driven schedules, and maintain real-time responsiveness across multiple platforms.\n\n\nKey Responsibilities\n\n\n\tCo-manage daily operations of PBHI’s social media platforms (Instagram, X/Twitter, LinkedIn, TikTok)\n\tBuild and maintain platform-specific content calendars aligned with our editorial vision\n\tAnalyse engagement metrics weekly and propose actionable insights\n\tSupport execution of global campaigns and awareness days\n\tMaintain brand consistency in captions, tone, visuals, and responses\n\tEngage actively with followers, partner platforms, and collaborators\n\tInnovate automation and scheduling systems using tools like Buffer, Notion, Metricool, etc.\n\n\nRequirements\n\n\n\tMinimum 1 year of professional, volunteer, or academic experience related to public health or digital engagement\n\tDemonstrated experience managing public-facing accounts for a health, development, or advocacy brand\n\tAbility to interpret analytics and translate numbers into strategy\n\tHigh responsiveness and commitment to daily time blocks\n\tFluency in visual storytelling and platform algorithms\n\tProficiency with tools like Meta Suite, Canva, Notion, and Buffer\n\tFluency in English (spoken and written); multilingual abilities are a plus\n\tWillingness to adhere to PBHI’s volunteer performance framework, code of conduct, and weekly task expectations\n\tConsistent access to a personal computer and reliable internet\n\tProven ability to work independently in a structured, remote, and cross-cultural team.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Operations Manager - Art Gallery Job at West Africa Vocational Education (WAVE)",
    "link": "https://www.jobgurus.com.ng/jobs/view/operations-manager-art-gallery-job-at-west-africa-vocational-education-wave",
    "pubDate": "Thu, 05 Jun 2025 11:37:09 GMT",
    "source": "JobGurus",
    "keyword": "west africa vocational education (wave)",
    "duplicate": false,
    "classifications": [],
    "content": "WAVE is solving what is arguably the biggest challenge on the continent: youth unemployment. In West Africa, 40-85% of youth, more than 50 million, are either unemployed or underemployed. Meanwhile, job creation in the region is on the rise. The disconnect between work-ready youth and the employment market must be bridged.\n\nWe are recruiting to fill the position below:\n\nJob Position: Operations Manager - Art Gallery\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nAbout the Job\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a dynamic and highly motivated Art Gallery Operations Manager with strong connections to High net-worth individuals (HNIs).\n\tThe ideal candidate will be responsible for managing gallery operations, hosting and networking with HNIs, organizing exhibitions, and driving art sales.\n\tThis role requires a high-agency individual with excellent people management skills and a proven track record in achieving business objectives.\n\n\nKey Responsibilities\n\n\n\tManage day-to-day operations of the art gallery, ensuring smooth functioning.\n\tHost, interact, and build strong relationships with HNIs to promote the gallery and its exhibitions.\n\tCollaborate in planning, organizing, and executing art exhibitions and events that attract and engage HNIs.\n\tLead and manage gallery staff, providing guidance and ensuring alignment with gallery goals.\n\tNetwork extensively to bring new HNIs and collectors to the gallery.\n\tCollaborate with artists, curators, and other stakeholders to curate compelling exhibitions.\n\tMonitor sales performance and provide regular reports to senior management.\n\tMaintain high standards of customer service and gallery presentation.\n\n\nRequirements\n\n\n\tBachelor's Degree.\n\tProven access to and experience working with high net-worth individuals.\n\tStrong networking and interpersonal skills.\n\tDemonstrated ability to manage people and meet business objectives.\n\tExperience in art gallery operations, sales, or a related field is advantageous.\n\tExcellent organizational and communication skills.\n\tHigh level of professionalism and discretion.\n\tAbility to work independently and take initiative.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: recruitments@waveacademies.org using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Office Assistant Job at Skylight Professional Services and Partners",
    "link": "https://www.jobgurus.com.ng/jobs/view/office-assistant-job-at-skylight-professional-services-and-partners",
    "pubDate": "Thu, 05 Jun 2025 11:37:09 GMT",
    "source": "JobGurus",
    "keyword": "skylight professional services and partners",
    "duplicate": false,
    "classifications": [],
    "content": "Skylight Professional Services and Partners considers its reputation of professional excellence and integrity to be of paramount importance. We avail our staff with appropriate and up to date trainings. Our role as successful financial planners, management consultants and course facilitators are enhancing our reputation in the financial and business world, and as such contributing significantly to the growth of our firm.\n\nWe are recruiting to fill the position below:\n\nJob Position: Office Assistant\n\nJob Location: Lagos\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAn Office Assistant provides essential support to ensure the smooth functioning of daily office operations.\n\tTheir duties typically include answering phones, managing schedules, maintaining files, and providing general administrative assistance to staff.\n\n\nRequirement\n\n\n\tInterested candidates should possess minimum of an SSCE qualification.\n\n\nMethod of Application\n\nInterested and qualified candidates should forward their Resume to: skylightkonsulting@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Supply Chain Analyst Job at Workforce Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/supply-chain-analyst-job-at-workforce-group",
    "pubDate": "Thu, 05 Jun 2025 11:37:09 GMT",
    "source": "JobGurus",
    "keyword": "workforce group",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Workforce group is a leading provider of end-to-end, integrated and result focused Business and Human Resource solutions in Nigeria. From inception in 2004, we have helped clients across diverse industries and sectors such as Financial Services, Telecoms, Oil and Gas, Real Estate, Hospitality, Power, Entertainment, FMCG, etc., to achieve their strategic goals and objectives.\n\nWorkforce Group is a top business and HR consulting firm in Nigeria, offering advisory, outsourcing, recruitment and assessment, learning and development, market entry and technology services and solutions. Our reputation for excellence in service was built from over a decade of providing business and human resource consulting across several states in Nigeria.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Supply Chain Analyst \nJob Location: Lagos\nReports to: Warehouse Manager\n\nJob Summary\n\n\n\tWe are hiring a Supply Chain Analyst for a client in the renewable energy sector. \n\tThe ideal candidate will support supply chain operations, coordinate shipping and freight, ensure timely cargo clearance, and drive efficiency through data analysis and inventory control.\n\n\nJob Responsibilities\n\n\n\tDaily reporting and tracking of all company shipments from origin to the warehouse.\n\tAssess clearing agents’ operations and compliance with the organisation's policy.\n\tAnalyze supply chain data to identify trends, patterns, and opportunities for improvement.\n\tReconcile and process all agents’ payment invoices with the Finance team.\n\tInventory control using ERP to prevent month-on-month inventory variances in the assigned hub.\n\tTrack key performance indicators (KPIs) and metrics to assess supply chain performance and identify areas for cost optimization.\n\tEnsure 100% documentation and records relating to the organisation's supply chain.\n\tOversee inbound operations after cargo delivery by HSE compliance.\n\tWork cross-functionally with inventory lead on warehouse storage and inventory levels.\n\n\nRequirements and skills\n\n\n\tB.Sc / HND in any related field.\n\t1–2 years of experience in supply chain operations, business analysis, or a similar role.\n\tProficiency in Microsoft Excel is critical.\n\tStrong analytical and problem-solving skills.\n\tDetail-oriented with the ability to handle multiple tasks and prioritize effectively in a fast-paced environment.\n\tCollaborative team player able to work cross-functionally and build relationships with stakeholders.\n\tExcellent communication skills.\n\tStrong attention to detail and accuracy.\n\n\nKey Requirements:\n\n\n\tB.Sc/HND in a relevant field\n\tMinimum of 1 year of supply chain or similar experience\n\tStrong Excel and analytical skills\n\tDetail-oriented, organized, and a good team player.\n\n\nSalary\nN150,000 net + HMO & Pension.\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Business Development Officer Job at Petrogap Oil and Gas Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/business-development-officer-job-at-petrogap-oil-and-gas-limited",
    "pubDate": "Thu, 05 Jun 2025 11:37:09 GMT",
    "source": "JobGurus",
    "keyword": "petrogap oil and gas limited",
    "duplicate": false,
    "classifications": [],
    "content": "Petrogap Oil and Gas Limited was incorporated as a response to the emerging trends in the dynamic Oil & Gas industry. We are a wholly indigenous company and registered player in the Upstream, Midstream and Downstream sectors of the Oil & Gas industry.\n\nWe are recruiting to fill the position below:\n\nJob Position: Business Development Officer\n\nJob Location: Victoria Island, Lagos\nEmployment Type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAssist in developing a sustainable business relationship model for new and existing Clients such as IOCs, DPR, NAPIMS, NNPC and other regulatory body in the oil and gas industry\n\tPrepare projects technical and commercial pre-qualifications proposal/bid to the Clients.\n\tFacilitate or assist as required in the strategy development and actual negotiation (technical, commercial and contractual) with customers and suppliers.\n\tWork closely with Clients to identify prospective projects needs for technical and commercial implementation\n\tAssist in sourcing, packaging, bidding on various platforms (within the stipulated deadline) and ensuring that all bids are won and executed flawlessly.\n\tDevelop and maintain a complete understanding of the business environment, market trends, drivers and issues that will impact on the Company's business.\n\tSource for Clients future projects with In -depth knowledge of up-coming and on-going key projects and follow-up till business is generated and awarded\n\tReactivate dormant Client account and relationship to generate tangible business.\n\n\nQualification / Person Specification\n\n\n\t Interested candidates should possess a B.Sc Degree with 1 - 3 years of working as a Business Development Officer in the Oil and Gas industry.\n\tAge range: 23 - 35 years old.\n\tSex: Male or Female.\n\n\nRequirements:\n\n\n\tIn-depth knowledge of up-coming and on-going key projects in the upstream sector of the Oil and Gas Sector.\n\tEngaged in robust and high level contacts in the IOCs and E&P companies.\n\tExperience in Upstream Business Development.\n\tCandidates should have strong links to industry and knowledge of the business drivers for the key markets.\n\tStrong financial acumen and analytical skills.\n\tStrong networking and interpersonal skills.\n\tExcellent relationship management skills.\n\tExcellent intelligence gathering skills.\n\tLeadership qualities.\n\tProficient in advanced Excel and Powerpoint.\n\n\nBenefits\nCompetitive salary with monthly Bonus on transactions.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: careers.pgog@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]