[
  {
    "title": "Job Openings at Rated Cranes and Scaffolding Nigeria Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-rated-cranes-and-scaffolding-nigeria-limited",
    "pubDate": "Mon, 07 Jul 2025 16:20:36 GMT",
    "source": "JobGurus",
    "keyword": "rated cranes and scaffolding nigeria limited",
    "duplicate": false,
    "classifications": [],
    "content": "At Rated Cranes and Scaffolding Nigeria Limited, we are Nigeria’s trusted partner in delivering world-class safety training, equipment services, and workforce solutions for the Oil & Gas, Manufacturing, Construction, and Industrial sectors. Our commitment to excellence, innovation, and safety ensures that your operations run smoothly, efficiently, and in full compliance with the highest industry standards.\n\nWe are recruiting suitably qualified candidates to fill the following positions below:\n\n1.) Junior Quantity Surveyor (Business Development Officer)\n\nJob Location: Lagos\n\nKey Responsibilities\nBusiness Development & Client Engagement:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tServe as the primary liaison between the company and all clients (existing and potential)\n\tActively pursue new project opportunities in Oil & Gas, Construction, and Industrial sectors\n\n\nQualifications and Requirements\n\n\n\tBachelor’s Degree or HND in Quantity Surveying, Building Technology, or a related field\n\tMinimum of 1-2 years of experience as a Quantity Surveyor or Estimator in Construction industries\n\tMust reside around Lekki Ajah axis.\n\tProficiency in quantity surveying and estimating software tools\n\tProfessional membership is an added advantage.\n\n\nSalary\nN150,000 - N200,000 / Month.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: recruitment@ratedcranesandscaffold.com using the Job Position as the subject of the email.\n\n \n\n2.) Health Safety Environment (HSE) & Training Coordinator\n\nJob Location: Lagos\n\nJob Summary\n\n\n\tWe are seeking a highly skilled and experienced HSE & Training Coordinator to lead and manage safety training activities and safety coordination projects at our Orofun, Ibeju-Lekki training center.\n\tThe ideal candidate must reside within the Ibeju-Lekki axis and bring deep knowledge of marine, offshore/onshore safety practices with proven expertise in Confined Space Entry (CSE), Lockout Tagout (LOTO), and Fall Protection.\n\n\nKey Responsibilities\nTraining & Instruction:\n\n\n\tDeliver hands-on and classroom training in: Confined Space Entry (CSE), Lockout/Tagout (LOTO), Fall Protection, Hot Work Permit Procedures\n\tOversee training sessions for both staff and external clients ensuring compliance with international safety standards\n\tUpdate and review training materials, manuals, and procedures regularly\n\n\nHSE Operations:\n\n\n\tCoordinate all safety-related programs and site supervision contracts\n\tMonitor compliance with applicable safety regulations on client construction sites and internal operations\n\tConduct risk assessments and support implementation of corrective actions\n\n\nClient Interface & Support:\n\n\n\tServe as the primary safety training contact for current and prospective clients\n\tCollaborate with clients to design and deliver customized training and HSE programs\n\tProvide safety advisory and technical support for client projects and audits\n\n\nDocumentation & Compliance:\n\n\n\tMaintain detailed records of training, certifications and safety audits\n\tEnsure alignment with ISO 45001, 9001, 14001, and 14064 management systems \n\tSupport external and internal audits related to HSE and training programs\n\n\nRequired Qualifications and Certifications\n\n\n\tBachelor’s degree or HND in Environmental Science, Occupational Health & Safety, Engineering, or related field\n\t3–5 years of experience in marine, Construction, offshore, or onshore Oil & Gas operations\n\tStrong background in Confined Space Entry (CSE), LOTO, Fall Protection, Hot Work Procedures\n\tProfessional Certifications (Mandatory):\n\t\n\t\tNEBOSH IGC, ISPON (Current Member)\n\t\tASP/CSP (Board of Certified Safety Professionals)\n\t\tMembership in IIRSM, OSHA, or other recognized safety bodies\n\t\n\t\n\tFamiliarity with relevant HSE software/tools and safety documentation systems\n\tStrong communication, instructional, and interpersonal skills\n\tCurrent Location: Lives within Ajah- Ibeju-Lekki axis\n\n\nSalary\nN200,000 - N300,000 / Month.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: recruitment@ratedcranesandscaffold.com using the Job Position as the subject of the email.\n\n \n\n3.) Quantity Surveyor (Business Development Manager)\n\nJob Location: Lagos\n\nKey Responsibilities\nBusiness Development & Client Engagement:\n\n\n\tServe as the primary liaison between the company and all clients (existing and potential)\n\tActively pursue new project opportunities in Oil & Gas, Construction, and Industrial sectors\n\tPrepare and follow up on bids, EOIs, proposals, and commercial offers\n\tRespond to invitations to tender (ITTs), RFQs, and public procurement calls\n\tBuild and maintain client relationships through email, calls, and meetings\n\tPromote Rated Cranes’ training and inspection services to new clients\n\n\nPrepare accurate cost estimates for a wide range of services including:\n\n\n\tEPIC (Engineering, Procurement, Installation, and Commissioning)\n\tTechnical Training Programs\n\tSafety Inspections and Third-Party Evaluations\n\tCrane and Equipment Repairs\n\tHVAC Design, Installation, and Maintenance\n\tFire Detection and Suppression System Installations\n\tScaffolding Erection and Working at Height Projects\n\tLead the preparation of all tender documents including BOQs, technical write-ups, and commercial breakdowns\n\tTrack and respond to all relevant published tenders and procurement notices\n\tEnsure timely submission of all documentation with appropriate follow-ups\n\n\nQualifications and Requirements\n\n\n\tBachelor’s Degree or HND in Quantity Surveying, Building Technology, or a related field\n\tMinimum of 3–5 years of experience as a Quantity Surveyor or Estimator in Construction industries\n\tProficiency in quantity surveying and estimating software tools\n\tMust reside around Lekki Ajah axis.\n\n\nMust be a registered or active member of at least one of the following:\n\n\n\tNigerian Institute of Quantity Surveyors (NIQS)\n\tQuantity Surveyors Registration Board of Nigeria (QSRBN)\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: recruitment@ratedcranesandscaffold.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Executive Secretary Job at Farm Katsina Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/executive-secretary-job-at-farm-katsina-limited",
    "pubDate": "Mon, 07 Jul 2025 16:20:36 GMT",
    "source": "JobGurus",
    "keyword": "farm katsina limited",
    "duplicate": false,
    "classifications": [],
    "content": "The Farm Katsina Limited is an agricultural and flour mill comapny that deals in the livestock farming which includes cattle and poultry and maize flour production.\n\nWe are recruiting to fill the position below:\n\nJob Position: Executive Secretary\nJob Location: Katsina\nEmployment Type: Full-time\n\nSummary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a competent Executive Secretary to provide essential support to our high-ranking officials.\n\tYou will play a crucial role in organizing and maintaining the executive’s schedule, as well as performing various administrative tasks.\n\tAs an Executive Secretary, you must possess exceptional time-management and multitasking skills to handle multiple responsibilities efficiently.\n\n\nResponsibilities\n\n\n\tMaintain executive’s agenda and assist in planning appointments, board meetings, conferences etc.\n\tAttend meetings and keep minutes\n\tReceive phone calls\n\tHandle and prioritize all outgoing or incoming correspondence (e-mail, letters, packages etc.)\n\tMake travel arrangements for executives.\n\tHandle confidential documents ensuring they remain secure\n\tMaintain electronic and paper records ensuring information is organized and easily accessible\n\tPrepare presentations or reports as assigned.\n\n\nRequirements and Skills\n\n\n\tFirst Degree in Business Administration or relative field\n\tAt least 5 years of proven experience as executive secretary or similar administrative role.\n\tProficient in MS Office especially word, excel and powerpoint.\n\tIn depth knowledge of office management and filing systems.\n\tExcellent organizational and time-management skills\n\tOutstanding communication and negotiation abilities\n\tIntegrity and confidentiality.\n\n\nMethod of Application\nInterested and qualified candidates should forward their CV and application letter to: thefarmsjob@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Fleet Officer Job at TAK Logistics Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/fleet-officer-job-at-tak-logistics-limited",
    "pubDate": "Mon, 07 Jul 2025 16:20:36 GMT",
    "source": "JobGurus",
    "keyword": "tak logistics limited",
    "duplicate": false,
    "classifications": [],
    "content": "TAK Logistics Limited is a top-tier transportation firm based in Port Harcourt, offering unparalleled logistics solutions to our clients. Our expertise lies in efficiently transporting cargoes from production sites to storage facilities across Nigeria, ensuring a smooth and reliable delivery process every time.\n\nWe are recruiting to fill the position below:\n\nJob Position: Fleet Officer\nJob Locations: Kaduna, Lagos and Rivers\nEmployment Type: Contract\n\nDuties and Responsibilities\nOperations:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tManage the loading and scheduling of loads\n\tFollow up with drivers for prompt delivery and return\n\tManage diesel allocation for accuracy\n\tConfirm every delivery immediately after offloading to prevent losses and escalate every under delivery\n\tReport all diversion requests and follow up with prompt communication to the driver and clients\n\tEscalate all offloading delays for timely offloading\n\tOTD/TAT monitoring and management to ensure timely delivery and turnaround of the driver\n\tMaintenance delay reporting to clients in the overall improvement of our OTD score\n\tEmbark on rescue operations where required.\n\tPreparation of reports such as daily final offloading point reporting and weekly final offloading point reports, amongst others.\n\tSupport activities and other tasks as assigned by the team lead\n\tMonthly truck accessories reporting with a report to the management, including recommendations for drivers with missing accessories\n\tManage the driver database and communicate the absence of drivers to the driver admin unit.\n\tSubmit a well-compiled and up-to-date monthly active drivers’ list to the admin unit.\n\n\nAsset Management:\n\n\n\tWork with new and previous drivers to take inventory of trucks and properly file such records.\n\tSupervise drivers during the process for a thorough execution and ensure the documents are well prepared.\n\tConduct an inventory of accidented or abandoned vehicles at the incident scene, document and report accordingly.\n\tEnsure that the accessories of trucks under maintenance, accidented or without drivers are duly returned to the store.\n\tAny other task may be required\n\n\nRequirements for Educational Qualifications\n\n\n\tCandidates should possess an HND with a minimum of 2 years of working experience as an Operations Assistant.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: humanresources@ilsfleetmgt.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Female Sales Representative Job at Home Bargains Nigeria Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/female-sales-representative-job-at-home-bargains-nigeria-limited-1",
    "pubDate": "Mon, 07 Jul 2025 16:20:36 GMT",
    "source": "JobGurus",
    "keyword": "home bargains nigeria limited",
    "duplicate": false,
    "classifications": [],
    "content": "Home Bargains Nigeria Limited is a gift and decor store situated in Abuja, Nigeria.\n\nWe are recruiting to fill the position below:\n\nJob Position: Female Sales Representative\n\nJob Location: Wuse Zone 1, Abuja (FCT)\nEmployment Type: Full-time\n\nJob Description\n\n\n\tWe are looking for a dynamic and customer-focused Sales Representative to join our retail team. If you have a passion for sales and enjoy working in a fast-paced environment, we want to hear from you!\n\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAssist customers with purchases and product inquiries\n\tMaintain store cleanliness and product displays\n\tProcess sales transactions accurately\n\tAchieve individual and team sales targets.\n\n\nRequirements\n\n\n\tInterested candidates should possess a minimum of an OND qualification in a related field with 2 - 3 years of work experience. \n\tPrevious retail sales experience is essential\n\tExcellent communication and interpersonal skills\n\tStrong attention to detail and ability to multitask\n\tA team player with a positive attitude.\n\n\nWork Schedule:\n\n\n\t4 days per week,9:00 AM - 6:00 PM\n\t2 compulsory Sundays per month.\n\n\nSalary\nN90,000 - N100,000 per month.\n\nMethod of Application\nInterested and qualified candidates should send their CV and Cover letter to: ad.homebargains@gmail.com using the Job Position as the subject of the mail.\n\nNote: An aptitude test will be conducted as part of the recruitment process.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]