[
  {
    "title": "Executive Assistant to the GMD Job at Sujimoto Construction Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/executive-assistant-to-the-gmd-job-at-sujimoto-construction-limited",
    "pubDate": "Fri, 20 Jun 2025 14:15:01 GMT",
    "source": "JobGurus",
    "keyword": "sujimoto construction limited",
    "duplicate": false,
    "classifications": [],
    "content": "Sujimoto Construction Limited is a luxury real estate and construction company with a vision to dominate Nigeria's real estate industry. The firm covers all areas of construction, including the pre and post phases. Our major expertise is in luxury real estate development. We have also expanded our operations into facility management and direct construction, catering to the discerning real estate investor who wishes to be associated only with bespoke and iconic structures.\n\nWe are recruiting to fill the position below:\n\nJob Position: Executive Assistant to the GMD\n\nJob Location: Lagos\nJob Type: Full-time and Onsite\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a highly organized, proactive, and resourceful Executive Assistant to provide high-level administrative support to the GMD Sujimoto Group.\n\tThe ideal candidate must have experience in handling a wide range of executive support tasks, working independently, and managing competing priorities with a high level of professionalism and discretion.\n\n\nResponsibilities\n\n\n\tManage the GMD’s calendar, schedule meetings, and coordinate appointments, ensuring effective time management.\n\tPrepare reports, presentations, and correspondence on behalf of the GMD.\n\tOrganize and attend executive-level meetings, taking accurate minutes and following up on action items.\n\tManage confidential documents and sensitive information with absolute discretion.\n\tSupport in project management, research, and strategic planning activities.\n\tServe as the primary point of contact between the GMD and internal/external stakeholders.\n\tCoordinate domestic and international travel arrangements, including flights, accommodations, and itineraries.\n\tLiaise with department heads and other senior executives to facilitate company-wide communications and initiatives.\n\tMonitor deadlines and ensure the GMD is well-prepared for all engagements and deliverables.\n\tAssist in personal tasks when necessary, maintaining clear boundaries and confidentiality.\n\n\nRequirements\n\n\n\tMinimum of 5 years of experience as an Executive Assistant or in a similar role, preferably in the real estate or corporate sector.\n\tExcellent verbal and written communication skills.\n\tStrong organizational and time-management abilities.\n\tProficient in Microsoft Office Suite (Outlook, Word, Excel, PowerPoint) and other relevant tools.\n\tAbility to work under pressure and meet tight deadlines.\n\tHigh level of integrity, professionalism, and discretion in handling confidential information.\n\tAdaptable, proactive, and able to anticipate the needs of a busy executive.\n\tFamiliarity with the real estate industry is a strong advantage.\n\n\nMethod of Application\nInterested and qualified candidates should submit their CV to: Best@sujimotonig.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Customer Resolution Center (CRC) Officer Job at Premium Human Resource Solution Limited       Solution",
    "link": "https://www.jobgurus.com.ng/jobs/view/customer-resolution-center-crc-officer-job-at-premium-human-resource-solution-limited-solution",
    "pubDate": "Fri, 20 Jun 2025 14:15:01 GMT",
    "source": "JobGurus",
    "keyword": "premium human resource solution limited       solution",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Premium Human Resource Solution - Our client, a reputable asset management organization, is recruiting to fill the position below:\n\nJob Position: Customer Resolution Center (CRC) Officer \nJob Location: Victoria Island, Lagos\nEmployment Type: Full-time\nIndustry: Financial Services (Asset Management)\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a Customer Resolution Centre (CRC) Officer with proven experience resolving customer complaints within a financial institution.\n\tThe ideal candidate will be skilled in handling high volumes of calls, emails, and digital inquiries, providing timely, accurate, and empathetic responses while maintaining a strong customer-centric approach.\n\tThis role is critical in upholding the brand’s reputation through professional and satisfactory complaint resolution.\n\n\nKey Responsibilities\n\n\n\tServe as the first point of contact for customer complaints received through phone calls, emails, and other digital platforms.\n\tLog, track, and follow through on all customer complaints and inquiries to ensure they are resolved within agreed turnaround times (TAT).\n\tConduct root cause analysis of customer complaints to identify recurring issues and escalate them for process improvement.\n\tPrepare daily, weekly, and monthly reports on complaint trends, volumes, and resolution timelines.\n\tRecommend improvements to enhance customer satisfaction and reduce complaint recurrence.\n\tCollaborate with relevant departments (e.g., Operations, Risk, IT, Product) to ensure seamless complaint resolution.\n\tMaintain detailed and accurate records of all interactions in the CRM or complaint management system.\n\tEnsure all resolutions comply with regulatory requirements, internal policies, and SLAs.\n\tPromote and maintain a positive image of the brand in every customer interaction.\n\n\nRequirements\nEducation & Experience:\n\n\n\tBSc Degree in Business Administration, Banking, Communication, or a related field.\n\t2–4 years of proven experience in a customer service or complaint resolution role within a financial institution (commercial bank, microfinance, fintech, etc.).\n\tExperience handling high volumes of inbound and outbound communications.\n\n\nSkills & Competencies:\n\n\n\tExcellent verbal and written communication skills.\n\tStrong listening, empathy, and problem-solving abilities.\n\tProficiency in CRM tools and complaint tracking systems.\n\tAbility to work under pressure and manage multiple tasks simultaneously.\n\tStrong sense of accountability, confidentiality, and professionalism.\n\tConflict resolution skills and emotional intelligence.\n\n\nSalary\nNegotiable    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Human Resources Officer Job at Matrix Design and Works",
    "link": "https://www.jobgurus.com.ng/jobs/view/human-resources-officer-job-at-matrix-design-and-works",
    "pubDate": "Fri, 20 Jun 2025 14:15:01 GMT",
    "source": "JobGurus",
    "keyword": "matrix design and works",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Matrix Design and Works is a top furniture manufacturing company in Nigeria for kitchen, wardrobes and office.\n\nWe are recruiting to fill the position below:\n\nJob Position: Human Resources Officer\n\nJob Location: Lagos \n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDevelopment of human resource policies and processes. Innovative in HR strategies in boosting Corporate goals\n\tEnsures effective management of the recruiting function: selection, placement, and induction process. keeping a pool of recruits - installers\n\tOrganizing and managing new employee orientation, onboarding,and training programs for new and current staff.\n\tMaintains organization structure, employee relations, and updates personnel file\n\tOversee all administrative functions i.e preparing reports, handling correspondence, and scheduling meetings\n\tServes as the primary point of contact for internal and external constituencies.\n\tDevelops and manages compensation and benefit, Payroll handling and administration.\n\tEnsures performance management standards are adhered to regularly.\n\tManages staff promotion in line with company policy and performance.\n\tMaintenance of Facilities and Utilities\n\tSecurity & Logistics\n\tVehicle Management\n\tReviewing procedures for employee safety, welfare, wellness and health\n\tEnsure compliance of all statutory laws.\n\tRepresenting employer in community and recruiting events\n\tAbility to give HR reports - monthly and quarterly to aid company strategy.\n\n\nRequirement\n\n\n\tCandidates should possess a Bachelor's Degree.\n\n\nMethod of Application\nInteretsed and qualified candidates should send their CV to: Hrmatrix001@gmail.comusing the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]