[
  {
    "title": "Inventory and Warehouse Officer Job at Medbury Pharmaceuticals",
    "link": "https://www.jobgurus.com.ng/jobs/view/inventory-and-warehouse-officer-job-at-medbury-pharmaceuticals",
    "pubDate": "Thu, 12 Jun 2025 10:17:28 GMT",
    "source": "JobGurus",
    "keyword": "medbury pharmaceuticals",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Medbury Pharmaceuticals is a division under the larger Medbury Healthcare group. They specialize in manufacturing globally?standard medications such as: Artemether?Lumefantrine, Ciprofloxacin, Metronidazole, Paracetamol, and condoms (Safex), and distributing these pharmaceuticals and medical supplies to healthcare providers, hospitals, clinics, and pharmacies across Nigeria. Their production facilities hold CE, ISO, and TVU certifications, and all products are NAFDAC-registered.\n\nWe are recruiting to fill the position below:\n\nJob Position: Inventory and Warehouse Officer\nJob Location: Ibadan, Oyo\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tMedbury Pharmaceuticals is recruiting a reliable and organizedInventory and Warehouse Officer to oversee the management of stock and warehouse operations in our Ibadan location.\n\tThe ideal candidate will be responsible for receiving, storing, issuing, and tracking pharmaceutical products with accuracy and compliance. This role requires a good understanding of inventory systems, attention to detail, and the ability to manage stock movement in line with Good Storage Practices (GSP).\n\n\nRequirements\n\n\n\tCandidates should possess a B.Sc Degree with relevant work experience.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: medpharmacareers@gmail.com using the Job Position and Location (e.g.,Inventory and Warehouse Officer, Ibadan) as the subject of the mail.\n\nNote: Only candidates currently residing in or willing to relocate to Ibadan will be considered.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Vacancies at Oilserv Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancies-at-oilserv-limited",
    "pubDate": "Thu, 12 Jun 2025 10:17:28 GMT",
    "source": "JobGurus",
    "keyword": "oilserv limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Oilserv Limited is a leading provider of integrated engineering, procurement, construction, installation & commissioning (EPCIC) services and complementary solutions across the asset and program life cycle within the onshore, offshore and subsea market segments of the oil and gas sector. Oilserv Limited was incorporated in 1992 and commenced operations in 1995.\n\nWe are recruiting to fill the following positions below:\n\n1.) Learning & Development Specialist\n\nJob Location: Port Harcourt, Rivers\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tTo support the Head Human Resources in the effective delivery of the overall L&D and Recruitment strategy.\n\tThe post holder will identify development needs, design, create and deliver solutions across the organisation at every level, including online learning.\n\tResponsible for setting clear points of evaluation and able to demonstrate the degree of success achieved for all L&D interventions\n\n\nJob Details\n\n\n\tTraining scheduling and coordination. \n\tConsult and partner with line managers/heads of department to incorporate operational/functional requirements and implement training needs assessments (TNA). \n\tDevelop and manage evaluation methods and reporting metrics to support the measurement of programme effectiveness.\n\t Build and sustain relationships with training providers and accreditation bodies to deliver effective training activities to the business. \n\tExecute/facilitate needed training and other learning projects \n\tMaintain effective relationship with ITF on annual training plans and ensure full annual reimbursements \n\tEvaluating training outcomes and generating weekly and monthly L&D reports \n\tDrive employee/self-paced learning on the Learning Management System (LMS) and track usage to ensure value \n\tMonitor training & development costs and expenses to assist in budget preparation \n\tTo design needed trainings and other learning projects with the performance objectives in mind \n\tCoordinating performance management procedure across business units \n\tImplement routine performance audits across the business units  \n\tEnsure good personal adherence to Health, Safety, Security and Environmental practice is maintained and exhibited at all times \n\tPerform other tasks as assigned by the Head of Human Resources\n\n\nRequirements\n\n\n\tB.Sc/HND in Management or Social Science or any related discipline from a reputable University/ Polytechnic\n\tCIPMN, SHRM, CIPD, CIPM\n\tMinimum of Five (5) years cumulative cognate experience in an HR/Learning & Development role \n\tKnowledge of Performance Management \n\tExperience in the oil and gas industry is an added advantage.\n\tAbility to communicate at all levels\n\tExcellent organizational/time management skills\n\tWorking knowledge of an Applicants Tracking System (ATS) or SAP HR \n\tProficiency in Microsoft Office Suites \n\tKnowledge of Advanced interviewing techniques \n\tFamiliar with a wide variety of sourcing avenues – especially for top Engineering/Project Mgt talent.\n\n\nBenefits\n\n\n\tGreat work culture and multiple opportunities for growth and self-development. \n\t18 days of annual leave, excluding federal public holidays. \n\tHealth Insurance coverage. \n\tMonthly employer pension contribution. \n\tEtc.\n\n\nClick here to apply online\n\n \n\n \n\n2.) Business Development Coordinator\n\nJob Location: Port Harcourt, Rivers\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tThis position has the following responsibilities.\n\tTo lead and motivate business development coordination in driving and expanding the business.\n\tConduct market analysis, initiate contact with prospects, generate leads and sales, maintain relationships with existing clients and address their needs, and complete a range of administrative duties.\n\n\nResponsibilities\nLeadership:\n\n\n\tHelp come up with a development strategy for the business with growth objective in mind.\n\tSet milestones and make action plans for the same.\n\tOrient and motivate the staff and employees on weekly and monthly goals to keep them on the task.\n\tFocus on customer satisfaction plans and financial gain strategies.\n\tPromote the company’s image, product, and services.\n\tAttending meetings with prospective clients.\n\tDeveloping quotes and proposals for clients.\n\tDeveloping goals for the development team and business growth and ensuring they are met.\n\n\nCore/Technical:\n\n\n\tRecord sales, revenue, and invoices to analyse.\n\tConducting research after assimilating data to better understand the requirements of the company and clientele.\n\tEnsure the best practices are used with all teams to better the workflow.\n\tContacting potential clients to establish rapport and arrange meetings.\n\tPlanning and overseeing new marketing initiatives.\n\tResearching organizations and individuals to find new opportunities.\n\tIncreasing the value of current customers while attracting new ones.\n\tFinding and developing new markets and improving sales.\n\tAttending conferences, meetings, and industry events.\n\tUndertake periodic measurement of divisional  KPIs and  initiate  actions to   re-align the KPIs to  the divisional objectives.\n\n\nQuality, Health, Safety & Environment:\n\n\n\tEnsure zero LTI and Fatality while carrying out maintenance activities.\n\tDrive compliance with Occupational Health, Safety, Quality and Environmental Policies, processes, procedures and applicable laws/legal requirements across Oilserv business.\n\tTake responsibility for their health & safety and those of stake holders across Oilserv business.\n\n\nRequirements\n\n\n\tHND / B.Sc. Electrical / Mechanical Engineering\n\t6 - 10 years of experience in Asset maintenance / management.\n\n\nBenefits\n\n\n\tGreat work culture and multiple opportunities for growth and self-development. \n\t18 days of annual leave, excluding federal public holidays. \n\tHealth Insurance coverage. \n\tMonthly employer pension contribution. \n\tAn opportunity to play an important role in building one of the top SaaS start-ups in the global emerging market.\n\n\nClick here to apply online\n\n \n\n \n\n3.) Mechanical Completions Engineer\n\nJob Location: Port Harcourt, Rivers\nWork Mode: Hybrid\nCategory: Sales\n\nJob Summary\n\n\n\tThe Mechanical Completions Engineer will be responsible for developing safe procedures for installation, troubleshooting and completions of mechanical equipment.\n\tDevelopment and reviews of mechanical scope of works during engineering, construction and commissioning phase of works.\n\n\nJob Responsibilities\nLeadership:\n\n\n\tProvide positive and professional leadership to technicians in all departments\n\tContribute to the goal zero drive of HSE\n\tProvide advice and support to all projects within the Group on matters relating to any issue within the remit of mechanical commissioning works\n\n\nCore/Technical:\n\n\n\tTakes part in project planning & Scheduling; prepares and keeps up -to- date the mechanical pre-commissioning and commissioning scope plans and procedures.\n\tAssists the Commissioning manager to co-ordinate overall Pre-commissioning, Commissioning and start-up processes of mechanical scope in new and existing pipelines and facilities from initial construction planning through to final handover to production operations/Owner.\n\tParticipates in developing commissioning plans and procedures, together with other discipline engineers and operation personnel.\n\tTakes part in the Project review meetings to make sure that the commissioning requirements have been duly complied with.\n\tEnsure compliance with the Quality System Documentation requirements, review engineering documents for overall commissioning completeness and approval\n\tDevelop and implement work procedures effectively.\n\tDevelop appropriate ITR (inspection and Test records) also known as A and B check-sheets, ensuring compatibility with design and equipment datasheet for each tag item on P&ID for review and approval\n\tAssist with the assessment and selection of mechanical Pre-Commissioning subcontractor which includes review of subcontractor proposal (equipment list, personnel, consumables, and qualifications).\n\tPerform engineering tasks associated with the Pre-Commissioning activities including site work under direction of the Pre-Commissioning Lead.\n\tAssists in preparation of punch list of activities to be completed before pre-commissioning and commissioning\n\tProvide formal and informal reporting of work progress and status.\n\tGenerate where applicable (either using Client Software or Excel) the Discipline Acceptance Certificate (DAC), Mechanical Completion Acceptance Certificate (MAC), System Acceptance Certificate (SAC), Facilities Acceptance Certificate (FAC) of completed systems on site for handover from Construction phase to Commissioning Team.\n\tDevelop and maintain client, vendor and subcontractor relationship.\n\tDevelop and track master punch-list register using either client proprietary software or excel to capture each discipline, sub-system, equipment tags; clearly showing status of cleared and outstanding item.\n\tMonitor and support subcontractors on site.\n\tResponsible for ensuring the effective implementation and adherence to Quality, Health & Safety policies during pre-commissioning and commissioning activities.\n\tDevelop systems and subsystems for mechanical discipline\n\n\nRequirements\n\n\n\tCandidates should possess an HND or above in Engineering\n\tMinimum of 7 years in Mechanical Installation, Calibration, Troubleshooting, with at least 3 years in a supervisory role, experience in Completion Software and Commissioning processes\n\tProfessional Trade Certificate\n\n\nBenefits\n\n\n\tGreat work culture and multiple opportunities for growth and self-development. \n\t18 days of annual leave, excluding federal public holidays. \n\tHealth insurance coverage. \n\tMonthly employer pension contribution. \n\n\nClick here to apply online    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Social Media Officer / Content Creator Job at Greenfield Consulting",
    "link": "https://www.jobgurus.com.ng/jobs/view/social-media-officer-content-creator-job-at-greenfield-consulting-1",
    "pubDate": "Thu, 12 Jun 2025 10:17:28 GMT",
    "source": "JobGurus",
    "keyword": "greenfield consulting",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Greenfield Consulting - Our client, a Commercial Kitchen, is recruiting to fill the position below:\n\nJob Position: Social Media Officer / Content Creator\nJob Location: Surulere, Lagos\nEmployment Type: Part-time\nWorkdays: Freelance\n\nJob Summary\n\n\n\tCreate content for the brand daily on social media\n\t?Engage the business audience\n\tStrategyDevelopment\n\tDrive online sales and engagement for the brand\n\n\nQualifications & Requirements\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tMinimum of HND qualification in a relevant field\n\tSocial media experience in a relevant industry\n\tGood verbal and written communication skills\n\tFashionable and conversant with fashion trends\n\tMust be proficient with internet and social media marketing\n\tComputer literate\n\tCandidate must live close to the job location: Surulere, Lagos.\n\n\nSalary\n\n\n\tN100,000 - N120,000 per month.\n\tNegotiable\n\n\nMethod of Application\nInterested and qualified candidates should send their CVs to the following email address or WhatsApp contact: greenfieldhrconsulting@gmail.com using the Job Position as the subject of the email.\n\nNote: For more enquiries, contact WhatsApp on 07037390428 (no phone calls).    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Front Desk & Administrative Officer Job at Northwest Petroleum & Gas Company Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/front-desk-administrative-officer-job-at-northwest-petroleum-gas-company-limited",
    "pubDate": "Thu, 12 Jun 2025 10:17:28 GMT",
    "source": "JobGurus",
    "keyword": "northwest petroleum & gas company limited",
    "duplicate": false,
    "classifications": [],
    "content": "(adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\nNorthwest Petroleum & Gas Company Limited is a Company in the Oil & Gas Sector of the economy with international repute. The Company has vast experience in the importation, supply, distribution, and storage of Petroleum Products and is also actively involved in the official export of Crude Oil from Nigeria being one of the twenty-seven Companies approved by the Nigerian National Petroleum Corporation (NNPC) for allocation and export of Nigerian Crude Oil. Presently, amongst other facilities, the Company operates two (2) Ultra-Modern Mega Petroleum Products Storage Terminals with a combined capacity of 96.8 million litres certified and duly licensed by the Department of Petroleum Resources (DPR) and an Ultra-Modern Berthing Facility with an International state of the art Fire Fighting and Safety Equipment in the Calabar Free Trade Zone, Cross River State.\n\nWe are recruiting to fill the position below:\n\nJob Position: Front Desk & Administrative Officer\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe seek to hire a warm, professional and organized Front Desk & Admin Officer to serve as the first point of contact for visitors and staff.\n\tThe ideal candidate must have excellent communication skills, a customer-focused attitude, and the ability to handle multiple tasks efficiently.\n\n\nMain Key Responsibilities\n\n\n\tWelcome visitors and staff in a professional and friendly manner.\n\tAnswer and direct phone calls, emails, and general inquiries promptly.\n\tMaintain the reception and entire company premises and ensure it is clean and welcoming\n\tManage appointment schedules and assist with meeting coordination.\n\tProvide general support to the admin team and other departments as required.\n\tProvide administrative support to different departments as needed.\n\tRelay important information to relevant personnel in a timely manner.\n\tHandle incoming and outgoing mail, deliveries, and official correspondence.\n\tMaintain visitor logs and ensure security and sign-in protocols are followed.\n\tSupport administrative tasks including filing, data entry, printing, and record keeping.\n\tAddress and resolve client and visitor inquiries or redirect them to the appropriate department.\n\tMonitor and replenish office supplies as needed.\n\n\nQualification/Experience/Key Competencies\n\n\n\tMinimum of a Relevant University Degree\n\tMinimum of 2-5 Years in a similar role.\n\tPrior experience in customer service/front office role is preferred.\n\tExcellent communication, interpersonal, and organizational skills.\n\tProficient in Microsoft Office (Word, Excel, Outlook).\n\tProfessional appearance and a positive attitude.\n\tAbility to handle confidential information with discretion.\n\tCalm and composed, especially in handling inquiries and managing busy front desk    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Data Analyst Job at Medbury Pharmaceuticals",
    "link": "https://www.jobgurus.com.ng/jobs/view/data-analyst-job-at-medbury-pharmaceuticals",
    "pubDate": "Thu, 12 Jun 2025 10:17:28 GMT",
    "source": "JobGurus",
    "keyword": "medbury pharmaceuticals",
    "duplicate": false,
    "classifications": [],
    "content": "Medbury Pharmaceuticals is a division under the larger Medbury Healthcare group. They specialize in manufacturing globally?standard medications such as: Artemether?Lumefantrine, Ciprofloxacin, Metronidazole, Paracetamol, and condoms (Safex), and distributing these pharmaceuticals and medical supplies to healthcare providers, hospitals, clinics, and pharmacies across Nigeria. Their production facilities hold CE, ISO, and TVU certifications, and all products are NAFDAC-registered.\n\nWe are recruiting to fill the position below:\n\nJob Position: Data Analyst\nJob Location: Ibadan, Oyo\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tMedbury Pharmaceuticals is seeking a detail-oriented and analytical Data Analyst to join our team in Ibadan.\n\tThe ideal candidate will play a key role in transforming data into insights that support decision-making across sales, inventory, and supply chain operations.\n\tThis role requires a strong grasp of data interpretation, report generation, and visualization techniques relevant to pharmaceutical operations.\n\tCandidates with a pharmacy technician background will be strongly preferred, as this provides valuable context for interpreting healthcare-related data.\n\n\nRequirements\n\n\n\tCandidates should possess a B.Sc Degree with relevant work experience.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: medpharmacareers@gmail.com using the Job Position and Location (e.g.,Data Analyst, Ibadan) as the subject of the mail.\n\nNote: Only candidates currently residing in or willing to relocate to Ibadan will be considered.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]