[
  {
    "title": "IT Manager - Manufacturing Job at Worknigeria",
    "link": "https://www.jobgurus.com.ng/jobs/view/it-manager-manufacturing-job-at-worknigeria",
    "pubDate": "Mon, 16 Jun 2025 14:15:49 GMT",
    "source": "JobGurus",
    "keyword": "worknigeria",
    "duplicate": false,
    "classifications": [],
    "content": "Worknigeria - Our client, a manufacturing and Agro company, is recruiting to fill the position below:\n\nJob Position: IT Manager - Manufacturing\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe IT Manager is responsible for directing the organisation’stechnology operations and strategy to ensure seamless business operations and sustained growth.\n\tThis role involves overseeing IT infrastructure, managing teams, safeguarding data security, and driving technological innovation to achieve business objectives.\n\tThe ideal candidate combines technical expertise with exceptional leadership and strategic vision.\n\n\nResponsibilities\n IT Strategy and Leadership:\n\n\n\tDevelop and execute a comprehensive IT strategy that aligns with organisationalgoals and future growth plans.\n\tAssess emerging technologies and recommend adoption to enhance efficiency and competitive advantage.\n\tServe as a trusted advisor to senior management on IT-related matters and contribute to overall business strategy.\n\n\nInfrastructure and Systems Management:\n\n\n\tOversee the design, deployment, and maintenance of the organisation’sIT infrastructure, ensuring scalability, reliability, and high performance.\n\tEnsure optimal functioning of network systems, hardware, and software across the organisation.\n\tProactively identify and address system vulnerabilities, inefficiencies, and opportunities for improvement.\n\n\nCybersecurity and Risk Management:\n\n\n\tEstablish robust cybersecurity measures to protect organisationalassets, data, and systems from internal and external threats.\n\tDevelop and maintain disaster recovery and business continuity plans to mitigate operational risks.\n\tEnsure compliance with all relevant legal, regulatory, and industry standards.\n\n\nTeam Development and Management:\n\n\n\tLead, mentor, and manage a team of IT professionals, fostering a culture of collaboration, innovation, and accountability.\n\tDefine team goals, monitor performance, and support professional development initiatives.\n\tManage resource allocation and workforce planning to meet project and operational demands.\n\n\nProject and Vendor Management:\n\n\n\tOversee the successful planning and execution of IT projects, ensuring delivery within scope, budget, and timelines.\n\tCollaborate with stakeholders to define project requirements and achieve alignment on objectives.\n\tBuild and maintain relationships with vendors and service providers, negotiating contracts to secure cost-effective, high-qualitysolutions.\n\n\nKey Performance Indicators (KPIs)\n\n\n\tSystem uptime and availability metrics.\n\tCybersecurity incident response time and resolution.\n\tBudget adherence and cost-efficiency improvements.\n\tTeam performance and satisfaction scores.\n\tTimely delivery of IT projects aligned with business objectives.\n\n\nRequirements\n\n\n\tBachelor’s Degree in Information Technology, Computer Science, or a related field (Master’s degree preferred).\n\tMinimum of 8 years of progressive experience in IT leadership roles.\n\tProven track record of successfully managing IT operations, projects, and teams.\n\tExperience in developing and implementing enterprise-wide IT strategies.\n\tDeep expertise in IT infrastructure, networks, cloud computing, and enterprise applications.\n\tStrategic thinking with a results-oriented approach.\n\tStrong knowledge of cybersecurity principles, data protection regulations, and risk management.\n\tProficiency in project management methodologies and tools (e.g., Agile, PMP).\n\tExceptional leadership and team management skills.\n\tExcellent communication and stakeholder management abilities.\n\tStrong analytical, problem-solving, and decision-making capabilities.\n\n\nSalary\nN700, 000 Monthly.\n\nMethod of Application\nInterested and qualified IT Managers with experience in the Manufacturing sector should send their CV to: careers@worknigeria.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Project Manager Job at Smartcity Plc",
    "link": "https://www.jobgurus.com.ng/jobs/view/project-manager-job-at-smartcity-plc",
    "pubDate": "Mon, 16 Jun 2025 14:15:49 GMT",
    "source": "JobGurus",
    "keyword": "smartcity plc",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Smartcity is an investment and Infrastructure development company dedicated to creating modern real estate and infrastructural projects that allows people to live, work and relax in a technologically enabled environment that makes for pleasant and productive living.\n\nWe are recruiting suitable candidates to fill the position below:\n\nJob Position: Project Manager\n\nJob Location: Lagos\nEmployment Type: Full Time\n\nQualifications & Experience\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tBachelor's Degree (BSc, BEng, BTech) in Project Management or related field professional certifications ( PMP, PRINCE2, or Agile/Scrum).\n\t8 - 10+ years experience managing large-scale projects, preferably in real estate, infrastructure, or tech sectors.\n\n\nDesirable:\n\n\n\tExposure to real estate, construction, or urban development environments..\n\tProficient in project tools such as Microsoft Project, Trello, Asana, ClickUp, and Excel.\n\n\nSkills & Competencies:\n\n\n\tLeads project planning, execution, and delivery across timelines, budget, and quality metrics.\n\tDrives alignment between operational strategy and business objectives to ensure measurable outcomes.\n\tEnsures compliance with industry standards, safety regulations, and contractual obligations.\n\tManages cross-functional teams, stakeholder communication, and risk mitigation initiatives.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and a Cover Letter to: recruitment@smartcityplc.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]