[
  {
    "title": "Head of Marketing Job at straitPay",
    "link": "https://www.jobgurus.com.ng/jobs/view/head-of-marketing-job-at-straitpay",
    "pubDate": "Sat, 07 Jun 2025 15:38:07 GMT",
    "source": "JobGurus",
    "keyword": "straitpay",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance"
    ],
    "content": "straitPay is a fin-tech company on a mission to make spending & investing in Africa a lot easier and convenient for anyone interested in Africa. We believe that there is a lot of potential on the African continent, which is why at Straitpay - We believe in Africa. We are a Fin-tech company, on a mission to make spending & investment in Africa a lot easier and convenient for anyone interested in Africa. You can be a part of this exciting journey, and make a difference in the African fintech space.\n\nWe are recruiting to fill the position below:\n\nJob Position: Head of Marketing\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nRole Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are looking for a strategic, creative, and results-oriented Head of Marketing to develop and execute country-specific marketing strategies that align with the overall group objectives.\n\tThis role is critical in building and maintaining straitPay as a strong and recognizable brand.\n\tThe Head of Marketing will be responsible for managing both digital and offline marketing campaigns, driving growth in key products, leading a talented marketing team, and ensuring effective communication of our brand message.\n\n\nKey Responsibilities\nStrategy:\n\n\n\tDevelop a comprehensive marketing strategy for straitPay; with a major focus on the African market.\n\tDefining straitPay's marketing and sales budget and expenditure (budget allocation and spend).\n\n\nBranding:\n\n\n\tEnsuing that there’s a standardized and recognizable logo.\n\tEnsuring that the company has brand guidelines and that anyone working on creatives internally and externally adheres to: the colors, logo placement, brand tone.\n\tControlling when, how and where the company's merchandise is deployed.\n\tDefining and managing the brand communication strategy using a variety of channels.\n\tOwning the development and messaging of the brand narrative.\n\tCreating, executing, and managing marketing programs and campaigns.\n\tStaying current on market trends and competitive activity.\n\n\nCorporate Communication:\n\n\n\tControlling the narrative and ensuring there’s consistency in brand tone in internal and external communications.\n\tDeveloping and implementing marketing and communications campaigns and strategies and monitoring their success\n\tDefining KPIs for each communications channel which will indicate a campaign's level of success\n\tDetermining strategic communications campaigns that will help further organizational goals\n\tCreating internal communications protocols and initiatives that will foster employee morale\n\tOverseeing the creation of marketing and communications collateral to ensure that it is consistent with the organization's brand, including white papers, website copy, and more\n\tWriting and delivering internal newsletter on a monthly basis\n\tRepresenting the organization at events and press conferences\n\tReaching out to influencers, media and beyond in order to arrange story placement on a national and global level.\n\n\nDigital Marketing & Content Creation:\n\n\n\tCollaborating with internal teams to create landing pages and optimize user experience.\n\tPlanning and executing all web, SEO/SEM, database marketing, email, social media, and display advertising campaigns.\n\tDesigning, building, and maintaining the company's social media presence.\n\tMeasuring and reporting performance of all digital marketing campaigns and assessing against goals ROI and KPIs).\n\tIdentifying trends and insights and optimizing spend and performance based on insights.\n\tUtilizing strong, analytical ability to evaluate end-to-end customer experience across multiple channels and customer touch points.\n\tIdentifying critical conversion points and drop off points and optimizing user funnels.\n\tBrainstorming new and creative growth strategies through digital marketing.\n\tPlanning, executing, and measuring experiments and conversion tests.\n\tCollaborating with agencies and other vendor partners.\n\tEvaluating emerging technologies.\n\n\nPublic Relations:\n\n\n\tCommissioning or undertaking relevant market research.\n\tPlanning publicity strategies and campaigns.\n\tWriting and producing presentations and press releases.\n\tDealing with enquiries from the public, the press, and related organisations.\n\tOrganising and attending promotional events such as press conferences, open days, exhibitions, tours and visits.\n\tSpeaking publicly at interviews, press conferences and presentations.\n\tProviding management and investors with information about new promotional opportunities and current PR campaigns progress.\n\tAnalysing media coverage.\n\tLiaising with investors, managerial and journalistic staff about budgets, timescales and objectives.\n\n\nTeam Leadership & Collaboration:\n\n\n\tLead, mentor, and motivate a high-performing marketing team.\n\tFoster a collaborative working environment with other departments to ensure the successful implementation of marketing strategies.\n\tManage external vendors and partners to ensure high-quality execution of marketing campaigns.\n\n\nQualifications & Experience\n\n\n\tCandidates should possess relevant qualifications in a related field.\n\t8 - 10 years of experience in marketing, with a strong focus on the Fintech, and financial services sector.\n\tProven track record in developing and executing successful marketing strategies/campaigns.\n\tStrong experience in brand management, digital marketing, content creation.\n\tExcellent communication and interpersonal skills, with the ability to engage effectively with internal and external stakeholders.\n\tStrong understanding of public relations and media management.\n\tA results-driven mindset with a focus on ROI and measurable outcomes.\n\n\nDesired Skills:\n\n\n\tExperience in the fintech or financial services industry is highly preferred.\n\tA deep understanding of digital marketing tools and platforms (social media, Search Engine Optimization - SEO, Search Engine Marketing - SEM, email marketing, etc.).\n\tAbility to think creatively and strategically to drive growth and brand awareness.\n\tAbility to independently come up with new ideas, develop strategies, and take initiative to execute them.\n\tStrong analytical skills with the ability to assess campaign performance and adjust strategies as needed.\n\tProven experience managing events and building partnerships to enhance brand presence.\n\n\nWhy Join Us?\n\n\n\tCompetitive compensation and benefits.\n\tBe part of a fast-growing fintech transforming financial access in Africa.\n\tWork in a dynamic and innovative environment with global exposure.\n\tA mission-driven company where your work directly contributes to empowering Africans worldwide.\n\tJoin us and play a key role in building a compliant and trusted financial ecosystem!\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Bancassurance Executive Job at Dunn And Braxton Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/bancassurance-executive-job-at-dunn-and-braxton-limited-4",
    "pubDate": "Sat, 07 Jun 2025 15:38:07 GMT",
    "source": "JobGurus",
    "keyword": "dunn and braxton limited",
    "duplicate": false,
    "classifications": [],
    "content": "Dunn And Braxton Limited - Our client, a leading Financial firm, is recruiting to fill the position below:\n\nJob Position: Bancassurance Executive\n\nJob Locations: Port Harcourt - Rivers, Uyo - Akwa Ibom, Owerri - Imo, Asaba & Warri - Delta, Benin - Edo and Awka - Anambra\nEmployment Type: Contract\n\nJob Summary\n\n\n\tThe Bancassurance Executives act as the Company’s representatives in identifying business opportunities (Sales of Life and General Insurance Products) within designated partner bank branches closest to their homes.\n\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tEstablish, maintain, and grow relationships with Branch employees and customers.\n\tSolicit new clients, and grow prospective/existing clientele.\n\tHandles activities that involve reporting, planning, and administration.\n\tConducts market analysis activities, which include branch/client profiling and surveys on competitor products.\n\tAttends the District/Region’smonthly/quarterly meetings.\n\n\nRequirements\nExperience/Qualification:\n\n\n\tFirst-degree or equivalent education\n\tMinimum of 2 years of post NYSC work experience with at least 1 year of experience in Insurance Sales.\n\n\nSkills:\n\n\n\tTeam player\n\tGood oral and written communication skills\n\tGood interpersonal skills\n\tExcellent Grooming\n\tAdaptability, Flexibility, and Tenacity\n\n\nBenefits\n\n\n\tN136,000 Monthly Net + Commission + Other Benefits\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to:  recruitment@dunnandbraxton.com using the Job Position and Location as the subject of the mail. E.g: \"Bancassurance Executive - Port Harcourt\".    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Operational Specialist Job at Felton Energy Services Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/operational-specialist-job-at-felton-energy-services-limited",
    "pubDate": "Sat, 07 Jun 2025 15:38:07 GMT",
    "source": "JobGurus",
    "keyword": "felton energy services limited",
    "duplicate": false,
    "classifications": [],
    "content": "Felton Energy Services Limited (FESL) is an indigenous oil & gas procurement, operation and maintenance company in Nigeria. The company was established to supply global customers with Electrical, Mechanical, Industrial and Engineering Products, on time and at the most competitive prices. FESL has unrivalled commitment to the Oil & Gas Industry and has gained support of the leading manufacturers which ensures our solutions are at the forefront oftoday’s technology.\n\nWe are recruiting to fill the position below:\n\nJob Position: Operational Specialist\n\nJob Location: Port Harcourt, Rivers\n\nAbout the Role\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking highly experienced Operational Specialist to support the delivery of job instructions, simulation-based training, and competency development for both new and experienced senior operations personnel.\n\tThis is a strategic role requiring a high level of technical knowledge, instructional capability, and operational experience to drive excellence in plant operations and workforce development.\n\tThe Company is a Gas Manufacturing Company engaged in the production of Liquefied Natural Gas. It is a business based in Bonny Island, Rivers State, Nigeria.\n\n\nKey Responsibilities\nTraining & Instructional Delivery:\n\n\n\tDeliver job instructions and plant-specific operational training to operations personnel in alignment with the NLNG Operations Assessment and Progression scheme.\n\tConduct simulation-based training and assessments to build and validate critical operational competencies.\n\tDevelop learning materials, manuals, and structured on-the-job training guides.\n\tProvide coaching and mentoring to operations personnel, fostering safe and efficient plant operations.\n\n\nOperations Competency Development:\n\n\n\tEvaluate technical proficiency and readiness of personnel for progression to higher roles, including Field Operators and Console Operators.\n\tDevelop tailored development plans for operators, based on individual performance assessments and progression requirements.\n\tEnsure competency development aligns with organizational standards, best practices, and HSE requirements.\n\n\nPlant Operations Support:\n\n\n\tProvide subject matter expertise in LNG processing plant operations, including startup, shutdown, emergency handling, and routine operations.\n\tSupport the standardization of operational procedures and best practices across teams.\n\tCollaborate with technical teams to integrate operational feedback into plant reliability and performance improvements.\n\n\nPerformance Monitoring & Reporting:\n\n\n\tTrack progress of personnel competency development and prepare performance reports for management.\n\tMaintain detailed records of training activities, simulations, and progression evaluations.\n\tSupport audits and reviews related to training and competence assurance.\n\n\nRequired Qualifications\n\n\n\tHND/Bachelor’s Degree in Chemical Engineering, Process Engineering, or related discipline.\n\tRelevant certifications in instructional delivery, operations training, or LNG plant operations are a strong advantage.\n\n\nRequired Experience:\n\n\n\tMinimum of 10 –15 years of operational experience in the LNG industry.\n\tProven experience in both Field Operations and Console (DCS) roles.\n\tPrior experience delivering training or mentoring in an industrial operations environment is a strong advantage.\n\n\nDesired Skills & Competencies:\n\n\n\tStrong instructional and facilitation skills in technical and operational training.\n\tAbility to evaluate and build competencies in a structured, measurable manner.\n\tExcellent communication, coaching, and interpersonal skills.\n\tProficiency in developing and using simulation tools for operations training.\n\tStrong commitment to safety, process discipline, and continuous improvement.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: wendy@feltonenergy.net using \"Operations Specialist\" as the subject of the email.\n\nNote: Be sure to attach all relevant certifications and indicate your desired daily pay rate.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Quality Control & Compliance Officer Job at Toasties Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/quality-control-compliance-officer-job-at-toasties-limited",
    "pubDate": "Sat, 07 Jun 2025 15:38:07 GMT",
    "source": "JobGurus",
    "keyword": "toasties limited",
    "duplicate": false,
    "classifications": [],
    "content": "Toasties Limited is a fast-casual dining restaurant chain located in Lagos, Nigeria. We specialize in hot toasted fusion sandwiches and offer a range of specials. Our focus is to bring out-of-the-box meal selections to Lagos’ on-the-go consumer. Using quality ingredients and efficient service, Toasties aims to put variety, creativity and great tasting products in the hands of every customer!\n\nWe are recruiting to fill the position below:\n\nJob Position: Quality Control & Compliance Officer\n\nJob Location: Ikoyi, Lagos\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tQuality Assurance: Regularly monitor food preparation and presentation to ensure consistency, taste, and quality meet restaurant standards.\n\tCompliance Monitoring: Ensure that all operations, from kitchen procedures to customer service, comply with local, state, and federal health and safety regulations.\n\tHealth & Safety Standards: Conduct routine audits to verify food safety practices (temperature control, storage, handling, sanitation) and ensure compliance with food safety certifications and regulations\n\tTraining & Development: Provide training and ongoing support to staff on quality control processes, food safety, and health regulations.\n\tProcess Improvement: Identify opportunities for improving food quality, service consistency, and operational efficiency, and collaborate with management to implement changes.\n\tSupplier Compliance: Ensure that all vendors and suppliers meet the restaurant's quality and compliance standards, including food sourcing and delivery practices.\n\tRecord Keeping & Documentation: Maintain accurate records of inspections, audits, and compliance-related activities for reporting and traceability.\n\tCustomer Feedback: Monitor guest feedback related to food quality and service to identify areas for improvement and ensure customer satisfaction.\n\tCrisis Management: Address any quality-related issues or food safety incidents promptly and effectively, working to resolve problems and prevent future occurrences.\n\n\nQualifications\n\n\n\tProven experience in quality control, compliance, or food safety roles, preferably within the restaurant or food service industry.\n\tStrong knowledge of food safety regulations, health codes, and quality control standards (e.g., HACCP, ServSafe).\n\tExcellent attention to detail with the ability to identify areas for improvement and take corrective actions.\n\tStrong communication skills to effectively train staff and communicate with management and external agencies.\n\tAbility to perform audits, inspections, and assessments with a focus on continuous improvement.\n\tAbility to work independently and as part of a team in a fast-paced environment.\n\tStrong organizational and time-management skills with the ability to manage multiple tasks simultaneously.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hr@biscuitboneblog.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Restaurant Support Team Member Job at Toasties Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/restaurant-support-team-member-job-at-toasties-limited",
    "pubDate": "Sat, 07 Jun 2025 15:38:07 GMT",
    "source": "JobGurus",
    "keyword": "toasties limited",
    "duplicate": false,
    "classifications": [],
    "content": "Toasties Limited is a fast-casual dining restaurant chain located in Lagos, Nigeria. We specialize in hot toasted fusion sandwiches and offer a range of specials. Our focus is to bring out-of-the-box meal selections to Lagos’ on-the-go consumer. Using quality ingredients and efficient service, TOASTIES aims to put variety, creativity and great tasting products in the hands of every customer!\n\nWe are recruiting to fill the position below:\n\nJob Position: Restaurant Support Team Member\n\nJob Location: Ikoyi, Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are looking for a dynamic Restaurant Support Team Memberto join our team and play a key role in delivering exceptional dining experiences.\n\tYou will support both front-of-house and kitchen operations, assisting with customer service, food preparation, and ensuring cleanliness and high standards of quality throughout the restaurant.\n\tYour attention to detail, passion for quality, and commitment to freshness will be vital in maintaining the high standards that our guests expect and our restaurant is known for.\n\n\nKey Responsibilities\n\n\n\tCustomer Service: Provide outstanding service to guests, ensuring a welcoming, friendly, and professional dining experience.\n\tKitchen Support: Assist with food preparation, cooking, and maintaining cleanliness in the kitchen, adhering to food safety standards.\n\tQuality & Safety: Uphold high standards of food quality, taste, and food safety to ensure each dish meets restaurant specifications.\n\tTeam Collaboration: Work closely with both front-of-house and kitchen teams to ensure smooth operations, efficient service, and a positive dining experience for customers.\n\tCleanliness & Maintenance: Ensure all areas of the restaurant, including dining spaces, kitchen, and restrooms, are clean, organized, and well-maintained at all times.\n\tTimely Service: Assist in ensuring that orders are prepared and delivered to guests in a timely and efficient manner, with attention to detail.\n\n\nQualifications\n\n\n\tPrevious experience in food service or restaurant operations.\n\tStrong communication and interpersonal skills, with the ability to provide excellent customer service.\n\tAbility to work efficiently in a fast-paced environment while maintaining attention to detail.\n\tKnowledge of basic food safety practices and the ability to maintain cleanliness in the kitchen.\n\tPositive attitude, reliability, and ability to work well with others.\n\tFlexibility to assist in different areas of the restaurant as needed.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hr@biscuitboneblog.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]