[
  {
    "title": "Chief Accountant Job at Allen Professional Services",
    "link": "https://www.jobgurus.com.ng/jobs/view/chief-accountant-job-at-allen-professional-services",
    "pubDate": "Wed, 04 Jun 2025 11:13:34 GMT",
    "source": "JobGurus",
    "keyword": "allen professional services",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Allen Professional Services - Our client, a Fast Foods Restaurant Chain, is recruiting to fill the position below:\n\nJob Position: Chief Accountant\nJob Location: Owerri, Imo\nEmployment Type: Full-time\n\nOverview\n\n\n\tThe chief accountant coordinates the bookkeeping and accounting functions of the company.\n\tHe oversees the maintenance of all financial records of the company.\n\tHe oversees the development and achievement of the company’s budgets and financial plans.\n\n\nKey Roles and Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tPrepare and manage monthly, quarterly, and annual budgets for the business.\n\tPerform general accounting activities, including preparation, maintenance, and reconciliation of ledger accounts and financial statements such as balance sheets, profit and loss statements, cash flow statements, capital expenditure schedules, and the production of management reports for the company.\n\tManage the cash and banking activities of the company.\n\tProvide management controls for procurement and expenditure.\n\tEstablish and implement processes for reconciliation of bank statements and financial records.\n\tManage tax reporting and inventory processing.\n\tPrepare weekly and monthly financial reports.\n\tSupport preparation of year-end and statutory accounts.\n\tPrepare audit files and statutory accounts in accordance with regulatory requirements.\n\n\nQualifications\n\n\n\tBachelor’s degree in accounting or related field.\n\tA minimum of five (5) years of experience in an accounting position in the food or hospitality industry.\n\tProfessional accounting qualifications such as ACCA, ICAN, ICMA, ACA, etc.\n\tHigh proficiency in the use of Ms. Excel.\n\tStrong analytical and managerial skills.\n\tStrong verbal and written communication skills.\n\n\nMethod of Application\nInterested and qualified candidates should send their recent CV to: recruitmentservices@allen.ng using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Restaurant Manager Job at Allen Professional Services",
    "link": "https://www.jobgurus.com.ng/jobs/view/restaurant-manager-job-at-allen-professional-services",
    "pubDate": "Wed, 04 Jun 2025 11:13:34 GMT",
    "source": "JobGurus",
    "keyword": "allen professional services",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Allen Professional Services - Our client is a fast food chain based in the Southeast region with its head office in Owerri, Imo State.\n\nThey are recruiting to fill the position below:\n\nJob Position: Restaurant Manager\n\nJob Location: Owerri, Imo\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe restaurant manager oversees the day-to-day operation of an outlet.\n\tHe supervises a set of outlet workers to ensure that the outlet operations are running smoothly in line with the company’s objectives.\n\tHe ensures that the sales and operations plans of the outlet are delivered.\n\tHe ensures that the outlet operates within the company’s policies and procedures to provide the most satisfactory services to customers.\n\n\nKey Roles and Responsibilities\n\n\n\tOversee the daily operations of the outlet for efficient operations.\n\tPlan and assign daily workloads to outlet associates.\n\tDevelop and enforce established policies and procedures.\n\tObtain customer feedback and recommend necessary outlet operational changes.\n\tSchedule orientations and job trainings for outlet associates.\n\tOrganize regular meetings to discuss issues and updates.\n\tEstablish operational strategies to meet quality and customer service standards.\n\tDevelop marketing strategies to improve sales and profitability.\n\tMaintain the outlet facility clean and safe.\n\tAnalyze and resolve problems in a timely and accurate manner.\n\tOrganize special events and entertainment to attract more customers.\n\tAddress customer queries courteously and ensure customer satisfaction.\n\tDevelop a cost-effective operational plan to achieve outlet goals.\n\tAssist in cash handling activities and develop expense and revenue reports.\n\n\nQualifications\n\n\n\tFirst Degree in Food Science & Technology, Catering, or related fields.\n\tA minimum of five (5) years of relevant work experience in a food services organization.\n\tHighly experienced in food products and services.\n\tSound logistics management, business operations, and financial knowledge.\n\tStrong managerial skills with a proven track record in delivering targets and efficiencies.\n\tFluency in English is essential, with superior oral and written communication skills.\n\n\nMethod of Application\nInterested and qualified candidates should send their recent CV to: recruitmentservices@allen.ng using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]