[
  {
    "title": "Sales Representative Job at Virgin Beauty industries Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/sales-representative-job-at-virgin-beauty-industries-limited",
    "pubDate": "Fri, 27 Jun 2025 17:40:24 GMT",
    "source": "JobGurus",
    "keyword": "virgin beauty industries limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Virgin Beauty industries Limited, is a leading company in the beauty industry in Nigeria. We offer exceptional products for hair and skin solutions. Our goal is to meet customers beauty needs and keep their hair nourished with our organically sourced materials.\n\nWe are recruiting to fill the position below:\n\nJob Position: Sales Representative\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tEngage in promotion and sales of all company’s products\n\tMaintain a positive attitude and focus on customer satisfaction in a fast-paced environment.\n\tReach out to new prospects and maintain relationship with existing customers\n\tEngage in receipt of cash payments and credit sales\n\tBe knowledgeable about the product and answer questions about the product.\n\tIdentify prospective customers, lead generation and conversion.\n\tAnalyze territory/market potential and supply reports on customer needs\n\tKeep sales records and summary report\n\tMaintain contact lists and follow up with customers to continue relationships.\n\tEmphasize the features of products to highlight how they solve customers’ needs/ problems.\n\n\nRequirements\n\n\n\tCandidates should possess an OND / HND / B.Sc Degree with 1 - 2 years of work experience.\n\n\nMethod of Application\n\nInterested and qualified candidates should send their CV to: virginbeauty359@gmail.com using the Job Position as the subject of the email.\n\nNote: Only qualified candidates will be considered.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Marketer Job at Virgin Beauty industries Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/marketer-job-at-virgin-beauty-industries-limited",
    "pubDate": "Fri, 27 Jun 2025 17:40:24 GMT",
    "source": "JobGurus",
    "keyword": "virgin beauty industries limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Virgin Beauty industries Limited is a leading company in the beauty industry in Nigeria. We offer exceptional products for hair and skin solutions. Our goal is to meet customers beauty needs and keep their hair nourished with our organically sourced materials.\n\nWe are recruiting to fill the position below:\n\nJob Position: Marketer\n\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\n\nJob Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tPlan advertising and promotional campaigns for products and services on variety of media (social, print etc.)\n\tLiaise with stakeholders and vendors to promote success of activities and enhance the company’s presence.\n\tPrepare content for the publication of marketing material and oversee distribution.\n\tTo chase and analyze the reasons for failure to turn an enquiry into a new order\n\tProducing a brand style guide that best capture the company or client’s voice and mission\n\tOrganize and attend marketing activities or events to raise brand awareness.\n\tContribute in the implementation of marketing strategies.\n\tResearching previous successful campaign to understand what worked, what didn’t and what can be improved.\n\tConducting market research to determine a target audience’s needs, wants, habits, interests and other relevant factors used in creating targeted marketing campaigns.\n\tWorking with other members of sales or marketing team to plan, make sales, execute and monitor a successful marketing campaign.\n\n\nRequirements\n\n\n\tCandidates should possess relevant qualifications with 3 - 5 years of experience.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and Cover Letter to: virginbeauty359@gmail.com using the Job Position as the subject of the email.\n\nNote: Only qualified candidates will be considered.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Openings at Updeal Resources",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-updeal-resources",
    "pubDate": "Fri, 27 Jun 2025 17:40:24 GMT",
    "source": "JobGurus",
    "keyword": "updeal resources",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Updeal Resources is recruiting suitably qualified candidates to fill the following positions below:\n\n1.) Experienced Accountant\n\nJob Location: Lagos\n\nJob Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tOverseeing the preparation of management accounts and periodic financial reports to support strategic decision-making.\n\tMonitoring and evaluating the financial performance of all organizational profit centres, identifying trends and advising on improvements.\n\tEnsuring compliance with financial reporting standards and strict adherence to reporting deadlines.\n\tMaintaining comprehensive financial records and implementing efficient document management systems.\n\tProviding high-level bookkeeping and advisory services to clients across various sectors.\n\tSupervising accounts receivable, accounts payable, and payroll processes to ensure accuracy and efficiency.\n\tAdvising on and ensuring compliance with federal, state, and local regulatory requirements.\n\tConducting detailed analysis of clients’ financial records, identifying discrepancies, and implementing corrective actions.\n\tReviewing and approving bank and other reconciliation statements to ensure integrity of financial data.\n\tOverseeing the proper recording and classification of all issued and received invoices to ensure completeness and accuracy of accounting records.\n\n\nRequirements\n\n\n\tBachelor’s Degree in Accounting, Finance, or any related field.\n\tMinimum of 3 years of accounting experience.\n\tMust be a Chartered Accountant\n\tWorking knowledge of basic accounting principles and practices.\n\tWorking knowledge of relevant state, federal, and local regulations.\n\tProficiency in MS Office and popular accounting software.\n\n\nMethod of Application\nInterested and qualified candidates should send their Cvs to: updealcareers@gmail.com using \"Experienced Accountant\" as the subject of the mail.\n\n \n\n \n\n2.) Tax Associate\n\nJob Location: Ikeja, Lagos\n\nJob Summary\n\n\n\tAs a Tax Associate, you will play a pivotal role in managing the tax-related responsibilities for our esteemed clients.\n\tYou will be responsible for preparing and filing tax returns, ensuring strict compliance with tax laws, identifying opportunities for tax optimization, and supporting clients during audits.\n\tYour role also involves conducting thorough tax research, assisting in tax planning, and maintaining accurate financial records.\n\tSuccess in this position requires strong analytical skills, meticulous attention to detail, and proficiency in tax software.\n\n\nResponsibilities\n\n\n\tTax Preparation: Accurately prepare and file tax returns for individuals, businesses, and organizations while adhering to applicable regulations.\n\tTax Compliance: Ensure clients’ adherence to local, state, and federal tax laws, avoiding penalties and maintaining compliance standards.\n\tTax Research: Conduct detailed research on tax-related issues, enabling tailored advice and solutions for client challenges.\n\tTax Planning: Assist in developing tax strategies to minimize liabilities and optimize financial results for clients.\n\tAudit Support: Provide clients with comprehensive assistance during tax audits and disputes, including documentation preparation and interaction with tax authorities.\n\tRecord Maintenance: Maintain detailed and organized financial records to support tax filings and audits.\n\tClient Communication: Clearly explain tax strategies, obligations, and potential financial opportunities to clients, fostering strong relationships.\n\tCollaborative Engagement: Work collaboratively with senior associates, managers, and other teams to address complex tax scenarios and ensure seamless service delivery.\n\n\nEducation and Experience\n\n\n\tA Bachelor's Degree in Accounting or a related field, with a minimum of second-class Upper Division.\n\t1 - 3 years of practical experience in tax or accounting, preferably with one of the foremost professional services firms.\n\tMembership in a relevant professional body (e.g., ACA or ACCA) or possession of additional professional qualifications is an added advantage.\n\tSolid knowledge of accounting principles, tax regulations, and auditing standards.\n\tProficiency in Microsoft Office tools and accounting software.\n\tStrong analytical, communication, and organizational skills, with exceptional attention to detail.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: updealcareers@gmail.com using the Job Position as the subject of the email.\n\n \n\n \n\n3.) Audit Associate\n\nJob Location: Ikeja, Lagos\n\nResponsibilities\n\n\n\tAssist in planning and executing internal audits, including operational, financial, and compliance audits across different departments and branches.\n\tPerform audit testing and document audit procedures in accordance with audit programs.\n\tAnalyze business processes and identify control weaknesses, risks, and opportunities for process improvement.\n\tPrepare clear and concise audit documentation and reports outlining audit findings and recommendations.\n\tFollow up on previous audit findings and ensure corrective actions have been implemented.\n\n\nRequirements\n\n\n\tBachelor's Degree in Accounting, Finance, Business Administration, or a related field.\n\t0 - 2 years of relevant audit or accounting experience; prior experience in logistics or supply chain is a plus.\n\tStrong analytical and problem-solving skills.\n\tProficiency in Microsoft Excel and audit/accounting software.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: updealcareers@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Openings at Macden Communications Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-macden-communications-limited-1",
    "pubDate": "Fri, 27 Jun 2025 17:40:24 GMT",
    "source": "JobGurus",
    "keyword": "macden communications limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Macden Communications Limited was set up in the year 2012 and it was set up for the purpose of logistics, supply chain and distribution.\n\nWe are recruiting to fill the following positions below:\n\n1.) Assistant Manager\n\nJob Location: Ogun\nEmployment Type: Full-time\n\nResponsibilities\n\n\n\tSupervision and leadership\n\tOperational management\n\tCustomer services\n\tAdminstrative tasks\n\tFnancial oversight\n\tGoal achievement\n\tTraining and development\n\tProblem solving\n\n\nRequirements\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tCandidates should possess an OND / HND / B.Sc with 3 - 5 years of work experience. \n\tInterested applicants are to apply from within Sagamu and its environs.\n\n\nSalary\nN75,000 - N80,000 Monthly.\n\nApplication Closing Date: 25th July, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: patricia_asemota@yahoo.com using the Job Position as the subject of the email.\n\nNote \n\n\n\tFor further inquiries, Call: 09063461304.\n\tThe working hours and days are from Mondays to Saturdays from 8am to 6pm and on public holidays.\n\n\n \n\n \n\n2.) Empties / Inventories Manager\n\nJob Location: Sagamu, Ogun\nEmployment Type: Full-time\nWorking Hours: Mondays to Saturdays from 8am to 6pm and also on public holidays\n\nJob Summary\n\n\n\tOversees the flow of products in and out of a business\n\tEnsures accurate stock levels and efficient inventory control\n\tDeveloping and implementing inventory tracking system\n\tCoordinating with suppliers for timely delivery of goods\n\tReceiving, storing and issuing inventory as per supply chain processes, data analysis and reporting, inventory management, quality control.\n\n\nRequirements\n\n\n\tInterested candidates should possess a minimum of OND qualification.\n\n\nSalary\nN55,000 - N60,000 per month. \n\nApplication Closing Date: 30th June, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: patricia_asemota@yahoo.com using the Job Position as the subject of the email.\n\nNote: For inquiries, Call: 09063461304.\n\n \n\n3.) Truck Driver\n\nJob Location: Ogba, Lagos\nEmployment Type: Full-time\n\nResponsibilities\n\n\n\tSafely transporting goods and materials to given locations.\n\tLoading and unloading.\n\tSafety compliance.\n\tVehicle maintenance.\n\tDocumentation.\n\tCustomer Interaction.\n\n\nRequirements\n\n\n\tCandidates should possess relevant qualifications with experience.\n\n\nSalary\nN45,000 - N50,000 / Month.\n\nApplication Closing Date: 30th June, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: patricia_asemota@yahoo.com using the Job Position as the subject of the email.\n\nNote: For inquiries, Call: 09063461304.\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Full Stack WordPress Developer Job at Kumesoft Technology",
    "link": "https://www.jobgurus.com.ng/jobs/view/full-stack-wordpress-developer-job-at-kumesoft-technology-1",
    "pubDate": "Fri, 27 Jun 2025 17:40:24 GMT",
    "source": "JobGurus",
    "keyword": "kumesoft technology",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Software Engineering"
    ],
    "content": "Kumesoft Technology - We are a growing digital marketing agency with a strong focus on SEO. Our mission is to help businesses grow by providing customized, results-driven SEO services that increase visibility, drive traffic, and boost conversions. Starting with high-demand markets, we offer country-specific SEO strategies (e.g., “Local SEO in Nigeria,” “Local SEO in Canada”) to meet the unique needs of each region. As we build our client base and revenue, we plan to expand into PPC, social media, and content marketing.\n\nOur vision is to become a globally recognized SEO agency known for delivering high-quality, tailored solutions. Join us as we grow and shape the future of digital marketing.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Full Stack WordPress Developer\nJob Location: Remote\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe are looking for a highly skilled and experienced Full Stack WordPress Developer to join our team.\n\tThe ideal candidate is a tech-savvy professional with deep expertise in WordPress development, front-end and back-end programming, server management, SEO, and automation.\n\tYou will be responsible for building, customizing, and maintaining high-performance WordPress websites, ensuring optimal user experiences, performance, and security.\n\n\nKey Responsibilities\n\n\n\tDesign and develop fully responsive WordPress websites from concept to launch\n\tCreate custom WordPress themes and plugins tailored to project requirements\n\tTransform Figma designs and wireframes into fully functional WordPress sites\n\tUtilize page builders such as Elementor, WP Bakery, Divi, Bricks, and Gutenberg\n\tImplement dynamic content using ACF and Crocoblock\n\tManage cPanel/WHM, phpMyAdmin, FTP, and other hosting/server environments\n\tPerform manual site migrations and cloning, including database and file transfers\n\tOptimize website performance through caching, image compression, and best practices\n\tImplement robust security measures to prevent hacks, malware, and vulnerabilities\n\tSet up and manage WooCommerce stores including payment gateway integrations\n\tHandle SEO strategy, PPC campaign setup, and implementation of tracking pixels\n\tBuild automated workflows including email (segmentation, tagging), SMS, booking systems, and more\n\tLeverage AI tools for content generation, design ideation, and workflow optimization\n\tDebug, troubleshoot, and resolve site errors and performance issues\n\tDocument development processes and provide regular progress updates to stakeholders\n\n\nRequired Skills & Qualifications\n\n\n\tProven experience as a Full Stack WordPress Developer (minimum 3+ years)\n\tAdvanced proficiency in HTML5, CSS, JavaScript, PHP, AJAX, and Python\n\tYou must know how to write and use custom codes in some cases ( VERY IMPORTANT! )\n\tStrong knowledge of WordPress architecture, database management, and API integration\n\tExperience with automation tools and techniques (email marketing, booking systems, etc.)\n\tSkilled in SEO and PPC campaign management\n\tProficiency with WordPress white labeling and plugin management\n\tKnowledgeable in transforming designs from Figma to WordPress\n\tHands-on experience with website performance optimization\n\tStrong grasp of security best practices in WordPress development\n\tFamiliarity with AI tools for development and marketing enhancement\n\tStrong communication skills and a commitment to clearly documenting work\n\n\nNice to Have:\n\n\n\tExperience with Git version control\n\tFamiliarity with other CMS platforms (Shopify, Webflow, Wix Studio, Framer, e.t.c)\n\tUX/UI design sensibility\n\tAbility to handle multiple projects simultaneously.\n\n\nWhat We Offer\n\n\n\tSalary: N100,000 - N180,000 Monthly.\n\tCompetitive, based on experience.\n\tFlexible remote work\n\tCollaborative team environment\n\tOpportunities for skill development and growth\n\tAccess to premium tools and resources\n\tCompetitive compensation (Data).\n\n\nMethod of Application\nInterested and qualified candidates should send their Resume, portfolio, and a brief cover letter highlighting their relevant experience to: idoho.linksmanagement@gmail.com using “Full Stack WordPress Developer” as the subject of the mail.\n\nNote\n\n\n\tPlease only apply if you are a full-stack WordPress developer. If you only have WordPress experience (not full-stack), do not falsely edit your CV to claim full-stack expertise, as this will lead to a quick termination of the interview process\n\tWe look forward to hearing from you!\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]