[
  {
    "title": "Digital Marketing / Social Media Officer Job at Davruna Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/digital-marketing-social-media-officer-job-at-davruna-group",
    "pubDate": "Mon, 09 Jun 2025 13:50:12 GMT",
    "source": "JobGurus",
    "keyword": "davruna group",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Davruna Group, a Real Estate & E-commerce company, is recruiting to fill the position below:\n\nJob Position: Digital Marketing / Social Media Officer\nJob Location: Ikeja, Lagos (Hybrid Role)\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tAre you a creative and experienced Digital Marketer with a passion for driving online visibility and engagement?\n\tWe’re looking for a Digital Marketing/Social Media Officer to join our dynamic team at Davruna Group, a growing real estate and e-commerce brand in Lagos.\n\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDevelop and execute engaging social media campaigns across platforms (Instagram, Facebook, TikTok, LinkedIn).\n\tCreate high-quality video content and handle video editing for promotional and product-related content.\n\tDesign eye-catching graphics to support marketing efforts.\n\tExecute email marketing strategies that resonate with our audience.\n\tManage and optimize Google Ads, Facebook/Instagram Ads, LinkedIn Ads, and TikTok promotions.\n\tLead and monitor PPC campaigns to drive traffic and conversion.\n\tCraft compelling content and marketing strategies aligned with our brand goals.\n\tAnalyze performance metrics and optimize campaigns for better ROI.\n\n\nRequirements\n\n\n\tProven experience in digital marketing and social media management.\n\tProficiency in tools like Canva, Adobe Premiere Pro/CapCut, Meta Ads Manager, Google Ads, Mailchimp, etc.\n\tStrong portfolio of past campaigns, video content, or social media projects.\n\tExcellent communication and creative thinking skills.\n\tMust be Lagos-based and able to work in a hybrid capacity.\n\n\nSalary\nN150,000 - N200,000 per month.\n\nMethod of Application\nInterested and qualified candidates should submit their CV and portfolio to: blessingofelix@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]