[
  {
    "title": "Job Openings at Rimdinado International Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-rimdinado-international-limited",
    "pubDate": "Tue, 01 Jul 2025 10:45:55 GMT",
    "source": "JobGurus",
    "keyword": "rimdinado international limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Rimdinado International Limited - We are a global brand, leveraging on technology and changing business conditions to provide cutting edge solutions to our communities.We provide human capital management,Organizational design and development and business process management consulting services for our wide range local and international clientele.\n\nWe are recruiting to fill the following positions below:\n\n1.) Head, Internal Audit\n\nJob Location: Abuja\nEmployment Type: Full-time\nIndustry: Mortgage Bank\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe candidate is responsible to the Audit committee of the Board. He/she is charged with the mandate to ensure quarterly audit of and report on all activities of Mortgage Bank in accordance with acceptable audit standards and approved audit procedures.\n\n\nKey Performance\n\n\n\tProfessionalism and integrity\n\tDeadline oriented. Dependability, requiring minimum supervision\n\tStrong leadership and people management skills\n\tSound strategic thinking, with risk and control consciousness\n\tStrong analytic skills\n\tExcellent communication skills: written and oral\n\n\nQualification & Experiences\n\n\n\tBachelor's degree or its equivalent in Business, Accounting, Finance, Economics or related area of study\n\t8-15 years work experience in audit and internal control in banking sector essential\n\tAt least 4 years in management position\n\tProfessional certification in accountancy (ACA, ACCA)\n\n\nRequired Knowledge:\n\n\n\tPossession of extensive experience in auditing, and a thorough understanding of Microfinance Banking and accounting practices\n\tExperienced in strategic planning and management.\n\n\nMethod of Application\nInterested and qualified candidates should submit their CV to: rimdinado@gmail.com using the Job Position as the subject of the mail.\n\n \n\n \n\n2.) Medical Laboratory Manager\n\nJob Location: Abuja (FCT) \nEmployment Type: Full-time\nDepartment: Pathology Laboratory\nReports To: Head of Laboratory Operations\n\nPosition Summary\n\n\n\tThe Medical Laboratory Manager is responsible for the overall management, coordination, and supervision of laboratory operations to ensure high standards of quality, efficiency, and compliance.\n\tThis role combines leadership with hands-on technical expertise to oversee daily operations, manage personnel, maintain accreditation standards, and ensure timely and accurate diagnostic results.\n\n\nKey Responsibilities\nOperational Management:\n\n\n\tOversee daily laboratory operations across all departments (e.g., histopathology, microbiology, hematology, cytology, etc.)\n\tMonitor workflow, test turnaround times, and resource utilization to ensure optimal performance.\n\n\nQuality & Compliance:\n\n\n\tMaintain compliance with relevant national and international accreditation standards (e.g., MLSCN, local health authorities).\n\tConduct regular audits and coordinate corrective and preventive actions (CAPA).\n\n\nPersonnel Management:\n\n\n\tSupervise, mentor, and schedule laboratory scientist, technicians, and support staff.\n\tFoster a culture of safety, accuracy, accountability, and continuous improvement.\n\n\nAdministrative & Financial:\n\n\n\tPrepare operational reports, KPIs, and data analyses for senior management.\n\tSupport IT system usage for LIS (Laboratory Information System) optimization.\n\n\nStrategic Development:\n\n\n\tSupport the implementation of new technologies and tests.\n\tParticipate in planning for laboratory expansion, digital pathology, or automation initiatives.\n\n\nQualifications\n\n\n\tBachelor’s Degree in Medical Laboratory Science BMLS or related fields (required).\n\t7 - 9 years of clinical laboratory experience, including at least 4/5 years in a leadership or supervisory role.\n\tMaster’s Degree in Laboratory Management, Healthcare Administration, or related field (preferred).\n\tCertification/Registration with relevant professional body (e.g., MLSCN , etc.).\n\n\nSkills and Competencies:\n\n\n\tIn-depth knowledge of laboratory processes, quality standards, and regulatory compliance.\n\tStrong leadership, communication, and organizational skills.\n\tProficiency with LIS and data analysis tools.\n\tAbility to lead teams, resolve conflicts, and drive process improvements.\n\tHigh attention to detail with strong decision-making capabilities.\n\n\nWorking Conditions:\n\n\n\tFull-time, on-site with potential for extended hours as needed.\n\tExposure to biohazardous materials; adherence to all safety protocols is required.\n\n\nMethod of Application\nInterested and qualified candidates should submit their CV, a cover letter detailing relevant experience, and contact information for at least two professional references to: rimdinado@gmail.com using the Job Position as the subject of the mail.\n\n \n\n \n\n3.) Medical Laboratory Manager\n\nJob Location: Abuja (FCT) \nEmployment Type: Full-time\nDepartment: Pathology Laboratory\nReports To: Head of Laboratory Operations\n\nPosition Summary\n\n\n\tThe Medical Laboratory Manager is responsible for the overall management, coordination, and supervision of laboratory operations to ensure high standards of quality, efficiency, and compliance.\n\tThis role combines leadership with hands-on technical expertise to oversee daily operations, manage personnel, maintain accreditation standards, and ensure timely and accurate diagnostic results.\n\n\nKey Responsibilities\nOperational Management:\n\n\n\tOversee daily laboratory operations across all departments (e.g., histopathology, microbiology, hematology, cytology, etc.)\n\tMonitor workflow, test turnaround times, and resource utilization to ensure optimal performance.\n\n\nQuality & Compliance:\n\n\n\tMaintain compliance with relevant national and international accreditation standards (e.g., MLSCN, local health authorities).\n\tConduct regular audits and coordinate corrective and preventive actions (CAPA).\n\n\nPersonnel Management:\n\n\n\tSupervise, mentor, and schedule laboratory scientist, technicians, and support staff.\n\tFoster a culture of safety, accuracy, accountability, and continuous improvement.\n\n\nAdministrative & Financial:\n\n\n\tPrepare operational reports, KPIs, and data analyses for senior management.\n\tSupport IT system usage for LIS (Laboratory Information System) optimization.\n\n\nStrategic Development:\n\n\n\tSupport the implementation of new technologies and tests.\n\tParticipate in planning for laboratory expansion, digital pathology, or automation initiatives.\n\n\nQualifications\n\n\n\tBachelor’s Degree in Medical Laboratory Science BMLS or related fields (required).\n\t7 - 9 years of clinical laboratory experience, including at least 4/5 years in a leadership or supervisory role.\n\tMaster’s Degree in Laboratory Management, Healthcare Administration, or related field (preferred).\n\tCertification/Registration with relevant professional body (e.g., MLSCN , etc.).\n\n\nSkills and Competencies:\n\n\n\tIn-depth knowledge of laboratory processes, quality standards, and regulatory compliance.\n\tStrong leadership, communication, and organizational skills.\n\tProficiency with LIS and data analysis tools.\n\tAbility to lead teams, resolve conflicts, and drive process improvements.\n\tHigh attention to detail with strong decision-making capabilities.\n\n\nWorking Conditions:\n\n\n\tFull-time, on-site with potential for extended hours as needed.\n\tExposure to biohazardous materials; adherence to all safety protocols is required.\n\n\nMethod of Application\nInterested and qualified candidates should submit their CV, a cover letter detailing relevant experience, and contact information for at least two professional references to: rimdinado@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Operations Lead Job at SterlingPRO Business Application Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/operations-lead-job-at-sterlingpro-business-application-limited",
    "pubDate": "Tue, 01 Jul 2025 10:45:55 GMT",
    "source": "JobGurus",
    "keyword": "sterlingpro business application limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "SterlingPRO Business Application Limited is a FINTECH that provides innovative, market-relevant and industrialized technology consulting solutions that drive high performance in the financial sector primarily. SterlingPRO is a global brand servicing Top Commercial Banks across Nigeria and Africa with plans to expand into other markets like the U.S, Europe and Asia.\n\nWe are recruiting to fill the position below:\n\nJob Position: Operations Lead\n\nJob Location: Maryland, Lagos\nEmployment Type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe team is looking for an individual with a strong background in FinTech, Business Operations, and/or experience in a startup environment. In this role, you'll be working alongside the Managing Partner.\n\tThis role is essential for driving organizational efficiency, supporting governance, and maintaining operational integrity.\n\tAssist the Managing Partner in managing daily business operations to ensure efficiency and alignment with organizational goals;\n\tServe as the point of contact for operational issues, ensuring timely resolution in accordance with company standards;\n\tOversee project coordination and initiatives, ensuring objectives are met within set timelines;\n\tConduct regular reviews of business policies and processes to ensure alignment with industry best practices and regulatory standards.\n\tEnsuring Regulatory Compliance.\n\tCollaborate with cross-functional teams to facilitate the seamless execution of business processes;\n\tMonitor and evaluate key operational metrics to identify areas for improvement and implement corrective actions;\n\tDevelop and maintain operational workflows, policies, and procedures to enhance efficiency and productivity;\n\tMonitor changes in regulatory policies and ensure timely updates and adherence to new requirements in collaboration with relevant team.\n\tReporting and Strategic Planning Support.\n\tSupport the Country Manager in developing and executing strategic plans for market expansion, business growth, and operational excellence.\n\tAnalyze trends and data to provide actionable insights that support strategic decision-making.\n\tContribute to the preparation of presentations, proposals, and business cases for stakeholders and regulators.\n\tAnalyze financial data to identify areas for cost reduction and profit improvement.\n\tIdentify new business opportunities and develop plans to expand the company’s market presence.\n\tCollaborate with department heads to set performance goals and monitor progress.\n\tBuild and maintain relationships with clients, suppliers, and other stakeholders.\n\tLead and mentor staff to improve productivity, engagement, and overall performance.\n\tMonitor key performance indicators (KPIs) and provide insights to drive continuous improvement.\n\tNegotiate contracts with vendors, suppliers, and business partners to ensure favorable terms.\n\tManage and resolve any operational challenges that may arise.\n\n\nRequirements\n\n\n\tBachelor’s Degree in Business Administration, Finance, Law, or a related field.\n\t3 - 5 years of experience in business operations, compliance, or risk management within a regulated industry.\n\tA master’s Degree or professional certification in Compliance or Risk Management is an advantage.\n\tExperience in the Fintech Sector will be a huge advantage.\n\tProficiency in English, both in speaking and writing.\n\tStrong organizational and project management skills.\n\tGood analytical skills, ability to collaborate effectively, and team spirit.\n\tStrong communication and interpersonal skills, with the ability to interact with stakeholders at all levels.\n\tProficiency in the Microsoft Office Suite\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hr@sterlingprong.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Restaurant Liaison Officer Job at FoodOnline Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/restaurant-liaison-officer-job-at-foodonline-limited",
    "pubDate": "Tue, 01 Jul 2025 10:45:55 GMT",
    "source": "JobGurus",
    "keyword": "foodonline limited",
    "duplicate": false,
    "classifications": [],
    "content": "FoodOnline is a dynamic food delivery and logistics tech company revolutionizing how Nigerians access meals. It connects users to their favorite restaurants and food vendors through a fast, user-friendly mobile app.\n\nWe are recruiting to fill the position below:\n\nJob Position: Restaurant Liaison Officer\nJob Locations: Jabi, Utako, Wuye, Wuse, Mabushi - Abuja (FCT)\nEmployment Type: Full-time\n\nDescription\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tJoin FoodOnline and help us deliver food faster and smarter!\n\tWe’re looking for smart, young, and organized individuals who can work with restaurants to ensure fast and correct orders.\n\n\nYour Role\n\n\n\tReceive order screenshot.\n\tBuy and confirm food from restaurant.\n\tLabel, seal, and hand over to the assigned rider.\n\tCommunicate delays or issues to the team.\n\n\nRequirements\n\n\n\tMinimum of an SSCE (WAEC, NECO, or equivalent).\n\tMust be at least 16 years old.\n\tMust live in or near Jabi, Utako, Wuye, Wuse, or Mabushi.\n\tPolite, smart, and presentable.\n\tOwn a smartphone with WhatsApp.\n\tKnows how to move fast and communicate clearly.\n\n\nSalary & Benefits\n\n\n\tSalary: N70,000 / Month.\n\tBonus tied to performance.\n\tGrowth opportunity in a fast-moving company.\n\tOn-the-job training.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Warehouse / Store Officer (Pharm Tech) Job at Castville Solutions",
    "link": "https://www.jobgurus.com.ng/jobs/view/warehouse-store-officer-pharm-tech-job-at-castville-solutions",
    "pubDate": "Tue, 01 Jul 2025 10:45:55 GMT",
    "source": "JobGurus",
    "keyword": "castville solutions",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Castville Solutions is a recruitment and business solutions provider specializing in the healthcare sector. We focus on connecting healthcare facilities with highly skilled professionals, enabling efficient operations, and driving business growth. Our services extend to recruitment, Templates for process and operations management, SOP development, and healthcare-specific training, with a clear mission to transform the healthcare workforce and operations.\n\nWe are recruiting to fill the position below:\n\nJob Position: Warehouse / Store Officer (Pharm Tech)\n\nJob Location: Ajah, Lagos \nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tReceive, inspect, and store pharmaceutical products and medical supplies\n\tMaintain accurate inventory records using stock management systems\n\tIssue and record stock movement in line with prescriptions and requisitions\n\tLiaise with procurement and pharmacy teams for stock replenishment\n\tEnsure proper storage conditions, labeling, and shelf-life monitoring\n\tConduct routine stock checks and report discrepancies promptly\n\tMaintain cleanliness and organization of the store/warehouse area.\n\n\nRequirements\n\n\n\tCertified Pharmacy Technician (PCN registration is an advantage)\n\tMinimum of 2 years of experience in a pharmacy, warehouse, or medical store role\n\tStrong attention to detail and good record-keeping skills\n\tProficiency in inventory software and basic computer use\n\tAbility to work independently and manage time effectively\n\tStrong ethics, integrity, and reliability\n\n\nSalary\nN120,000 - N170,000 Monthly.\n\n \n\nNote: For More Information or Enquiries: Call or WhatsApp: 09010634633.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]