[
  {
    "title": "Sales Manager Job at Huafei Trading Company Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/sales-manager-job-at-huafei-trading-company-limited",
    "pubDate": "Tue, 08 Jul 2025 17:14:53 GMT",
    "source": "JobGurus",
    "keyword": "huafei trading company limited",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "Huafei Trading Company Limited - We are one of the leading trading companies in Lagos, seeking competent, self-motivated, hardworking and result-driven professionals to join our team in the capacity below:\n\nJob Position: Sales Manager\nJob Location: Lagos\nEmployment Type: Full-time\n\nResponsibility\n\n\n\tTo ensure the implementation of strategies and activities that would enhance the growth in sales of our food additive and brand.\n\n\nRequirements\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tB.Sc / HND qualification in Marketing, Business Administration, or any other Social Science.\n\tAt Least 2 - 5 Years of sales experience in the Agrobusiness Industry.\n\tAt least one year of team management experience.\n\tGood Team Spirit.\n\tMust be Proactive.\n\tGood Communication skills.\n\tGood Interpersonal Relationship.\n\tAge: Between the range of 30 - 40 Years.\n\n\nMethod of Application\nInterested and qualified candidates should send their Resume to: Bobofood_hr@yahoo.com using the Job Position as the subject of the mail.\n\nNote: Only shortlisted candidates would be called for an interview.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Sales / Business Development Executive Job at Human Edge Dimension Consulting",
    "link": "https://www.jobgurus.com.ng/jobs/view/sales-business-development-executive-job-at-human-edge-dimension-consulting",
    "pubDate": "Tue, 08 Jul 2025 17:14:53 GMT",
    "source": "JobGurus",
    "keyword": "human edge dimension consulting",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Human Edge Dimension Consulting - Our client is an international logistics company providing services in Air cargo operations, Sea groupage, Clearing & Forwarding, Freight Forwarding amongst others.\n\nThey are recruiting to fill the position below:\n\nJob Position: Sales / Business Development Executive\n\nJob Location: Marina - Lagos Island, Lagos\nEmployment Type: Full-time\n\nJob Description\n\n\n\tThey are seeking to employ a strategic and experienced sales  /  Business Development Executive to help attract the right clients and audience and convince them to use their services.\n\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAnalyze the Lagos market, identify new opportunities, and promote company services.\n\tDevelop and maintain relationships with new and existing customers, identifying and fulfilling potential customer needs.\n\tHandle inquiries, provide competitive pricing, and negotiate to maximize company interests.\n\tProactively resolve any issues during the transportation process to ensure client satisfaction.\n\n\nRequirements\n\n\n\tA Bachelor’s Degree or HNDin Logistics, Marketing, International Trade, or a related field.\n\t4+ years of experience in freight forwarding, particularly in Sales, Business Development and ClientManagement.\n\tStrong understanding of freight forwarding processes, including foreign trade, transportation, and warehousing.\n\tProven skills in sales development and customer relationship management in logistics.\n\tExcellent communication, negotiation, and problem-solving skills, with a high level of self-motivation.\n\n\nRemuneration & Benefits\n\n\n\tBonus: Transportation allowance between N15,000 - N50,000.\n\tA competitive salary of N500,000/month.\n\tPaid time off, including vacation and sick leave.\n\tWork hours: 8:00 AM – 5:00 PM, Monday to Saturday.\n\tRegular team-building activities and an end-of-year gift.\n\n\nMethod of Application\nInterested and qualified candidates should send their updated CV to: humanedgeconsulting02@gmail.com using \"Sales / Business Development Executive\" as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Female Receptionist / Front Desk Officer Job at Krystal Medical Centre",
    "link": "https://www.jobgurus.com.ng/jobs/view/female-receptionist-front-desk-officer-job-at-krystal-medical-centre-2",
    "pubDate": "Tue, 08 Jul 2025 17:14:53 GMT",
    "source": "JobGurus",
    "keyword": "krystal medical centre",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance"
    ],
    "content": "Krystal Medical Centre is a leading healthcare facility located in Magodo Phase 2, Lagos, Nigeria. Renowned for its commitment to excellence in patient care, the centre offers a comprehensive range of medical services, including general consultations, specialist care, diagnostics, and preventive health services. With a team of experienced professionals and modern medical equipment, Krystal Medical Centre delivers quality, affordable, and accessible healthcare in a serene and secure environment.\n\nWe are recruiting to fill the position below:\n\nJob Position: Female Receptionist / Front Desk Officer\n\nJob Location: Magodo Phase 2, Lagos\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tProvide a Positive First Impression: Ensure patients and visitors have a welcoming and positive experience.\n\tMaintain a Welcoming Environment: Keep the hospital environment calm, quiet, and inviting for patients and their families.\n\tCollect and Manage Patient Information: Gather patient details and update medical records accurately.\n\tData Backup: Log daily registrations into Microsoft Excel for backup.\n\tHandle Telephone Communications: Answer calls with polite and consistent phone manners, adhering to proper telephone etiquette.\n\tSchedule Appointments: Organize and manage patient appointment schedules effectively.\n\tCoordinate Patient Flow: Facilitate and monitor the movement of patients within the hospital.\n\tAssist with Documentation: Help patients complete necessary forms and paperwork.\n\tMaintain a Clean Reception Area: Ensure the front desk and surrounding areas are tidy and orderly.\n\tProcess Billing and Payments: Handle payment transactions and billing processes efficiently.\n\tProvide Comfort to Distressed Patients: Address appointment issues and offer emotional support during stressful situations or emergencies.\n\tManage Social Media Accounts: Oversee and maintain the hospital’s social media presence.\n\tEnsure Confidentiality: Maintain strict confidentiality of patient and hospital information at all times.\n\tGenerate Relevant Reports: Create and provide necessary reports as required.\n\tStock Front Office Supplies: Keep the reception area well-stocked with essential stationery and consumables.\n\tLiaise with Departments: Communicate professionally and discreetly with all medical departments.\n\n\nQualifications\n\n\n\tOND/HND in Business Administration, Accounting or its equivalent.\n\tOne to two years of working experience\n\n\nRequirements / Skills:\n\n\n\tProficient in Healthcare Management Systems and Microsoft Office Suite.\n\tExperience working in a hospital is an added advantage.\n\tFace-to-face experience with customers.\n\tOutstanding communication skills, both written and verbal.\n\tExcellent organizational and multitasking skills.\n\tHighly motivated team player, willing to go the extra mile.\n\tMust be presentable and smart.\n\tAttention to detail.\n\tFast learner.\n\tMust be ready to resume immediately\n\tMust reside within Magodo, Ketu, Ikosi, Shangisha, Berger, Ikeja, or nearby areas.\n\n\nMethod of Application\nInterested and qualified candidates should forward their applications and copies of their credentials to: Krystalmedicalcentre@gmail.com with the Job Position applied for as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]