[
  {
    "title": "General Manager, Hotel Operations Job at Alan & Grant",
    "link": "https://www.jobgurus.com.ng/jobs/view/general-manager-hotel-operations-job-at-alan-grant",
    "pubDate": "Fri, 27 Jun 2025 11:37:32 GMT",
    "source": "JobGurus",
    "keyword": "alan & grant",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Alan & Grant - Our client is a hospitality conglomerate based in Nigeria with diverse business interests including restaurants, catering, snack food manufacturing, hotels, cinemas, and real estate development.\n\nThey are recruiting suitable candidates to fill the position below:\n\nJob Position: General Manager, Hotel Operations\n\nJob Location: Port Harcourt, Rivers\nJob type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe General Manager is responsible for the overall strategic direction, operational efficiency, guest satisfaction, and financial performance of the hotel.\n\tThis leadership role ensures that all departments operate in alignment with the brand’s standards, while also driving profitability, maintaining service excellence, and fostering a high-performance culture among staff.\n\n\nKey Responsibilities \n\n\n\tEnsure high-quality customer service and guest satisfaction.\n\tImplement strategies to enhance the guest experience, including personalized services.\n\tMonitor online reviews and guest feedback to drive continuous improvement.\n\tSupervise daily hotel operations, including front desk, housekeeping, food & beverage, and maintenance.\n\tWork with the revenue management team to optimize room rates and occupancy.\n\tMonitor operational expenses and manage budgets effectively.\n\tAssist in cost control initiatives without compromising service quality.\n\tEnsure smooth check-in/check-out procedures and efficient room turnovers.\n\tMonitor inventory levels and coordinate procurement for hotel supplies.\n\tEnforce health, safety, and sanitation regulations.\n\tSupport sales and marketing efforts to boost bookings and revenue.\n\tSupervise and provide guidance to department heads and staff.\n\n\nRequirements\n\n\n\tBachelor’s Degree in Hospitality Management, Business Administration, or a related field.\n\t7-10 years in hotel operations, with managerial experience.\n\tStrong leadership, problem-solving, and decision-making skills.\n\tExcellent communication and interpersonal abilities.\n\tAbility to work in a fast-paced environment and handle multiple responsibilities.\n\tKnowledge of financial planning, budgeting, and revenue management\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Social Media Officer Job at Aspom Travels and Tours",
    "link": "https://www.jobgurus.com.ng/jobs/view/social-media-officer-job-at-aspom-travels-and-tours-1",
    "pubDate": "Fri, 27 Jun 2025 11:37:32 GMT",
    "source": "JobGurus",
    "keyword": "aspom travels and tours",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Aspom Travels and Tours is a travel company that offers a wide range of services to facilitate both individual and corporate travel plans. Our services include Visa assistance, Flight reservations, Hotel bookings, Birth services and Planning different tour packages to suit the needs and preferences of our customers. Our agency is committed to providing efficient and high-quality services atcompetitive rates.\n\nWe are recruiting to fill the position below:\n\nJob Position: Social Media Officer\nJob Location: Lekki, Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Social Media Officer is responsible for developing, implementing, and managing the company's social media strategy to enhance brand awareness, engagement, and drive relevant traffic.\n\tThis role involves creating compelling content, managing social media platforms, analyzing performance metrics, and staying up-to-date with the latest social media trends.\n\tThe ideal candidate is creative, data-driven, possesses excellent communication skills, and has a proven track record of successful social media management.\n\n\nResponsibilities\n\n\n\tDevelop and execute social media strategies aligned with marketing goals.\n\tCreate engaging and relevant content (text, images, videos) for various social media platforms.\n\tManage and maintain the company's social media presence across all relevant channels.\n\tMonitor social media trends, tools, and applications, and implement best practices.\n\tIdentify and engage with influencers and key stakeholders.\n\tStay up-to-date on social media algorithm changes and adapt strategies accordingly.\n\tEngage with the online community, respond to inquiries, and foster positive interactions.\n\tTrack and analyze social media performance metrics to optimize campaigns and strategies.\n\tCollaborate with marketing and other teams to ensure brand consistency and integrated campaigns.\n\tManage social media budgets and ensure cost-effectiveness.\n\n\nRequirements\n\n\n\tBachelor's Degree in Marketing, Communications, Digital Marketing, or a related field.\n\t1 - 3 years of proven experience in social media management, content creation, and community engagement.\n\tStrong understanding of various social media platforms (e.g., Facebook, Instagram, Twitter, LinkedIn, TikTok).\n\tExcellent writing, editing, and visual communication skills.\n\tProficiency in using social media management tools and analytics platforms.\n\tStrong analytical and problem-solving skills with the ability to interpret data and generate insights.\n\tCreative and innovative thinker with a passion for social media trends.\n\n\nSalary\nN150,000 / Month.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Travel Consultant Job at Aspom Travel Agency",
    "link": "https://www.jobgurus.com.ng/jobs/view/travel-consultant-job-at-aspom-travel-agency",
    "pubDate": "Fri, 27 Jun 2025 11:37:32 GMT",
    "source": "JobGurus",
    "keyword": "aspom travel agency",
    "duplicate": false,
    "classifications": [],
    "content": "Aspom Travel Agency was founded on the 2nd of February, 2012 and has remained at the top of its game providing visa assistants, hotels, holiday packages, tours and flight deals to her clients.\n\nWe are recruiting to fill the position below:\n\nJob Position: Travel Consultant\n\nJob Location: Lekki, Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Travel Consultant is responsible for assisting clients with travel arrangements including flight bookings, hotel reservations, visa processing, travel insurance, tour packages, and related services.\n\tThe role involves providing expert advice, handling client inquiries, offering tailored travel solutions, and ensuring an excellent customer experience.\n\n\nKey Responsibilities\n\n\n\tConsult with clients to determine their travel needs, preferences, and budget.\n\tBook flights, hotels, cruises, and other travel-related services.\n\tOffer travel packages and promotions to potential and existing clients.\n\tHandle customer inquiries, complaints, and emergencies professionally.\n\tFollow up with clients before and after their trips to ensure satisfaction.\n\tAssist with visa applications, travel insurance, and itinerary planning.\n\tMaintain up-to-date knowledge of travel industry trends, destinations, and requirements.\n\tProcess payments, issue travel documents, and maintain accurate client records.\n\tLiaise with airlines, hotels, tour operators, and other partners.\n\tMeet sales targets and contribute to the agency's growth.\n\n\nRequirements\n\n\n\tMinimum of a Diploma or Bachelor’s Degree in Tourism, Hospitality, Business Administration, or any related field.\n\t1–3 years of experience in a travel agency or similar role.\n\tFamiliarity with international travel procedures, visa processes, and destination knowledge is highly desirable.\n\tExperience using booking platforms and travel software is a plus.\n\n\nOther Requirements:\n\n\n\tMust have a passion for travel and tourism.\n\tFlexible working hours, including weekends or evenings, depending on client needs.\n\tTeam player with a positive attitude.\n\tIntegrity and discretion when dealing with confidential information.\n\n\nRequired Skills:\n\n\n\tExcellent communication and interpersonal skills.\n\tStrong customer service orientation.\n\tAttention to detail and organizational ability.\n\tKnowledge of GDS (e.g., Amadeus, Sabre, Galileo) is an advantage.\n\tGood problem-solving and negotiation skills.\n\tAbility to work under pressure and multitask.\n\tProficiency in Microsoft Office (Word, Excel, Outlook).\n\n\nRemuneration\n\n\n\tCompetitive salary (N150,000 Monthly)  based on experience and qualifications.\n\tCommission on sales or closed bookings.\n\tPerformance-based bonuses.\n\tTravel discounts or fam trips (familiarization trips) where applicable.\n\tProfessional development opportunities.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Vacancies at Whassan Nigeria",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancies-at-whassan-nigeria",
    "pubDate": "Fri, 27 Jun 2025 11:37:32 GMT",
    "source": "JobGurus",
    "keyword": "whassan nigeria",
    "duplicate": false,
    "classifications": [],
    "content": "Whassan Nigeria is a fully owned Nigeria Company with over 40 years of experience in industrial catering services, facility maintenance, and manpower supply services on offshore, onshore, and remote sites.\n\nWe are recruiting to fill the following positions below:\n\n1.) Salad / Sandwich / Burger Maker\n\nJob Location: Victoria Island, Lagos\nEmployment Type: Full-time\n\nDescription\n\n\n\tWe are looking for a skilled salad, sandwich, and burger maker to join our team.\n\tWe seek a candidate who is creative in designing salads.\n\n\nRequirements\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tCandidates should possess relevant qualifications with experience.\n\n\nSalary\nN150,000 - N180,000 / Month.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: recruitment@whassanng.com using the Job Position as the subject of the email.\n\n \n\n \n\n2.) National cook\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe are seeking a skilled cook with expertise in national dishes, an excellent cook who can manage an industrial kitchen with ease and maintain good time management, ensuring timely delivery.\n\n\nRequirements\n\n\n\tInterested candidates should possess an SSCE qualification with 3 - 5 years of work experience.\n\n\nSalary\nN150,000 - N180,000 per month. \n\nMethod of Application\nInterested and qualified candidates should send their CV to: recruitment@whassanng.com using the Job Position as the subject of the email.\n\n \n\n \n\n3.) Continental Cook\n\nJob Location: Victoria Island, Lagos\nEmployment Type: Full-time\n\nJob Details\n\n\n\tWe are looking for a skilled continental cook with expertise in continental cuisine.\n\tThe ideal candidate should handle an industrial kitchen with ease and meet timely delivery expectations.\n\n\nReqiuirements\n\n\n\tCandidates should possess an SSCE / GCE / NECO with 3 - 5 years of work experience.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: recruitment@whassanng.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]