[
  {
    "title": "Executive Sales Associate Job at Jameda Concepts",
    "link": "https://www.jobgurus.com.ng/jobs/view/executive-sales-associate-job-at-jameda-concepts",
    "pubDate": "Thu, 03 Jul 2025 13:28:09 GMT",
    "source": "JobGurus",
    "keyword": "jameda concepts",
    "duplicate": false,
    "classifications": [],
    "content": "Jameda Concepts is recruiting suitably qualified candidates to fill the position below:\n\nJob Position: Executive Sales Associate\n\nJob Location: Lekki, Lagos\nWorking days: Monday- Saturday\n\nRole\n\n\n\tWelcome customers, answer questions about products or services, and guide them through the purchasing process\n\tAddress customer complaints and resolve issues to ensure satisfaction\n\tInform customers about current sales, promotions, and loyalty programs\n\tWork with other team members to achieve sales targets and maintain a positive work environment.\n\n\nQualifications and Experience\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAny sales or customer relationships experience.\n\tSkills: Good communication and written.\n\tThe candidate must be staying on the island.\n\n\nSalary\nAttractive.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: jamedaconcepts@gmail.com using the Job Position as the subject of the mail.\n\nNote: For further enquiries, message: 08036423766.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Human Resource Manager Job at Tailored Talent",
    "link": "https://www.jobgurus.com.ng/jobs/view/human-resource-manager-job-at-tailored-talent-1",
    "pubDate": "Thu, 03 Jul 2025 13:28:09 GMT",
    "source": "JobGurus",
    "keyword": "tailored talent",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Tailored Talent - Our client, a fast-growing fintech company, is recruiting to fill the position below:\n\nJob Position: Human Resource Manager\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are a fast-growing fintech company redefining financial services through innovation, technology, and customer-centric solutions.\n\tAs we continue to scale, we are looking for a dynamic and experienced Human Resources Manager to lead our people strategy and foster a high-performance, inclusive, and agile work environment.\n\tThe ideal candidate will have previous experience in a technology-driven organization, preferably within fintech, and a proven ability to support fast-paced, high-growth teams.\n\n\nKey Responsibilities\nHR Strategy & Operations:\n\n\n\tDesign and implement HR strategies aligned with overall business goals.\n\tLead and manage end-to-end HR functions including recruitment, onboarding, performance management, employee relations, compensation, and benefits.\n\tDevelop and maintain HR policies, procedures, and compliance frameworks tailored for a tech-driven environment.\n\n\nTalent Acquisition & Management:\n\n\n\tPartner with department heads to identify staffing needs and attract top tech talent.\n\tDrive a seamless and engaging recruitment process, leveraging tech platforms and data-driven sourcing strategies.\n\tOversee employee lifecycle activities — from hiring to offboarding.\n\n\nCulture & Development:\n\n\n\tChampion company culture, values, and engagement initiatives.\n\tLead training and development programs that support technical and soft skill growth.\n\tImplement employee feedback and pulse surveys to enhance workplace satisfaction.\n\n\nPerformance & Analytics:\n\n\n\tDevelop and track KPIs related to hiring, retention, and performance.\n\tProvide strategic insights to leadership using HR analytics and dashboards.\n\n\nCompliance & Risk Management:\n\n\n\tEnsure compliance with labor laws, data protection regulations, and HR best practices.\n\tManage workplace investigations and resolve conflicts with fairness and discretion.\n\n\nPreferred Qualifications\n\n\n\tBachelor's Degree in Human Resources, Business Administration, or a related field. (MBA or CIPM/SHRM is a plus)\n\t3+ years of HR experience in a technology or fintech company.\n\tProven experience working in a fast-paced, scaling startup or tech-driven environment.\n\tDeep understanding of tech talent dynamics and culture.\n\tStrong interpersonal, communication, and problem-solving skills.\n\tHands-on experience with modern HR tools (e.g., BambooHR, Deel, Notion, Lever, etc.).\n\n\nWhat We Offer\n\n\n\tA chance to work at the intersection of finance and innovation.\n\tHigh-impact role with room for growth and leadership.\n\tCompetitive salary and benefits package.\n\tCollaborative and flexible work environment.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Sales Officer Job at Lopterra Services Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/sales-officer-job-at-lopterra-services-limited-6",
    "pubDate": "Thu, 03 Jul 2025 13:28:09 GMT",
    "source": "JobGurus",
    "keyword": "lopterra services limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Lopterra Services Limited - Our client stands out as one of the most competitive renewable energy and power systems firms in Nigeria. By working with this esteemed organisation, you will encounter a diverse range of learning experiences and challenges that will foster your professional development. and becoming part of a passionate community of professionals dedicated to transforming the way the world is powered.\n\nThey are recruiting to fill the position below:\n\nJob Position: Sales Officer\n\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\nFunctionally Reports To: Business Development Manager, Lagos State\n\nJob Objective/Purpose of Job\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe primary objective is to generate revenue by identifying and securing new customers, maintaining relationships with existing clients and promoting the company's products and services.\n\tThe Sales Officer will be responsible for achieving sales targets, conducting market research, following up on leads and providing excellent customer service to drive business growth.\n\n\nKey Responsibilities\n\n\n\tTarget both business clients (C&I) and individual customers (B2C) with our solar power solutions Inverters and UPS systems\n\tActively prospect for new customers by cold calling, networking and following up on leads to create opportunities.\n\tOwn the full sales cycle from lead generation to closing, ensuring customer satisfaction at every stage.\n\tDevelop and deliver compelling and tailored sales presentations, proposals and pitches to key stakeholders (businesses and individual clients).\n\tDeliver measurable results by consistently hitting and surpassing monthly sales targets.\n\tDevelop and maintain long-term relationships with both business and individual clients to drive repeat business and referrals.\n\tProvide regular updates and reports to supervisor on business development activities, progress, and outcomes.\n\tStay on top of industry trends and competitive offerings to fine-tune your sales strategy and remain ahead of the game.\n\n\nRequirements\n\n\n\tEducational Qualification: A minimum of OND in Marketing, Mathematics, Business Administration, or related field. • Professional Qualification: Added Advantage.\n\tMinimum of two (2) years in direct sales, with experience in both B2B and B2C environments (preferably in the renewable energy and technology, or similar industry).\n\tSales-Focused Mindset: You are not just looking to meet targets—you want to exceed them. You are passionate about winning and making sales happen.\n\tStrong Communication Skills: You can effectively pitch to a wide range of clients, from large businesses to individual consumers.\n\tSelf-Starter: You take ownership of your sales territory, work independently and don’t need micromanaging to succeed.\n\tPassion for Renewable Energy: A genuine interest in solar power, sustainable energy, or technology.\n\tFlexible & Adaptable: Whether you are meeting a business executive or an individual homeowner, you can adapt your approach to different client types.\n\tTravel Willingness: Field-based role requiring travel across assigned regions.\n\tProficiency in the use of Microsoft Office suites\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Field Fiber Engineer Job at Tizeti Network Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/field-fiber-engineer-job-at-tizeti-network-limited",
    "pubDate": "Thu, 03 Jul 2025 13:28:09 GMT",
    "source": "JobGurus",
    "keyword": "tizeti network limited",
    "duplicate": false,
    "classifications": [],
    "content": "Tizeti Network Limited (wifi.com.ng) is a fast growing NCC licensed internet service provider and top provider of Unlimited internet in Nigeria as well as West Africa Countries. Our services are reliable, affordable and available in various packages to suit the needs of our customers. We also provide excellent customer support to ensure that our clients have a seamless internet experience.\n\nWe are recruiting to fill the position below:\n\nJob Position: Field Fiber Engineer\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Field Fiber Engineer is responsible for the on-site deployment, installation, maintenance, and repair of fiber optic infrastructure.\n\tThis role involves working directly in the field to ensure high-quality service delivery, supporting fiber rollouts, customer activations, and resolving technical faults.\n\tThe ideal candidate is hands-on, technically skilled, and committed to delivering reliable connectivity to end users.\n\n\nResponsibilities\n\n\n\tExecute field installations of fiber optic cables for FTTH, FTTB, or backbone networks.\n\tPerform splicing, termination, and testing of fiber using tools like OTDR, power meters, and splicing machines.\n\tConduct site surveys for new deployments and prepare technical site reports.\n\tEnsure clean, secure routing and termination of fiber cables.\n\tWork closely with the NOC and support teams to provide field updates and resolve escalated issues.\n\tInstall and configure customer-premise equipment (CPE), including ONUs and routers.\n\tTroubleshoot and resolve connectivity issues for residential and business fiber customers.\n\tAdhere to safety standards and ensure compliance with installation protocols.\n\tMaintain accurate documentation of all fiber activities and site visits.\n\tEducate and guide customers on basic usage and care of installed equipment.\n\n\nRequirements\n\n\n\tCandidates should possess an HND, B.Eng with experience.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: HR@Tizeti.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Cashier / Inventory Officer Job at Salpha Energy Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/cashier-inventory-officer-job-at-salpha-energy-limited-16",
    "pubDate": "Thu, 03 Jul 2025 13:28:09 GMT",
    "source": "JobGurus",
    "keyword": "salpha energy limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Salpha Energy is a leading renewable energy company in Nigeria, dedicated to providing reliable and sustainable solar power solutions to residential, commercial, and industrial clients. Our mission is to accelerate the adoption of clean energy across Nigeria, reducing carbon footprints and empowering communities with affordable and consistent power. We are a passionate team driven by innovation, customer satisfaction, and a commitment to a greener future for our nation.\n\nWe are recruiting to fill the position below:\n\nJob Position: Cashier / Inventory Officer\nJob Location: Ojo, Lagos\nEmployment Type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAs the Cashier / Inventory Officer, you will work closely with the location’s sales officers to facilitate customer purchasing, as well as handling and ensuring payments by the customer.\n\tYou are saddled with the responsibility of handling stocks and inventory in the location of your operation by ensuring proper handling, receiving and documentation of the inventory received.\n\tYou will be responsible for processing and receiving payments, issuing receipt and ensure proper documentation in the drive.\n\n\nKey Responsibilities\nSales Transactions:\n\n\n\tAssist to achieve branch budgeted sales and profit target.\n\tCollecting payments for products either in cash or credit.\n\tAccepting payments, ensuring all prices and quantities are accurate and providing receipt for every sales transaction.\n\tEnsure products presented by customers are properly handled to the satisfaction of the customer.\n\tCross checking items presented for purchase by customers to see that they are in good condition.\n\tTrack sales transactions and report any discrepancies to the management.\n\tResolving customers’ complaints. Inventory Management:\n\tReceive and handling of the location’s inventories/Stock.\n\n\nInventory Management:\n\n\n\tEnsure accountability and safety of the location’s inventory.\n\tEnsure stock release only on approval of the Sales Order Form.\n\tEnsure regular stock count at least twice in a month.\n\tHave proper knowledge of all companies’ products and prices.\n\tEscalate issues relating to inconsistencies in inventory to the financial accountant.\n\n\nCash Management:\n\n\n\tMake deposit of cash received to the bank.\n\tDaily reconciliations of cash and bank.\n\tRegular checks/phone calls to customers indebted to the company.\n\n\nRecord Keeping:\n\n\n\tBalancing the cash register and generating reports for credit and debit sales.\n\tMaintain accurate record of inventory sent to the station.\n\tDocumenting sales, payments, and credits sales on the drive.\n\tEnsuring proper documentation of stocks and inventory issued out for sales.\n\tKeep proper record of cash and expenses within the location. Station Management:\n\tMaintain clean and tidy warehouse/storeroom and other equipment.\n\tPerform any other duties that may be assigned.\n\n\nQualifications\n\n\n\tBachelor's Degree in Accounting / Business Administration / Economics or any relevant field with 3 - 5 years of experience\n\tComputer Savvy\n\tExcellent knowledge of Google Suites\n\tExcellent communication and interpersonal skills\n\tPrioritizing, time management and organizational skills\n\tRelationship management skills and openness to feedback\n\tProven experience as a cashier is an added advantage.\n\tCandidates must reside in the job location.\n\n\nKey Qualities Expected:\nAppearance and Dressing:\n\n\n\tThe Cashier/Inventory Officer will be clean and neatly attired while on duty in a manner befitting of your position.\n\tTeamwork – Ability to work within a diverse team with the aim of actualizing organizational goal above personal gains.\n\tAn eye for details.\n\tGood knowledge of Inventory Management.\n\tGood communication and interpersonal skills.\n\tAbility to work effectively under pressure to meet deadlines.\n\tResult and service orientation.\n\tAbility to multi-task effectively.\n\tCandidates living around Ojo, Mile2, Festac, Satelite are advised to apply.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: salpha@salphaenergy.com using the Job Position and Location as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]