[
  {
    "title": "CNG Maintenance Technician Job at Dangote Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/cng-maintenance-technician-job-at-dangote-group",
    "pubDate": "Thu, 12 Jun 2025 11:37:16 GMT",
    "source": "JobGurus",
    "keyword": "dangote group",
    "duplicate": false,
    "classifications": [],
    "content": "Dangote Group is one of Nigeria’s most diversified business conglomerates with a hard – earned reputation for excellent business practices and products’ quality with its operational headquarters in the bustling metropolis of Lagos, Nigeria in West Africa.\n\nWe are recruiting to fill the position below:\n\nJob Position: CNG Maintenance Technician\n\nJob Location: Obajana Plant - Kogi / Zaria - Kaduna and Port Harcourt - Rivers\nJob type: Full-time\n\nDescription\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tCNG Maintenance will be responsible for maintaining, troubleshooting, and repairing CNG fueling stations and related equipment. This role involves ensuring the efficient operation of all CNG systems and adherence to safety protocols.\n\n\nKey Duties and Responsibilities\n\n\n\tConduct regular inspections of CNG systems, engines, and components to identify issues.\n\tCarry out preventive maintenance and repairs on CNG vehicles and equipment according to safety standards and manufacturer specifications.\n\tTroubleshoot mechanical and electrical problems with CNG systems, engines, and other related components.\n\tReplace or repair faulty parts and components as necessary.\n\tMaintain accurate records of maintenance and repair work performed.\n\tEnsure compliance with environmental and safety regulations while handling CNG equipment.\n\tAssist in the training of junior technicians and share knowledge on best practices in CNG maintenance.\n\tStay updated on advancements in CNG technology and maintenance techniques.\n\n\nRequirements\nEducation and Work Experience:\n\n\n\tDegree in Mechanical Engineering, Electrical Engineering, or related field.\n\tA minimum of 3 years of experience in the maintenance engineering with a focus on CNG or gas Compression system.\n\tStrong knowledge of CNG equipment, safety standards, and maintenance practices.\n\tProficiency in troubleshooting and diagnostic procedure for mechanical and electrical systems.\n\n\nSkills and Competencies:\n\n\n\tExcellent attention to detail and ability to follow safety protocols.\n\tGood communication and teamwork skills.\n\tProficient in the use of hand tools and diagnostic equipment related to CNG maintenance.\n\tAbility to troubleshoot, diagnose and repair equipment with accuracy and speed\n\tProblem solving skills\n\tAbility to pay attention to details\n\tGood relationship management skills.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Fashion Customer Service Officer Job at Amani Advisory Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/fashion-customer-service-officer-job-at-amani-advisory-limited",
    "pubDate": "Thu, 12 Jun 2025 11:37:16 GMT",
    "source": "JobGurus",
    "keyword": "amani advisory limited",
    "duplicate": false,
    "classifications": [],
    "content": "Amani Advisory Limited - Our client, a vibrant fashion house offering luxury fabric choices from leading manufacturers for men, is recruiting to fill the position below:\n\nJob Position: Fashion Customer Service Officer\nJob Location: Lekki, Lagos\nEmployment Type: Full-time\nWork Days: Monday to Saturday (4 days in /1 half day/1 full day off)\nHours: Rotation\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAs a Fashion Customer Representative, you are the face and voice of the brand. You will provide premium customer service, assist clients with styling and purchase decisions. This role blends fashion knowledge, sales expertise, and a passion for delivering exceptional service.\n\n\nResponsibilities\n\n\n\tGreet and assist walk-in customers, providing personalized styling advice based on their needs.\n\tDrive in-store sales through expert product knowledge and confident selling.\n\tMaintain a clean, organized, and visually appealing store environment.\n\tFollow up on customer orders, complaints, exchanges, and requests.\n\tMeet or exceed weekly and monthly sales targets.\n\tProcess payments and handle POS operations.\n\tAssist with fittings, fabric explanations, and product recommendations.\n\tRespond promptly and professionally to inquiries via Instagram, WhatsApp, email, and website chat.\n\tGuide online clients through styling, sizing, and ordering.\n\tKeep track of customer preferences, purchases, and feedback for CRM purposes.\n\tDevelop relationships with VIP and repeat customers.\n\tMaintain a database of client profiles, important dates, and style preferences.\n\tEncourage return visits through clienteling, follow-ups, and personalized service.\n\tStay updated on current collections, fabrics, sizing, and brand story.\n\tCommunicate the company’s values, craftsmanship, and design inspiration confidently.\n\n\nPerson Specification\n\n\n\t1–3 years of experience in retail fashion or luxury sales.\n\tStrong communication and interpersonal skills.\n\tPassion for fashion, especially menswear and minimalist style.\n\tFriendly, proactive, and professional attitude.\n\tAbility to multitask and remain calm under pressure.\n\tFamiliarity with POS systems and basic digital tools (Instagram, WhatsApp Business, etc.\n\n\nSalary\n 150,000 Naira per month (Net)\n\nMethod of Application\nInterested and qualified candidates should forward their CV to: talent@amaniadvisory.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Project Assistant Job at 1001luxerentals",
    "link": "https://www.jobgurus.com.ng/jobs/view/project-assistant-job-at-1001luxerentals",
    "pubDate": "Thu, 12 Jun 2025 11:37:16 GMT",
    "source": "JobGurus",
    "keyword": "1001luxerentals",
    "duplicate": false,
    "classifications": [],
    "content": "1001luxerentals, a furniture rental company located in Surulere, Lagos State, is recruiting suitable candidates to fill the position below:\n\nJob Position: Project Assistant\n\nJob Location: Surulere, Lagos\nEmployment Type: Full-time\n\nDuties\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tCreating timelines, milestones, and deliverables to contribute to effective project planning\n\tFollowing up on the progress of action items and other tasks and reporting to the project manager\n\tSupporting team members in completing their tasks to ensure they meet milestones\n\tUpdating and organizing project files, such as meeting minutes and progress reports\n\tObserving the team's performance and providing detailed updates to the project manager\n\tAssisting in the preparation of project presentations and reports for senior managers\n\tUsing project management software to maintain charters and process flows\n\tAssisting in risk mitigation, identification, tracking, management, and resolution\n\tScheduling meetings, conference calls, and project-related events with team members\n\tConducting research and gathering data to support project initiatives and encourage good decision-making practices\n\tAssisting the project manager with budgeting, logging expenses, and filing financial reports\n\tFacilitating communication among team members and liaising with the project manager\n\tProviding administrative support to project managers when necessary\n\tSeeking opportunities for process improvements and making recommendations\n\tWriting and distributing project-related messages, such as memos and status updates\n\tCollaborating with cross-functional teams that include a diverse range of personalities and skills, adaptability, and flexible.\n\n\nQualifications\n\n\n\tInterested candidates should possess an OND, HND, or Bachelor's Degree with 1-2 years of experience.\n\n\nSalary\nN100,000 - N120,000 / Month.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: chisomukeje@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Customer Service Representative / Hostess Job at Mai Shayi Coffee Roasters Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/customer-service-representative-hostess-job-at-mai-shayi-coffee-roasters-limited",
    "pubDate": "Thu, 12 Jun 2025 11:37:16 GMT",
    "source": "JobGurus",
    "keyword": "mai shayi coffee roasters limited",
    "duplicate": false,
    "classifications": [],
    "content": "Mai Shayi Coffee Roasters Limited is a premier specialty coffee brand in Nigeria, renowned for its end-to-end involvement in the coffee value chain. From cultivating Arabica coffee in Jos, Plateau state, to meticulous processing and batch-roasting, we promise an unparalleled coffee experience. As a forward-thinking company, our footprint extends from cafes in Lagos and Abuja to our two arabica coffee farms, a cooperative of 141 farmers, and a dedicated roastery supplying premium coffee for both retail and B2B avenues. With our expansion, we seek a skilled and detail-oriented Internal Auditor to ensure the integrity of our financial operations and compliance with legal regulations\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Customer Service Representative / Hostess\nJob Locations: Abuja (FCT) and Queen Elizebeth, Victoria Island - Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe are hiring a customer service representative/Hostess to manage customer queries and complaints. You will also be asked to process orders, and modifications, and escalate complaints across several communication channels\n\n\nKey Responsibilities\n\n\n\tMaintaining a positive, empathetic, and professional attitude toward customers at all times.\n\tResponding promptly to customer inquiries.\n\tCommunicating with customers through various channels.\n\tIdentify and assess customers’ needs to achieve satisfaction.\n\tBuild sustainable relationships and trust with customer accounts through open and interactive communication.\n\tProvide accurate, valid, and complete information by using the right methods/tools.\n\tMeet personal/customer service team sales targets and call handling quotas.\n\tHandle customer complaints, provide appropriate solutions and alternatives within the time limits; follow up to ensure resolution\n\tKeep records of customer interactions, process customer accounts, and file documents.\n\tFollow communication procedures, guidelines, and policies.\n\n\nRequirements and skills\n\n\n\tFirst degree (HND/BSC or Equivalent) in a relevant field.\n\tProven customer support experience or experience as a Client Service Representative.\n\tTrack record of over-achieving quota.\n\tExcellent communication and presentation skills.\n\tAbility to multi-task, prioritize, and manage time effectively.\n\tStrong phone contact handling skills and active listening.\n\tFamiliarity with CRM systems and practices.\n\tCustomer orientation and ability to adapt/respond to different types of characters.\n\tReady to work 6 days a week.\n\tReady to work in Mai Shayi Location, Abuja.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV  and attached Credentials to: rita@maishayicoffee.com copying: kayode@maishayicoffee.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Accountant Job at 1001luxerentals",
    "link": "https://www.jobgurus.com.ng/jobs/view/accountant-job-at-1001luxerentals",
    "pubDate": "Thu, 12 Jun 2025 11:37:16 GMT",
    "source": "JobGurus",
    "keyword": "1001luxerentals",
    "duplicate": false,
    "classifications": [],
    "content": "1001luxerentals, a furniture rental company located in Surulere, Lagos State, is recruiting suitable candidates to fill the position below:\n\nJob Position: Accountant\n\nJob Location: Surulere, Lagos\nEmployment Type: Full-time\n\nDuties\n\n\n\tManage all accounting transactions\n\tPayroll management\n\tRecord keeping\n\tReconciling invoices with clients payment\n\tMonthly financial statements\n\tAccount Reconciliation\n\tComplying with financial policies and regulations.\n\n\nQualifications\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tInterested candidates should possess an OND, HND, or Bachelor's Degree with 1-2 years experience.\n\tMust reside within surulere and environs.\n\n\nWork Hours / days:\n\n\n\t9am-5pm\n\tOffice is everyday...\n\tPhysical (office)\n\tMonday..Wednesday..Friday.\n\n\nSalary\nN140,000 / Month.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: chisomukeje@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]