[
  {
    "title": "DevOps Engineer Job at Daystar Power Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/devops-engineer-job-at-daystar-power-group-1",
    "pubDate": "Sat, 28 Jun 2025 14:41:04 GMT",
    "source": "JobGurus",
    "keyword": "daystar power group",
    "duplicate": false,
    "classifications": [
      "Software Engineering"
    ],
    "content": "Daystar Power is a leading off-grid power service provider, offering hybrid power solutions to commercial and industrial businesses in West Africa. Daystar Power’s solutions “Solar-as-a-Service” (100% solar power) and “Power-as-a-Service” (hybrid power solutions with battery storage) provide clean and reliable power while significantly reducing clients’ overall power costs.\n\nDaystar Power counts the region’s leading industrial and commercial companies among its client base. Daystar is active in Nigeria, Ghana, Togo and Senegal with a representative office in Cote d’Ivoire.\n\nWe are recruiting to fill the position below:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Position: DevOps Engineer\nJob Location: Lagos\nEmployment type: Full-time\n\nJob Description\n\n\n\tWe are looking to engage a competent and experienced DevOps Engineer who will be responsible for Applications Management, Software Development, exploring Technologies such as AI & Hyper-automation and server as the IT Business Management process lead. In addition, He or She would also mentor citizen developers in Low/No-code tools development. The job scope covers service management activities, Cloud operational landscapes with many integration points; and the integration of the interdependent services of diverse internal and external service providers into end-to-end services which deliver value to Daystar from the Lagos - Nigeria office.\n\tWe are seeking a hard-working, self-motivated, and well-organized individual with a focus on continuous improvement to exceed expectations.\n\tDaystar Power Group is an equal opportunity employer, committed to promoting diversity and inclusion in the workplace. We prohibit all forms of discrimination and harassment based on race, colour, gender, religion, sexual orientation, national origin, disability, genetic information, pregnancy or any other characteristic protected by federal, state or local law\n\n\nKey Responsibilities\n\n\n\translate functional requirements into technical specifications with input from subject matter experts and Design Authority.\n\tUnderstanding business requirements to pilot and prototype new solutions and technologies, including procurement, setup, development, demonstration, and deployment.\n\tManage complex integration scenarios and interfaces between cloud and legacy systems.\n\tDesign, development, testing and implementation of software solutions designed for web applications.\n\tWork closely with the product and UX Team to develop user experience optimization.\n\tUtilize AWS and Power BI for data acquisition, transformation, and visualization. Automate key business processes using Power Apps and tools like Python.\n\tContribute to functional excellence in terms of definition and maintenance of standards, methods and tools, bringing in best practices from market standard implementations.\n\tEnsure the best possible performance, quality, and responsiveness of applications.\n\tIdentify/correct bottlenecks and fix bugs.\n\tResponsible for maintaining code quality, organization, and automation.\n\tSupport Projects and Support teams in all phases of the software development lifecycle, including requirement gathering, analysis, design, coding, testing, implementation, and production support for software systems.\n\tCoach business users on low/no-code tools to automate their own processes.\n\n\nRequirements\n\n\n\tBachelor’s/ Master’s degree in ICT, Electrical/Electronic Engineering and Computer Science. Candidates with degrees in other subjects but with strong hands-on domain achievements and relevant certifications in the areas listed above are also acceptable.\n\tMinimum Five (5) years of relevant experience in Application Delivery & Support, DevOps and Integration technologies.\n\tProficient in using Power Apps and Power BI.\n\tDemonstrable experience/skill in React.js, Next.js, GitHub and Python.\n\tProven subject matter expertise working with cloud technologies like Azure/AWS Platform, MongoDB.\n\tExperience in supporting a diverse application landscape, including change management, application testing, data integrity management, patch management and end-user support and training.\n\tITIL Certification (preferred).\n\tKnowledge of Agile methodologies and tools such as Visual Studio Team Services (VSTS) and the use to run scrum meetings.\n\n\nBenefits\n\n\n\tOpportunity to work in a forward-looking, innovative company, with international group of colleagues.\n\tUnlimited career opportunities - depending on achievements and personal development.\n\tA competitive salary and benefits package with long term prospect in a fast-growing company.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "IT Operations Manager Job at Daystar Power Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/it-operations-manager-job-at-daystar-power-group",
    "pubDate": "Sat, 28 Jun 2025 14:41:04 GMT",
    "source": "JobGurus",
    "keyword": "daystar power group",
    "duplicate": false,
    "classifications": [],
    "content": "Daystar Power is a leading off-grid power service provider, offering hybrid power solutions to commercial and industrial businesses in West Africa. Daystar Power’s solutions “Solar-as-a-Service” (100% solar power) and “Power-as-a-Service” (hybrid power solutions with battery storage) provide clean and reliable power while significantly reducing clients’ overall power costs.\n\nDaystar Power counts the region’s leading industrial and commercial companies among its client base. Daystar is active in Nigeria, Ghana, Togo and Senegal with a representative office in Cote d’Ivoire.\n\nWe are recruiting to fill the position below:\n\nJob Position: IT Operations Manager\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Location: Lagos\nEmployment type: Full-time\n\nJob Description\n\n\n\tWe are looking to engage a competent and experienced IT Operations Manager to take end-to-end responsibility of the operations of Daystar Power Group IT landscape and delivery to the agreed Service Level and/or Operate Level Agreements. The jobholder is responsible for the day-to-day service integrator (end-to-end) to ensure application landscapes remain compliant.\n\tThis role spans across all IDT Services & Operations (Network services, End User Support, Business Critical Services, Service Assurance, Compliance etc.) and across the Group.\n\tHe or She will work closely with a network of partners and suppliers to ensure secure, reliable, and affordable end-to-end IT operations, whilst driving the digitalization journey and ensuring that regulatory and compliance controls are embedded in landscape operations and assist with evidence collection from the Lagos - Nigeria office.\n\n\nResponsibilities\nService management:\n\n\n\tServe as a single point of oversight to incorporate all elements required to deliver a stable platform.\n\tUnderstand the end-to-end support model and SLAs linked to the services within landscape.\n\tKnow the ITSM processes around Incident, Problem, Configuration, Change & Release, Major Incident Management, Service Delivery.\n\n\nChange & Release Management:\n\n\n\tAssess the impact of changes and aim to minimise business disruption.\n\tUltimate sign off authority for Transition to Support.\n\tAssists with supportability and transition activities of enhancements and project solutions. This includes analysing and understanding business functional and non-functional requirements for supportability impact, as well as assessing implications of landscape changes and reviewing for enhancement and continuous improvement opportunities.\n\n\nAsset management:\n\n\n\tEnsure that IT assets are logged on “Service Now” or any other equivalent Asset Management tool and the Configuration Management Database is kept up to date.\n\n\nBusiness Continuity:\n\n\n\tDevelop, Implement, execute Test and provide assurance that technical and organization facilities for IT business continuity are implemented and guaranteed.\n\n\nIRM controls:\n\n\n\tEnsure regulatory and compliance controls are embedded in landscape operations and assist with evidence collection.\n\tBe actively Informed on the assessments performed within your landscapes and implementation of the relevant controls.\n\tContinuously build knowledge of relevant information risks and regulatory requirements.\n\n\nVendor Management:\n\n\n\tManage the supplier relationships to deliver the expected contractual performance as a contract holder.\n\tProvide support on getting the supplier’s cooperation with required service management, security and assurance activities.\n\n\nBenefits\n\n\n\tOpportunity to work in a forward-looking, innovative company, with international group of colleagues.\n\tUnlimited career opportunities - depending on achievements and personal development.\n\tA competitive salary and benefits package with long term prospect in a fast-growing company.\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Junior Sales Executive (Travel Agency) Job at TravelDeer",
    "link": "https://www.jobgurus.com.ng/jobs/view/junior-sales-executive-travel-agency-job-at-traveldeer",
    "pubDate": "Sat, 28 Jun 2025 14:41:04 GMT",
    "source": "JobGurus",
    "keyword": "traveldeer",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "TravelDeer is a travel management company, based in Lagos, Nigeria, run and managed by trained IATA certified travel professionals who manage travel not just as a job/career but as a passion. We strive to bring the most exciting and exquisite destinations and experiences closer to our travelers. Doing the hard work so they don't have to - just to make their travel aspirations a reality.\n\nWe are recruiting to fill the position below:\n\nJob Position: Junior Sales Executive (Travel Agency)\n\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time (Hybrid)\nIndustry: Travel & Tourism\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Junior Sales Executive will support the sales team by engaging prospective clients, promoting travel packages, and following up on leads to convert inquiries into sales.\n\tThis is an excellent opportunity for a highly motivated individual to grow in the travel and tourism industry.\n\n\nKey Responsibilities\n\n\n\tAssist clients in selecting suitable travel packages and services based on their needs and budget\n\tRespond promptly to inquiries via email, phone, or in-person\n\tFollow up on leads and convert them into confirmed bookings\n\tMaintain accurate records of sales and customer interactions using CRM tools\n\tCollaborate with the marketing team to support promotional campaigns\n\tProvide after-sales support to ensure customer satisfaction and repeat business\n\tAttend regular training to stay updated on product knowledge and travel industry trends\n\n\nQualifications & Skills\n\n\n\tHND or Bachelor's Degree in Marketing, Business Administration, Tourism, or related field\n\t2-4 years of experience in sales, customer service, or a related role (experience in the travel industry is an advantage)\n\tExcellent communication and interpersonal skills\n\tProficient in Microsoft Office and basic CRM software\n\tStrong organizational skills and attention to detail\n\tA positive attitude and willingness to learn\n\tMust reside within the city.\n\n\nSalary\n\n\n\tN100,000 - N110,000 per month. \n\n\nWhat We Offer:\n\n\n\tCompetitive entry-level salary\n\tOn-the-job training and career development opportunities\n\tFriendly and supportive work environment\n\tOpportunity to grow within the company.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and Cover Letter to: hr@traveldeer.ng using the Job Position as the subject of the mail.\n\nNote: Only shortlisted candidates will be contacted.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Project Engineer Job at Daystar Power Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/project-engineer-job-at-daystar-power-group-3",
    "pubDate": "Sat, 28 Jun 2025 14:41:04 GMT",
    "source": "JobGurus",
    "keyword": "daystar power group",
    "duplicate": false,
    "classifications": [],
    "content": "Daystar Power is a leading off-grid power service provider, offering hybrid power solutions to commercial and industrial businesses in West Africa. Daystar Power’s solutions “Solar-as-a-Service” (100% solar power) and “Power-as-a-Service” (hybrid power solutions with battery storage) provide clean and reliable power while significantly reducing clients’ overall power costs.\n\nDaystar Power counts the region’s leading industrial and commercial companies among its client base. Daystar is active in Nigeria, Ghana, Togo and Senegal with a representative office in Cote d’Ivoire.\n\nWe are recruiting to fill the position below:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Position: Project Engineer\nJob Location: Lagos\nEmployment type: Full-time\n\nKey Responsibilities\nProject Management:\n\n\n\tDeveloping project plans to execute sales contracts.\n\tDesigning and planning solar power installations.\n\tLeading the supply chain process including sourcing and ordering parts internationally and locally.\n\tConducting quality assurance of technical installations of both Daybreak’s team as well as the installations of our technical partners.\n\tDirecting, coordinating, and supervising the installations of solar power solutions; and\n\tTraining clients on the operation and optimal utilization of systems\n\n\nGeneral:\n\n\n\tImplement standard operating procedures and HSE standards for solar installation work.\n\tDevelop standard operating procedures and HSE standards for solar installation work.\n\tReview technological trends in the local and global energy sector.\n\tDevelop and coach technical staff to meet the objectives of the company.\n\tAssist in market research and identify solar energy projects in Nigeria.\n\n\nWorking condition:\n\n\n\tApproximately 30% of time shall be spent in office environments with the remaining time in the field.\n\n\nRequirements\n\n\n\tEducation: Minimum of a Bachelor’s Degree in Electrical Engineering.\n\tExperience: A minimum of 3 years’ work experience in Electrical Engineering roles and managing large scale and industrial projects in the solar industry (preferred) or power industry.\n\tProfessional Membership: Preferably a professional engineer with NSE, COREN and engineering certifications\n\tLanguage Proficiency: English.\n\n\nCharacter:\n\n\n\tProven leadership experience\n\tSelf-motivated and demonstrate a sense of ownership with high level of commitment and the ability to thrive under pressure.\n\tGood communication skills and ability to lead and work well in teams.\n\tHighly organized with ability to manage multiple projects in parallel and prioritize competing demands, passion for renewable energy.\n\tAttention to details and extraordinary oral and written communication skills.\n\tWillingness to adapt, learn and grow with the company.\n\tHigh level of integrity\n\tAbility to work effectively and harmoniously in a group.\n\tHighly organized with ability to manage multiple projects in parallel and prioritize competing demands, passion for renewable energy.\n\tPMP Certification is a plus.\n\tHSE certification is an advantage.\n\tFlexible to travel domestically and internationally.\n\tProficient computer skills, including Microsoft Office Suite (Word, PowerPoint, and Excel) – report writing and analysis.\n\n\nBenefits\n\n\n\tOpportunity to work in a forward-looking, innovative company, with international group of colleagues.\n\tUnlimited career opportunities - depending on achievements and personal development.\n\tA competitive salary and benefits package with long term prospect in a fast-growing company.\n\n\nNote: Only shortlisted candidates will be contacted.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Business Development Manager Job at TechnoServe",
    "link": "https://www.jobgurus.com.ng/jobs/view/business-development-manager-job-at-technoserve-1",
    "pubDate": "Sat, 28 Jun 2025 14:41:04 GMT",
    "source": "JobGurus",
    "keyword": "technoserve",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "TechnoServe works with enterprising people in the developing world to build competitive farms, businesses, and industries. We are a non-profit organization that develops business solutions to poverty by linking people to information, capital, and markets. Our work is rooted in the idea that given the opportunity, hardworking men and women in even the poorest places can generate income, jobs, and wealth for their families and communities. With more than four decades of proven results, we believe in the power of private enterprise to transform lives.\n\nWe are recruiting to fill the position below:\n\nJob Position: Business Development Manager\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nRequisition Number: BUSIN004975\nJob Location: Abuja\nJob Category: Program Development\nJob Type: Full-Time / On-site\nReports to:  Country Director\n\nJob Summary\n\n\n\tTechnoServe Nigeria has a robust portfolio of projects across the country.\n\tThe team is currently seeking a dedicated business development professional to build upon the existing portfolio and support the cultivation and development of new business opportunities in the region.\n\tThe Business Development Manager will support the Country Director and Project Managers in identifying funding opportunities; developing, leading and strengthening fundraising strategies and tactics; and responding to major contract/grant opportunities from bi-lateral, multilateral agencies, national governments, private foundations, and the private sector.\n\n\nDepartment Overview\n\n\n\tThe Business Development Manager is part of the Nigeria team and will report to the Country Director with a dotted line reporting to the Senior Regional Program Development Manager and working with other team members in TechnoServe.\n\tThe Business Development department of TechnoServe is responsible for fundraising and partnerships, including identifying and pursuing new opportunities relevant to TechnoServe’s global and country-specific strategies within our areas of excellence.\n\n\nPrimary Functions & Responsibilities\nThe responsibilities of this position include:\n\nNew Business Development:\n\n\n\tWorking with the Country Director to champion the design and implementation of comprehensive fundraising strategies and annual plans with specific targets.\n\tLiaising with public sector funding agencies, institutional foundations, corporations, and other private donors to acquire and maintain an in-depth knowledge of their mission, organization, policies, procedures and key decision-makers.\n\tSupport knowledge management by synthesizing TechnoServe’s work in qualification statements for core technical areas and geographies, and capturing donor knowledge and interactions in TechnoServe’s CRM system.\n\tLeading and/or supporting opportunity assessments in Nigeria’s priority/areas of excellence.\n\tIdentifying new opportunities that align with TechnoServe’s areas of excellence (entrepreneurship, agriculture markets, food processing) and TechnoServe Nigeria’s strategy and leading the pursuit of these opportunities in collaboration with the Country Director as well as the regional and global PD teams.\n\tManaging the proposal writing processes for key opportunities with public/private funding, at the country level\n\tDeveloping winning proposals in collaboration with local teams and TNS regional and/or development divisions in coordination with the relevant staff of the project team and New Business development division,\n\tCoordinating the review and maintenance of project lead summaries, the new business pipeline, opportunity tracker, the new business resource prioritization matrix, new business opportunity assessments, and other requirements of the new business process.\n\n\nProgram Design and Development:\n\n\n\tCollaborate with TechnoServe’s West Africa regional team and TechnoServe global practice areas to develop concept notes and proposals for Nigeria that incorporate best practices from TechnoServe’s core areas of expertise.\n\tExecute all aspects of proposal development, including managing and coordinating complex efforts with dispersed proposal team members, facilitating program design processes, drafting and editing technical proposals, gathering budget inputs, developing work plans, and customizing past performance references.\n\tSupport project design and development in alignment with donor requirements, rules and regulations.\n\tWorking with the Regional Program Development team to ensure a high-quality start-up of confirmed new programs.\n\tIn the case of programs which have been confirmed but where there is no on-the-ground capacity to ensure a successful transition from the proposal phase to project implementation, the New Business Development Manager will work with the Global Surge Support Team, the Regional Program Development Manager, the Deputy Country Director and Country teams to ensure high-quality program start-up.\n\tAssist the Project Technical Team in the implementation of relevant components as well as monitor activities relating to TechnoServe Nigeria projects.\n\tWork with the Country Director and the Senior Communications Specialist to create visibility and communications materials to support business development.\n\tAny other tasks that may be assigned.\n\n\nBasic Qualifications\nThe following qualifications are required for the role:\n\n\n\tA minimum of an Undergraduate Degree (BSc) in Social Sciences, Business Management, Agriculture, Economics or a relevant field. A Masters’ degree in a relevant field is desirable, but not required.\n\tA minimum of 7 years of experience with a BSc. is required or 5 years’ experience with a Masters degree.\n\tA minimum of 2-3 years of experience in New Business Development and writing successful proposals is a must .\n\n\nPreferred Qualifications:\nAdditional qualifications that are desirable, but not required, include:\n\n\n\tExperience working in Nigeria or West Africa\n\tAt least 2-3 years’ experience working with institutional, bilateral, multilateral donors and foundations is required.\n\tExperience supporting project design and project start-\n\tExtensive knowledge of and experience working in the agriculture and food systems.\n\n\nTravel:\n\n\n\tThis position requires minimal travel.\n\n\nKnowledge, Skills, and Abilities:\nThe successful candidate should have\n\n\n\tExcellent writing skills\n\tGood communication skills, including the ability to express himself or herself clearly and communicate effectively with colleagues and partners\n\tGood initiative and follow-through\n\tThe ability to work in teams and collaborate with others\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]