[
  {
    "title": "Graphics Designer / Virtual Assistant Job at International Facilities Services Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/graphics-designer-virtual-assistant-job-at-international-facilities-services-limited",
    "pubDate": "Wed, 09 Jul 2025 08:49:19 GMT",
    "source": "JobGurus",
    "keyword": "international facilities services limited",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance"
    ],
    "content": "International Facilities Services (IFS) Group is a Cleaning and Facility Management company. We are a leading international facility management services group providing maintenance, industrial cleaning, trading & consultancy, & healthcare support services.\n\nWe are recruiting to fill the position below:\n\nJob Position: Graphics Designer / Virtual Assistant\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n            \n    \n\n\n\n\n\tOur company is searching for a talented digital designer and visual artist to create interactive online content and maintain a smooth user interface for our website and social media pages.\n\tYou'll be responsible for producing content that matches the company's brand, aesthetic, and marketing strategy, including social media graphics, website banners, and promotional artwork.\n\tThe ideal candidate should be able to efficiently combine creativity, functionality, and technology to produce eye-catching and informative content.\n\tIn this role, organizational and technical skills are key, and all candidates must possess in-depth knowledge of design software programs.\n\n\nResponsibilities\n\n\n\tDesigning, producing, and managing interactive online content, including email templates, social media, and promotional artwork, and informative ebooks.\n\tPreparing briefs for each project and presenting design ideas to all the relevant stakeholders.\n\tDesign, build and maintain our social media presence\n\tMeasure and report the performance of all digital marketing campaigns, and assess against goals (ROI and KPIs)\n\tIdentify trends and insights, and optimize spend and performance based on the insights\n\tBrainstorm new and creative growth strategies\n\tPlan, execute, and measure experiments and conversion tests\n\tEnsuring consistency in designs and content across all company platforms.\n\tReviewing product positioning and online marketing content to identify room for improvement.\n\tProviding advice and guidance on the aesthetic for campaigns, projects, and promotional events.\n\n\nRequirements\n\n\n\tBachelor's Degree in Digital Design, Graphic Design, or a related field.\n\tProven experience in a professional digital design role.\n\tDemonstrable experience leading and managing SEO/SEM, marketing database, email, social media, and/or display advertising campaigns\n\tHighly creative with experience in identifying target audiences and devising digital campaigns that engage, inform and motivate\n\tExperience in optimizing landing pages and user funnels\n\tExperience with A/B and multivariate experiments\n\tSolid knowledge of website analytics tools (e.g., Google Analytics, NetInsight, Omniture, WebTrends)\n\tA portfolio of previous digital design work to showcase experience and creativity.\n\tSolid knowledge of design software programs, such as Sketch, and Adobe Creative Suite.\n\tAbility to clearly present design ideas and concepts for campaigns and projects.\n\tA team player with exceptional organizational and technical skills.\n\n\nSalary\nN150,000 per month.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Finance & Accounts Assistant Job at Rome Business School Nigeria",
    "link": "https://www.jobgurus.com.ng/jobs/view/finance-accounts-assistant-job-at-rome-business-school-nigeria",
    "pubDate": "Wed, 09 Jul 2025 08:49:19 GMT",
    "source": "JobGurus",
    "keyword": "rome business school nigeria",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Rome Business School Nigeria, a satellite campus of the Rome Business School based in Rome, Italy is a managerial training and research institute of excellence situated in Ikeja, Lagos. The Rome Business School Nigeria’s aim is to play a role in closing the gap between the classroom and the job market by providing managerial training courses suited to convey the knowledge necessary to kick-off or develop professional careers or business activities. Our mission is to train entrepreneurs, managers and professionals to a level of excellence in their competence and their ethical approach to business and work, able to play a part in the development of an economic humanity and of a society more prosperous, fair and respectful of the central role of the individual.\n     \n\n            \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Finance & Accounts Assistant\n\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tFinance & Accounts Assistant will be responsible for providing essential support in day-to-day financial operations.\n\tKey responsibilities include invoice reconciliation, payment processing, petty cash management, and the maintenance of accurate financial records.\n\tThe role involves working collaboratively with the finance team to ensure timely data entry, assist with compliance and statutory reporting, manage student account records, and contribute to monthly financial reviews.\n\tThis position requires a detail-oriented individual with a solid foundation in accounting principles, a high level of accuracy, and the ability to efficiently handle multiple administrative and financial tasks.\n\n\nKey Responsibilities\n\n\n\tAssist with invoice reconciliation and follow-up on vendor payments.\n\tGenerate invoices and confirm payments in collaboration with team members.\n\tTrack and recover outstanding funds related to assigned programs.\n\tMaintain the fixed asset register and support depreciation calculations.\n\tManage imprest records and prepare petty cash reports.\n\tEnter accurate financial data into accounting software (e.g., Xero).\n\tIssue receipts and collect relevant payment documentation.\n\tOrganize and file physical financial and audit-related documents.\n\tUpdate and maintain student account logs and financial trackers.\n\tReconcile student payment records and provide account statements monthly.\n\tParticipate in finance team meetings and record meeting minutes.\n\tAssist with preparing statutory remittance reports (PAYE, WHT, NSITF, pensions).\n\tAddress student inquiries about payment issues through email or chat.\n\tEnsure complete documentation and upload of receipts to the system.\n\tReconcile financial records, including bank, cash, income, and student ledgers.\n\tMonitor petty cash and minor expenditure to support cost control.\n\tPerform other finance-related duties as assigned by the Finance Manager.\n\n\nQualifications\n\n\n\tBachelor's Degree in Accounting, Finance or a related field.\n\t1 - 3 years of relevant experience in finance or accounting support roles.\n\tBasic understanding of accounting principles and financial procedures.\n\tExperience using accounting software (e.g., Xero) is an advantage.\n\n\nSkills Required:\n\n\n\tStrong numerical and analytical skills.\n\tHigh attention to detail and accuracy.\n\tProficiency in Microsoft Office Suite, particularly Excel.\n\tGood written and verbal communication skills.\n\tAbility to manage multiple tasks and meet deadlines.\n\tStrong organizational and documentation skills.\n\tTeam-oriented with a proactive and flexible attitude.\n\tFamiliarity with financial compliance processes is a plus.\n\n\nMethod of Application\nInterested and qualified candidates should send their updated CV and Application to: Chinyere@romebusinessschool.ng using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Deputy General Manager, Mechanical (Power Plant) Job at Dangote Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/deputy-general-manager-mechanical-power-plant-job-at-dangote-group",
    "pubDate": "Wed, 09 Jul 2025 08:49:19 GMT",
    "source": "JobGurus",
    "keyword": "dangote group",
    "duplicate": false,
    "classifications": [],
    "content": "Dangote Group is one of Nigeria’s most diversified business conglomerates with a hard – earned reputation for excellent business practices and products’ quality with its operational headquarters in the bustling metropolis of Lagos, Nigeria in West Africa.\n\nWe are recruiting to fill the position below:\n\nJob Position: Deputy General Manager, Mechanical (Power Plant)\n\nJob ID: DGM-obj-27122024\nJob Location: Obajana, Kogi\nJob type: Full-time\nWork type: On-site\nCategory: DCP - Operations\n\nDescription\n     \n\n            \n    \n\n\n\n\n\tThe Dangote Group is seeking a Deputy General Manager, Mechanical for its Power Plant operations.\n\tThe ideal candidate will be responsible for overseeing the mechanical maintenance of the power plant and ensuring optimal performance and reliability of equipment.\n\n\nKey Responsibilities\n\n\n\tDevelop and implement preventive, predictive, and corrective maintenance schedules for all plant equipment, including gas turbines, compressors, gas generators, gas compressors, DM plant, Chiller, cooling tower and auxiliary systems.\n\tPlan and coordinate major overhauls, shutdowns, and inspections.\n\tLead and manage a team of maintenance engineers, technicians, and support staff.\n\tProvide training and development opportunities to enhance team skills and knowledge.\n\tPromote a culture of safety, accountability, and continuous improvement.\n\tEnsure maximum plant availability and reliability by minimizing downtime and responding promptly to equipment failures.\n\tImplement maintenance best practices and modern techniques to optimize plant performance.\n\tPrepare and manage the maintenance budget, ensuring cost-effective use of resources.\n\tMonitor and control maintenance expenses while maintaining high-quality standards.\n\tEnsure adherence to all safety, health, and environmental regulations.\n\tConduct regular audits and inspections to maintain safety and compliance standards.\n\tImplement corrective actions to mitigate risks and hazards.\n\tCoordinate with external vendors, contractors, and OEMs for procurement of spares, services, and maintenance support.\n\tEvaluate contractor performance and ensure contractual obligations are met.\n\tMaintain accurate records of maintenance activities, equipment history, and performance data.\n\tPrepare periodic maintenance reports and present them to senior management.\n\n\nRequirements\nEducational Qualifications and Experience:\n\n\n\tCandidates should possess a Bachelor's Degree in Mechanical Engineering.\n\tMinimum of 24 years of experience in mechanical maintenance within power plant operations.\n\n\nSkills and Competencies:\n\n\n\tStrong knowledge of power plant systems, including gas turbines, gas generators and electrical systems.\n\tProficient in SAP System\n\tExcellent problem-solving, leadership, and communication skills.\n\tAbility to manage multiple priorities.\n\tProficient in predictive, preventive, and corrective maintenance approaches.\n\tStrong analytical and problem-solving abilities.\n\tFamiliarity with safety regulations and best practices in mechanical maintenance.\n\tProficient in Microsoft Office and relevant maintenance management software.\n\n\nBenefits\n\n\n\tPrivate Health Insurance\n\tPaid Time Off\n\tTraining & Development\n\tth Insurance\n\tPension Plan\n\tPaid Time Off\n\tTraining & Development\n\tPerformance Bonus\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Graphics Designer / Virtual Assistant Job at International Facilities Services (IFS) Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/graphics-designer-virtual-assistant-job-at-international-facilities-services-ifs-group",
    "pubDate": "Wed, 09 Jul 2025 08:49:19 GMT",
    "source": "JobGurus",
    "keyword": "international facilities services (ifs) group",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance"
    ],
    "content": "International Facilities Services (IFS) Group is a Cleaning and Facility Management company. We are a leading international facility management services group providing maintenance, industrial cleaning, trading & consultancy, & healthcare support services.\n\nWe are recruiting to fill the position below:\n\nJob Position: Graphics Designer / Virtual Assistant\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n            \n    \n\n\n\n\n\tOur company is searching for a talented digital designer and visual artist to create interactive online content and maintain a smooth user interface for our website and social media pages.\n\tYou'll be responsible for producing content that matches the company's brand, aesthetic, and marketing strategy, including social media graphics, website banners, and promotional artwork.\n\tThe ideal candidate should be able to efficiently combine creativity, functionality, and technology to produce eye-catching and informative content.\n\tIn this role, organizational and technical skills are key, and all candidates must possess in-depth knowledge of design software programs.\n\n\nResponsibilities\n\n\n\tDesigning, producing, and managing interactive online content, including email templates, social media, and promotional artwork, and informative ebooks.\n\tPreparing briefs for each project and presenting design ideas to all the relevant stakeholders.\n\tDesign, build and maintain our social media presence\n\tMeasure and report the performance of all digital marketing campaigns, and assess against goals (ROI and KPIs)\n\tIdentify trends and insights, and optimize spend and performance based on the insights\n\tBrainstorm new and creative growth strategies\n\tPlan, execute, and measure experiments and conversion tests\n\tEnsuring consistency in designs and content across all company platforms.\n\tReviewing product positioning and online marketing content to identify room for improvement.\n\tProviding advice and guidance on the aesthetic for campaigns, projects, and promotional events.\n\n\nRequirements\n\n\n\tBachelor's Degree in Digital Design, Graphic Design, or a related field.\n\tProven experience in a professional digital design role.\n\tDemonstrable experience leading and managing SEO/SEM, marketing database, email, social media, and/or display advertising campaigns\n\tHighly creative with experience in identifying target audiences and devising digital campaigns that engage, inform and motivate\n\tExperience in optimizing landing pages and user funnels\n\tExperience with A/B and multivariate experiments\n\tSolid knowledge of website analytics tools (e.g., Google Analytics, NetInsight, Omniture, WebTrends)\n\tA portfolio of previous digital design work to showcase experience and creativity.\n\tSolid knowledge of design software programs, such as Sketch, and Adobe Creative Suite.\n\tAbility to clearly present design ideas and concepts for campaigns and projects.\n\tA team player with exceptional organizational and technical skills.\n\n\nSalary\nN150,000 per month.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]