[
  {
    "title": "Senior Financial Accountant Job at Infinion Technologies",
    "link": "https://www.jobgurus.com.ng/jobs/view/senior-financial-accountant-job-at-infinion-technologies-2",
    "pubDate": "Sat, 05 Jul 2025 18:44:55 GMT",
    "source": "JobGurus",
    "keyword": "infinion technologies",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Infinion Technologies is a Microsoft certified partner, we offer custom solutions to Enterprise businesses for business automation using the latest and sophisticated technologies. \n\nWe are recruiting to fill the position below:\n\nJob Position: Senior Financial Accountant\n\nJob Location: Victoria Island, Lagos \nEmployment Type: Full-time\n\nAbout the Role\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Senior Financial Accountant will work closely with the CFO to manage and improve the company’s financial health.\n\tThis role requires strong technical accounting skills, attention to detail, and a proactive mindset to support decision-making across the business.\n\n\nKey Responsibilities\n\n\n\tPrepare accurate monthly, quarterly, and annual financial statements in accordance with IFRS.\n\tOversee all general ledger activities and ensure timely reconciliations.\n\tSupport budgeting, forecasting, and financial planning processes.\n\tEnsure compliance with all tax, regulatory, and statutory requirements.\n\tManage internal and external audits, including liaising with auditors and preparing audit documentation.\n\tMonitor cash flow, expenses, and financial performance, providing actionable insights.\n\tAssist in developing and maintaining internal controls, financial policies, and procedures.\n\tProvide support for financial analysis on key business initiatives and investments.\n\tCollaborate with other departments to improve financial processes and reporting.\n\n\nQualifications and Requirements\n\n\n\tBachelor’s Degree in Accounting, Finance, or related field.\n\tMinimum of 7–8 years of relevant experience, preferably in a high-growth or tech-driven environment.\n\tICAN, ACA, or ACCA certification is required.\n\tStrong knowledge of IFRS and local tax laws.\n\tAdvanced proficiency in accounting software (e.g., Sage, QuickBooks, Microsoft Dynamics) and Excel.\n\tExceptional analytical, problem-solving, and organizational skills.\n\tProven ability to work independently and as part of a team in a fast-paced environment.\n\n\nWhat We Offer\n\n\n\tCompetitive salary and performance-based incentives\n\tOpportunity to work in a high-impact, innovation-driven environment\n\tCareer growth and professional development\n\tA collaborative, inclusive company culture.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: careers@infinion.co using “Senior Financial Accountant\" as the subject of the email.\n\nNote: The role is 100% Onsite.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]