[
  {
    "title": "Marketing / Sales Manager Job at Masruq Investment Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/marketing-sales-manager-job-at-masruq-investment-limited",
    "pubDate": "Mon, 30 Jun 2025 21:38:31 GMT",
    "source": "JobGurus",
    "keyword": "masruq investment limited",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance"
    ],
    "content": "Masruq Investment Limited is a leading agribusiness company based in Nigeria that was founded on January 22nd, 2015. Our primary emphasis is on the processing and production of high-quality agricultural products, particularly beans and other staple crops. Masruq is committed to bringing you the best products possible, made from locally sourced and responsibly grown ingredients. Our cutting-edge processing facility enables us to produce a diverse range of products such as peeled beans, bean flour, yam flour, plantain flour, chilli powder, and other spices.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe take great pride in our commitment to quality, and our products are manufactured using stringent quality control procedures to ensure that you only receive the best. We are committed to providing you with the highest quality products at competitive prices, whether you are a wholesaler, retailer, or consumer. Masruq believes in long-term relationships with our customers and partners. Our team consists of experienced professionals who are committed to providing you with the best service possible and ensuring that you are completely satisfied with your experience with us.\n\nWe are recruiting to fill the position below:\n\nJob Position: Marketing / Sales Manager\n\nJob Locations: Bwari, Dutse & Kubwa - Abuja (FCT)\nEmployment Type: Full-time\nDepartment: Sales & Marketing\nReports to: General Manager / Managing Director\n\nJob Summary\n\n\n\tThe Marketing & Sales Manager will be responsible for developing and executing strategic marketing and sales plans to grow the company’s market share, increase brand visibility, and drive revenue.\n\tThe role requires deep knowledge of the food industry, market trends, customer behavior, and strong leadership skills to manage a team and meet business targets.\n\n\nKey Responsibilities\nSales Functions:\n\n\n\tDevelop and implement effective sales strategies to achieve sales targets.\n\tIdentify new markets and customer segments for the company’s food products.\n\tBuild and maintain strong relationships with distributors, wholesalers, retailers, and key customers.\n\tConduct regular market visits and oversee field sales activities to monitor performance and ensure market penetration.\n\tNegotiate and close business deals, pricing, and terms of sales agreements.\n\tAnalyze sales performance metrics and provide detailed sales reports to management.\n\n\nMarketing Functions:\n\n\n\tDesign and execute marketing campaigns to promote products and increase brand awareness.\n\tManage online and offline marketing activities including social media, advertising, product launches, and events.\n\tConduct market research to identify consumer needs, preferences, and trends.\n\tDevelop pricing strategies and promotional programs to drive product demand.\n\tCollaborate with product development and production teams to align product offerings with market demand.\n\tMonitor competitors’ marketing and sales activities to maintain a competitive edge.\n\n\nTeam Management:\n\n\n\tLead and motivate the sales and marketing team to meet departmental goals.\n\tConduct training and mentoring to improve team performance.\n\tSet sales targets, assign responsibilities, and track team progress.\n\n\nPerformance Indicators\n\n\n\tMonthly and annual sales target achievement\n\tGrowth in market share\n\tROI on marketing campaigns\n\tCustomer acquisition and retention rates\n\tDistribution expansion\n\n\nKey Requirements\n\n\n\tBachelor’s degree in Marketing, Business Administration, or related field.\n\tMinimum of 5 years of experience in sales and marketing, preferably in the food processing or FMCG industry.\n\tProven track record of meeting or exceeding sales targets.\n\tStrong understanding of local and regional market dynamics in the food industry.\n\tExcellent communication, negotiation, and leadership skills.\n\tProficient in Microsoft Office and CRM software.\n\tAbility to travel as required.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and Cover Letter in PDF only to: mmc.hr.recruits@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Sales Manager Job at Tybitx Services International Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/sales-manager-job-at-tybitx-services-international-limited",
    "pubDate": "Mon, 30 Jun 2025 21:38:31 GMT",
    "source": "JobGurus",
    "keyword": "tybitx services international limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Tybitx Services International Limited - Our client, a Travel agency, is recruiting to fill the position below:\n\nJob Position: Sales Manager\nJob Location: Lagos Island, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tThe role involves managing flight bookings, promoting travel services, and helping the agency attract and retain customers.\n\tThe ideal candidate should be confident, organised, and comfortable working in a sales and customer-facing role.\n\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tHandle flight bookings and respond to customer inquiries\n\tPromote travel deals and close sales\n\tSupport the agency’s sales and marketing efforts\n\tFollow up on leads and maintain client relationships\n\tHelp drive bookings and improve customer engagement.\n\n\nJob Requirements\n\n\n\tMinimum of OND qualification\n\tStrong communication and interpersonal skills\n\tSales-minded with good negotiation ability\n\tAble to work well independently and with a team\n\tExperience or interest in sales, marketing, or customer service is an advantage.\n\n\nSalary\nN100,000 Monthly.\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Branding and Communications Manager Job at ACE Real Estates Development Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/branding-and-communications-manager-job-at-ace-real-estates-development-limited",
    "pubDate": "Mon, 30 Jun 2025 21:38:31 GMT",
    "source": "JobGurus",
    "keyword": "ace real estates development limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "ACE Real Estates Development Limited is a real estate company located in Lekki Phase 1, Lagos.\n\nJob Position: Branding and Communications Manager\nJob Location: Lekki Phase 1, Lagos\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDigital and Traditional Marketing\n\tInternal and External Communications\n\tContent Creation (Graphics and Videos)\n\tCoordinate the design of promotional material and distribute in online and offline channels\n\tPlan interviews and press conferences\n\tSocial Media Engagement and Management\n\tPromote our products and services during events\n\tProduce marketing copy for our website\n\tCraft and send regular newsletters with company updates.\n\tTrack ROI for marketing campaigns.\n\n\nRequirements\n\n\n\tCandidates should possess a Bachelor's Degree with 1 - 3 years of experience.\n\n\nSalary\nN300,000 - N400,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hr@acerealestates.ng using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Project In-Charge Manager Job at PG Consulting Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/project-in-charge-manager-job-at-pg-consulting-limited",
    "pubDate": "Mon, 30 Jun 2025 21:38:31 GMT",
    "source": "JobGurus",
    "keyword": "pg consulting limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "PG Consulting Limited is a recruitment, training and business consulting firm. We provide our clients - businesses and corporate organizations - across different industries with superior human capital, high-quality trainings and cutting-edge consulting to help them drive organizational growth, multiply staff productivity, gain appropriate market positioning and maximise profit.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nOver the course of almost 20 years of our existence, we have serviced various organizations, many of which are strong indigenous brands operating with global standards. We are most inclined to building strong brands and supporting business growth across industries. Our preference is to work with our clients as partners on an on-going basis towards making their organizations internally effective and more profitable. As we grow into the future, the sustaining core of our operations is working with you, all the way, from People to Profit.\n\nWe are recruiting to fill the position below:\n\nJob Position: Project In-Charge Manager\n\nJob Location: Ajaokuta, Kogi\nEmployment Type: Fuultime\nIndustry: Manufacturing/Building Materials\nReporting To: Head of Engineering\n\nJob Summary\n\n\n\tWe are expanding our team and seeking a qualified and experienced Project In-Charge Manager to oversee operations at our Ajaokuta Plant.\n\tThe role is responsible to work closely with project teams, managing day-to-day activities and ensuring proper coordination between project managers and the contractors.\n\tAct as a liaison to streamline processes and ensure alignment with project goals. Collaborate with subject matter experts and production teams to ensure that the project site runs smoothly, delivering value to the client while ensuring operational excellence.\n\tIn Preparation of project Schedule & Execution of project, Preparation of Technical Specification & data sheets for RFQ, etc.\n\n\nExperience & Key Responsibilities\n\n\n\tWork closely with project teams, managing day-to-day activities and ensuring proper coordination between project managers and the contractors. Act as a liaison to streamline processes and ensure alignment with project goals.\n\tCollaborate with subject matter experts and production teams to ensure that the project site runs smoothly, delivering value to the client while ensuring operational excellence.\n\tProvide on-site support to project teams during planning and execution phases, Supervision and arraging resources, Planning the material storage requirements, and Tracking of materials from storage location to project site.\n\tPreparation of project Schedule & Execution of project, Preparation of Technical Specification & data sheets for RFQ, etc\n\tCompliance to Safety management systems, work permits, Shutdown management, Site preparations for safe execution of the Project, Identifying the risk involved in the execution, mitigation plans and coordination for safe execution. Ensure a safe working environment for all project personnel, including contractors and subcontractors. Develop and implement safety plans and procedures to minimize the risk of accidents and injuries.\n\tOversee the design documents, procurement trackings, installation, and testing Mechanical and electrical equipments. Ensuring the Project site is executing as per the approved design documents.\n\tCommunicate project progress, risks, and issues to project manager. Prepare the daily Progress report (DPR) of the Project, monthly progress report, update the project milestones, Participate in the project review meetings and updating the Progress.\n\tPlan for shutdown management in coordination with user departments without effecting the project schedules. Follow isolation procedures and execution at the site.\n\tPreparation of AutoCAD drawings, review and explanation to the contractors for execution as per the Project documents.\n\tEscalating to project manager about all abnormal developments with respect to progress of work, safety, quality, resources etc. Daily Tool box meeting with Contractors, Coordination with OEM technicians during erection and commissioning.\n\n\nRequirements\n\n\n\tDegree in Mechanical Engineering/ Electrical Engineering\n\tStrong project management skills, including planning, organizing, and controlling.\n\tAbility to manage multiple stakeholders and priorities.\n\tSkilled at increasing workforce productivity during execution\n\tCapable of managing multiple tasks and sections within a factory\n\tTechnical awareness of civil, electro-mechanical and architectural works. Willing to work extra hours during the critical project milestones execution.\n\tExcellent command required in manpower management, scheduling management, providing techniques to increase the productivity of workers while execution.\n\n\nSalary\nVery Attractive\n\nMethod of Application\nInterested and qualified candidates should send their application with a copy of their CV to: jobs@pgconsultinguk.com using the Job Position as the subject of the email.\n\nNote: Only shortlisted candidates will be contacted.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Digital Manager Job at Lucky Fibres Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/digital-manager-job-at-lucky-fibres-limited",
    "pubDate": "Mon, 30 Jun 2025 21:38:31 GMT",
    "source": "JobGurus",
    "keyword": "lucky fibres limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Lucky Fibres Limited started out making Nobel Carpets and rugs but pivoted into premium hair extensions by introducing Lush Hair in 2017. Since then, Lush Hair has become Increasingly Popular with consumers for its high quality and trendy styles.\n\nWe are recruiting to fill the position below:\n\nJob Position: Digital Manager\n\nJob Location: Lagos\nEmployment Type: Full-time\nCompany: Lush Hair Africa\nIndustry: FMCG / Beauty & Personal Care\n\nAbout the Role\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a strategic, data-driven, and hands-on Digital Manager to lead our digital transformation and elevate our brand’s online presence across multiple African markets.\n\tIn this role, you will drive performance across social media, e-commerce platforms, and digital marketing channels, creating impactful consumer experiences that drive awareness, engagement, and sales.\n\tThe ideal candidate is passionate about digital innovation, performance marketing, and understands how to translate data into actionable strategies.\n\n\nKey Responsibilities\n\n\n\tDevelop and execute a comprehensive digital strategy across all digital touchpoints: social media, website, e-commerce, email marketing, and paid media.\n\tLead performance marketing efforts including PPC, paid social, and display campaigns to drive lead generation and conversions.\n\tManage all social media platforms, planning content calendars, posting schedules, community engagement, and analytics tracking.\n\tOptimize the e-commerce experience across both owned and third-party platforms, improving customer journeys, conversion rates, and online sales.\n\tCollaborate with cross-functional teams (brand, creative, trade) and external partners (agencies, influencers, e-commerce platforms) to drive cohesive execution.\n\tStay updated on digital trends, platform algorithms, and competitor activity to guide strategic adjustments.\n\tConduct A/B testing, map out customer journeys, and deliver regular performance reports with recommendations for continuous improvement.\n\tEnsure consistency in brand voice and visual identity across all online platforms.\n\n\nRequirements & Qualifications\n\n\n\tBachelor’s Degree in Marketing, Communications, Digital Media, or related field.\n\t5+ years of experience in digital marketing, preferably in the FMCG, beauty, or retail sector.\n\tProven track record of managing paid media campaigns and e-commerce performance.\n\tStrong analytical skills and proficiency in using digital tools (Google Analytics, Meta Ads, Shopify, etc.).\n\tExcellent communication and project management skills.\n\tExperience working across African markets is a major advantage.(e.g., Ghana, Kenya, South Africa).\n\n\nWhat We Offer\n\n\n\tA vibrant, collaborative, and growth-oriented work environment.\n\tThe opportunity to shape and scale a leading brand’s digital future across African markets.\n\tCompetitive compensation and benefits.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]