[
  {
    "title": "General Manager Job at Hilton Worldwide",
    "link": "https://www.jobgurus.com.ng/jobs/view/general-manager-job-at-hilton-worldwide",
    "pubDate": "Wed, 11 Jun 2025 18:22:03 GMT",
    "source": "JobGurus",
    "keyword": "hilton worldwide",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Hilton is the leading global hospitality company, spanning the lodging sector from luxurious full-service hotels and resorts to extended-stay suites and mid-priced hotels. For nearly a century, Hilton has offered business and leisure travelers the finest in accommodations, service, amenities and value. Hilton is dedicated to continuing its tradition of providing exceptional guest experiences across its global brands. Our vision to fill the earth with the light and warmth of hospitality unites us as a team to create remarkable hospitality experiences around the world every day. And our amazing Team Members are at the heart of it all.\n\nWe are recruiting to fill the position below:\n\nJob Position: General Manager\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Ref ID: HOT0BFQS\nJob Location: Abuja\n\nThe Role\n\n\n\tThis exciting General Manager position will be responsible for managing the Hotel Management team, hotel targets to deliver an excellent Guest and Team Member experience while managing profitability and meeting our Owners expectations.  \n\n\nResponsibilities\nSpecifically, you will be responsible for performing the following tasks to the highest standards:\n\n\n\tManage and lead the hotel operation with a strong focus on F&B and C&E.\n\tManage ongoing profitability of the hotel, ensuring revenue, guest satisfaction and Team Member engagement goals are met and exceeded.\n\tLead in all key property issues including capital projects, customer service, and refurbishment.\n\tEnsure all decisions are made in the best interest of the hotel, Hilton and owner.\n\tComply with and exceed Hilton Brand Service Standards.\n\tEnsure costs are controlled.\n\tManage and develop the Hotel Executive team to ensure career progression and effective succession planning within Hilton.\n\tConduct regular briefings and communication meetings with the HOD team, fostering collaboration and alignment.\n\tMaintain a strong working relationship with the Union through consistent engagement and meetings.\n\tHold regular connects and briefings with owner team.\n\tDeliver achievable hotel budgets and set other short- and long- term strategic goals for the property.\n\tProvide exceptional leadership to hotel Team Members focusing on Hilton culture and values.\n\tLead in all aspects of business planning.\n\tBeing highly visible in the hotel, meeting with customer and VIPs.\n\tRespond to audits to ensure continual improvement is achieved.\n\n\nRequirements\n\n\n\tCandidates should possess a Degree or Diploma in Hotel Management or equivalent.\n\tThe ideal candidate will possess excellent leadership skills with a strong focus on Owner relations, Operations, F&B, Commercial, Guest experience and Team Member engagement.\n\tEnthusiastic and passionate, you will have current experience as a strategic hotel General Manager ideally with Africa market experience.\n\tA General Manager serving Hilton brands is always working on behalf of our Guests and working with other Team Members.\n\n\nTo successfully fill this role, you should maintain the attitude, behaviours, skills, and values that follow:\n\n\n\tA highly Established General Manager with a strong F&B background and commercial knowledge.\n\tExperience working in an international branded hotel of a similar size.\n\tExceptional Owner relations experience – excellent track record leading with owners and providing guidance.\n\tDemonstrated ability to collaborate and build strong networks and relationships with owners, contractors, corporates, the local community, and the press, ensuring high visibility.\n\tPassionate about networking and maintaining a high profile to foster connections and relationships. Act as the face of Transcorp Hilton Abuja, representing Hilton/owners at public events.\n\tDeliver innovative commercial opportunities with experience in increasing profitability especially in the MICE business.\n\tExceptional people leadership, creating synergies, and retention of talent with the ability to bring a team together on a journey and instilling the Hilton culture and values.\n\tExceptional stakeholder/owner relations experience.\n\tLabor union experience (two unions in place.)\n\tAbility to show resilience, judgement and leadership, with strong communication skills.\n\tExperience managing budgets, revenue proposals, and forecasting results in a similar sized property.\n\tIn-depth knowledge of the hotel sector.\n\tEnglish language mandatory.\n\tExpat package available.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "General Ledger Accounting Manager Job at DP World",
    "link": "https://www.jobgurus.com.ng/jobs/view/general-ledger-accounting-manager-job-at-dp-world",
    "pubDate": "Wed, 11 Jun 2025 18:22:03 GMT",
    "source": "JobGurus",
    "keyword": "dp world",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "DP World - We exist to make the world’s trade flow better, changing what’s possible for the customers and communities we serve globally. With a dedicated, diverse and professional team of more than 108,100 employees spanning 74 countries on six continents. We are pushing trade further and faster towards a seamless supply chain that’s fit for the future. We’re rapidly transforming and integrating our businesses - Ports and Terminals, Marine Services, Logistics and Technology – and uniting our global infrastructure with local expertise to create stronger, more efficient end-to-end supply chain solutions that can change the way the world trades.\n\nWe are recruiting to fill the position below:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Position: General Ledger Accounting Manager\n\nJob Location: Lagos\n\nJob Function\n\n\n\tThis role focuses on maintaining accurate financial records and supporting daily accounting operations within the finance department.\n\tThe position involves managing general ledger activities, asset accounting, insurance coordination, and collaborating with various teams to ensure compliance with company policies while contributing to process improvements.\n\n\nKey Accountabilities\n\n\n\tGL accounting: ensuring accuracy of accounting in general ledger accounts and timely closure of postings.\n\tGL balances reconciliation and preparation of monthly GL reports and balances.\n\tGL open item management and clearing.\n\tPreparation of asset registers and tracking against budgets.\n\tManaging company insurance profiles and participating in risk mitigation strategies.\n\tConducting periodic reviews of debtors with the sales team.\n\tAsset accounting and ensuring compliance with company policies and procedures.\n\tAssisting the Senior Finance Manager in discharging day-to-day accounts operations.\n\tContributing to the development and implementation of process improvements within the finance function.\n\n\nQualifications\n\n\n\tCandidates should possess relevant qualifications\n\tMust be a member of ICAN.\n\n\nSkills and Experience:\n\n\n\t3 - 5 years of experience in a similar environment.\n\tHands-on experience with ERP systems.\n\tStrong knowledge of accounting principles and large data analytical skills\n\tGood interpersonal skills.\n\tAbility to work under pressure.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Human Resource Officer Job at Food Concepts Plc",
    "link": "https://www.jobgurus.com.ng/jobs/view/human-resource-officer-job-at-food-concepts-plc-2",
    "pubDate": "Wed, 11 Jun 2025 18:22:03 GMT",
    "source": "JobGurus",
    "keyword": "food concepts plc",
    "duplicate": false,
    "classifications": [],
    "content": "Food Concepts commenced operations in 2001. From inception, our aim has been clear-cut and focused: to revolutionize the food sector in West Africa and to deliver extraordinary satisfaction to our stakeholders.\n\nSince launching in 2004, Chicken Republic (Subsidiary of Food concepts) has already opened 55 stores in Nigeria and Ghana. On this basis, we are proud of the brand’s hard-earned reputation as the fastest growing chicken QSR in West Africa and the number 1 chicken QSR in Nigeria (both in revenues and number of outlets). In addition, Chicken Republic was ranked as one of Nigeria’s top 20 brands across all categories (Financial Standards Awards 2009).\n\nThey are recruiting to fill the position below:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Position: Human Resource Officer\n\nRequisition ID: 1142\nJob Location: Mushin, Lagos\nReport to: Human Resources Manager \nDepartment: Human Resources Department\n\nJob Purpose\n\n\n\tTo provide administrative support functions to the Human Resource operations department\n\n\nCore Responsibilities and Key Result Areas\nRecords Management:\n\n\n\tCreate and manage the HR Database\n\tShare database information with only approved recipients\n\tKeep the records, documents and files, relating to all employees of the organization\n\tMake available for all staff within the division directly or indirectly through line managers, all work tools or conditions that contribute to or enhances the delivery of excellent performances from employees\n\n\nHuman Resources Administrative Functions:\n\n\n\tPrepare and deploy payroll activities every month and ensure all employees are paid promptly and correctly\n\tProvide staff with all required forms when requested for, such as, Leave Forms, Loan Forms, Medical forms, Pension forms, Tax forms, etc.\n\tRemit taxes and payroll deductions in a timely manner.\n\tEnsure all PFAs update employees’ records with their pension contributions 2 weeks after remittance\n\tAct as an Interface with Admin department on issues relating to Admin’s support, e.g., travels, stationeries, uniforms, etc.\n\n\nDepartmental Correspondence:\n\n\n\tKeep all correspondences, memos, reports and certificates in each employee’s and also the department’s files\n\tTrack the in and out of the files and the document contents of the files\n\tEnsure all due correspondences, memos, reports and certificates are tracked in each employees files\n\tProvide updates and action logs on all departmental correspondences and follow up prompt deliveries by the assigned, summarizing your report to the Human Resource Manager weekly.\n\tPerform any other related task as may be assigned from time to time\n\tKey Performance Indicators\n\tQuality of Database management\n\tRate of Internal Compliance\n\n\nJob Specifications\n\n\n\tA good first degree in Human Resources, Business Administration, or related discipline\n\tMinimum of 2 years of experience in a similar role is required\n\tMembership of CIPM, HRCI or any other related professional degree is an added advantage\n\n\nKnowledge Requirements:\n\n\n\tKnowledge of QSR/ Food Industry Trends and processes\n\tKnowledge of Process Management, Knowledge and Application\n\tDemonstrates Problem Solving & Analysis skills\n\tKnowledge of the country’s Labor laws\n\n\nDecision Expectations:\n\n\n\tEnsure all due correspondences, memos, reports and certificates are tracked in each employees files\n\tCreate and manage the HR Database\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Safety Officer Job at BSS Consulting Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/safety-officer-job-at-bss-consulting-limited-2",
    "pubDate": "Wed, 11 Jun 2025 18:22:03 GMT",
    "source": "JobGurus",
    "keyword": "bss consulting limited",
    "duplicate": false,
    "classifications": [],
    "content": "BSS Consulting Limited engages in HSE, Consultancy, Outsourcing and Training. We render services for manufacturing, Oil and Gas, Financial Institution and other corporate organization. The company was incorporated on 26th October, 2003 (RC 498083).\n\nWe are recruiting to fill the position below:\n\nJob Position: Safety Officer\n\nJob Location: Surulere, Lagos\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDelivers and facilitates structured safety and regulatory training and development programs and initiatives in support of the company’s training plan, objectives and brand essence\n\tUpdates materials as dictated by changes in regulations and/or programs\n\tProvides coaching, reinforcement of safety policy and procedures in cooperation with EHS department to Team Members throughout the resort\n\tPerforms administrative duties to track completion of training, scheduling of classes and resources, compile and prepare statistical information on training program status\n\tPosition will require candidate to have flexibility to conduct training sessions during any of the three operating shifts and be available to the needs of the various client groups this position will support\n\tEnsure the delivery of high quality, innovative and engaging CITB certified courses that meet all required aspects of the employees learning needs, CITB requirements meeting business budgets\n\tEnsure the development & delivery of high quality, innovative and engaging HSES certified courses that meet all required aspects of the employees learning needs meeting business budgets\n\tEnsure UK core HSES standards and processes are embedded into the training plans wherever possible\n\tMaintain accurate and timely training records and reports through strong alignment and engagement with Employee Services L&D admin team\n\tMaintain technical excellence levels for all CITB and UK HSES training material.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV / Resume to: Bss_consulting@yahoo.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Credit, Risk & Recovery Manager Job at Outsource Nigeria",
    "link": "https://www.jobgurus.com.ng/jobs/view/credit-risk-recovery-manager-job-at-outsource-nigeria",
    "pubDate": "Wed, 11 Jun 2025 18:22:03 GMT",
    "source": "JobGurus",
    "keyword": "outsource nigeria",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Outsource Nigeria is a full-service Human Resources agency, specializing in providing outsourced turnkey manpower solutions to growing companies. Our solution include HR Services, Recruiting, Accounting, IT Support, Business Intelligence, Developers, and Operations including management and field / phone / automated based resources. The core of Outsource Nigeria’s success is its people.\n\nWe are recruiting to fill the position below:\n\nJob Position: Credit, Risk & Recovery Manager\n\nJob Location: Abuja (FCT) \nEmployment Type: Full-time\n\nJob Purpose\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Credit, Risk & Recovery Manager is responsible for overseeing the bank’s entire credit risk management process—spanning credit origination, risk evaluation, portfolio monitoring, and recovery.\n\tThis role ensures that credit decisions align with regulatory standards and internal policies while minimizing non-performing loans (NPLs) and optimizing recovery efforts.\n\n\nKey Responsibilities\nCredit Management:\n\n\n\tDevelop, implement, and monitor credit policies and procedures in line with CBN regulations and the bank’s risk appetite.\n\tEvaluate and approve or recommend loan applications after thorough risk analysis.\n\tOversee credit appraisal processes to ensure accurate assessment of customer creditworthiness.\n\tMonitor disbursements, loan performance, and ensure portfolio quality.\n\n\nRisk Management:\n\n\n\tIdentify, assess, and mitigate credit, operational, and market risks.\n\tConduct regular stress testing, credit risk reviews, and portfolio analysis.\n\tEnsure compliance with internal risk limits and regulatory requirements.\n\tMaintain a risk register and recommend corrective actions to senior management.\n\n\nRecovery & Collections:\n\n\n\tDevelop and implement effective loan recovery strategies and policies.\n\tSupervise loan collection efforts and manage delinquent accounts.\n\tLiaise with legal and external recovery agents where necessary.\n\tMinimize loan losses through proactive engagement and restructuring where applicable.\n\n\nReporting & Compliance:\n\n\n\tPrepare regular reports on credit risk exposure, delinquency trends, and recovery performance.\n\tEnsure timely submission of reports to CBN and other relevant regulators.\n\tAssist in internal and external audits relating to credit and risk matters.\n\n\nKey Performance Indicators (KPIs):\n\n\n\tPortfolio at Risk (PAR) ratios\n\tLoan recovery rates.\n\tCredit approval turnaround time.\n\tNon-performing loans (NPL) as % of total portfolio\n\tRegulatory and audit compliance scores\n\tRisk mitigation effectiveness.\n\n\nRequirements\n\n\n\tBachelor’s Degree in Finance, Accounting, Economics, or a related field (Master’s preferred).\n\t5–10 years of experience in credit management, risk assessment, and debt recovery.\n\tProfessional certification (e.g., CPA, CFA) is a plus.\n\tStrong understanding of financial statements, credit scoring, and regulatory frameworks.\n\tExcellent financial and risk management capabilities.\n\tDeep understanding of regulatory frameworks and corporate governance.\n\tExceptional leadership, interpersonal, and communication skills.\n\tTrack record of innovation and driving business growth.\n\tHigh ethical standards and commitment to social impact.\n\tIntegrity, independence, and a proactive approach to work.\n\n\nSalary\nN300,000 / month.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: jobs@outsourcenigeria.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]