[
  {
    "title": "Front Desk Officer Job at Daily Need Distributors Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/front-desk-officer-job-at-daily-need-distributors-limited",
    "pubDate": "Mon, 16 Jun 2025 18:22:06 GMT",
    "source": "JobGurus",
    "keyword": "daily need distributors limited",
    "duplicate": false,
    "classifications": [],
    "content": "Daily Need Distributors Limited is a leading FMCG distributing company in West Africa covering 4 states in North Central Nigeria, with Head Office in Abuja, Nigeria. We have been delivering excellent values for over 25 years of existence. Our experience span through result driven partnerships with multinational, intercontinental and local organizations.\n\nWe are recruiting to fill the position below:\n\nJob Position: Front Desk Officer\nJob Location: Idu, Abuja (FCT)\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tGreeting and assisting clients and visitors professionally.\n\tAnswering and routing incoming calls.\n\tManaging the reception area, ensuring it's organized and welcoming.\n\tMaintaining visitor logs and client records.\n\tHandling general inquiries and directing them to the appropriate personnel.\n\tAttending to customers' enquiries and complaints.\n\n\nRequirements\n\n\n\tOND, HND, or Bachelor's Degree in Business Administration, Public Administration, Mass Communication, or a related field.\n\t1-3 years of experience in a similar role.\n\tComputer literacy is essential.\n\tMust be a mature, responsible, and well-mannered individual.\n\tStrong communication and interpersonal skills.\n\tFemale and single\n\tFluentin Hausa\n\tClose proximity to Idu, Abuja.\n\n\nBenefits\n\n\n\tSalary: N100,000 Gross/ Month.\n\tAnnual leave allowance.\n\tHealth Insurance Cover.\n\tCareer development programs.\n\n\nMethod of Application\nInterested and qualified candidates should send their CVs to: recruitment@dndng.net using the Job Position as the subject of the mail.     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Software Engineer Job at Choice Talents NG",
    "link": "https://www.jobgurus.com.ng/jobs/view/software-engineer-job-at-choice-talents-ng",
    "pubDate": "Mon, 16 Jun 2025 18:22:06 GMT",
    "source": "JobGurus",
    "keyword": "choice talents ng",
    "duplicate": false,
    "classifications": [
      "Software Engineering"
    ],
    "content": "Choice Talents NG is Nigeria’s preferred talents management company. Our goal is to help build successful businesses through effective talent, resource and process management.\n\nWe are recruiting to fill the position below:\n\nJob Position: Software Engineer\n\nJob Locations: Abuja (FCT) and Lagos (Remote)\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe are seeking a software Engineer to build and maintain softwares, working on full lifecycle development, API integrations, and automation.\n\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDesign, develop, and maintain secure, scalable web and mobile applications.\n\tDevelop RESTful APIs and integrate third-party services (e.g., payment processors, authentication).\n\tBuild cross-platform mobile apps using React Native, Flutter, or other frameworks.\n\tCollaborate with advisory teams to automate and digitize tax and audit processes.\n\tMaintain version control, document codebase, and ensure testing protocols.\n\tMonitor application performance and resolve bugs or performance bottlenecks.\n\tSupport deployment to cloud platforms (e.g., AWS, Azure).\n\n\nRequirements\n\n\n\tB.Sc Degree in Computer Science, Engineering, or related discipline.\n\t3+ years of experience in full stack development.\n\tProficient in front-end technologies: React, HTML, CSS, JavaScript.\n\tStrong back-end skills: Node.js, C#, Python, PHP, or .NET.\n\tSolid experience in mobile app development (React Native or Flutter preferred).\n\tFamiliarity with SQL and NoSQL databases (e.g., PostgreSQL, MongoDB).\n\tExperience with Git, CI/CD pipelines, and agile methodologies.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: jobs@choicetalents.com.ng using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Human Resources & Recruitment Officer Job at Mactay Consulting",
    "link": "https://www.jobgurus.com.ng/jobs/view/human-resources-recruitment-officer-job-at-mactay-consulting-1",
    "pubDate": "Mon, 16 Jun 2025 18:22:06 GMT",
    "source": "JobGurus",
    "keyword": "mactay consulting",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Mactay Consulting, We are the leading management consulting firm in Nigeria, providing HR Consulting, Learning & Development Solutions, Outsourcing and Contact Centre Solutions.\n\nWe are recruiting to fill the position below:\n\nJob Position: Human Resources & Recruitment Officer\n\nJob Location: Lekki phase 1, Lagos\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a dynamic and results-driven Human Resources & Recruitment Officer to join our team.\n\tThe ideal candidate will be responsible for managing the full recruitment process, handling payroll administration, growing our social media presence, and maintaining strong relationships with clients through regular visits and engagements.\n\n\nResponsibilities\nRecruitment & Onboarding:\n\n\n\tManage end-to-end recruitment process including sourcing, interviewing, and onboarding of candidates\n\tMaintain and update job descriptions and specifications\n\tConduct background checks and employment verifications\n\n\nPayroll Management:\n\n\n\tHandle monthly payroll processing accurately and on time\n\tMaintain employee records related to salaries, benefits, and deductions\n\tEnsure compliance with tax laws and labor regulations\n\n\nSocial Media & Employer Branding:\n\n\n\tDevelop and execute strategies to grow the company’s social media platforms (LinkedIn, Instagram, Facebook, etc.)\n\tCreate engaging HR-related content and recruitment campaigns\n\tPromote job openings and company culture online\n\n\nClient Relationship Management:\n\n\n\tConduct regular visits to clients for feedback, engagement, and business development\n\tServe as the primary HR contact for assigned client accounts\n\tResolve client and candidate concerns professionally and promptly\n\n\nRequirements\n\n\n\tBachelor’s Degree in Human Resources, Business Administration, or a related field\n\tMinimum of 2 years of relevant HR and recruitment experience\n\tProficient in payroll systems and HRIS software\n\tStrong knowledge of labor laws and HR best practices\n\tExcellent communication, interpersonal, and organizational skills\n\tExperience with social media marketing or brand management is an added advantage\n\tAbility to travel to client sites as required.\n\n\nSalary\nN300,000 - N400,000 monthly.\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Sales Representative Officer Job at Startup Soar",
    "link": "https://www.jobgurus.com.ng/jobs/view/sales-representative-officer-job-at-startup-soar",
    "pubDate": "Mon, 16 Jun 2025 18:22:06 GMT",
    "source": "JobGurus",
    "keyword": "startup soar",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Startup Soar is a leading business consulting and HR services provider, offering tailored solutions to businesses across all sectors. We empower organizations—from startups to established enterprises—with the tools, strategies, and expertise needed to optimize their human resources and business operations. Whether you’re building your dream business, growing your existing operations, or scaling to new heights, Startup Soar is your trusted partner in achieving sustained success.\n\nWe are recruiting to fill the position below:\n\nJob Position: Sales Representative Officer\n\nJob Location: Abuja (FCT) \nEmployment Type: Full-time\n\nSummary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are looking for a skilled Sales Representative Officer to sell our real estate properties to potential clients.\n\tThe successful candidate will be responsible for generating leads, building relationships with clients, and meeting sales targets.\n\tIf you have excellent communication and negotiation skills, we encourage you to apply.\n\n\nResponsibilities\n\n\n\tGenerate leads and follow up on potential clients to sell real estate properties\n\tConduct property viewings and presentations to showcase properties to clients\n\tBuild and maintain relationships with clients to ensure customer satisfaction and loyalty\n\tStay up-to-date with market trends and competitor activity\n\tCollaborate with internal teams, including marketing and customer service, to achieve sales goals\n\tNegotiate prices and terms of sales with clients\n\tMeet and exceed monthly and quarterly sales targets\n\tMaintain accurate records of sales activities, including client interactions and sales progress.\n\n\nRequirements\n\n\n\tBachelor’s Degree in Marketing, Business, or a related field\n\t1 - 3 years of experience in sales, preferably in real estate.\n\tExcellent communication.\n\n\nInterpersonal skills:\n\n\n\tAbility to work under pressure and meet sales targets\n\tStrong analytical and problem-solving skills\n\tProficiency in Microsoft Office and CRM software.\n\n\nWhat We Offer\n\n\n\tSalary: N150,000 - N200,000 monthly.\n\tOpportunity to work with a leading real estate development company\n\tProfessional training and development programs\n\tCollaborative and dynamic work environment\n\tRecognition and rewards for outstanding performance.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and a compelling cover letter to: recruitmentconsult@zohomail.com using \"Application for Sales Representative Officer\" as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Experienced Customer Service Manager Job at Keen British School",
    "link": "https://www.jobgurus.com.ng/jobs/view/experienced-customer-service-manager-job-at-keen-british-school-1",
    "pubDate": "Mon, 16 Jun 2025 18:22:06 GMT",
    "source": "JobGurus",
    "keyword": "keen british school",
    "duplicate": false,
    "classifications": [],
    "content": "Keen British School - We are an international educational institution committed to achieving overall excellence in the upbringing of children from the age of three to eighteen years. We have Creche, preschool, elementary and high school classes.\n\nWe are recruiting to fill the position below:\n\nJob Position: Experienced Customer Service Manager\nJob Location: Lagos\n\nRequirements\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tInterested candidates should possess a BSc Degree.\n\tThe applicants must reside at Okota/Ejigbo axis of Lagos.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: career@keenbritishschool.org using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]