[
  {
    "title": "Key Account Manager Job at Fort Knox Outsourcing",
    "link": "https://www.jobgurus.com.ng/jobs/view/key-account-manager-job-at-fort-knox-outsourcing",
    "pubDate": "Mon, 16 Jun 2025 17:41:08 GMT",
    "source": "JobGurus",
    "keyword": "fort knox outsourcing",
    "duplicate": false,
    "classifications": [],
    "content": "Fort Knox Outsourcing - Our client, a leading Commercial Bank (with offices on 3 continents), is recruiting to fill the position below:\n\nJob Position: Key Account Manager\nJob Location: Oyo\nEmployment Type: Full-time\nDepartment: Sales\n\nResponsibilities\nBelow are the roles and responsibilities but not limited to:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tHe/She will be responsible for driving the business of Merchant acquiring in the different merchant sectors (Supermarket, Pharmacies, Filling Stations, Eateries & Restaurants, Lounge and Bar and Hotels) and developing & deploring strategies to increase sales revenue.\n\tEngaging with portfolio of merchants to introduce them to our products.\n\tBeing able to help the merchant resolve issues / complaints on the spot or escalate to customer support when necessary.\n\tCoordinating pre-sales and post-sales follow up.\n\tHit target quotas for set KPIs (Transaction value, volume, and revenue).\n\tHave a good understanding of the business's products or services and be able to advise others about them.\n\tFollow up with Merchants and ensure active and inactive merchants are visited and if need be, mobilize retrieval of POS from inactive business partners.\n\tOnboard and retain the merchants and nurture those key relationships over time.\n\tTo achieve their daily, weekly, and monthly target of transactions.\n\tTo reactivate the inactive accounts by calling, and visiting them.\n\tMonitoring market trends and providing regular competitor feedback.\n\n\nKPIs and Bonus Scheme\n\n\n\tEach increased # of Qualified POS (>750K transaction per week) from your team will warrant a N1,000 bonus\n\tYou get a bonus for POS in good standing with high transactions weekly\n\tUp to 1M per month for top performers in the team.\n\tHigh chance to be promoted to associate / full regional managers (on payroll position) within 1 - 6 month for high performers.\n\n\nRequirements\n\n\n\tCandidates should possess an HND, NCE, BSc qualification\n\t4 - 6 years of experience as a Loan Officer/Merchant business.\n\tAbility to self-motivate and manage self.\n\tGood communication and interpersonal skills.\n\tCustomer orientation and ability to adapt/respond to different characters.\n\n\nBenefits\n\n\n\tBase Salary: Net Monthly Salary: N285,000 per month (paid per month)\n\tMax Bonus: up to 1M per month (paid per week).\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: recruitment@fortknoxoutsourcing.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Administrative Assistant III Job at ABNL Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/administrative-assistant-iii-job-at-abnl-limited-2",
    "pubDate": "Mon, 16 Jun 2025 17:41:08 GMT",
    "source": "JobGurus",
    "keyword": "abnl limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "ABNL Limited was incorporated in 1992 as an Oil and Gas servicing company with a vision to provide professional engineering and technical services to the Oil and Gas exploration and production companies in Nigeria and the West African sub-region. Since its incorporation, the company has grown in leaps and bounds, expanding its business horizon, but still within the Oil and Gas sector.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nABNL is a 100% owned indigenous firm, with a shareholding in excess of 100 million Naira. Its' directors are individuals of proven integrity, who over the years have acquired the requisite experience in the Oil and Gas business, as well as in the banking and finance sector. The integrity of the directors and the staff of the company have been a priceless contributive factor in the growth and wellbeing of the company.\n\nWe are recruiting to fill the position below:\n\nJob Position: Administrative Assistant III\nJob Location: Lagos\nEmployment Type: Contract\nWork Schedule: 5 days on 2 days Off.\n\nJob Summary\n\n\n\tCalendar Management: Schedule and coordinate meetings, appointments, and travel arrangements.\n\tCommunication: Handle incoming and outgoing communications, including emails, phone calls, and mail.\n\tDocument Management: Prepare, review, and distribute documents, reports, and presentations.\n\tEvent Coordination: Assist in planning and organizing company events and meetings.\n\tOffice Management: Maintain office supplies inventory, order supplies, and ensure the office environment is organized.\n\tData Entry: Input and update data in various systems and databases.\n\tSupport Tasks: Provide administrative support to team members as needed.\n\n\nRequirements\n\n\n\tInterested candidates should possess a BSc / MSc Degree.\n\n\nMethod of Application\nInterested and qualified candidates should send their Resume in MS Word format to: jobs@abnl.net using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]