[
  {
    "title": "Structural Engineer Job at TeamAce Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/structural-engineer-job-at-teamace-limited",
    "pubDate": "Wed, 18 Jun 2025 18:21:58 GMT",
    "source": "JobGurus",
    "keyword": "teamace limited",
    "duplicate": false,
    "classifications": [],
    "content": "TeamAce Limited - Our client, a leading Construction firm, is recruiting suitable candidates to fill the position below:\n\nJob Position: Structural Engineer\n\nJob Location: Ikoyi, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tAs the Structural Engineer, you will be responsible for Performing structural analysis and design for building projects, and creating detailed structural drawings and documentation for construction.\n\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tPrepare drawings, specifications, calculations, charts, and graphs, and monitor work for compliance with applicable codes.\n\tPlan and conduct independent work requiring judgment in the evaluation, selection, application and adaptation of engineering techniques, procedures, and criteria.\n\tProvide technical advice on safe designs and construction.\n\tObtain planning and/or building regulations approval.\n\tAnalyze configurations of the basic components of a structure.\n\tMonitor and inspect all work undertaken by contractors to ensure structural soundness.\n\tInspect properties to evaluate the conditions and foundations.\n\n\nRequirements\n\n\n\tCandidates should possess a B.Eng./HND in Structural Engineering, Civil Building Engineering, or any other related discipline.\n\tMinimum of 6 years of experience in a reputable organization.\n\tProfessional certification in Engineering or relevant areas\n\n\nSalary\nNGN500,000 - NGN600,000 / Month    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Business Development Manager Job at ISurf Global Service",
    "link": "https://www.jobgurus.com.ng/jobs/view/business-development-manager-job-at-isurf-global-service-2",
    "pubDate": "Wed, 18 Jun 2025 18:21:58 GMT",
    "source": "JobGurus",
    "keyword": "isurf global service",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "ISurf Global Service is an Information Technology Consulting Services Company with specialization in delivering technology solutions to meet the needs of our clients. Our Consulting experience provides practical, cost effective innovative change, insights and knowledge to help you organize and maintain an effective Optimal model for your business growth and flexibility.\n\nOur main activities are focused on providing professional consulting and technical services, carrying out research and training in the use of ICT and organizing events and workshops. The solutions we build help our customers achieve profitable growth, reduce costs and take advantage of new business opportunities.\n\nWe are recruiting to fill the position below:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Position: Business Development Manager\n\nJob Location: Port Harcourt, Rivers\nEmployment Type: Full-time (Permanent)\n\nJob Description\n\n\n\tWe are seeking an experienced and motivated Business Development Manager (BDM) to join our dynamic team in port-hacourt.\n\tThis role is ideal for a results-driven professional with a strong background in sales, partnerships, and business strategy within the FinTech or finance industry.\n\tThe BDM will be responsible for developing and maintaining long-term commercial and strategic relationships with agents, vendors, distributors, and partner organizations.\n\tThe ideal candidate will bring a proven track record in expanding business opportunities and driving revenue growth.\n\n\nResponsibilities\n\n\n\tIdentify, onboard, and manage new agents, partners, and business opportunities.\n\tDrive bulk purchase transactions from organizations and corporate entities.\n\tBuild and maintain strong relationships with existing and prospective clients, vendors, and stakeholders.\n\tConsistently exceed revenue targets for the assigned coverage area.\n\tEducate customers on the features, benefits, and value proposition of our products and services.\n\tCollaborate with cross-functional teams to deliver customer-focused solutions.\n\n\nRequirements\n\n\n\tA Bachelor's Degree from a reputable institution is compulsory\n\tMinimum of 3 years of proven experience in partnership development, business development, or account management.\n\tPrevious experience in the *FinTech industry is an *added advantage\n\tStrong communication, negotiation, and interpersonal skills.\n\tAbility to work independently, manage multiple projects, and meet deadlines.\n\n\nSalary\nN300,000 / Month.\n\nMethod of Application\nInterested and qualified candidates should send their CV and a brief cover letter to: jobs.david@isurfglobal.com using the Job Position as the subject of the mail.\n\nNote: For more information contact 07049905970.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Senior Public Relations Manager Job at Maurice Xandra Solutions Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/senior-public-relations-manager-job-at-maurice-xandra-solutions-limited",
    "pubDate": "Wed, 18 Jun 2025 18:21:58 GMT",
    "source": "JobGurus",
    "keyword": "maurice xandra solutions limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Maurice Xandra Solutions Limited is a management consulting company that renders quality services in Human Resource, Management and Process improvement. MXS Limited was set up to provide high quality, up to date training, team management and process improvement services for its clients.\n\nWe are recruiting to fill the position below:\n\nJob Position: Senior Public Relations Manager\n\nJob Location: Lagos\nEmployment Type: Full time\nHybrid Work Schedule: 3 days onsite & 2 days offsite; 9 am- 5 pm daily\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tCoordinating all public relations and marketing communications activities\n\tDeveloping and executing marketing communication plans including strategy, goals, budget, and tactics using varying communication channels\n\tAnalysing, implementing and defining communications key performance indicators for client briefs and campaigns\n\tDeveloping a media relations strategy, seeking high-level placements in print, broadcast, and online media\n\tManaging Client relationships and fostering relationships with new clients\n\tProspecting new clients and creating necessary communications pitch decks\n\tLeveraging existing Media relationships and cultivating new contacts within business and industry media\n\tManaging media inquiries and interview requests\n\tBuilding relationships with thought leaders to grow industry awareness\n\tMaintaining a keen understanding of industry trends affecting clients and making appropriate recommendations regarding communication strategy surrounding them\n\tCreating content for press releases, byline articles, and keynote presentations\n\tMonitoring, analysing, and communicating PR results on a daily/monthly/quarterly basis\n\tEvaluating opportunities for partnerships, sponsorships, and advertising on an ongoing basis.\n\tManaging communications team to ensure the successful completion of client briefs\n\tManaging influencer marketing campaigns\n\tDeveloping, executing and maintaining crisis management strategies on behalf of clients\n\tOverseeing and coordinating team members to execute public relations and communication plans\n\n\nRequirements\n\n\n\tBSc in communications or any related field\n\tMinimum 5 years of experience in a public relations agency or in corporate communication\n\tStrong account management and corporate communications skills\n\tExcellent team management skills\n\tAbility to manage multiple clients.\n\n\nMethod of Application\nInterested and qualified candiates should send their CV to: hr@mauricexandra.com using the Job Posiiton as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Administrative / Account Officer Job at Bhel and Moore",
    "link": "https://www.jobgurus.com.ng/jobs/view/administrative-account-officer-job-at-bhel-and-moore-1",
    "pubDate": "Wed, 18 Jun 2025 18:21:58 GMT",
    "source": "JobGurus",
    "keyword": "bhel and moore",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Bhel and Moore is recruiting suitably qualified candidates to fill the position below:\n\nJob Position: Administrative / Account Officer\n\nJob Location: Surulere, Lagos\nEmployment Type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Administrative / Account Officer will be responsible for ensuring smooth day-to-day office operations and supporting the company’s financial activities.\n\tThis role involves providing administrative assistance, managing office resources, supervising operations staff, handling basic accounting duties, and overseeing inventory and vendor management.\n\tThe ideal candidate will be detail-oriented, organized, and adaptable to corporate governance standards.\n\n\nResponsibilities\n\n\n\tCoordinate and oversee office activities to ensure efficiency and compliance with company policies.\n\tSupervise operations staff and delegate responsibilities to maximize performance.\n\tPrepare basic financial reports, such as expense reports, office budgets, and other accounting documentation.\n\tSupport management with financial analysis and data preparation when required.\n\tMaintain and update company databases and organize company records, ensuring data accuracy and confidentiality.\n\tServe as the primary point of contact for employees and clients, addressing administrative queries and offering support as needed.\n\tManage office supplies, including monitoring stock levels and placing orders as required.\n\tEnsure the proper maintenance of office equipment and management tools.\n\tEstablish and manage a filing system for important and confidential company documents.\n\tAssist management in reviewing and updating office policies to align with corporate governance requirements and operational needs.\n\tEnsure office procedures comply with corporate governance standards and company policies.\n\tMaintain a company calendar and schedule appointments for upper management.\n\tOrganize and coordinate internal and external events, meetings, and staff engagements.\n\tPrepare and distribute meeting agendas, record minutes, and follow up on actionable items.\n\tManage all forms of correspondence, including phone calls, emails, letters, and packages.\n\tAct as a liaison between employees, clients, and management, ensuring smooth communication flow within the office.\n\tPerform additional administrative duties required to maintain office functionality and support the needs of the company.\n\tOversee the company’s inventory management system, ensuring accurate stock levels of office and operational supplies.\n\tConduct regular inventory audits and reconcile discrepancies between physical stock and inventory records.\n\tManage relationships with suppliers and service providers, negotiating contracts, pricing, and service terms.\n\tTrack vendor performance to ensure timely delivery of products and services and address any issues related to service quality or delivery times.\n\n\nRequirements\n\n\n\tMinimum of a HND / B.Sc in a related discipline (e.g., Business Administration, Accounting, Finance).\n\tAt least 1 year of post-graduate professional experience in an administrative or accounting role.\n\n\nSkills:\n\n\n\tDemonstrated work experience as an Administrative Officer, Administrator, or in a similar administrative role.\n\tStrong knowledge of office and project management procedures, ensuring seamless operations.\n\tProficiency in office management software, particularly Microsoft Office Suite (Excel, PowerPoint, Word).\n\tAbility to manage multiple tasks with strong attention to detail and a solutions-oriented approach to challenges.\n\tExcellent written and verbal communication skills to interact effectively with team members, clients, and management.\n\tStrong interpersonal skills with the ability to provide exceptional customer service and build positive working relationships.\n\tHigh level of emotional intelligence to navigate complex interactions and maintain professionalism in all situations.\n\tIntegrity, dependability, and discretion in handling sensitive information.\n\tA team player with a proactive attitude and the ability to adapt to changing environments.\n\tMust be adaptable and committed to upholding corporate governance principles and standards.\n\n\nKey Competencies:\n\n\n\tStrong organizational and time-management skills.\n\tAbility to work independently and collaboratively.\n\tKeen attention to detail and accuracy in reporting.\n\tDependable, ethical, and capable of maintaining confidentiality.\n\n\nSalary\nN130,000 - N150,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: bhelconsultancy@yahoo.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]