[
  {
    "title": "Direct Sales Agent Job at ACE Recruiters Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/direct-sales-agent-job-at-ace-recruiters-limited",
    "pubDate": "Tue, 10 Jun 2025 14:16:03 GMT",
    "source": "JobGurus",
    "keyword": "ace recruiters limited",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance"
    ],
    "content": "(adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\nACE Recruiters Limited (RC: 1397156) commenced operations March 2017. We are a People and Business Management Consulting firm passionate about adding value. We offer services in the areas of Strategic Human Resource Consulting and we have the capacity to ensure returns on investment in the following areas: Outsourcing – Personnel, Sales & Business Process Human Resources Consulting Training and Development Sales Support – Market Intelligence, Promotion & Activation With a strong drive to be one of the best in our areas of core competences, we pride ourselves as specialists in our chosen field of endeavour. We are driven by a sense of mutually beneficial relationships with our clients, striving to create high performance teams, and deliver agile operations that responds and drives the ever changing ways of doing business/working.\n\nWe are recruiting to fill the position below:\n\nJob Position: Direct Sales Agent\n\nJob Location: Lagos Island, Lagos\nEmployment Type: Full-time\n\nJob Description\n\n\n\tMeeting or exceeding weekly, monthly, and yearly sales targets.\n\tCanvassing assigned territories to present company products to potential customers.\n\tAssisting management in identifying viable marketing and pricing strategies.\n\tAttending trade shows and other industry-related events.\n\tPreparing sales proposals for potential buyers.\n\tDemonstrating product features to customers.\n\tContacting leads and setting up appointments to present company products.\n\tCompleting order forms and submitting them for processing.\n\tCompleting regular sales reports specifying the number of sales made.\n\n\nRequirements\n\n\n\tOND or SSCE.\n\tBachelor's Degree in Marketing, Business Administration or related field is advantageous.\n\tProven sales experience.\n\tThe ability to retain important information.\n\tSound consultative selling skills.\n\tExcellent networking skills.\n\tStrong negotiation skills.\n\tEffective communication skills.\n\tExceptional customer service skills.\n\n\nSalary\nN95,000 - N150,000    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Investment Advisor (Corporate Marketer) Job at AT Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/investment-advisor-corporate-marketer-job-at-at-limited",
    "pubDate": "Tue, 10 Jun 2025 14:16:03 GMT",
    "source": "JobGurus",
    "keyword": "at limited",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "AT Limited - Our client, a Real Estate company, is recruiting a dynamic and results-driven candidate to fill the position below:\n\nJob Position: Investment Advisor (Corporate Marketer)\nJob Locations: Abuja\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a highly qualified and experienced Investment Advisor (Corporate Marketer) for our client in the real estate sector.\n\tThe ideal candidate must have a strong background in investment advisory, corporate marketing, and client relationship management.\n\tThis role requires a strategic thinker with excellent communication skills and the ability to attract and retain high-net-worth investors while driving business growth.\n\tThe ideal candidate will be responsible for developing and managing corporate client relationships, promoting real estate investment opportunities, and driving sales growth through strategic marketing and advisory services.\n\n\nKey Responsibilities\n\n\n\tDevelop and implement corporate marketing strategies to attract high-net-worth individuals and institutional investors.\n\tIdentify, engage, and maintain relationships with potential corporate clients and investors interested in real estate assets.\n\tProvide investment advisory services tailored to clients’ financial goals and risk appetite.\n\tConduct market research to analyze trends, competitor activities, and investment opportunities within the real estate sector.\n\tCollaborate with the sales and marketing teams to design and execute targeted campaigns for corporate investors.\n\tPresent and pitch real estate investment opportunities to potential investors through meetings, presentations, and networking events.\n\tEnsure compliance with all legal and regulatory requirements in real estate investment transactions.\n\tNegotiate terms of investment deals and facilitate contract execution in alignment with company policies.\n\tMonitor and report on market dynamics, customer preferences, and sales performance to drive strategic decision-making.\n\n\nRequirements & Qualifications\n\n\n\tBachelor's degree in Marketing, Business Administration, Finance, Real Estate, or a related field.\n\tMinimum of 2 years of experience in investment advisory, corporate sales, or real estate marketing.\n\tStrong understanding of real estate investment strategies and financial analysis.\n\tExcellent communication, negotiation, and interpersonal skills.\n\tProven ability to develop and maintain relationships with corporate clients and investors.\n\tGoal-oriented with a strong drive for revenue generation and business growth.\n\tProficiency in Microsoft Office Suite and CRM tools.\n\tAbility to work independently and as part of a team in a fast-paced environment.\n\n\nSalary\nN150,000 - N200,000 Gross monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV and a cover letter to: hr.department.atlimited@gmail.com using \"Application for Investment Advisor (Corporate Marketer)\" as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Social Media Manager Job at Bisimkha TV",
    "link": "https://www.jobgurus.com.ng/jobs/view/social-media-manager-job-at-bisimkha-tv",
    "pubDate": "Tue, 10 Jun 2025 14:16:03 GMT",
    "source": "JobGurus",
    "keyword": "bisimkha tv",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "Bisimkha TV is a fast-growing, multi-channel media platform based in Abuja, operating three powerful online content arms:Bisimkha Kingdom Network (BKN) – focused on Christian faith, worship, and revival.Bisimkha Inspiration TV (BITV) – focused on business, career growth, leadership, and entrepreneurship.Bisimkha Homes TV (BHTV) – focused on real estate education, wealth-building, and property investment.\n\nWe are expanding our team and seeking creative, driven, and purpose-aligned individuals to join us in building a media hub that speaks to the heart, mind, and marketplace.\n\nWe are recruiting to fill the position below:\n\nJob Position: Social Media Manager\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Location: Garki, Abuja (FCT)\nEmployment Type: Full-time\n\nJob Description\n\n\n\tManage Content\n\tBoost visibility, and grow bisimkha Tv digital presence.\n\n\nReqiurement\n\n\n\tOND / HND / B.Sc Degree in any field.\n\tHands - on experience managing Instagram, YouTube, Facebook & Tiktok.\n\n\nSalary\nN100,000 - N120,000 / Month.\n\nMethod of Application\nInterested and qualified candidates should send their CV and letter of application to: bisimkhatv@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Motion Graphic Designer Job at the Startup Place Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/motion-graphic-designer-job-at-the-startup-place-limited",
    "pubDate": "Tue, 10 Jun 2025 14:16:03 GMT",
    "source": "JobGurus",
    "keyword": "the startup place limited",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "The Startup Place Ltd. is a Startup and Business Growth Firm with over 5 years cognate experience in Desigining, Training and Deploying Solutions and Stratgies for business owners. Our Key competent and focus area is on Marketing, Finance, Operations and Human Resource Management.\n\nWe are recruiting to fill the position below:\n\nJob Position: Motion Graphic Designer\n\nJob Location: Lekki, Lagos\nJob type: Full-time\n\nole Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThis is a full-time on-site role for a Motion Graphic Designer located in Lekki.\n\tThe Motion Graphic Designer will be responsible for creating motion designs, video production, motion graphics, graphic design, and graphics on a day-to-day basis.\n\n\nQualifications\n\n\n\tMotion Design and Motion Graphics skills\n\tVideo Production skills\n\tGraphic Design skills\n\tExperience with creating graphics\n\tProficiency in Adobe Creative Suite\n\tStrong portfolio showcasing motion graphic design work\n\tExcellent attention to detail and time management skills\n\tAbility to work collaboratively in a team environment.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hello@thestartupplaceng.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Admin Manager, Industrial Gas Plant Job at Cometstar Industrial Gases Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/admin-manager-industrial-gas-plant-job-at-cometstar-industrial-gases-limited",
    "pubDate": "Tue, 10 Jun 2025 14:16:03 GMT",
    "source": "JobGurus",
    "keyword": "cometstar industrial gases limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Cometstar Industrial Gases Limited producesargon, nitrogen, oxygen, and carbon dioxide — gases that aid operations in multiple sectors, including pharmaceuticals, healthcare, power, oil, steel, manufacturing, Fire Service, and food and beverages.\n\nWe are recruiting to fill the position below:\n\nJob Position: Admin Manager, Industrial Gas Plant\n\nJob Location: Agbara, Ogun\n\nSummary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe ideal candidate must be dynamic, strategic, and resourceful with exceptional management and leadership skills. \n\tHe must have 5+ years of experience in plant management within the industrial gas sector.\n\n\nCore Responsibilities\n\n\n\tOversee the daily operations of the plant to ensure efficiency in operations, risks and profitability\n\tPlan, streamline, and execute administrative workflows and procedures\n\tManage the plant’s personnel, physical and budgeting/financial resources to improve the company’s bottom line\n\tProvide overall guidance and strategic direction in the planning and execution of production and service objectives\n\tEnsure and maintain the highest standards of quality control and safety compliance in line with regulations\n\tMonitor and analyse KPIs to identify areas for improvement\n\tOversee customer interactions and resolve any issues including liaison with external contractors and vendors.\n\n\nExperience and Qualification\n\n\n\tHND / Bachelor's Degree in Engineering, Production Technology, Business, or a related field.\n\t5+ years in managing an industrial gas plant is mandatory\n\tA master’s degree in management is an added advantage\n\tStrong practical knowledge of industrial gas manufacturing processes, safety standards, storage, retail trade, and dispensing\n\tProven leadership and team management skills.\n\n\nSkills and Behaviours:\n\n\n\tKnowledge of principles of business administration\n\tFamiliar with process improvement principles\n\tExcellent leadership, delegation and people management\n\tPatience and great attention to detail\n\tBusiness acumen, financial analytics and numeracy skills\n\tWorking knowledge of marketing strategies.\n\n\nMethod of Application\nInterested and qualified candidates should their CV to: career@cometstar-group.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]