[
  {
    "title": "Business Developer Job at Opay",
    "link": "https://www.jobgurus.com.ng/jobs/view/business-developer-job-at-opay-2",
    "pubDate": "Wed, 25 Jun 2025 10:45:37 GMT",
    "source": "JobGurus",
    "keyword": "opay",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Software Engineering",
      "Finance"
    ],
    "content": "OPay is a mobile money platform operated by OPay Digital Services Limited and licensed by the Central Bank of Nigeria. Launched in June 2018, the company has spread its services across all 36 states in Nigeria with over 500,000 mobile money merchants. We are more than a payment company. We believe everyone should be able to enjoy financial and social inclusion, without regard for physical borders, boundaries, or even social status. OPay is a one-stop mobile-based platform for payment and other important services in your everyday life. Millions of users rely on OPay every day to send and receive money and pay bills.\n\nWe are recruiting to fill the position below:\n\nJob Position: Business Developer\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Locations: Keffi - Nasarawa & Suleja - Niger\n\nDescription\n\n\n\tThe business development officer will be responsible for driving user adoption of our digital products ( E-wallets, cards, etc.) and customer acquisition in various locations or regions, developing strategies to increase transaction product utilization.\n\n\nKey Responsibilities\n\n\n\tHave a good understanding of the business products or services and be able to advise others about the advantages of our product.\n\tResearch and identify new business opportunities - including new markets, growth areas, trends, customers, partnerships, and individuals.\n\tMeet with customers/clients face-to-face.\n\tDevelop relationships with old and new customers/clients.\n\tWork strategically and carry out necessary planning to have a good market penetration.\n\tDiscuss promotional strategies and activities, feedback on daily experiences, challenges, and possible ways of resolving the issues.\n\tFamiliar with the region of operation.\n\tSetting goals and developing plans for business and revenue growth.\n\tFoster and develop relationships with customers/clients.\n\tHave a good understanding of the business's products or services and be able to advise others about them.\n\tManaging the sales process for new prospects, from initial contact through to closure.\n\n\nJob Requirements\n\n\n\tNCE / ND / HND / BSc in Business Administration, Marketing, and any related course.\n\tMinimum of 1 - 2 years as a BDE in Merchant Acquiring (Entry level experience also welcomed).\n\tBanking firm or Direct Sales Executive in a Commercial Banks.\n\tPrevious achievement in the field of sales/Business Development.\n\tPrevious achievement/results driving adoption of financial products by customers.\n\tStrong communication and presentation skills.\n\tStrong marketing, engagement & negotiating skills.\n\n\nCompensation\n\n\n\tSalary: N70,000 Gross.\n\tCommission: N135,000 Gross.\n\tTransport Allowance.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Creative Assistant Job at Amani Advisory Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/creative-assistant-job-at-amani-advisory-limited-1",
    "pubDate": "Wed, 25 Jun 2025 10:45:37 GMT",
    "source": "JobGurus",
    "keyword": "amani advisory limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Amani Advisory Limited is committed to assisting organizations in achieving success by maximizing their most valuable resource - their employees. We offer complete HR solutions to businesses of all sizes and in various industries. Thanks to a team of seasoned HR professionals, we approach every project with expertise, innovation, and a client-centric mindset.\n\nWe are recruiting to fill the position below:\n\nJob Position: Creative Assistant\n\nJob Location: Lekki, Lagos\nEmployment Type: Full-time\n\nSummary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tIn this role, you will support the Creative Director and design team in developing innovative and visually stunning designs.\n\tIt is a requirement that you have a strong passion for fashion, excellent communication skills, and the ability to work in a fast-paced environment.\n\n\nResponsibilities\n\n\n\tAssist in the development of designs from concept to final product.\n\tLiaise with the design team, Creative Director, and other departments to ensure effective communication and collaboration.\n\tMaintain organized files, records, and design archives.\n\tProvide input on fabric selection, colour palettes, and style ideas.\n\tPrepare sketches, illustrations, or digital renderings as needed.\n\tAssist with special projects, such as fashion shows, photo shoots, and events.\n\tAssist in the creation and development of design concepts, mood boards, and presentations.\n\tCollaborate with the production team to ensure timely execution of designs.\n\tMaintain sample organization and oversee quality checks for prototypes and final products.\n\tSupport in managing timelines and ensuring assigned tasks stay on schedule.\n\tParticipate in photoshoots and provide creative direction to capture brand aesthetics.\n\tAssist in styling models and organizing promotional content for social media and marketing.\n\tWork with the marketing team to ensure cohesive visual representation across platforms.\n\tMaintain accurate records of materials, designs, and production notes.\n\tSupport the creative director with day-to-day production schedules.\n\tEnsure all creative work aligns with the brand’s vision, values, and target audience.\n\tStay updated on industry trends to provide fresh ideas and competitive insights.\n\n\nRequirements\n\n\n\tBachelor's Degree in Fashion Design, Fine Arts, or related field.\n\t1 - 2 years of experience in fashion design, styling, or a related field.\n\tProficient in Adobe Creative Suite (Photoshop, Illustrator, Sketchbook), Microsoft Office, and Google Suite.\n\tStrong understanding of fashion trends, textiles, and design principles.\n\tStrong visual sense, attention to detail, and innovative mindset.\n\tExcellent multitasking abilities with a proactive and solution-oriented approach.\n\tStrong verbal and written communication for effective collaboration.\n\n\nSalary\nN200,000 - N250,000 monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: talent.amanisolutions@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Project Officer (Surgical Care and Outreach) Job at Congenital Heart Disease Foundation of Nigeria",
    "link": "https://www.jobgurus.com.ng/jobs/view/project-officer-surgical-care-and-outreach-job-at-congenital-heart-disease-foundation-of-nigeria",
    "pubDate": "Wed, 25 Jun 2025 10:45:37 GMT",
    "source": "JobGurus",
    "keyword": "congenital heart disease foundation of nigeria",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "The Congenital Heart Disease Foundation of Nigeria (CHDF) is a non-profit organization that supports children and persons with Congenital Heart Disease popularly called Hole in the Heart in Nigeria. The foundation is envisioned to be the leading charity organization in Nigeria supporting the CHD cause. Our mission “to create a paradigm shift in the current status of congenital heart disease in Nigeria through awareness campaign and advocacy; support; education and research promotion” states the 4 main areas we are focusing on to achieve our vision.\n\nWe are recruiting to fill the position below:\n\nJob Position: Project Officer (Surgical Care and Outreach)\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Location: Ogun\nEmployment Type: Volunteer\n\nRole Overview\n\n\n\tWe are seeking a passionate and committed Medical Doctor, Medical Graduate (Intern, NYSC), or Medical Student (400 level and above) to serve as a Volunteer Project Officer (Surgical Care & Outreach).\n\tThis role is essential in supporting the planning, coordination, and monitoring of surgical care programs and outreach initiatives.\n\the successful candidate will work closely with the Program Manager and clinical teams to ensure our interventions are impactful and patient-centered.\n\n\nKey Responsibilities\n\n\n\tCoordinating and sourcing for partnership/ sponsorship for patients' cardiac intervention treatments locally and internationally.\n\tAssist in planning and coordinating surgical missions and outreach programs.\n\tTrack project progress and prepare reports on outcomes and impact.\n\tMaintain accurate documentation of surgical and outreach activities.\n\tLiaise with hospitals, surgical teams, and partner organizations.\n\tSupport patient identification, screening, and follow-up processes.\n\tParticipate in community engagement and awareness efforts.\n\tContribute to a collaborative and mission-driven team environment.\n\n\nQualifications\n\n\n\tMust be a Medical Doctor, Medical Graduate (Interns, NYSC), Medical Student (400 level and above).\n\tStrong interest in surgical care, public health, and community outreach.\n\tExcellent organizational, communication, and interpersonal skills.\n\tExperience in clinical coordination or health outreach is an advantage.\n\tPassion for improving the lives of individuals affected by congenital heart disease.\n\tAbility to work independently and collaboratively in a hybrid setting.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Marketing and Sales Officer Job at Scentarcade",
    "link": "https://www.jobgurus.com.ng/jobs/view/marketing-and-sales-officer-job-at-scentarcade",
    "pubDate": "Wed, 25 Jun 2025 10:45:37 GMT",
    "source": "JobGurus",
    "keyword": "scentarcade",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Scentarcade - We are one of Nigeria’s leading distributors of high-quality scenting and fragrance solutions, dedicated to enhancing environments with premium aromatic experiences. With a strong presence in the market and a growing customer base, we are expanding our team to reach new heights in brand visibility and customer engagement.\n\nWe are recruiting to fill the position below:\n\nJob Position: Marketing and Sales Officer\n\nJob Location: Lekki, Lagos\nEmployment Type: Full-time\nIndustry: Fragrance & Scenting Solutions\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking dynamic and results-driven Marketing and Sales Officers to join our team.\n\tThis role involves promoting our fragrance products, identifying new business opportunities, and building strong customer relationships. Candidates must be passionate about sales, have a keen sense of marketing strategy, and possess excellent communication skills.\n\n\nKey Responsibilities\n\n\n\tDrive product sales through both direct and indirect channels\n\tDevelop and execute marketing campaigns to increase brand awareness and customer engagement\n\tIdentify and pursue new market opportunities and client acquisition\n\tMaintain and grow existing customer relationships\n\tCollaborate with internal teams to align marketing strategies with sales goals\n\tConduct market research and competitor analysis\n\tProvide regular reports on sales performance and market trends.\n\n\nRequirements\n\n\n\tMinimum of a Bachelor's Degree in Marketing, Business, or a related field\n\t2+ years of relevant experience in sales and/or marketing (experience in fragrance, FMCG, or lifestyle brands is a plus)\n\tStrong interpersonal and negotiation skills\n\tSelf-motivated with the ability to work independently and as part of a team\n\tProficiency in digital marketing and CRM tools is an advantage.\n\n\nRemuneration Package\n\n\n\tBase Salary: N450,000/month\n\tPerformance Bonus: Attractive commission structure based on sales targets\n\tOther Benefits: Professional development opportunities, performance incentives, and travel allowances (where applicable).\n\n\nMethod of Aplication\nInterested and qualified candidates should send their CV to: digitaleplanet@gmail.com using the Job Position as the subject of email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "District Manager Job at Bogo Beverages Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/district-manager-job-at-bogo-beverages-limited",
    "pubDate": "Wed, 25 Jun 2025 10:45:37 GMT",
    "source": "JobGurus",
    "keyword": "bogo beverages limited",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "Bogo Beverage Limited is a young and dynamic total manufacturing, distribution and marketing of quality beverage company, with a strong entrepreneurial spirit and growth mindset. We are determined to dominate the beverage sector with our quality brands, apt commercial acumen and cognate experience of the Nigerian consumers and Africa\n\nWe are recruiting to fill the position below:\n\nJob Position: District Manager - East\nJob Location: Ebonyi / Enugu / Imo\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDrive brand penetration in both on-prem and off-prem outlets within the region.\n\tUnderstand and effectively communicate the company's vision and values.\n\tResponsible for driving brand visibility at the point of sales and consumption.\n\tSupervise the installation and maintenance of point-of-sale/ printed materials within the region.\n\tAssist customers with inventory management responsibilities (product availability/new product placement, and rotation of stock)\n\tMaintain sales volume, product mix, and selling price by keeping current with supply and demand, changing trends, economic indicators, and competitors\n\tEstablish and adjust selling prices by monitoring costs, competition, supply, and demand.\n\tMaintained sales staff by recruiting, selecting, orienting, and training employees. As well as counselling and disciplining employees, planning, monitoring, and appraising job results\n\n\nRequirements and Skills\n\n\n\tA graduate with an MBA will be an added advantage.\n\tMust have 9-14 years of work experience.\n\tCandidates must be in the wine and spirits industry.\n\tProven sales experience, meeting, or exceeding targets\n\tProven ability to position products against competitors.\n\tExcellent listening, negotiation, and presentation skills\n\tExcellent verbal and written communication skills\n\tStrong analytical skills\n\tAbility to work in a fast-paced, goal-driven environment.\n\tThe candidate should have a car and know how to drive.\n\tThe candidate should be a resident in the East (Imo, Enugu, Ebonyi).\n\n\nMethod of Application\nInterested and qualified candidates should send their Resume to: careers.bogo@outlook.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]