[
  {
    "title": "Head of Operations Job at Prosperity Microfinance Bank Nigeria Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/head-of-operations-job-at-prosperity-microfinance-bank-nigeria-limited",
    "pubDate": "Tue, 01 Jul 2025 16:20:19 GMT",
    "source": "JobGurus",
    "keyword": "prosperity microfinance bank nigeria limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Prosperity Microfinance Bank Nigeria Limited (PMBank) is a Microfinance Bank incorporated in Nigeria with the Corporate Affairs Commission of Nigeria in March 2005 under the provisions of the Companies and Allied Matters Act CAP C20 LFN 2004 with registration number RC 620230 and commenced operations on 10th October 2005. It is licensed to carry on the business of microfinance banking by the Central Bank of Nigeria.\n\nWe are recruiting to fill the position below:\n\nJob Position: Head of Operations\nJob Location: Benin, Edo\nEmployment Type: Full-time\n\nResponsibilities\nOperational Leadership:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDevelop and implement strategies to optimize operational efficiency and service delivery.\n\tOversee the bank’s operational processes, including account management, loan disbursement, and transaction processing.\n\tEnsure the alignment of operational activities with the bank’s strategic goals.\n\n\nProcess Improvement:\n\n\n\tDesign and implement policies and procedures to improve operational workflows and reduce turnaround time.\n\tIdentify opportunities for automation and digitization to enhance operational efficiency.\n\tConduct regular reviews of operational systems to ensure they are up-to-date and effective.\n\n\nRisk and Compliance Management:\n\n\n\tEnsure compliance with regulatory requirements and internal policies, particularly those set by the Central Bank of Nigeria (CBN).\n\tMonitor and mitigate operational risks through the implementation of robust control frameworks.\n\tOversee the management of internal and external audits related to operations.\n\n\nTeam Leadership:\n\n\n\tManage and develop the operations team, providing training, mentorship, and performance feedback.\n\tFoster a culture of accountability, excellence, and continuous improvement within the department.\n\tSet and monitor key performance indicators (KPIs) for the operations team.\n\n\nCustomer Service Excellence:\n\n\n\tDevelop and implement strategies to improve customer experience and satisfaction.\n\tMonitor service delivery channels to ensure a seamless and positive customer experience.\n\tHandle escalated customer service issues and resolve them efficiently.\n\n\nResource and Asset Management:\n\n\n\tOversee the management of the bank’s physical and technological assets to ensure optimal performance.\n\tEnsure efficient allocation and utilization of resources to support operational goals.\n\tManage vendor relationships and ensure cost-effective procurement of services and supplies.\n\n\nRequirements\n\n\n\tInterested candidates should possess a minimum of OND with 5 - 15 years of experience. \n\n\nMethod of Application\nInterested and qualified candidates should send their CV and portfolio to: nhrecruiters@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Customer Support Officer Job at Ivorypay",
    "link": "https://www.jobgurus.com.ng/jobs/view/customer-support-officer-job-at-ivorypay",
    "pubDate": "Tue, 01 Jul 2025 16:20:19 GMT",
    "source": "JobGurus",
    "keyword": "ivorypay",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Ivorypay is a crypto payment gateway that enables businesses in Africa to get paid in stable cryptocurrency and leverage Defi and NFT for growth.\n\nWe are recruiting to fill the position below:\n\nJob Position: Customer Support Officer\nJob Location: Lagos\nJob Type: Full-time\n\nRole Overview\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThis role is ideal for someone with strong communication skills, technical curiosity, and a passion for delivering exceptional customer experiences.\n\tYou’ll handle real-time interactions, resolve user issues, support operational improvements, and work closely with cross-functional teams to ensure customer satisfaction at every touchpoint.\n\n\nKey Responsibilities\n\n\n\tProvide prompt, professional support to users via email, live chat, phone, and social media.\n\tTroubleshoot wallet issues, payment delays, or account-related concerns.\n\tEscalate product or technical issues to the appropriate teams, ensuring fast resolution.\n\tMaintain accurate records of customer interactions and case resolutions using CRM tools.\n\tIdentify recurring issues and contribute to the improvement of support workflows and self-help content.\n\tStay updated on product changes and proactively share insights with customers.\n\tAct as an escalation point for sensitive user concerns, offering strategic guidance and resolution.\n\tCollaborate with internal teams to enhance FAQs, help centre articles, and internal support materials.\n\n\nRequirements\n\n\n\tMinimum of 2 years of customer support experience, preferably in the Fintech space.\n\tPrior experience using CRM tools.\n\tExcellent written and verbal communication in English.\n\tCustomer-first mindset with strong problem-solving skills.\n\tAbility to multitask and prioritize in a fast-paced, startup environment.\n\tFamiliarity with blockchain concepts and digital wallets is an added advantage.\n\tProficiency in Microsoft Office and strong attention to detail.\n\tMust be based in Lagos, Nigeria.\n\tComfortable working in a hybrid setup (remote and onsite).\n\tWillingness to work shifts, weekends, or public holidays, when necessary.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: careers@ivorypay.io using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "SME Leasing Officer Job at Addosser Finance Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/sme-leasing-officer-job-at-addosser-finance-limited",
    "pubDate": "Tue, 01 Jul 2025 16:20:19 GMT",
    "source": "JobGurus",
    "keyword": "addosser finance limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Addosser Finance Limited is a fast growing Finance Company licensed by Central Bank of Nigeria on the foundation of integrity, best practices and excellence to deliver innovative and bespoke financial solutions to SMEs and individuals. We are a reliable financial partner that provides a plethora of easily accessible financial solutions such as Loans, Leases, Corporate Financing and Advisory Services to bridge the funding gap for individuals, business owners and corporate institutions. We also offer investment solutions tailored to help our client’s grow their wealth and meet their financial goals.\n\nWe are recruiting to fill the position below:\n\nJob Position: SME Leasing Officer\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Description\n\n\n\tWe are seeking a results-driven and detail-oriented SME Leasing Officer to support and grow our SME leasing portfolio. The ideal candidate will have a strong background in lease structuring, client relationship management, and credit analysis within a financial institution.\n\n\nKey Responsibilities\n\n\n\tIdentify and engage prospective SME clients for leasing products.\n\tEvaluate lease applications by conducting credit and risk assessments.\n\tStructure lease facilities in line with company policies and risk appetite.\n\tMonitor lease accounts to ensure timely payments and compliance.\n\tPrepare and present lease proposals for management approval.\n\tMaintain strong relationships with existing clients to drive renewals and referrals.\n\tCollaborate with credit, risk, and legal teams to ensure seamless documentation and disbursement.\n\tGenerate periodic reports on lease portfolio performance.\n\n\nRequirements\n\n\n\tCandidates should possess a minimum of a First Degree in any discipline (Finance, Business Admin, or related field preferred).\n\tMinimum of 3 years of relevant experience in SME leasing within a financial institution.\n\tGood understanding of leasing operations, credit analysis, and risk management.\n\tStrong communication, negotiation, and interpersonal skills.\n\tProficiency in Microsoft Office (Excel, Word, PowerPoint).\n\tAbility to work independently and as part of a team in a fast-paced environment.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: ayodeji.omidiji@addosser.com using “Leasing Officer – Lagos” as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Social Media Manager Job at Sensei Integrated Global Farms",
    "link": "https://www.jobgurus.com.ng/jobs/view/social-media-manager-job-at-sensei-integrated-global-farms",
    "pubDate": "Tue, 01 Jul 2025 16:20:19 GMT",
    "source": "JobGurus",
    "keyword": "sensei integrated global farms",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Sensei Integrated Global Farms is a forward-thinking agricultural enterprise driven by excellence, innovation, and mastery. We specialise in integrated farming practices that combine fish farming, vegetable cultivation, and sustainable agri-solutions.\n\nWe are recruiting to fill the position below:\n\nJob Position: Social Media Manager\n\nJob Location: Niger\nEmployment Type: Part-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tSIG Farms is a dynamic agricultural business committed to providing high-quality farm products to our customers. We are looking for a talented Social Media Manager to join our team and help us expand our online presence.\n\n\nResponsibilities\n\n\n\tCreate engaging content for social media platforms including Facebook, Instagram, TikTok, and Twitter.\n\tCapture photos and videos at the farm to showcase our activities and products.\n\tEdit content to ensure it is visually appealing and aligns with our brand.\n\tManage and schedule posts to ensure consistent online activity.\n\tUtilize graphic design tools like Canva to create eye-catching images.\n\tImplement paid advertising campaigns on platforms like Facebook Ads and Google Ads.\n\tMonitor and analyze engagement metrics to optimize content and strategies.\n\n\nRequirements\n\n\n\tMinimum of 2 years of experience in social media management.\n\tProven track record of increasing engagement and followers.\n\tProficiency in graphic design tools like Canva.\n\tExperience with paid advertising on social media platforms.\n\tStrong communication and organizational skills.\n\n\nSalary\nN40,000 - N50,000 / month. \n\nMethod of Application\nInterested and qualified candidates should send their Resume and Portfolio to: realezekiel1@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]