[
  {
    "title": "Admin Officer Job at Northbury British School",
    "link": "https://www.jobgurus.com.ng/jobs/view/admin-officer-job-at-northbury-british-school",
    "pubDate": "Thu, 19 Jun 2025 16:19:18 GMT",
    "source": "JobGurus",
    "keyword": "northbury british school",
    "duplicate": false,
    "classifications": [],
    "content": "Northbury British School Kano is one of the leading International Schools in Kano located at No 1 Ibrahim Dabo Road, Tarauni, Kano. A serene and secured learning environment that provides pupils/students with unique and exceptional learning experiences with state-of-the-art facilities, well-trained teachers and classroom technologies. Our pupils and students are prepared to take on life challenges for self-development as well as becoming an integral part of societal development.\n\nWe are recruiting to fill the position below:\n\nJob Position: Admin Officer\nJob Location: Kano\nJob Type: Full-time\n\nRequirements\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tCandidates should possess relevant qualifications and experience.\n\n\nMethod of Application \nInterested and qualified candidates should send their CV to: northburybritishschool@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Mechanical Engineer & Site Coordinator Job at Choice Talents NG",
    "link": "https://www.jobgurus.com.ng/jobs/view/mechanical-engineer-site-coordinator-job-at-choice-talents-ng",
    "pubDate": "Thu, 19 Jun 2025 16:19:18 GMT",
    "source": "JobGurus",
    "keyword": "choice talents ng",
    "duplicate": false,
    "classifications": [],
    "content": "Choice Talents NG is Nigeria’s preferred talents management company. Our goal is to help build successful businesses through effective talent, resource and process management.\n\nWe are recruiting to fill the position below:\n\nJob Position: Mechanical Engineer & Site Coordinator\n\nJob Locations: Abuja (FCT) and Lagos\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tSupervision of mechanical engineering functionsandmobile equipment in the workshop\n\tOverseeing multi- cultural workshop team including performance, time keeping and cost allocation.\n\tProgramming and implementing fleet maintenance program.\n\n\nRequirements\n\n\n\tDiesel Mechanic Trade Test is the minimum qualification\n\t3+ years of experience in the maintenance of Caterpillar / CAT equipment.\n\tAble to lead and supervisemulti-cultural individuals.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: jobs@choicetalents.com.ng using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Operations Safety Engineer (OSE) Job at Benmaris Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/operations-safety-engineer-ose-job-at-benmaris-limited",
    "pubDate": "Thu, 19 Jun 2025 16:19:18 GMT",
    "source": "JobGurus",
    "keyword": "benmaris limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Benmaris Limited started as a professional manpower providers, financial consultants and general works contractor in 2007. It is a wholly owned Nigerian Company. Over the years, it has undertaken many challenging projects and accumulated skills, know-how and experiences in Facilities Management, Procurement and Supply Services, Design and Build Solutions, Project Management Services, Building Construction and related engineering works.\n\nWe are recruiting to fill the position below:\n\nJob Position: Operations Safety Engineer (OSE)\n\nJob Location: Lagos\n\nAbout the Role\nActivites:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAssists the DW FOPS Operations Safety Leader in the implementation of the Health, Safety and Environment standards & objectives, in compliance with the One MAESTRO, COMPANY HSE Management System and other COMPANY Referential.\n\tSupport the DW FOPS OSL to actively lead Company HSE awareness and initiative schemes, ensure compliance with/application of all relevant statutory and Company HSE standards on the operational sites\n\tIn liaison with the DW FOPS OSL, act as a focal point for all HSE statistics reporting relating to DW Field Operations onshore and offshore activities weekly (Collates for review anomaly reports issued from DW Onshore and record/trend incident reports from DW Offshore)\n\tAssist the DW FOPS OSL in preparation of reports on key HSE events and related DW FOPS activities (FORUM, CODIV, STANDOWN, AWAY-DAY, etc), then monitor DW Field Operations HSE Performances (objectives, activity plan, KPI)\n\tDevelop DW FOPS monthly HSE Performance reports following the direction of the DW FOPS OSL and assist in the preparation, coordination and organization of the quarterly base HSE Committee Meetings (CODIV)\n\tEnsure HSE training requirements for all DWA FOPS personnel (staff and contract) are completely captured in SafePass, HSEPass and ePOB as the case may be; then monitor to drive compliance and report HSE training performance weekly.\n\tStand down review of Incident/REX notifications and their Synergi cases, then follow up the implementation of all DW FOPS actions in Synergi arising from incident investigation reports, audits implementation, etc.\n\tFacilitate and participate in contractors HSE MS audits; operational sites HSE audits & inspections as well as report, monitor and update all actions emanating from them, including OPERSAFE and MAESTRO Audit corrective actions\n\tParticipate in hazard studies / risk assessments undertaken for the modification of installations and the execution of operations when the need arises to ensure the safe execution of operations; and that risks are adequately managed\n\tCreate new HSE material/equipment after validating the specifications with DW FOPS OSL, raise MRFs/SRF for procurement of HSE consumables /services for site operations; follow up with responsible supply chain parties (buyer, FOPS materials coordinator, transit, Stock controller, LADOL materials Supt, etc) till delivery to site.\n\tMonitor as the Decentralized Purchase Person the HSE consumables and services supply chain processes for unassigned PRs, unreleased PRs, POs, and SES; then promptly highlight to the DWA FOPS OSL for intervention. Participate in the supply chain DUET meetings to drive availability of HSE consumable materials.\n\tLead specific Operations Safety reviews in support of Request for Modification (RFM) process and Downgraded Situations (DGS) – HAZOP, HAZID, etc.\n\tSupport operational entities in Call-For-Tender Risk Assessment and Derogation preparation.\n\tTransverse follow up of HSE budget executors to ensure work plans are adequately captured in the IOP plan; work scope executed as plan and the invoices submitted in a timely manner for all scope executed\n\tContribute to development of REX from event/activity reports; distribution of REX (HSE alerts, FBN, SFN) and follow up implementation of REX recommendations\n\tFollow up of the implementation of the DW FOPS HSEQ activity plan in line with the HSEQ objectives set for the year to ensure adequate monitoring, regular update and effective communication of the HSEQ activities.\n\tParticipate in the review of key operational HSE document (SIMOPS/HSE Dossiers, specific procedures, bridging document, etc.)\n\tCoordinate and deliver (where required) identified HSE training needs of existing asset personnel and follow up their HSE training compliance (company and contractor); also support the DW FOPS OSL in providing relevant HSE awareness sessions to new persons arriving the division.\n\tParticipate in site operations Emergency Preparedness and implementation as required including drafting of Emergency.\n\n\nContext and Environment:\n\n\n\tOffice-based (LAGOS) with occasional site visits and hierarchically attached to the DW FOPS Operations Safety Leader (OSL) DW Fields with crude and condensate processing, shutdown/ construction activities, Operations ramp-up:\n\tAKPO FPSO in operation (aging with integrity issues); Production: Oil/Condensate = 185Kbbls/day, Gas = 530MMScfpd\n\tEGINA FPSO in operation; Production: Oil/Condensate = 200Kbbls/day.\n\tStrong interface with other departments in the DW Field Operations, DW HSE; DW Contract & Procurement; and LADOL supply base.\n\n\nAccountabilties:\n\n\n\tAttend and facilitate the holding of site and departmental HSE committee meetings\n\tCoordinate DW Field Operations inputs to PPE procurement; issue of PPE to relevant crew and maintenance of contingencies\n\tFacilitating HSE audits (pre-start-up, facility, etc.), co-ordinate management facility inspection visits and DPR facilities inspections.\n\n\nRequirements\n\n\n\tEngineering Degree in Civil, Electrical, Mechanical, Petroleum or Safety fluent in English with good communication skills\n\tProfessional Experience: 5 years in Oil and Gas (E&P), 3 years in HSE position.\n\tExperience in a construction and operation environment, in Safety Engineering techniques, (HAZOP, PTR, HAZID and Audits)\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "IT Officer Job at the Place - Smackers Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/it-officer-job-at-the-place-smackers-limited",
    "pubDate": "Thu, 19 Jun 2025 16:19:18 GMT",
    "source": "JobGurus",
    "keyword": "the place - smackers limited",
    "duplicate": false,
    "classifications": [],
    "content": "The Place - We are a fast growing, world class, and dynamic, multi-billion Nigerian conglomerates, established and managed by a team of professionals with decades of management consulting and accounting experience/ training from Arthur Andersen (now KPMG in Nigeria). We are a profitable player in the QSR sector of the Hospitality industry in Nigeria with great prospects and staff strength of over 1000 employees. Currently, our operations span across 17 locations in Lagos and Abuja, Nigeria, with rapid expansion plans to penetrate more locations in the short to medium term.\n\nWe are recruiting to fill the position below:\n\nJob Position: IT Officer\nJob Location: Abuja (FCT)\nEmployment Type: Full-time \n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Description\n\n\n\tTroubleshooting and maintaining wireless and ethernet network systems and  providing rapid solutions.\n\t Installing and administering application servers, laptops and PCs, including operating systems.\n\tTroubleshooting and managing User outlook issues.\n\tCollaborating with internal stakeholders in planning, administration, and execution of projects, processes, issue resolution, and procedures.\n\tMonitoring and maintaining computer systems and networks.\n\tManaging installations, upgrades and configurations of hardware and software\n\tAssessing system (laptops, desktops, servers etc.) performance and recommending improvements where necessary.\n\tSupporting any ERP or business application\n\tProviding technical/user support across the company\n\tProviding timely and accurate customer feedback.\n\tSupporting and testing the roll-out of new technologies, applications and/or features\n\n\nQualifications\n\n\n\tNational Diploma in computer science or related field\n\t1 to 2 years of relevant experience\n\tKnowledge of Microsoft Navision is a plus.\n\n\nPersonalities:\n\n\n\tLogical thought process\n\tAbility to stick to strict deadlines\n\tAbility to work well with people\n\tExcellent organizational skills\n\tWillingness to sometimes work unsociable hours\n\tEnthusiasm for continual learning\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]