[
  {
    "title": "Customer Service Representative Job at Gosub Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/customer-service-representative-job-at-gosub-limited-4",
    "pubDate": "Tue, 24 Jun 2025 14:43:44 GMT",
    "source": "JobGurus",
    "keyword": "gosub limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Gosub Limited is a software company dedicated to developing innovative products that tackle everyday challenges. We are currently promoting gosub.ng, a web application that provides telecommunication products and services to individuals and corporate customers across Nigeria. Through gosub.ng, users can easily purchase data plans or airtime, transfer or convert airtime to cash, and process bill payments. We are passionate about delivering technological solutions to address the challenges faced by Nigerians.\n\nWe are recruiting to fill the position below:\n\nJob Position: Customer Service Representative\n\nJob Location: Benin City, Edo\nEmployment Type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking an experienced and highly motivated Customer Service Representative to join our team.\n\tAs a Customer Service Representative, you will be responsible for providing excellent customer service and support to our valued customers.\n\n\nResponsibilities\n\n\n\tManage incoming customer inquiries via phone, email, and social media channels.\n\tProvide product and service information to customers.\n\tRespond to customer complaints and resolve issues in a timely and effective manner.\n\tProcess customer orders.\n\tCollaborate with other teams to ensure customer satisfaction.\n\tMaintain accurate records of customer interactions and transactions.\n\tIdentify and escalate priority issues to the appropriate department.\n\n\nRequirements\n\n\n\tCandidate must possess at least a Bachelor’s Degree in a related field.\n\tMinimum of 2 years of experience in a similar role.\n\tFlexible to work shifts, including days, nights, weekends, and holidays.\n\tMust reside in Benin City, specifically around Sapele Road or GRA and environs.\n\tStrong problem-solving and analytical skills.\n\tProficiency in multitasking and prioritizing in a fast-paced environment.\n\tExcellent communication and interpersonal skills.\n\tCapacity to work under pressure.\n\tProficiency in Microsoft Office Suite (especially Excel) and CRM software.\n\tExperience in a customer-focused environment.\n\tAbility to work independently and in a team setting.\n\n\nSalary\nN120,000 monthly.\n\nMethod of Application\nInterested and qualified candidates should send their application directly to: career@gosub.ng using the Job Position as the subject of the email.\n\nNote:\n\n\n\tOnly applications sent to career@gosub.ng will be reviewed.\n\tWe encourage you to apply early, as applications will be considered on a first-come, first-served basis.\n\tIf you’re a motivated, customer-focused individual who is passionate about delivering exceptional service, we encourage you to apply for this exciting opportunity.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Human Resource & Admin Manager Job at Worknigeria",
    "link": "https://www.jobgurus.com.ng/jobs/view/human-resource-admin-manager-job-at-worknigeria",
    "pubDate": "Tue, 24 Jun 2025 14:43:44 GMT",
    "source": "JobGurus",
    "keyword": "worknigeria",
    "duplicate": false,
    "classifications": [],
    "content": "Worknigeria was established with a Singular Vision. To help the vast Nigerian workforce find meaningful jobs. We are also on a mission to upskill them in the best ways possible and help them grow with and within their careers.\n\nWe are recruiting to fill the position below:\n\nJob Position: Human Resource & Admin Manager\n\nJob Location: Ajao Estate, Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe seek a dynamic Human Resource & Admin Manager to oversee all HR and administrative functions, including recruitment, onboarding, performance and wage reviews, disciplinary actions, training, and policy implementation.\n\tYou should have senior-level HR and admin experience and deep knowledge of Nigerian labor laws and compliance (e.g., NHF,PENCOM, ITF, NDPR) to drive workplace efficiency and align HR with business goals\n\n\nJob Responsibilities\n\n\n\tTalent Acquisition: Source, recruit, and onboard high-caliber staff, ensuring alignment with organizational goals and compliance with Nigerian labor market standards.\n\tSeamless Onboarding: Design and implement an efficient onboarding process to integrate new employees effectively into the organization.\n\tAsset and Records Management: Oversee office asset management and maintain accurate, confidential employee records in line with Nigerian data protection regulations (e.g., NDPR).\n\tProcurement and Vendor Coordination: Manage procurement processes, negotiate with vendors, and maintain cost-effective supplier relationships to support office operations.\n\tEmployee Development: Develop and deliver training programs, provide counseling, and mentor staff to foster professional growth and a positive workplace culture.\n\tAdministrative Oversight: Execute essential administrative tasks, including office logistics, facility management, and coordination of operational resources.\n\tPerformance and Compensation Reviews: Conduct regular performance evaluations and manage wage reviews to ensure fair and competitive compensation practices.\n\tConflict Resolution: Facilitate constructive and professional mediation to resolve workplace disputes, ensuring adherence to Nigerian labor laws and organizational policies.\n\tPolicy Development and Awareness: Create, update, and communicate clear HR and administrative policies to ensure employee understanding and compliance.\n\tReporting: Prepare concise, data-driven reports on HR metrics, administrative activities, and compliance for management decision-making.\n\tPresentations: Deliver engaging and informative presentations to employees, management, or stakeholders to communicate policies, initiatives, or updates.\n\tRegulatory Compliance: Ensure all HR and administrative processes comply with Nigerian labor laws, health and safety regulations, and statutory requirements (e.g., NHF, PENCOM, ITF)\n\n\nQualifications\n\n\n\tBachelor's Degree in HR Management, Business Administration, or related field.\n\tCIPM, CIPD, or SHRM certification preferred.\n\n\nJob Requirements:\n\n\n\tExperience: 7+ years in HR and admin roles\n\tInterpersonal Skills: Ability to build positive relationships with diverse stakeholders, showing cultural sensitivity.\n\tTraining: Experience in designing and delivering employee training and mentoring programs.\n\tConflict Resolution: Expertise in managing conflicts, disciplinary actions, and workplace investigations per Nigerian labor laws.\n\tConfidentiality: Strong adherence to workplace privacy and Nigerian data protection regulations (e.g., NDPR).\n\tCommunication: Proficient in delivering presentations and communicating effectively with diverse audiences.\n\tRegulatory Knowledge: Familiarity with Nigerian labor laws, health and safety regulations, and compliance (e.g., NHF, PENCOM, ITF).\n\tDigital Skills: Proficient in Microsoft Office (Word, Excel, PowerPoint) and HRIS for payroll and employee management.\n\tAdaptability: Ability to manage administrative challenges and vendor relationships in Nigeria's dynamic business environment.\n\n\nSalary\nN800,000 - N1,000,000 monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CVs to: careers@worknigeria.com using the Job Position as the subject of the mail.email.\n\nNote: Only shortlisted candidates will be contacted.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Facility Officer Job at Addosser Investment Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/facility-officer-job-at-addosser-investment-limited",
    "pubDate": "Tue, 24 Jun 2025 14:43:44 GMT",
    "source": "JobGurus",
    "keyword": "addosser investment limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Addosser Investment Limited is a Group of Company with different subsidiaries that renders Financial Solutions Services for individuals, Business owners, and Corporate Institutions.\n\nWe are recruiting to fill the position below:\n\nJob Position: Facility Officer\n\nJob Location: Lagos \nEmployment Type: Full-time\n\nRequirements\n\n\n\tBSc in related discipline with 3 years + of work experience, Additional qualification is an added advantage.\n\n\nSalary\nN200,000 - N250,000 Monthly.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: taiwo.oguntade@addosser.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Administrative and People Operations Assistant Job at Karishma CDK Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/administrative-and-people-operations-assistant-job-at-karishma-cdk-limited",
    "pubDate": "Tue, 24 Jun 2025 14:43:44 GMT",
    "source": "JobGurus",
    "keyword": "karishma cdk limited",
    "duplicate": false,
    "classifications": [],
    "content": "Karishma is an established plastics manufacturer, having commenced operations eighteen years ago. Over time, we have come to be known for our uncompromising standard of quality in all our products. We produce FlowGuard® CPVC Pipes, PVC pipes, PVC conduit pipes, and HDPE water storage tanks.\n\nWe are recruiting to fill the position below:\n\nJob Position: Administrative and People Operations Assistant\nJob Location: Challawa, Kano\nEmployment Type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a dedicated and organized Administrative and People Operations Assistant to join our team.\n\tAs an Administrative and People Operations Assistant, you will assist in overseeing administrative functions and various aspects of human resources operations.\n\tThe ideal candidate will possess strong organizational skills, exceptional communication abilities, and a keen understanding of administrative processes and human resources management.\n\n\nResponsibilities\n\n\n\tAssist in managing administrative functions, including office management, facilities maintenance, and procurement of office supplies.\n\tSupport the development and implementation of administrative policies and procedures to ensure smooth operations and compliance with company standards.\n\tHelp process all required regulatory permits and licenses for our facilities, and actively engage with governmental agencies to guarantee compliance with relevant regulations and requirements, including attendance during inspections.\n\tAid in managing human resources operations, including recruitment, onboarding, attendance, payroll, performance management, employee relations, and offboarding processes.\n\tCollaborate with department heads to identify staffing needs and develop strategies for talent acquisition and retention.\n\tAssist in recruitment activities, including job postings, resume screening, interviewing, and selection of candidates.\n\tFacilitate new employee onboarding processes, including orientation, training, and integration into the company culture.\n\tAssist in preparing payroll schedules, including attendance records, and ensure accurate and timely processing of employee payments, tax withholdings, and benefits deductions, all while adhering to relevant regulations and company policies.\n\tSupport employee performance appraisal processes and provide guidance to supervisors and employees on performance management.\n\tAssist in handling employee relations issues and grievances, including conducting investigations and implementing appropriate resolutions.\n\tAssist in the administration of employee benefits programs, including enrollment, changes, and termination of benefits.\n\tMaintain accurate employee records and ensure compliance with relevant employment laws and regulations.\n\tAssist in coordinating employee training and development initiatives to enhance skills and competencies across the organization.\n\tHelp manage employee communication channels and facilitate effective communication between management and staff.\n\n\nRequirements\n\n\n\tInterested candidates should possess relevant qualifications with 2 - 3 years of work experience.\n\n\nSalary\nN230,000 - N280,000 Monthly.\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "HR / Admin Officer Job at GPED Global Services",
    "link": "https://www.jobgurus.com.ng/jobs/view/hr-admin-officer-job-at-gped-global-services",
    "pubDate": "Tue, 24 Jun 2025 14:43:44 GMT",
    "source": "JobGurus",
    "keyword": "gped global services",
    "duplicate": false,
    "classifications": [],
    "content": "GPED Global Services, a Recruitment and general goods company, is recruiting to fill the position below:\n\nJob Position: HR / Admin Officer\n\nJob Location: Lagos \nEmployment Type: Full-time\n\nResponsibilites\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAdvertise job openings and coordinate recruitment processes.\n\tSchedule interviews and conduct reference checks.\n\tPrepare offer letters and employment contracts.\n\tCollect and process timesheets.\n\tSupport payroll preparation and ensure proper deductions and benefits administration.\n\tAssist in performance appraisal processes.\n\tOrganize staff induction and onboarding.\n\tMaintain and update staff files, leave records, and HR database.\n\tTrack attendance, absence, and punctuality.\n\tMonitor employee KPIs and report to management.\n\tHandle grievances, complaints, and disciplinary actions.\n\tEnsure adherence to company policies and labour regulations.\n\tIdentify training needs and coordinate internal or external training programs.\n\tKeep training records up to date.\n\tEnsure smooth running of daily administrative operations.\n\tOversee the use and maintenance of company property.\n\tKeep an inventory of office assets and supplies.\n\n\nQualifications & Requirements\n\n\n\tB.Sc / HND qualification in Human Resource Management, Business Admin, or related field.\n\t2 - 5 years of experience in a similar role.\n\tGood knowledge of labour laws and HR best practices.\n\tProficient in Microsoft Office (Word, Excel, PowerPoint).\n\tExcellent interpersonal, communication, and organizational skills.\n\tHigh level of confidentiality and professionalism.\n\n\nMethod of Application\nInterested and qualified candidates should send their CVs to: gpedglobal@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]