[
  {
    "title": "Digital Marketing & Brand Officer Job at Elites Holdings",
    "link": "https://www.jobgurus.com.ng/jobs/view/digital-marketing-brand-officer-job-at-elites-holdings",
    "pubDate": "Thu, 03 Jul 2025 12:33:11 GMT",
    "source": "JobGurus",
    "keyword": "elites holdings",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Elites Holdings is a group of companies comprising of Elites reality limited, Elites Chauffuer limited and Elites Agro farm and feedmills limited.. We offer quality services to both corporate organizations and private individuals. Our services include real estate development and advisory services, affordable and reliable car rental for commercial or personal use, and poultry farming and processing of broiler chickens for wholesale and retail supply. We pride ourselves on being an innovative, creative, people-oriented company providing cross-training skill, self-development, and growth to all employees.\n\nWe are recruiting to fill the position below:\n\nJob Position: Digital Marketing & Brand Officer\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Location: Ikeja, Lagos\nEmployment Type: Hybrid (Onsite & Remote)\n\nJob Summary\n\n\n\tWe are seeking a talented and driven Digital Marketing & Brand Officer to lead our digital marketing and branding efforts.\n\tThe ideal candidate will develop and implement strategic campaigns that enhance our brand presence, engage our audiences, and drive measurable business outcomes.\n\tThis role bridges marketing, communications, and design—managing content, maintaining brand consistency, and supporting cross-functional initiatives across departments.\n\n\nKey Responsibilities\nDigital Marketing & Communications:\n\n\n\tPlan and execute digital campaigns across SEO, PPC, email marketing, display ads, and social media.\n\tManage and update website content via CMS platforms; optimize for SEO and performance.\n\tBuild and maintain a strong social media presence (LinkedIn, Facebook, Instagram, X/Twitter, etc.).\n\tMonitor, analyze, and report on key digital metrics (traffic, engagement, conversion, ROI).\n\n\nBrand Management:\n\n\n\tEnsure brand consistency across all digital and physical materials.\n\tDevelop and implement brand guidelines and toolkits.\n\tCollaborate with design teams to produce brand-aligned marketing assets.\n\n\nContent Creation:\n\n\n\tCreate and curate content (copy, visuals, videos) for websites, blogs, social media, newsletters, and campaigns.\n\tWork with internal teams and external vendors to develop compelling, brand-aligned storytelling.\n\n\nCollaboration & Support:\n\n\n\tPartner with departments like Sales, Product, and HR to support internal and external branding campaigns.\n\tAssist in organizing marketing events, sponsorship activations, and PR initiatives.\n\n\nRequirements\nEducation & Experience:\n\n\n\tBachelor’s Degree in Marketing, Communications, Digital Media, or a related field.\n\tMinimum of 4 years of relevant experience in digital marketing, branding, or corporate communications.\n\n\nSkills & Competencies:\n\n\n\tProficient in Google Analytics, Meta Ads Manager, and WhatsApp Ad Manager.\n\tHands-on experience with CMS platforms (e.g., WordPress), email marketing tools, and Adobe Creative Suite.\n\tExceptional writing, editing, and storytelling ability.\n\tAbility to juggle multiple projects and meet deadlines in a fast-paced environment.\n\tCreative, detail-oriented, and a strategic thinker.\n\n\nPreferred Qualifications:\n\n\n\tExperience in advertising or related industry is an advantage.\n\tBasic knowledge of HTML/CSS or video editing.\n\tFamiliarity with Google Ads, HubSpot, or similar CRM and automation platforms.\n\n\nSalary\nN180,000 - N220,000 monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV and portfolio to: hr@elitesholdingsng.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Secretary Job at Ascentech Services Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/secretary-job-at-ascentech-services-limited-4",
    "pubDate": "Thu, 03 Jul 2025 12:33:11 GMT",
    "source": "JobGurus",
    "keyword": "ascentech services limited",
    "duplicate": false,
    "classifications": [],
    "content": "Ascentech Services Limited is a full-fledged Human Resource Solution Provider incorporated in 2013 with its Head Office in Lagos, Nigeria. We are committed to forging long-term partnerships with our clients by creating and delivering robust and flexible services that address the changing needs of their business.\n\nWe are recruiting to fill the position below:\n\nJob Position: Secretary\nJob Location: Oshodi, Lagos\nEmployment Type: Full-time\n\nJob Overview\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a highly organized Secretary with 3-5 years of experience.\n\tThe ideal candidate must have Strong communication and organizational skills\n\n\nKey Responsibilities\n\n\n\tPrepare and organize documents, reports, and meeting materials.\n\tHandle internal and external communications, including phone calls and emails.\n\tAssist in basic accounting tasks, including invoicing and expense tracking.\n\tCoordinate office supplies and equipment maintenance.\n\tTake meeting minutes and follow up on action items.\n\n\nQualifications\n\n\n\tMinimum of OND Certificate\n\t3-5 years of experience in a similar role\n\tStrong computer skills, including proficiency in MS Office\n\tExcellent communication and organizational skills.\n\tAbility to handle confidential information with discretion.\n\n\nSalary\nN128,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should forward their CVs to: cv@ascentech.com.ng using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]