[
  {
    "title": "Customer Service Representative (B2B) Job at Pharmarun",
    "link": "https://www.jobgurus.com.ng/jobs/view/customer-service-representative-b2b-job-at-pharmarun",
    "pubDate": "Wed, 02 Jul 2025 15:17:30 GMT",
    "source": "JobGurus",
    "keyword": "pharmarun",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Pharmarun is an on-demand platform providing fast and easy access to medication. We do this by finding, financing and delivering medication to users.\n\nWe are recruiting to fill the position below:\n\nJob Position: Customer Service Representative (B2B)\n\nJob Location: Lekki, Ikate - Lagos\n\nRole Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a Customer Service Representative with pharmacy experience to support and manage customer requests across our digital channels.\n\tYou’ll be the first point of contact for patients and customers looking to place medication orders, resolve issues, or make inquiries.\n\tYour pharmacy background will ensure you communicate clearly and accurately, especially when addressing medication-related questions.\n\n\nKey Responsibilities\n\n\n\tRespond promptly and professionally to customer inquiries via WhatsApp, Phone calls, chat, email, and social media.\n\tUnderstand and verify medication requests using pharmacy knowledge.\n\tAssist customers with placing, tracking, modifying, or canceling orders.\n\tWork closely with the dispatch and pharmacy teams to ensure smooth fulfillment and accurate delivery.\n\tEscalate complex or clinical queries to pharmacists when necessary.\n\tUpdate internal order tracking sheets and CRM tools.\n\tFollow up with customers for satisfaction, repeat orders, and issue resolution.\n\tIdentify recurring issues and contribute to improving customer support workflows.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Customer Service Representative Job at Fibre Hub",
    "link": "https://www.jobgurus.com.ng/jobs/view/customer-service-representative-job-at-fibre-hub",
    "pubDate": "Wed, 02 Jul 2025 15:17:30 GMT",
    "source": "JobGurus",
    "keyword": "fibre hub",
    "duplicate": false,
    "classifications": [],
    "content": "Fibre Hub is a telecommunication and Information Technology service company. We offer a combination of business solutions designed to enhance the efficiency and productivity of our clients. Over the years we have been able to identify and develop competence for analyzing and understanding business operations, the cost drivers, and operational hiccups that create inefficiencies and challenges in organizations. We have numerous customized business solutions designed to address our client's specific telecommunication challenges; giving the organization the required edge in today’s highly competitive market.\n\nWe are recruiting to fill the position below:\n\nJob Position: Customer Service Representative\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Location: Omole / Ogba Junction, Lagos\nEmployment Type: Full-time\n\nJob Brief\n\n\n\tWe are seeking a Customer Service Representative who will be responsible for promptly and effectively addressing customer queries and issues.\n\tThe tasks include providing accurate information, troubleshooting problems, and ensuring customer satisfaction.\n\n\nResponsibilities\n\n\n\tProvide excellent customer service by responding to customer inquiries via phone, email, and chat\n\tResolve customer complaints and issues in a timely and professional manner\n\tKeep accurate and detailed records of customer interactions and transactions\n\tIdentify and escalate priority issues to the appropriate team member or manager\n\tStay up-to-date with product and service knowledge to effectively assist customers\n\tAssist in developing and implementing customer service policies and procedures\n\tCollaborate with other departments to ensure customer satisfaction and retention\n\tAttend training and professional development programs to improve customer support skills\n\n\nRequirements\n\n\n\tExcellent communication skills in English\n\tAbility to handle customer queries and complaints in a professional and empathetic manner\n\tFamiliarity with customer support software and tools\n\tStrong problem-solving skills and ability to think fast\n\tFlexibility to work in shifts, including weekends and holidays\n\tPatience and ability to remain calm under pressure\n\tAttention to detail to ensure accurate documentation of customer interactions\n\tWillingness to learn and adapt to new processes and procedures in a fast-paced work environment.\n\n\nMethod of Application\nInterested and qualified candidates should send their resume to: hr@fibrehub.com.ng using the Job Position as the subject of the email.\n\nNote: A male candidate is advised to apply for gender balance.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Senior Manager (Telecoms) Job at Ama Zuma Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/senior-manager-telecoms-job-at-ama-zuma-group",
    "pubDate": "Wed, 02 Jul 2025 15:17:30 GMT",
    "source": "JobGurus",
    "keyword": "ama zuma group",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Ama Zuma Group is on the mandate to restructure the oil and gas arm of the business and to take full advantage of all available opportunities in the downstream sector. The company was founded on the basis of integrity and commitment to excellence.\n\nWe are recruiting to fill the position below:\n\nJob Position: Senior Manager (Telecoms)\n\nJob Location: Abule-Egba, Lagos\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tOversee the daily activities of the operations department\n\tMaintain excellent relationships via strong stakeholder management, and communication practices at all levels\n\tParticipatein Contract negotiations to reduce cost\n\tOversee fuelling and servicing of generator set on sites\n\tCheck and ensure servicing proposals and fuelling proposalsare well prepared before forwarding to the Audit department\n\tReview the daily activities of the operation unit especially as it concerns the alarms\n\tDevelop and coordinate the implementation of tactical intervention plan to improve network site/cluster utilization, profitability and revenue generation.\n\tClearly andconcisely communicate new processes to team members\n\tDevelop and coordinate the implementation of tactical intervention plan to improve network site/cluster utilization, profitability and revenue generation.\n\tClearly andconcisely communicate new processes to team members\n\tMonitor/supervise mobile generator deployment to sites\n\tDaily check on the engineers at sites to ensure seamless activitytherebyreducing sites down\n\tEnsure collated forms from engineers by the operations unitare signedtimely and follow up to the stage of getting the monthly clearance\n\tEnsure clearance forms from the operations unitare presentedtimely andaccurately.\n\tEnsure the Admin Manager get a monthly servicing report from the operations unit\n\tNegotiate with vendors for effective costing\n\tMonitor the store unit especially servicing materials and vehicle parts in stock\n\tPeriodic visitation to sites for updates\n\tOther duty as may be assigned.\n\n\nRequirements\n\n\n\tMinimum of B.Sc / HND in a relevant field.\n\t10-15 years of professional experience as a Senior Manager with experience in Telecoms Operations.\n\tStrong problem-solving skills; experience identifying and resolving issues independently based on own initiative.\n\tProactive in nature and accountable in practice; clear ownership over results and quality of work\n\tStructured, logical, and creative thinking.\n\tEstablished track record in driving cross-functional initiatives and/or building out workflows and process improvements within teams that produce measurable impact.\n\n\nMethod of Application\nInterested and qualified candidates should send a copy of their CV to: hradvertizer@yahoo.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]