[
  {
    "title": "Personal Assistant to the CEO Job at Arkounting Business Concepts Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/personal-assistant-to-the-ceo-job-at-arkounting-business-concepts-limited",
    "pubDate": "Mon, 16 Jun 2025 11:37:47 GMT",
    "source": "JobGurus",
    "keyword": "arkounting business concepts limited",
    "duplicate": false,
    "classifications": [],
    "content": "Arkounting Business Concepts - We are a brilliant and result-oriented team continuously seeking to offer world-class and simplified professional services and solutions (focused in Management Accounting, HR Consulting, Business Advisory etc.) to businesses across Africa. Our mission is to enhance business productivity by empowering and enabling them through our professional services.\n\nWe pride ourselves in providing a collaborative, and positive environment because it is important to us that you have a great experience through out your journey with us.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Personal Assistant to the CEO\nJob Location: Ogudu, Lagos\nEmployment Type: Full-time\nIndustry: Consulting (Arkounting Business Concepts Limited)\n\nThe Role\n\n\n\tThis role is exciting, positively challenging and will provide growth to the prospective role holder.\n\tThe ideal role holder is a proactive and detail-oriented Personal Assistant who is comfortable working in a fast-paced environment and supporting executive-level tasks.\n\tYou will provide day-to-day administrative support to the CEO, including calendar management, communication handling, and project coordination.\n\tThe role also involves helping to track deliverables, follow up on ongoing tasks, and ensure smooth execution of assigned projects.\n\tMost importantly, in line with our standard, he/she should be committed, hard-working and particular about delivering quality work.\n\n\nJob Responsibilities\n\n\n\tManage the CEO’s calendar, schedule meetings, and coordinate appointments.\n\tOrganize travel arrangements, including flights, accommodation, and itineraries.\n\tMaintain filing systems, both electronic and physical.\n\tAssist in managing projects, tracking deadlines, and ensuring deliverables are met.\n\tArkounting Business Concepts\n\tHandle sensitive information with the highest level of confidentiality and professionalism.\n\tConduct research and prepare briefing materials, reports, or presentations as required\n\tSupport additional administrative tasks and evolving priorities as the role develops.\n\n\nJob Requirements\n\n\n\tInterested candidates should possess a BSc Degree with 2+ years of relevant experience as a Personal Assistant or in an administrative support role\n\tExcellent communication, time management, and organizational skills\n\tStrong attention to detail with the ability to multitask and prioritize effectively\n\tProficiency in Microsoft Office (Word, Excel, PowerPoint) and Google Workspace\n\tAbility to conduct research and present findings clearly\n\tDiscreet, trustworthy, and able to handle confidential information professionally\n\tA proactive, solution-oriented mindset\n\tFlexibility and willingness to take on varied tasks as needed\n\tA positive attitude and strong sense of ownership.\n\n\n \n\nNote: Only shortlisted candidates will be contacted. We sincerely appreciate your interest in being part of our team.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Supermarket Cashier Job at Domeo Resources International",
    "link": "https://www.jobgurus.com.ng/jobs/view/supermarket-cashier-job-at-domeo-resources-international",
    "pubDate": "Mon, 16 Jun 2025 11:37:47 GMT",
    "source": "JobGurus",
    "keyword": "domeo resources international",
    "duplicate": false,
    "classifications": [],
    "content": "Domeo Resources International (DRI) is a prolific organisation which proffers HR and Management Consultancy solutions premised on excellence and innovation. DRI analyses various organisational problems, develops improvement plans, deploys those plans and monitors the plans to ensure improved organisational performance.\n\nWe are recruiting to fill the position below:\n\nJob Position: Supermarket Cashier\n\nJob Location: Abuja (FCT) \nReports to: The Supermarket Manager\n\nJob Description\nMain Function:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Supermarket Cashier is responsible for managing customer transactions efficiently, accurately, and courteously.\n\tThe role requires handling point-of-sale operations, ensuring proper cash handling, and delivering a seamless checkout experience.\n\tThe ideal candidate must be friendly, reliable, detail-oriented, and able to work in a fast-paced retail environment while maintaining a professional demeanor.\n\n\nRole Responsibilities\nTransaction Processing:\n\n\n\tAccurately scan, price, and register purchases using POS systems.\n\tReceive payments via cash, card, transfer, or vouchers and provide accurate change.\n\tIssue receipts and bag merchandise properly.\n\tEnsure the POS is balanced at the beginning and end of each shift.\n\n\nCustomer Service:\n\n\n\tGreet customers warmly and provide responsive and friendly service.\n\tAnswer product-related questions or direct customers to appropriate store personnel.\n\tResolve minor customer complaints or escalate to the supervisor when necessary.\n\tAssist elderly or disabled customers as needed.\n\n\nCash & Payment Reconciliation:\n\n\n\tMaintain an accurate cash drawer and follow proper cash-handling procedures.\n\tPerform end-of-day cash reconciliation and submit reports to the accounts or store manager.\n\tImmediately report any discrepancies, errors, or suspicious activities.\n\n\nStore Presentation & Cleanliness:\n\n\n\tMaintain a clean and orderly checkout area.\n\tMonitor and refill shopping bags, receipt paper, and other supplies as needed.\n\tReport equipment malfunctions (POS, scanners, etc.) to the supervisor promptly.\n\n\nCompliance:\n\n\n\tFollow internal policies regarding transaction limits, refund protocols, and price overrides.\n\tComply with safety, hygiene, and sanitation standards.\n\tAdhere to attendance and punctuality standards.\n\n\nQualifications and Experience\nEducation and Certifications:\n\n\n\tMinimum of SSCE / WAEC; OND or higher qualification is an advantage.\n\tMinimum of 1 – 2 years of experience as a cashier, preferably in a retail or supermarket environment.\n\tFamiliarity with POS systems, cash registers, and retail operations.\n\tBasic math and computer skills.\n\tAbility to work flexible hours, including weekends and public holidays.\n\n\nKey Competencies:\n\n\n\tHigh level of integrity and accuracy\n\tExcellent customer service and communication skills\n\tFast and efficient multitasking ability\n\tProfessional appearance and behavior\n\tTeam spirit and willingness to support other departments\n\tGood problem-solving and interpersonal skills\n\n\nMethod of Application\nInterested and qualified candidates should forward their CV and Cover Letters to: recruitment@domeoresources.org using Supermarket Cashier as the subject of mai.\n\nNote: Only shortlisted candidates will be contacted.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Personal Assistant / Social Media Manager Job at Lisse Africa",
    "link": "https://www.jobgurus.com.ng/jobs/view/personal-assistant-social-media-manager-job-at-lisse-africa",
    "pubDate": "Mon, 16 Jun 2025 11:37:47 GMT",
    "source": "JobGurus",
    "keyword": "lisse africa",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Lisse Africa is a dynamic human resource consulting firm with key interest in recruitment with the aim of providing employees that are professional, verified and with a good cultural fit. At Lisse Africa, our aim is to build the world's most valued Recruitment Solution Company to Clients, Candidates, Colleagues and the communities where we work and live with regards to staff recruitment, background verification and other HR solutions. We solely focus on the enhancement of client organizations by providing quality services on various aspects of their human resources and by letting the organization focus on its core issues.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Personal Assistant / Social Media Manager\nJob Location: Lagos\nEmployment Type: Full-time (Hybrid - 2 days physically and 3 days remotely)\n\nJob Summary\n\n\n\tWe are seeking a highly organized and proactive Personal Assistant to support our client.\n\tThe successful candidate will play a crucial role in ensuring the smooth operation running of the clients schedule,run errands and handle her social media pages.\n\n\nResponsibilities\n\n\n\tManage and maintain executive calendars, including scheduling appointments, meetings, and travel arrangements.\n\tManage the brand of the MD and her social media handles.\n\tPrepare and edit correspondence, presentations, reports, and other documents.\n\tHandle confidential information with discretion and professionalism.\n\tAssist in the preparation of expense reports and other financial documents.\n\tCoordinate and facilitate internal and external meetings, including preparing agendas and taking minutes.\n\tConduct research and compile information for various projects and initiatives.\n\tServe as a liaison between executives and other staff members, clients, and external stakeholders.\n\tAssist with special projects and other duties as assigned.\n\n\nQualifications\n\n\n\tBachelor's Degree or equivalent experience preferred.\n\tExperience: 2 years\n\tProven experience as a personal assistant or similar role.\n\tExcellent organizational and time management skills.\n\tAbility to manage social media pages.\n\tStrong written and verbal communication abilities.\n\tProficiency in Microsoft Office suite and other relevant software.\n\tAbility to multitask and prioritize tasks effectively.\n\tDiscretion and confidentiality in handling sensitive information.\n\tStrong attention to detail and accuracy.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: tegarecruits@gmail.com using \"Personal Assistant / Social Media Manager\" as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Internal Audit Officer Job at Vixa Pharmaceutical Company Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/internal-audit-officer-job-at-vixa-pharmaceutical-company-limited",
    "pubDate": "Mon, 16 Jun 2025 11:37:47 GMT",
    "source": "JobGurus",
    "keyword": "vixa pharmaceutical company limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Vixa Pharmaceutical Company Limited was founded by Chief Sir Ebuka Okafor, an entrepreneur with vast experience in the pharmaceutical industry. Vixa Pharmaceutical Company Limited has come of age with an imposing record of over 10 years meeting the needs of sick and needy through a range of globally sourced, best-in-their-class life saving medicines.\n\nOur range of pharmaceutical products include critical care, super specialty products covering the categories of Anti-Malarial, Anti-Biotic, Anti-Fungal, Anti-Emetic, Steroid, NSAID drugs, Anti-Spasmodic, Anti-Hypertensive, Worm Expellant, Anti-Hastimine and Anti-Psychotic drugs.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Internal Audit Officer\nJob Location: Abuja (FCT)\nEmployment Type: Full-time\n\nJob Description\n\n\n\tReconciliation of stocks records using accepted accounting and statistical procedures.\n\tConduct weekly, monthly, quarterly and annual review of audit report plans.\n\tCollect and analyze data to detect deficient controls, duplicated effort, extravagance, fraud, or non-compliance with laws, regulations, and management policies.\n\n\nResponsibilities\n\n\n\tVerifying assets and liabilities by comparing items to documentation.\n\tEnsures compliance with established internal control procedures by examining records, reports, operating practices, and documentation.\n\tCompletes audit work-papers by documenting audit tests and findings.\n\tIdentify loopholes and recommend risk aversion measures and cost savings.\n\tPrepare and present reports that reflect audit’s results and document process.\n\tReview data about material assets, net worth, liabilities, capital stock, surplus, income, and expenditures.\n\tCommunicates audit findings by preparing a final report; discussing findings with auditees.\n\tExamine inventory to verify journal and ledger entries.\n\n\nQualifications\n\n\n\tA minimum of HND / B.Sc. Degree Accounting, Finance, Business Administration or other related Social Sciences.\n\tMinimum of 2 years of experience in a reputable organization.\n\tPreferably Good Knowledge of Accounting Software i.e SAGE.\n\tProfessional Qualification in Audit will be added advantage.\n\n\nRequirements:\n\n\n\tSelf-motivation\n\tDetermination and confidence.\n\tA keen interest in the financial system\n\tExcellent interpersonal and communication skills, including good presentation and report writing skills.\n\tAdvanced computer skills on MS Office, accounting software (SAGE) and databases.\n\tMeticulous attention to detail.\n\tExcellent problem-solving skills.\n\tAbility to work to deadlines, under pressure.\n\n\nMethod of Application\nInterested and qualified candidates should forward their CV and Cover Letter to: pharmarecruitment2online@gmail.com using the Job Position as the subject of the mail.\n\nNote: Only shortlisted candidates will be contacted.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Marketer Job at Hamik Energy Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/marketer-job-at-hamik-energy-limited",
    "pubDate": "Mon, 16 Jun 2025 11:37:47 GMT",
    "source": "JobGurus",
    "keyword": "hamik energy limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Hamik Energy Limited  was incorporated in 2010 to carry on business in the oil and gas industry in areas of oil well fishing services, well drilling and completions, coil tubing, solid control operations and equipment leasing. The company is also into oilfield and construction equipment leasing. Among the business of HAMIK ENERGY LIMITED is well testing, land logistics and other related services.\n\nWe are recruiting to fill the position below:\n\nJob Position: Marketer\n\nJob Location: Port Harcourt, Rivers\nEmployment Type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tSeasoned marketers are required for our reputable 5 Star Hotel at GRA phase III Near Casablanca, Port Harcourt, Rivers State.\n\tMale or female who knows where he wants to go and how to get there.  Who is self-aware.  \n\tWho has marketing strategies and winning strategy and tips to find the brand.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: careers@hamikng.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]