[
  {
    "title": "Job Vacancies at Salpha Energy Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancies-at-salpha-energy-limited-2",
    "pubDate": "Thu, 19 Jun 2025 11:37:52 GMT",
    "source": "JobGurus",
    "keyword": "salpha energy limited",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "Salpha Energy is a social, for-profit business that designs, distributes, solar-powered home energy products, with an underserved population in mind: the 1.3 billion global consumers for whom the old-fashioned electrical grid is either unavailable or too expensive.\n\nWe are recruiting to fill the position below:\n\n1.) 3D Product Designer - Consumer Electronics & Enclosure Design\n\nJob Location: Lagos \nEmployment Type: Contract\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tSalpha Energy is hiring a talented 3D Product Designer to support the development of consumer electronics enclosures.\n\tYou’ll design functional, manufacturable, and visually compelling plastic housings for a variety of compact, performance-focused products.\n\n\nResponsibilities\n\n\n\tCreate detailed 3D CAD models for housings and small device enclosures.\n\tDevelop technical drawings and documentation suitable for manufacturing and tooling vendors.\n\tGenerate realistic product renderings for marketing, investor decks, and internal review.\n\tSupport product integration by ensuring proper fit of internal components (PCBs, batteries, ports).\n\tIterate on designs based on performance, assembly, and material feedback.\n\tCommunicate effectively with cross-functional teams across design, manufacturing, and quality.\n\n\nRequirements\n\n\n\tCandidates should possess an HND, B.Eng, or MSc with 5 - 9 years of experience. \n\tCreative problem solver with technical rigor\n\tDetail-oriented and precise communicator.\n\tComfortable working across design, engineering, and manufacturing teams.\n\tExcited about building innovative energy products for African markets\n\n\nRequired Skills & Tools:\n\n\n\tProficiency in 3D design tools: SolidWorks, Fusion 360, AutoCAD, or similar.\n\tExperience with rendering software: KeyShot, Blender, V-Ray, or equivalent.\n\tAbility to prepare STL/STEP files, exploded views, and mold-ready component drawings.\n\tStrong understanding of plastic component design, DFM/DFA, and consumer product housings.\n\tBonus: Experience working on electronics or plastic manufacturing.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and application to: salpha@salphaenergy.com using the Job Position as the subject of the email.\n\n \n\n2.) Mechanical Engineer\n\nJob Location: Calabar, Cross River \nEmployment Type: Full-time\n\nJob Description\n\n\n\tSalpha Energy is expanding its local manufacturing operations and is hiring a skilled\n\tMechanical Engineer to establish and run our in-house plastic housing line.\n\tYou’ll be responsible for setting up, optimizing, and scaling the injection molding process that produces durable enclosures.\n\tYou’ll work at the intersection of mechanical performance and electronic integration, ensuring Salpha’s products meet the highestquality and efficiency standards.\n\n\nResponsibilities\n\n\n\tSet up and manage injection molding machines and related tooling.\n\tOptimize cycle times, material flow, and machine parameters for consistent part quality.\n\tTroubleshoot molding defects (e.g., flash, short shots, warping, burns) and implement long-term fixes.\n\tSupervise mold maintenance, cleaning, and repair scheduling.\n\tEnsure product integration with electronic components (alignment, fit, cooling, cable access, etc.).\n\tEnsure safe, efficient workflows.\n\n\nRequirements\n\n\n\tBachelor’s Degree in Mechanical Engineering, Mechatronics, Polymer Engineering, or a related field.\n\tMinimum of 7 years of experience in injection molding, with proven success in high-volume plastic component production.\n\tStrong knowledge of polymer behavior, particularly Polypropylene (PP), Polyethylene (PE), and other housing-grade resins.\n\tExperience working with consumer electronics, small appliances, or energy products is highly preferred.\n\tFamiliarity with ISO, GMP, or similar manufacturing standards is an advantage.\n\n\nTechnical Skills:\n\n\n\tProficiency in injection machine setup, process validation, and root cause analysis.\n\tStrong understanding of hot runner and cooling systems, mold design, and machine electricals.\n\tAbility to document processes, analyze production data, and implement continuous improvement initiatives.\n\n\nSoft Skills:\n\n\n\tExcellent team coordination and leadership ability.\n\tSharp analytical mindset with a hands-on, solution-first attitude.\n\tStrong communication skills for cross-functional collaboration with engineering, QA, and logistics teams.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and Application to: salpha@salphaenergy.com using the Job Position as the subject of the email.\n\n \n\n\n3.) Cashier/Inventory Officer, Kano\n\nJob Location: Kano \nEmployment Type: Full-time\n\nJob Description\n\n\n\tAs the Cashier / Inventory Officer, you will work closely with the location’s sales officers to facilitate customer purchasing, as well as handling and ensuring payments by the customer.\n\tYou are saddled with the responsibility of handling stocks and inventory in the location of your operation by ensuring proper handling, receiving and documentation of the inventory received.\n\tYou will be responsible for processing and receiving payments, issuing receipt and ensure proper documentation in the drive.\n\n\nKey Responsibilities\nSales Transactions:\n\n\n\tAssist to achieve branch budgeted sales and profit target.\n\tCollecting payments for products either in cash or credit.\n\tAccepting payments, ensuring all prices and quantities are accurate and providing receipt for every sales transaction.\n\tEnsure products presented by customers are properly handled to the satisfaction of the customer.\n\tReceive and handling of the location’s inventories/Stock.\n\tEnsure accountability and safety of the location’s inventory.\n\tEnsure stock release only on approval of the Sales Order Form.\n\tCross checking items presented for purchase by customers to see that they are in good condition.\n\tTrack sales transactions and report any discrepancies to the management.\n\tResolving customers’ complaints. Inventory Management:\n\tEnsure regular stock count at least twice in a month.\n\tHave proper knowledge of all companies’ products and prices.\n\tEscalate issues relating to inconsistencies in inventory to the financial accountant.\n\n\nCash Management:\n\n\n\tMake deposit of cash received to the bank.\n\tDaily reconciliations of cash and bank.\n\tRegular checks/phone calls to customers indebted to the company.\n\n\nRecord Keeping:\n\n\n\tBalancing the cash register and generating reports for credit and debit sales.\n\tMaintain accurate record of inventory sent to the station.\n\tDocumenting sales, payments, and credits sales on the drive.\n\tEnsuring proper documentation of stocks and inventory issued out for sales.\n\tKeep proper record of cash and expenses within the location. Station Management:\n\tMaintain clean and tidy warehouse/storeroom and other equipment.\n\tPerform any other duties that may be assigned.\n\n\nQualifications\n\n\n\tBachelor's Degree in Accounting / Business Administration / Economics or any relevant field with 3 - 5 years of experience\n\tComputer Savvy\n\tExcellent knowledge of Google Suites\n\tExcellent communication and interpersonal skills\n\tPrioritizing, time management and organizational skills\n\tRelationship management skills and openness to feedback\n\tProven experience as a cashier is an added advantage.\n\tCandidates must reside in the job location.\n\n\nKey Qualities Expected:\nAppearance and Dressing:\n\n\n\tThe Cashier/Inventory Officer will be clean and neatly attired while on duty in a manner befitting of your position.\n\tTeamwork – Ability to work within a diverse team with the aim of actualizing organizational goal above personal gains.\n\tAn eye for details.\n\tGood knowledge of Inventory Management.\n\tGood communication and interpersonal skills.\n\tAbility to work effectively under pressure to meet deadlines.\n\tResult and service orientation.\n\tAbility to multi-task effectively.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: careers@salphaenergy.com using the Job Position and Location as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]