[
  {
    "title": "Job Openings at the Label Store",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-the-label-store-1",
    "pubDate": "Fri, 20 Jun 2025 10:16:47 GMT",
    "source": "JobGurus",
    "keyword": "the label store",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "The Label Store is a dynamic retail business that caters to a diverse range of customer needs. In addition to clothing and accessories, they also offer a carefully curated selection of groceries. With an emphasis on high quality and healthy products, the Label Store's grocery section is a favorite among health conscious shoppers. From fresh produce to pantry staples, the Label Store ensures that all of their products meet strict quality standards. With a dedication to offering an unparalleled shopping experience, the Label Store has become a one-stop-shop for customers looking for fashion forward clothing, stylish accessoriesand wholesome groceries.\n\nWe are recruiting to fill the following positions below:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n1.) Sales Supervisor\n\nJob Location: Surulere, Lagos\nEmployment Type: Full-time\n\nResponsibilities\n\n\n\tAssist in the administration of floor Staff/Security\n\tStaff discipline and scheduling under the supervision of a manager.\n\tEnsure customer satisfaction and customer service\n\tManagement of staff gate.\n\tMerchandising of stocks according to principles and ethics.\n\tManagement of stock re-ordering and ensuring that shop attendants submit their stock out list on weekly basis to the procurement department and confirm the quantity to be procured based on history.\n\tEnsure all procedures are strictly adhered to.\n\tPrepare roasters latest by Friday of every week.\n\tSupervision of Shop Floor\n\tAny other duty that may be assigned from time to time.\n\n\nRequirements\n\n\n\tCandidates should possess a Bachelor's Degree with 3 - 6 years of experience.\n\n\nApplication Closing Date: 30th June, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV and Cover Letter to: thelabelstoreng@gmail.com using the Job Position as the subject of the email.\n\n \n\n \n\n2.) Accountant\n\nJob Location: Surulere, Lagos\nEmployment Type: Full-time\n\nResponsibilities\n\n\n\tProvide accounting and clerical support to the accounting department\n\tType accurately, prepare, and maintain accounting documents and records\n\tPrepare bank deposits, general ledger postings, and statements\n\tResearch, track, and resolve accounting or documentation problems and discrepancies\n\tInform management and compile reports/summaries on activity areas\n\tReconcile accounts in a timely manner\n\tDaily enter key data of financial transactions into the database\n\tProvide assistance and support to company personnel\n\tFunction in accordance with established standards, procedures, and applicable laws\n\tProvide constant updates on job knowledge.\n\n\nRequirements\n\n\n\tCandidates should possess relevant qualifications with 4 - 8 years of experience.\n\n\nApplication Closing Date: 27th June, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV and Cover Letter to: thelabelstoreng@gmail.com using the Job Position as the subject of the mail.\n\n \n\n \n\n3.) \n\nFemale Domestic Staff\n\nLocation: Surulere, Lagos\nEmployment Type: Full-time\n\nResponsibilities\n\n\n\tPerform various household tasks including cleaning, laundry, and organization to maintain a tidy living space\n\tPrepare and serve nutritious meals according to dietary preferences and restrictions\n\tCommunicate effectively with clients to understand their needs and preferences\n\tAssist with personal careto enhance the quality of life for clients\n\tManage household supplies and inventory, ensuring necessary items are stocked\n\tMaintain confidentiality and respect clients' privacy at all times.\n\n\nApplication Closing Date: 29th June, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV and Cover Letter to: thelabelstoreng@gmail.com using the Job Position as the subject of the email.\n\n \n\n \n\n4.) Cashier \n\nJob Location: Surulere, Lagos\nEmployment Type: Full-time\n\nRequirements\n\n\n\tMust have basic Math skills and customer service experience.\n\tInterested candidates must possess an OND, HND or BSc Degree in any field with 1 year of work experience.\n\n\nApplication Closing Date: 28th June, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV and Cover Letter to: thelabelstoreng@gmail.com using the Job Position as the subject of the email.\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Administrative Assistant Job at Wellsworth Energy Services Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/administrative-assistant-job-at-wellsworth-energy-services-limited",
    "pubDate": "Fri, 20 Jun 2025 10:16:47 GMT",
    "source": "JobGurus",
    "keyword": "wellsworth energy services limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Wellsworth Energy Services Limited (WESL) is a leading provider of energy services to exploration and production companies in Nigeria. By focusing on innovative technology, world-class safety practices, and personnel competence, WESL offers its clients high-quality support for their operations that translates to increased efficiency and lower operating costs.\n\nWe are recruiting to fill the position below:\n\nJob Position: Administrative Assistant\nJob Location: Lagos\nEmployment Type: Full-time\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tHandle and coordinate active calendars, schedules, and meetings.\n\tDistribute memos and reports, ensuring timely communication of relevant company updates.\n\tMonitor office supplies, inventory and liaise with vendors to maintain adequate stock levels.\n\tPrepare and follow up on internal departmental requisitions for approval.\n\tMaintain organized filing systems in line with office protocols.\n\tManage the scheduling and coordination of pool cars and supervise drivers to ensure efficient transportation services.\n\tSupervise office cleaners to ensure that the office and its premises remain clean, tidy, and well-maintained.\n\tProvide ad hoc administrative support and give assistance to other departments as needed.\n\n\nRequirements\n\n\n\tA bachelor’s degree in Business Administration, Computer Science, or any related field is preferred.\n\tStrong reporting skills and attention to detail.\n\tProficient with administrative software and office tools.\n\tSmart, proactive, and young professional eager to grow and develop.\n\tExcellent organizational and multitasking abilities.\n\tAbility to communicate clearly and work effectively with various departments.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hr@wellsworthenergy.com using \"Administrative Assistant Application\" as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Verification Inspector Job at Tenaris",
    "link": "https://www.jobgurus.com.ng/jobs/view/verification-inspector-job-at-tenaris",
    "pubDate": "Fri, 20 Jun 2025 10:16:47 GMT",
    "source": "JobGurus",
    "keyword": "tenaris",
    "duplicate": false,
    "classifications": [],
    "content": "Tenaris is the leading global manufacturer and supplier of tubular products and services used in the drilling, completion and production of oil and gas and a leading supplier of tubular products and services used in process and power plants and in specialised industrial and automotive applications.\n\nWe are recruiting to fill the position below:\n\nJob Position: Verification Inspector\n\nJob Location: Onne, Rivers\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tPerforms basics process and product control under supervision, verifying procedures compliance and inspecting final products, in a safe and efficient manner according to applicable procedures, complying with defined quality standards\n\n\nResponsibilities\n\n\n\tCommit with health, safety and environmental policies and notify situations that present potential risk\n\tEnsure product quality complying with defined standards and reporting deviations\n\tCarry out duties in an effective manner meeting productivity and efficiency standards in accordance with minimum costs\n\tAttend and collaborate in training activities in order to maintain and increase the company knowledge\n\tProactively suggest improvements and participate in continuous improvement activities\n\tPerform activities according to applicable procedures\n\tComplete and update all applicable records ensuring information accuracy\n\tEnsure proper use of the company assets, detecting and reporting malfunctioning\n\tMaintain a clean and ordered workplace\n\tAbide by Tenaris discipline norms\n\tPerform activities understanding their consequences on the global process\n\n\nMain activities:\n\n\n\tEnsures instruments are in good condition checking their expiration date and correct functioning\n\tPerforms dimensional and visual inspection of product in process\n\tPerforms dimensional and visual inspection of finished product\n\tVerifies procedures compliance throughout the process\n\tPerforms quality reports of pipes notifying the defects found\n\tUpdates information in the tracking systems and records the obtained results.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Social Media Manager Job at Zowdin Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/social-media-manager-job-at-zowdin-limited",
    "pubDate": "Fri, 20 Jun 2025 10:16:47 GMT",
    "source": "JobGurus",
    "keyword": "zowdin limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Zowdin Limited is a company committed to excellence in design, construction and real estate development.\n\nWe are recruiting to fill the position below:\n\nJob Position: Social Media Manager \n\nJob Location: Abuja (FCT)\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe are currently seeking a highly skilled and innovative Social media Manager to join our team, who will be responsible for developing and implementing a comprehensive social media strategy that drives brand awareness, engagement, and sales.\n\n\nJob Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDevelop high-quality, original content (text, images, videos, graphics) tailored to each social media platform.\n\tWrite engaging captions, blog posts, and other promotional materials that align with the brand's voice.\n\tCreate and edit videos, pictures or animations for campaigns and promotions.\n\tCollaborate with customer service teams to address concerns raised online.\n\tDevelop and execute social media and content strategies to increase followers and engagement.\n\tIdentify trends, hashtags, and viral content opportunities relevant to the brand.\n\tManage day-to-day operations of social media platforms including but not limited to Facebook, Instagram, Youtube, Tiktok, Twitter, LinkedIn, etc.\n\tSchedule, post, and monitor content to ensure consistent engagement.\n\tRespond promptly to comments, messages, and inquiries across platforms.\n\tPlan and manage social media campaigns and initiatives.\n\tMonitor social media metrics (engagement, reach, impressions, conversions) to evaluate content performance.\n\tGenerate periodic performance reports and provide actionable insights.\n\tUse data to optimize strategies and campaigns.\n\tEnsure consistency in tone, voice, and visuals across all platforms.\n\tAlign content to achieve overarching marketing and branding goals.\n\tWork closely with the marketing team and other departments to support business goals.\n\tCoordinate with graphic designers, photographers, and videographers as needed.\n\n\nRequirements\n\n\n\tA Degree in Marketing or a similar field is an added advantage\n\tAt least 3 years of experience in social media marketing\n\tA portfolio showing the projects undertaken so far would be preferred\n\tProven track record of success in developing and implementing social media strategies that drive engagement and sales.\n\tExcellent content creation and curation skills, with the ability to create high-quality, engaging content that showcases our companies products and services.\n\tStrong analytical and problem-solving skills, with the ability to analyze engagement metrics and adjust the social media strategy accordingly.\n\tVideo Editing and Photoshop Skills\n\tExcellent communication and interpersonal skills, with the ability to collaborate with our marketing and sales teams.\n\tStrong knowledge of social media platforms and their respective audiences.\n\tAbility to work in a fast-paced environment and adapt to changing situations.\n\n\nSalary\nN100,000 - N150,000 monthly. \n\nMethod of Application\nInterested and qualified candidates are invited to submit their CV, portfolio and a cover letter explaining their relevant experience and why they are the best fit for this position to: zowdin.ltd@gmail.com using “Social Media Manager Application”  as the subject of the email.\n\nNote: The Ideal candidate must reside in Abuja.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]