[
  {
    "title": "Junior Accountant Job at Star Lanternz Integrated Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/junior-accountant-job-at-star-lanternz-integrated-limited",
    "pubDate": "Mon, 23 Jun 2025 13:31:51 GMT",
    "source": "JobGurus",
    "keyword": "star lanternz integrated limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Star Lanternz Integrated Limited is a financial services firm that offers personal loans, business loans, gadget finance loans, salary advances, and lite loans to individuals and business owners. We are committed to investing in and contributing to the communities we serve by fostering an inclusive environment that promotes financial security and successful careers. To do this, we partner with our clients to understand their problems, discover solutions, and provide exceptional customer service.\n\nWe are recruiting to fill the position below:\n\nJob Position: Junior Accountant\n\nJob Location: Yaba, Lagos\nEmployment Type: Full-time\n\nSummary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a team-orientated candidate to fill the position of an accountant at Star Lanternz Integrated Limited, Yaba, Lagos State.\n\tThe accountant will be responsible for preparing the monthly management report, handling tax matters, preparing the budget, and reconciling the bank and receivables accounts.\n\n\nRequirements\n\n\n\tHND / B.Sc Degree Accounting, Finance or other related discipline\n\t1 - 2 years of relevant experience in roles such as financial reporting, tax and other accounting-related positions\n\tStrong analytical skills – ability to analyze financial data, identify trends, and support informed decision-making\n\tProficiency in budgeting and timely financial reporting\n\tExcellent written and verbal communication skills\n\tSolid technical proficiency in accounting software, spreadsheets, and related financial tools.\n\n\nSalary\nN85,000 monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hr@starlanternz.com using \"Accountant\" as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Human Resource Officer Job at ABC Cargo Express",
    "link": "https://www.jobgurus.com.ng/jobs/view/human-resource-officer-job-at-abc-cargo-express",
    "pubDate": "Mon, 23 Jun 2025 13:31:51 GMT",
    "source": "JobGurus",
    "keyword": "abc cargo express",
    "duplicate": false,
    "classifications": [],
    "content": "ABC Cargo Express, is a member of the ABC Transport Plc. Group, Nigeria’s leading road transport and logistics company covering cities in Nigeria and West Africa sub-region. For over 26 year, ABC Cargo Express has developed cutting edge, fast, efficient and cost saving parcel delivery services for all categories of businesses and individuals.\n\nWe are recruiting to fill the position below:\n\nJob Position: Human Resource Officer\n\nJob Location: Yaba, Lagos\nEmployment Type: Full-time\n\nScope of Work\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are foremost Logistic Company in Nigeria. In order to maintain leadership position within the top 3 we require the services of HR Officer to join our HR team.\n\n\nAcademic Qualification\n\n\n\tThe ideal candidate must have a minimum of BSc or HND in Human Resource Management or related field\n\tMembership of CIPM or related certification will be an added advantage.\n\n\nOur Preferred Candidate Should Have:\n\n\n\tA strong HR background with at least 3 years of Generalist experience.\n\tMust have hands-on experience in performance management\n\tA working knowledge of performance management.\n\tWorking knowledge on Training and Development.\n\tFlare to drive productivity with little or no supervision.\n\tSound knowledge of HRIS\n\tAdvance knowledge of excel and other MS office suite.\n\tThe ability to work under pressure and extended hours.\n\tHigh organization skill.\n\n\nSalary\nN150,000 - N240,000 / Month.\n\nApplication Method\nInterested and qualified candidates should send their CV to: abcrecruitment1993@gmail.com using \"Human Resource Officer\" as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Senior Azure DevOps Engineer Job at IQVIA",
    "link": "https://www.jobgurus.com.ng/jobs/view/senior-azure-devops-engineer-job-at-iqvia",
    "pubDate": "Mon, 23 Jun 2025 13:31:51 GMT",
    "source": "JobGurus",
    "keyword": "iqvia",
    "duplicate": false,
    "classifications": [
      "Software Engineering"
    ],
    "content": "IQVIA is the leading human data science company focused on helping healthcare clients find unparalleled insights and better solutions for patients. Formed through the merger of IMS Health and Quintiles, IQVIA offers a broad range of solutions that harness the power of healthcare data, domain expertise, transformative technology, and advanced analytics to drive healthcare forward.\n\nWe are recruiting to fill the position below:\n\nJob Position: Senior Azure DevOps Engineer\n\nJob ID: R1488097\nJob Location: Lagos\nJob type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAn Azure DevOps Engineer is responsible for managing and automating the infrastructure and deployment processes on Microsoft Azure.\n\tThis role involves working closely with development, operations, and security teams to ensure efficient and secure deployment of applications and services.\n\n\nKey Responsibilities\n\n\n\tDesign, implement, and manage CI/CD pipeline automation around GitLab. Maintain and update GitLab runner infrastructure.\n\tAutomate infrastructure provisioning and configuration management using tools like Terraform and Packer.\n\tImplement and manage containerization technologies such as Docker and Kubernetes.\n\tTroubleshoot and resolve issues related to infrastructure, deployment, and performance.\n\tMonitor and optimize the performance, scalability, and security of Azure environments.\n\tCollaborate with development and ops teams to ensure streamlined building and deployment of applications.\n\tEnsure compliance with security best practices and policies.\n\tMaintain documentation for infrastructure and deployment automation.\n\n\nPreferred Qualifications\n\n\n\tAzure certifications (e.g., Azure Administrator, Azure DevOps Engineer).\n\tExperience with monitoring and logging tools (e.g., Prometheus, Grafana, ELK stack).\n\tKnowledge of agile development methodologies.\n\tPrevious experience working in a regulated environment (Healthcare, Life Sciences) preferred\n\n\nRequired Skills and Qualifications:\n\n\n\tStrong experience with Azure services (VMs, AKS, Blob Storage, AppService plans, private endpoints, AGIC, APIM, Databricks, Service Bus).\n\tExperience developing code in Python.\n\tExperience with CI/CD tools, GitLab specifically.\n\tKnowledge of infrastructure as code (IaC) tools (Terraform).\n\tFamiliarity with containerization and orchestration tools (Docker, Kubernetes, Helm).\n\tUnderstanding of release engineering best practices and patterns. Particularly trunk-based development.\n\tExperience with repository design best practices for enabling automation.\n\tUnderstanding of networking concepts and security best practices.\n\tExcellent problem-solving and troubleshooting skills.\n\tAbility to communicate in English (both spoken and written) required.\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Administrative Officer Job at United Nigeria Airlines",
    "link": "https://www.jobgurus.com.ng/jobs/view/administrative-officer-job-at-united-nigeria-airlines",
    "pubDate": "Mon, 23 Jun 2025 13:31:51 GMT",
    "source": "JobGurus",
    "keyword": "united nigeria airlines",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "United Nigeria Airlines is a wholly owned Nigerian company incorporated under the Companies and Allied Matters Act of 1990 at the Corporate Affairs Commission to offer commercial air transportation services under the trade name United Nigeria.\n\nWe are recruiting to fill the position below:\n\nJob Position: Administrative Officer\n\nJob Location: Lagos\nEmployment Type: Full time\nReports to: DA & HR.\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tA highly organized, detail-oriented, and proactive Administrative Officer to provide comprehensive support to our team.\n\tThe successful candidate will manage office operations, maintain accurate records, handle petty cash, monitor company resources, ensure a smooth working environment, and support HR functions.\n\n\nDuties/Responsiblities\nProcurement and Inventory Management:\n\n\n\tPurchase and maintain adequate stock levels of stationery, office supplies, and other materials.\n\tMonitor and record usage to ensure optimal levels.\n\tMaintain and manage petty cash funds according to company policies.\n\tKeep accurate, up-to-date records of petty cash transactions.\n\tMaintain vendor relationships and negotiate prices when necessary.\n\tEnsure timely delivery of ordered items. Petty Cash Management\n\tRetire petty cash timely to avoid office cash shortages.\n\tEnsure petty cash is reconciled monthly.\n\n\nFuel and Diesel Management:\n\n\n\tMonitor and record diesel and fuel consumption for company equipment.\n\tEnsure efficient usage and report discrepancies or suspicious activity.\n\tMaintain fuel consumption records\n\n\nAsset Management:\n\n\n\tConduct regular inventory of company property, including furniture, equipment, and supplies.\n\tMonitor and prevent theft, misuse, or damage.\n\tMaintain accurate records of company assets.\n\n\nIssue Escalation:\n\n\n\tIdentify operational issues affecting the office.\n\tEscalate issues to management promptly.\n\tFollow up on resolutions and provide feedback.\n\n\nUtility Management:\n\n\n\tProcess EEDC electric recharge and ESWAMA payments timely.\n\tMaintain accurate payment records.\n\tEnsure uninterrupted utility services.\n\n\nOffice Maintenance:\n\n\n\tEnsure the office environment is clean, organized, and conducive.\n\tCoordinate maintenance, repairs, and renovations.\n\tReport maintenance issues to management.\n\n\nSecurity Oversight:\n\n\n\tVerify security personnel attendance daily.\n\tReport security concerns or breaches.\n\n\nFacilities Management:\n\n\n\tIdentify damaged or malfunctioning equipment (lights, ACs, chairs, tables, water dispensers).\n\tSend repair requests to management or vendors.\n\tCoordinate new purchases or replacements.\n\n\nHR Support:\n\n\n\tAssist in sourcing CVs for recruitment.\n\tFile employee documents accurately and maintain confidentiality.\n\tCarry out any other assignments given by your Line manager\n\n\nExperience & Qualification\n\n\n\tHND or B. Sc. in any Social Science course or Art\n\tMinimum 2 years of experience in administrative support.\n\tStrong organizational, communication, and problem-solving skills.\n\tKnowledge of clerical and administrative procedures and systems, such as filing and record-keeping\n\tAbility to work independently.\n\tProficient in Microsoft Office Suite (Word, Excel, PowerPoint, Outlook).\n\tProactive and solution-oriented.\n\tExcellent time management.\n\tAttention to detail.\n\tStrong interpersonal skills.\n\tAbility to multitask\n\n\nMethod of Application\nInterested and qualified candidates should send their CV detailing their relevant experience and qualifications to: careers@flyunitednigeria.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Openings at Yemsays Properties and Investment Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-yemsays-properties-and-investment-limited",
    "pubDate": "Mon, 23 Jun 2025 13:31:51 GMT",
    "source": "JobGurus",
    "keyword": "yemsays properties and investment limited",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance"
    ],
    "content": "Yemsays Properties and Investment Limited is a leading real estate firm based in Lagos, Nigeria, specializing in property development, investment, and marketing. We are committed to providing top-notch services that connect clients with the best real estate opportunities, ensuring transparency, innovation, and excellence in all our dealings.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nAt Yemsays, we pride ourselves on our dynamic team, which works tirelessly to deliver exceptional results. We foster a collaborative and professional work environment where every team member’s input is valued and growth is encouraged. Our services include property sales, real estate investment consultancy, and development projects tailored to meet diverse client needs. As we continue to expand, we are dedicated to empowering our workforce and building a team that shares our vision of transforming lives through real estate.\n\nWe are recruiting to fill the following positions below:\n\n1.) Graphic Designer\n\nJob Location: Ajah, Lagos\nEmployment Type: Full-time\n\nJob Description\n\n\n\tAre you a creative designer who knows how to make visual content pop on social media and in property marketing?\n\tWe’re looking for a Graphic Designer who can bring bold, clean, and engaging real estate visuals to life.\n\tThis role is ideal for someone who knows how to design for conversion, not just aesthetics. If you’re based around Ajah and ready to join a growing brand, read on.\n\n\nWhat You’ll Do\n\n\n\tDesign high-quality graphics for social media, flyers, banners, ads, presentations, and marketing campaigns\n\tCollaborate with the marketing and sales team to create on-brand, scroll-stopping content\n\tAdapt designs for multiple platforms (Instagram, WhatsApp, LinkedIn, Email, etc.)\n\tDesign visual templates for client communication, events, and real estate offers\n\tMeet design deadlines and stay on top of design trends\n\n\nRequirements\n\n\n\tStrong proficiency in Canva, Adobe Photoshop, Illustrator, or similar tools\n\tReal estate marketing experience is a strong advantage\n\tAbility to create clean, premium designs that speak to a modern real estate audience\n\tUnderstands content for social media growth, engagement, and lead conversion\n\tMust be creative, detail-oriented, and able to deliver under pressure\n\tMust live around Ajah, Lekki, or Sangotedo\n\tFull-time, on-site role only (not freelance/remote).\n\n\nSalary\nN120,000 - N150,000 / month.\n\nWhat We Offer:\n\n\n\tConsistent design work with creative freedom\n\tFun and energetic team environment\n\tAccess to brand assets and templates\n\tOpportunity to grow your design career in a content-first real estate brand.\n\n\nApplication Closing Date: 10th July, 2025.\n\nMethod of Application\nInterested and qualified candidates should send a copy of their CV + portfolio (PDF or link) to: emmanueltami7@gmail.com using \"Graphic Designer Application – [Your Name]\" as the subject of the mail.\n\n \n\n \n\n2.) Videographer\n\nJob Location: Ajah, Lagos\nEmployment Type: Full-time\n\nSummary\n\n\n\tAre you a creative and highly skilled videographer with an eye for capturing real estate in its best light? Can you shoot, edit, and fly a drone - and you're based around Ajah? This is for you.\n\tWe're looking for a full-time Videographer to join our content-driven real estate marketing team.\n\tThis role goes beyond basic filming - we're after someone who understands how to make properties sell through compelling visuals.\n\n\nKey Responsibilties\n\n\n\tCapture high-quality videos and photos of properties (interiors, exteriors, lifestyle shots)\n\tFly drones to capture aerial views of estates and site locations\n\tEdit and deliver sharp, engaging, and branded video content for social media, ads, and listings\n\tCollaborate with the digital and marketing teams on storytelling direction\n\tTravel to different property locations (within and outside Lagos)\n\tMaintain and manage video equipment.\n\n\nRequirements\n\n\n\tInterested candidates should possess Bachelor's Degree\n\t2 - 3 years of proven experience as a Videographer (real estate industry is a BIG plus)\n\tStrong editing skills using tools like Adobe Premiere Pro, Final Cut Pro, or CapCut\n\tMust be able to fly a drone confidently and responsibly\n\tExcellent eye for composition, lighting, and movement\n\tHighly creative and flexible - able to work under deadlines and adapt to changing shoot schedules\n\tMust reside around Ajah, Sangotedo, or Lekki axis\n\tOpen to full-time work (not freelance-based).\n\n\nWhat You Get\n\n\n\tSalary: N120,000 - N170,000 monthly.\n\tStable full-time role with room to grow\n\tOpportunities to work on premium properties and exciting projects\n\tSupportive team and access to digital tools\n\tA chance to build your portfolio while building the brand.\n\n\nApplication Closing Date: 10th July, 2025.\n\nMethod of Application \nInterested and qualified candidates should send their CV, portfolio links, and a short note explaining why they’re a great fit to: emmanueltami7@gmail.com using the Job Title as the subject of the email (E:g \"Videographer Application - Your Name\").\n\n \n\n \n\n3.) General Manager\n\nJob Location: Ajah, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tAs our General Manager, you will drive the company’s sales growth, team performance, and operational execution, reporting directly to the CEO. This role requires a highly strategic thinker with strong leadership skills, industry experience, and the ability to drive results across all departments.\n\n\nKey Responsibilties\n\n\n\tOversee daily operations across departments (sales, marketing, admin, client relations)\n\tSet and monitor performance KPIs for the entire team\n\tProvide weekly reports and insights to executive leadership\n\tSupervise real estate consultants, interns, and marketing officers\n\tLead and coordinate strategic property marketing campaigns\n\tManage and grow client and partner relationships\n\tRepresent the company at events, client meetings, and site inspections\n\tEnsure smooth project execution and timely delivery\n\n\nRequirements\n\n\n\tBachelor's Degree in Business Admin, Marketing, Estate Management, or similar (MBA is a plus)\n\tProven experience as a General Manager or senior leadership role in real estate marketing\n\tStrong leadership, sales, and administrative management skills\n\tExcellent communication, negotiation, and people management skills\n\tTech-savvy and comfortable with CRM tools, digital reporting, and collaboration software\n\tResides around Ajah, Sangotedo, Abraham Adesanya, or Lekki Axis.\n\n\nWhat We Offer\n\n\n\tCompetitive salary + performance bonuses\n\tSupportive leadership and growth opportunities\n\tDynamic work culture with a strong digital focus\n\tThe chance to lead and make real impact in a fast-growing real estate firm\n\n\nApplication Closing Date: 23rd June, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV and a short cover letter explaining your fit for the role to: yemsaysproperties@gmail.com using the Job Position as the subject of the email (E:g \"General Manager Application – [Your Name]\").    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]