[
  {
    "title": "Admin / Human Resource Officer Job at Fiphs Infrastructure Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/admin-human-resource-officer-job-at-fiphs-infrastructure-limited",
    "pubDate": "Fri, 04 Jul 2025 22:15:13 GMT",
    "source": "JobGurus",
    "keyword": "fiphs infrastructure limited",
    "duplicate": false,
    "classifications": [],
    "content": "Fiphs Infrastructure Limited is an Engineering, Procurement and Construction Company with extensive local knowledge, engineering and construction expertise. We deliver innovative and creative solutions that provide our stakeholders with the highest possible level of expertise, exceeding their expectation using cutting edge technology to provide services covering planning, design, engineering, construction, operation and maintenance.\n\nWe are recruiting to fill the position below:\n\nJob Position: Admin / Human Resource Officer\n\nJob Location: Abuja (FCT) \nEmployment Type: Full-time\n\nJob Role / Objectives\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tConstruction Company seeks to recruit an Admin/Human Resource officer, who will be responsible for the general administrative activities of the organization as well as providing HR support.\n\n\nPosition Overview / Responsibilities\n\n\n\tOperate and manage multi-line telephone and route incoming calls.\n\tDraft internal memorandum, letters and other documents as required\n\tMaintain records: organize and store paperwork, documents and computer-based information.\n\tOversee the ordering of stationery and maintain office supplies and replenish inventory.\n\tOrganize and attend meetings, take minutes and keep notes.\n\tEnsure filing systems are maintained and up to date and also ensure protection of files and records.\n\tAssist in recruitment process\n\tAssist in preparation of Admin & HR budget.\n\tAssist in administering HMO for staff\n\tAssist in implementation and administration of company’s HR policy /standard.\n\tAssist in the management of the office facility to ensure good working condition for staff.\n\n\nQualifications and Requirements\n\n\n\tBachelor’s Degree in Law, or equivalent in Human Resources Management, Administration\n\tMinimum of 3 years of post NYSC in-depth experience of Human resource practices & Labor laws\n\tA professional approach which generates credibility and confidence in others.\n\tA professional approach which generates credibility and confidence in others.\n\tAbility to cope with pressure and work to tight deadlines.\n\tGreat team player.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV, attached with a Cover Letter, passport photograph, Degree Certificate, NYSC Certificate and any other professional/relevant certificates in one (1) email to: recruitment@fiphs.com using the Job Position as the subject of the email.\n\nNote: Candidates who do not comply with the above directives will be disqualified.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Senior Legal Counsel & Compliance Officer Job at HR Hive",
    "link": "https://www.jobgurus.com.ng/jobs/view/senior-legal-counsel-compliance-officer-job-at-hr-hive",
    "pubDate": "Fri, 04 Jul 2025 22:15:13 GMT",
    "source": "JobGurus",
    "keyword": "hr hive",
    "duplicate": false,
    "classifications": [],
    "content": "TheHRHive, a Recruitment Company, is recruiting suitably qualified candidates to fill the position below:\n\nJob Position: Senior Legal Counsel & Compliance Officer\n\nJob Location: Lagos\nDepartment: Risk & Compliance\n\nOverview\n\n\n\tWe are seeking a seasoned legal professional to join our leadership team in driving strategic legal initiatives and ensuring operational excellence across our financial services platform.\n\tThis role offers the opportunity to shape legal frameworks and risk management practices in a dynamic environment.\n\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tProvide strategic legal guidance across multiple business verticals including regulatory affairs, commercial partnerships, and operational compliance\n\tLead engagement with regulatory authorities and manage external legal partnerships\n\tDevelop and implement comprehensive legal risk frameworks\n\tStructure commercial agreements and ensure alignment with regulatory requirements\n\tSupport business growth initiatives through proactive legal counsel.\n\n\nRequirements\n\n\n\t8+ years of progressive legal experience with exposure to premier legal institutions\n\tDemonstrated expertise in financial services regulation and compliance\n\tStrong commercial acumen with experience advising business stakeholders\n\tExcellent communication skills and ability to translate complex legal concepts.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: thehrhive@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Growth and Marketing Strategist (Team Lead) Job at HR Hive",
    "link": "https://www.jobgurus.com.ng/jobs/view/growth-and-marketing-strategist-team-lead-job-at-hr-hive",
    "pubDate": "Fri, 04 Jul 2025 22:15:13 GMT",
    "source": "JobGurus",
    "keyword": "hr hive",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "TheHRHive - Our client, a Microfinance Bank, is recruiting suitable candidates to fill the position below:\n\nJob Position: Growth and Marketing Strategist (Team Lead)\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Growth and Marketing Strategist will lead the Growth and Marketing department, driving customer acquisition, engagement, and retention strategies across all channels.\n\tThe ideal candidate will be data-driven, creatively inclined, and results-oriented, with a strong understanding of digital and traditional marketing in the financial services sector.\n\tThis role requires strategic oversight, team leadership, and hands-on execution of high-impact growth initiatives to expand the bank’s customer base and market share.\n\n\nKey Responsibilities\n\n\n\tDevelop and own the bank’s comprehensive growth and marketing strategy, aligned with overall business goals.\n\tLead the development of integrated marketing campaigns to support product launches, partnerships, and brand visibility.\n\tIdentify market opportunities and customer segments, designing targeted campaigns to capture value.\n\tDesign and implement scalable growth strategies across online and offline channels (SEO, paid ads, referrals, activations, partnerships).\n\tOversee user funnel optimization from awareness to conversion and retention.\n\tLead customer acquisition through B2C and B2B strategies, ensuring cost-effective customer growth.\n\tPosition and strengthen the Aella brand across all customer touchpoints.\n\tCraft compelling messaging and oversee content strategy for digital and offline campaigns.\n\tManage PR, media buying, and agency relationships to ensure consistent and high-quality external communication.\n\tLead and mentor a multidisciplinary marketing team.\n\tSet clear KPIs and performance goals for the department.\n\tCollaborate cross-functionally with Product, Data, and Customer Success to drive aligned growth initiatives.\n\tAnalyze campaign performance and customer data to refine marketing strategy.\n\tDevelop dashboards and reporting tools to track conversion rates, and other growth metrics.\n\tA/B test key campaigns and customer journeys to improve results continuously.\n\n\nQualifications & Experience\n\n\n\tBachelor’s degree in Marketing, Business, Communications, or a related field. MBA is a plus.\n\t5 – 7 years of progressive experience in growth, digital marketing, or brand strategy, preferably in financial services, fintech, or tech.\n\tProven success in scaling marketing initiatives and achieving growth targets.\n\tExperience leading a team and managing agency/vendor relationships.\n\tStrong understanding of marketing tech tools (e.g., Google Ads, Meta Ads, CRM systems, analytics platforms).\n\n\nKey Skills & Competencies:\n\n\n\tStrategic and analytical mindset with strong business acumen.\n\tExcellent communication, storytelling, and brand positioning skills.\n\tData-driven decision-making and performance marketing expertise.\n\tStrong leadership and team development capabilities.\n\tAbility to thrive in a fast-paced, target-driven environment.\n\n\nSalary\nN500,000 - N700,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their Resume to: thehrhive@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Senior Finance & Capital Strategy Advisor Job at HR Hive",
    "link": "https://www.jobgurus.com.ng/jobs/view/senior-finance-capital-strategy-advisor-job-at-hr-hive-1",
    "pubDate": "Fri, 04 Jul 2025 22:15:13 GMT",
    "source": "JobGurus",
    "keyword": "hr hive",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "TheHRHive, a Recruitment Company, is recruiting suitably qualified candidates to fill the position below:\n\nJob Position: Senior Finance & Capital Strategy Advisor\n\nJob Location: Lagos \n\nOverview\n\n\n\tWe are seeking a finance professional to lead strategic capital initiatives and institutional relationship management.\n\tThis role focuses on optimizing our capital structure and building sustainable funding partnerships for continued growth.\n\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDevelop and execute comprehensive capital strategy including debt and equity initiatives \n\tStructure complex financial transactions and coordinate with internal and external stakeholders\n\tBuild and maintain strategic relationships with institutional partners and investors\n\tSupport long-term financial planning and regulatory capital management\n\tLead cross-functional projects related to balance sheet optimization.\n\n\nRequirements\n\n\n\t8 - 12 years of experience in investment banking, corporate finance, or related fields\n\tStrong understanding of capital markets and structured finance products\n\tProven ability to manage complex transactions and stakeholder relationships\n\tExperience in emerging markets and financial services preferred.\n\n\nSalary Range\nN500,000 - N700,000 net per month.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: thehrhive@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]