[
  {
    "title": "Front Desk Officer Job at Resource Intermediaries Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/front-desk-officer-job-at-resource-intermediaries-limited-2",
    "pubDate": "Fri, 13 Jun 2025 13:48:26 GMT",
    "source": "JobGurus",
    "keyword": "resource intermediaries limited",
    "duplicate": false,
    "classifications": [],
    "content": "Resource Intermediaries Limited (RIL) is a professional Managementfirm into all core Human Resource Services such as training, recruiting, manpower outsourcing, payroll management, business process outsourcing and general HR consulting services with over 18 years of industrial experience. We pride ourselves in easing business burdens.\n\nWe are recruiting to fill the position below:\n\nJob Position: Front Desk Officer\n\nJob Location: Iyaganku GRA - Ibadan, Oyo\nEmployment Type: Full-time\n\nJob Brief\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are looking for a pleasant Front Desk Representative to undertake all receptionist and clerical duties at the desk of our main entrance. You will be the “face” of the company for all visitors and will be responsible for the first impression we make.\n\tThe ideal candidate will have a friendly and easy going personality while also being very perceptive and disciplined. You should be able to deal with complaints and give accurate information. A customer-oriented approach is essential.\n\tThe goal is to make guests and visitors feel comfortable and valued while on our premises.\n\n\nResponsibilities\n\n\n\tKeep front desk tidy and presentable with all necessary material (pens, forms, paper etc.)\n\tGreet and Welcome guest\n\tAnswer questions and address complaints\n\tAnswer all incoming calls and redirect them or keep messages\n\tReceiveletters, packages etc. and distribute them\n\tPrepare outgoing mail by drafting correspondence, securing parcels etc.\n\tCheck, sort and forward emails\n\tMonitor office supplies and place orders when necessary\n\tKeep updated records and files\n\tMonitor office expenses and costs\n\tTake up other duties as assigned (travel arrangements, schedules etc.)\n\n\nRequirements and Skills\n\n\n\tHigh School diploma; additional qualifications will be a plus.\n\tProven experience as front desk representative, agent or relevant position\n\tFamiliarity with office machines (e.g. fax, printer etc.)\n\tKnowledge of office management and basic bookkeeping\n\tProficient in English (oral and written)\n\tExcellent knowledge of MS Office (especially Excel and Word)\n\tStrong communication and people skills\n\tGood organizational and multi-tasking abilities\n\tProblem-solving skills\n\tCustomer service orientation.\n\n\nSalary\nN70,000 / Month.\n\nMethod of Application\nInterested and qualified candidates should send their CV and cover letter to: vadisa@resourceintermediaries.org using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Telesales Agent Job at Oisedotcom Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/telesales-agent-job-at-oisedotcom-limited",
    "pubDate": "Fri, 13 Jun 2025 13:48:26 GMT",
    "source": "JobGurus",
    "keyword": "oisedotcom limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Oisedotcom Limited - We are an e-com business that deals in sales of products ranging across a diverse verities of categories including household equipment, home appliances, vehicle gadgets, phone gadgets, security etc.\n\nWe are recruiting to fill the position below:\n\nJob Position: Telesales Agent\n\nJob Location: Gbagada, Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking smart and experienced tele sales executives.\n\tThe tele sales executives who specializes in following up on already generated leads to close-up sales via phone calls.\n\tThey call leads provided by the marketing team to ensure they go through with their orders daily.\n\tThe role involves holding a conversation with both potential and returning customers informing them about their orders with us and convincing them to go through with their orders.\n\tThey provide both sales and customer care services handling customer queries in a professional manner.\n\n\nKey Responsibilties\n\n\n\tCalling potential customers from list of leads already generated by our marketing team.\n\tMake sure leads that are not serious with their orders to go through with it.\n\tInform the leads about their delivery and answer any questions related to the products which they may have.\n\tAttend to and resolve customers' queries as they arise.\n\tManagement of customers to the best to ensure repeated patronage and a happy customer experience.\n\n\nEducation, Qualifications and Experience\n\n\n\tBachelor Degree in Marketing and other related discipline.\n\tAt least 2 years of experience as in sales.\n\tMust be done with NYSC.\n\n\nSalary\nN130,000 - N140,000 monthly. \n\nMethod of Application\nInterested and qualified candidates should send their CV to: bennyboomhr@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Social Media Manager Job at Professional Perfect Solutions",
    "link": "https://www.jobgurus.com.ng/jobs/view/social-media-manager-job-at-professional-perfect-solutions-1",
    "pubDate": "Fri, 13 Jun 2025 13:48:26 GMT",
    "source": "JobGurus",
    "keyword": "professional perfect solutions",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Professional Perfect Solutions is an information technology company poised at building and managing voice solutions aimed at enabling your customers to reach you anywhere. Seasoned software engineers centered at developing customer driven software and integrating already developed software.\n\nWe are recruiting to fill the position below:\n\nJob Position: Social Media Manager\n\nJob Location: Ajao Estate, Lagos\nEmployment Type: Part-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are looking for a Digital Marketing Officer to develop and implement digital marketing strategies and campaigns.\n\tThe ideal candidate will have strong digital marketing skills, creativity, and the ability to drive engagement and conversions through various online channels.\n\tThis role requires expertise in digital marketing tools, analytics, and content creation.\n\n\nResponsibilities\n\n\n\tDevelop and execute digital marketing strategies and campaigns to drive brand awareness, traffic, and engagement across digital channels, including websites, social media, email, and search engines.\n\tCreate and curate content for digital marketing initiatives, including blog posts, social media posts, emails, videos, and graphics.\n\tManage and optimize digital advertising campaigns, including pay-per-click (PPC) ads, display ads, and social media ads, to achieve campaign objectives and ROI targets.\n\tMonitor and analyze key performance indicators (KPIs), metrics, and analytics data to measure the effectiveness of digital marketing efforts and identify opportunities for improvement.\n\tConduct market research, competitive analysis, and audience segmentation to inform digital marketing strategies and tactics.\n\tCollaborate with internal teams, including marketing, sales, and product development, to align digital marketing activities with business goals and objectives.\n\tStay updated on digital marketing trends, tools, and best practices to ensure the organization remains competitive in the digital landscape.\n\tOptimize website content, user experience, and conversion funnels to improve online visibility, traffic, and conversion rates.\n\tManage relationships with external vendors, agencies, and partners to support digital marketing initiatives and projects.\n\tMaintain accurate and organized records of digital marketing activities, budgets, and performance metrics.\n\n\nRequirements and Qualifications\n\n\n\tBachelor's Degree in Marketing, Digital Marketing, Communications, or related field.\n\tProven experience in digital marketing, with a focus on digital strategy, content creation, and campaign management.\n\tStrong understanding of digital marketing channels, platforms, and tools, including SEO, SEM, social media, email marketing, and analytics.\n\tCreative and analytical mindset, with the ability to develop innovative digital marketing solutions and measure their impact.\n\tProficiency in digital marketing software, content management systems (CMS), and analytics tools.\n\tExcellent communication and collaboration skills.\n\tAbility to multitask and prioritize tasks in a fast-paced environment.\n\tAdaptability and willingness to learn and adapt to new technologies and trends.\n\tAttention to detail and accuracy in work.\n\tIntegrity and professionalism in representing the organization's brand and values.\n\n\nSkills Required:\n\n\n\tDigital marketing strategy\n\tContent creation\n\tCampaign management\n\tAnalytics\n\tMarket research\n\tCollaboration\n\tAdaptability\n\tCommunication\n\tAttention to detail\n\tIntegrity.\n\n\nMethod of Application\nInterested and qualified candidates should submit their Resume to: info@pps.com.ng using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Sales and Distribution Agent Job at SunFi Technology Solutions Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/sales-and-distribution-agent-job-at-sunfi-technology-solutions-limited",
    "pubDate": "Fri, 13 Jun 2025 13:48:26 GMT",
    "source": "JobGurus",
    "keyword": "sunfi technology solutions limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "SunFi.co is leveraging its leadership experience as a Distributed Energy Provider (DEP) to build a Clean Energy FinTech platform that helps consumers access the most trusted solar and clean energy solutions that deliver the greatest savings. SunFi collaborates with the best equipment suppliers, installers, and financiers to provide clean energy consumers amazing solar experiences to help catalyze the transition to clean energy across Nigeria and eventually, across Africa.\n\nWe are recruiting to fill the position below:\n\nJob Position: Sales and Distribution Agent\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Location: Lagos \nEmployment Type: Full-time\nTeam: Growth (Embedded Sales & Distribution)\nReports To: Channel Manager (Embedded Sales & Distribution)\nGrade Level: Lead\n\nAbout the Role\n\n\n\tSunFi Distributor Agent will be responsible for the direct distribution and sales of solar systems to shop owners, ensuring they understand the product's features, benefits, and payment terms.\n\tThe role involves engaging with shop owners, facilitating supplier credit documentation, closing sales, and ensuring timely payment collection.\n\tAgents will also be responsible for maintaining a proper sales record, monitoring stock turnover, and ensuring compliance with SunFi’s pricing policy.\n\tThe Agent will actively engage existing solar business owners and companies in the community, educating them on SunFi’s value proposition—not as a competitor, but as a financing partner that enables their customers to access flexible payment plans when purchasing solar systems.\n\tAdditionally, the Dealer will promote SunFi’s subsidized pricing for batteries, inverters, and solar panels from OEMs, while highlighting the opportunity to earn up to a 3% rebate based on sales volume.\n\tThis role requires a proactive, business-savvy leader with strong relationship management skills, sales expertise, and the ability to drive large-scale adoption of SunFi’s solar financing solutions.\n\n\nJob Responsibilities\nSales & Distribution:\n\n\n\tReceive and safely warehouse units of the Itel 600W solar system from SunFi.\n\tPhysically visit at least six (6) shop owners daily to educate them on the product.\n\tSecure at least three (3) shop owners daily who agree to take the system on supplier credit and commit to full payment within two weeks.\n\tMonitor shop owners' sales progress and assist in promoting the product.\n\n\nSales Documentation & KYC Compliance:\n\n\n\tCollect and verify KYC documentation for shop owners receiving the system on supplier credit, including:\n\tFull Name\n\tEmail Address\n\tPhone Number\n\tHome & Shop Address\n\tNIN Slip or Any Valid National ID\n\tPicture of the Shop Owner in their Shop\n\tEnsure shop owners sign the SunFi sales agreement before product delivery.\n\tSubmit completed KYC documents to SunFi for approval.\n\n\nPayment Collection & Order Management:\n\n\n\tEnsure shop owners make full payment of units sold to SunFi’s bank account within two (2) weeks.\n\tTrack and confirm payments made by shop owners before new orders are approved.\n\tRetrieve unsold systems after three (3) weeks if the shop owner has not sold them, ensuring the product remains in good condition.\n\tRequest additional stock only after fully distributing the previous batch.\n\n\nDaily Reporting & Meetings:\n\n\n\tAttend daily team meetings from 9:00 AM – 10:00 AM (Monday – Friday) to discuss progress, challenges, and strategies.\n\tMaintain accurate records of shop owners engaged, deals closed, and payments collected.\n\tProvide weekly reports on sales performance, customer feedback, and market insights.\n\n\nAdditional Incentives:\n\n\n\tIf an Agent/Dealer sells above the recommended retail price, SunFi will refund the extra profit margin.\n\tHigh-performing Agents/Dealers may qualify for higher product allocations and exclusive dealer privileges.\n\n\nRequired Skills & Qualifications\n\n\n\tInterested candidates should possess an OND qualification with 2 - 5 years of work experience.\n\tSales Experience: Prior experience in direct sales, retail, or solar product distribution is an advantage.\n\tCommunication Skills: Strong ability to engage, educate, and persuade shop owners.\n\tNegotiation Skills: Ability to close deals and build long-term relationships with shop owners.\n\tSelf-Motivation & Accountability: Ability to work independently, meet daily targets, and maintain proper records.\n\tIntegrity & Reliability: Must be trustworthy and adhere to SunFi’s guidelines and policies.\n\tBasic Tech Skills: Ability to use a smartphone for record-keeping and communication.\n\n\nSalary\nN75,000 - N150,000 monthly.\n\nMethod of Application\nInterested and qualified candidates should send their resume and Application to: careers@sunfi.co using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Administrative Officer Job at Dangote Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/administrative-officer-job-at-dangote-group-1",
    "pubDate": "Fri, 13 Jun 2025 13:48:26 GMT",
    "source": "JobGurus",
    "keyword": "dangote group",
    "duplicate": false,
    "classifications": [],
    "content": "Dangote Group is one of Nigeria’s most diversified business conglomerates with a hard – earned reputation for excellent business practices and products’ quality with its operational headquarters in the bustling metropolis of Lagos, Nigeria in West Africa.\n\nWe are recruiting to fill the position below:\n\nJob Position: Administrative Officer\n\nJob Location: Zaria, Kaduna / Obajana, Kogi \n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Administrative Officer for CNG Station plays a crucial role in ensuring the smooth operation of compressed natural gas stations.\n\tThis position is responsible for managing administrative tasks, supporting station staff, and coordinating activities related to the efficient functioning of CNG stations.\n\n\nKey Duties and Responsibilities\n\n\n\tAssist in the management and operational support for CNG stations\n\tOversee daily administrative functions at the station\n\tMaintain accurate records for CNG sales, inventory, and fuel usage\n\tCoordinate with suppliers and service providers for necessary supplies and maintenance\n\tAddress and resolve any operational issues that arise at the stations\n\tPrepare reports on station performance, inventory levels, and operational expenses\n\tEnsure compliance with safety and environmental regulations\n\tAssist in scheduling and training staff for effective operation\n\tMaintain effective communication with upper management and other departments\n\n\nRequirements\n\n\n\tBSc/BA in Business Administration, Logistics, or a related field\n\tMinimum of 2 years of experience in an administrative role, preferably in the energy or transportation sector\n\tProficient in MS Office Suite (Excel, Word, PowerPoint) and relevant software applications\n\tKnowledge of safety and regulatory procedures in the CNG industry is preferred\n\tStrong organizational skills and ability to manage multiple tasks\n\tExcellent verbal and written communication skills\n\tStrong problem-solving abilities and attention to detail\n\n\nSkills and Behaviors:\n\n\n\tAbility to work independently and collaboratively within a team\n\tAdaptability to changing conditions and priorities\n\tStrong leadership qualities and interpersonal skills\n\tCommitment to achieving goals and continuous improvement.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]