[
  {
    "title": "Job Openings at Stivlon Consulting",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-stivlon-consulting",
    "pubDate": "Fri, 04 Jul 2025 15:15:58 GMT",
    "source": "JobGurus",
    "keyword": "stivlon consulting",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance"
    ],
    "content": "Stivlon Consulting is yourstrategic partner in building high-performance teams and unlocking individual potential. We are passionate about finding the perfect fit—the talented individuals who elevate your company and the fulfilling career paths that ignite professional growth.\n\nWe are recruiting to fill the following positions below:\n\n1.) Corporate Communications Specialist\n\nJob Location: Victoria Island, Lagos\nWork Mode: Hybrid\n\nQualifications\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tBachelor’s or master’s degree in communications, Marketing, Public Relations, or related field.\n\tMinimum of 5 years of experience in communications, preferably in a nonprofit or youth-focused program.\n\tProven experience in digital marketing, media relations, and social media management\n\tExperience promoting gender equality and inclusivity is highly desirable.\n\tProficiency with social media platforms, content management systems, and data analytics tools.\n\n\nSalary\nN700,000- N900,000  monthly.\n\nApplication Closing Date: 8th July, 2025.\n\nMethod of Application\nInterested and qualified candidates should their send their Resume to: stivlonjobs@gmail.com using the Job Position as the subject of the mail.\n\n \n\n \n\n2.) Interior Designer\n\nJob Location: Nigeria\n\nJob Summary\n\n\n\tWe are looking for a talented and detail-oriented Interior Designer to create exceptional design solutions that align with client needs and brand standards.\n\tThe ideal candidate will have strong technical knowledge, creativity, and the ability to manage projects from concept to completion.\n\n\nKey Responsibilities\n\n\n\tAdvise clients on space planning, layout, furnishing, and color coordination\n\tAnalyze client briefs and prepare Bills of Quantities (BOQs) and control books\n\tProduce working drawings and specifications using AutoCAD, Revit, and related tools\n\tConduct site measurements and oversee installation progress\n\tCoordinate with architects, engineers, contractors, and project teams\n\tPresent design proposals and secure client approvals\n\tResearch materials, design trends, and innovations\n\tEnsure all designs comply with brand standards\n\tRespond to client queries within 24 hours and ensure project satisfaction\n\tCollaborate with technical, customer service, and finance teams to align deliverables and payments\n\tPerform regular site inspections to ensure design integrity\n\tGather and document client feedback, concerns, and complaints.\n\n\nQualifications\n\n\n\tBachelor’s degree in Interior Design or Architecture\n\tMinimum of 3 years of relevant experience in a similar role\n\tA Master’s degree in Architecture is a plus\n\n\nKey Attributes:\n\n\n\tStrong problem-solving and creativity\n\tHigh attention to detail and organization\n\tAbility to work independently and in teams\n\tExcellent interpersonal and communication skills\n\tIntegrity, accountability, and adaptability under pressure\n\n\nTechnical Skills:\n\n\n\tProficiency in AutoCAD, Revit, 3D Max, and presentation tools\n\tSkilled in layout, lighting, material selection, and visual composition\n\tFamiliarity with Autodesk 3ds Max, CINEMA 4D, and video rendering tools\n\tDemonstrated experience in interior space planning and decoration\n\n\nKnowledge Areas:\n\n\n\tSales and marketing for design services\n\tCustomer service best practices\n\tEngineering and construction basics relevant to interiors\n\n\nSalary\nN200,000 - N250,000 Monthly. (Slightly negotiable)\n\nApplication Closing Date: 4th July, 2025.\n\nMethod of Application\nInterested and qualified candidates should their send their CV to: stivlonjobs@gmail.com using the Job Position as the subject of the mail.\n\n \n\n \n\n3.) Senior Sales Associate\n\nJob Location: Lagos\n\nJob Summary\n\n\n\tWe’re looking for a results-driven Senior Sales Associate with proven retail experience to lead and support a dynamic sales team.\n\tThe ideal candidate has a strong background in furniture, lifestyle, construction, or home retail, with a passion for customer satisfaction and team development.\n\tThis role supports retail leadership by ensuring sales targets are met, driving showroom and e-commerce performance, and fostering a high-performance sales culture.\n\n\nKey Responsibilities\n\n\n\tSupervise and guide the sales team, ensuring all members meet or exceed their individual and team targets\n\tLead by example by engaging clients, closing sales, and managing customer relationships\n\tTrack and report sales performance, team activity, and store trends to the Head of Retail\n\tMaintain a strong understanding of product offerings to provide expert guidance to customers and staff\n\tEnsure that all product listings are correctly uploaded, described, and updated on the e-commerce platform\n\tResolve customer issues efficiently and professionally, providing quick, practical solutions\n\tProvide ongoing support and training to sales team members, fostering a culture of high performance and service excellence\n\tAssist in merchandising and showroom layout to optimize sales opportunities\n\tUse Microsoft Office tools (Excel, Word, PowerPoint) to prepare reports, team schedules, and sales tracking\n\tWork closely with marketing and inventory teams to align promotions, stock availability, and customer engagement strategies\n\tBuild new client lists and identify retail opportunities.\n\n\nRequirements & Qualifications\n\n\n\tBachelor’s Degree in Business, Sales, Marketing, or related field\n\tMinimum of 5 years of retail sales experience, with at least 2 years in a supervisory or senior sales role\n\tExperience in a furniture or interior design company is highly desirable\n\tProven ability to sell effectively and meet targets consistently\n\tStrong people management skills, with the ability to motivate and guide a team\n\tExcellent communication, negotiation, and problem-solving abilities\n\tProficient in Microsoft Office Suite, especially Excel and PowerPoint\n\tFamiliarity with e-commerce platforms and product content management is an added advantage\n\tStrong organizational skills and attention to detail.\n\n\nApplication Closing Date: 4th July, 2025.\n\nMethod of Application\nInterested and qualified candidates should their send their CV to: stivlonjobs@gmail.com using the Job Position as the subject of the mail.\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Software-Defined Networking Engineer Job at Canonical Nigeria",
    "link": "https://www.jobgurus.com.ng/jobs/view/software-defined-networking-engineer-job-at-canonical-nigeria-1",
    "pubDate": "Fri, 04 Jul 2025 15:15:58 GMT",
    "source": "JobGurus",
    "keyword": "canonical nigeria",
    "duplicate": false,
    "classifications": [
      "Software Engineering"
    ],
    "content": "(adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\nCanonical - We deliver open source to the world faster, more securely, and more cost-effectively than any other company. We develop Ubuntu, the world’s most popular enterprise Linux from cloud to edge, together with a passionate global community of 200,000 contributors. Ubuntu means 'humanity to others. We chose it because it embodies the generosity at the heart of open source, the new normal for platforms and innovation. Together with a community of 200,000, we publish an operating system that runs from the tiny connected devices up to the world's biggest mainframes, the platform that everybody uses on the public cloud, and the workstation experience of the world's most productive developers. Secure and reliable, elegant and intuitive, and open for innovation - Ubuntu is the future of open source, which is why it's the fastest-growing Linux in the world despite already being the most widely deployed.\n\nWe are recruiting to fill the position below:\n\nJob Position: Software-Defined Networking Engineer\nJob Location: Lagos\nJob type: Full time\n\nWhat your day will look like\n\n\n\tWork with the most advanced operating systems and network application technologies available\n\tCollaborate with public clouds and network silicon providers\n\tDesign and implement the best software-defined networking experience for the latest hardware platforms and software stacks\n\tWrite high-quality, well-designed and well-documented software\n\tContribute to shape innovative product strategies \n\tDebug issues and produce high-quality code to fix them\n\tCollaborate proactively with a globally distributed organisation\n\tContribute to technical documentation to make it the best of its kind\n\tDisplay technical leadership internally, towards our partners, and in the open source communities\n\tInfluence open-source projects and communities\n\tShape software-define networking products for evolving data centre architectures to meet ever-increasing bandwidth, reliability, security, and interoperability demands\n\tWork from home, with global travel twice a year for company events of up to two weeks duration\n\n\nWhat we are looking for in you\n\n\n\tAn exceptional academic track record from both high school and university\n\tUndergraduate degree in Computer Science or STEM, or a compelling narrative about your alternative path\n\tDrive and a track record of going above-and-beyond expectations\n\tKnowledge of networking: architecture, design, and protocols\n\tDeep understanding of Linux networking, from kernel to user space\n\tFluency in at least one of Golang, C/C++, Rust or Python\n\tProfessional written and spoken English \n\tExperience with Linux (Debian or Ubuntu preferred) \n\tExcellent interpersonal skills, curiosity, flexibility, and accountability \n\tPassion, thoughtfulness, and self-motivation \n\tExcellent communication and presentation skills \n\tResult-oriented, with a personal drive to meet commitments \n\tAbility to travel twice a year, for company events up to two weeks each\n\n\nAdditional skills that you might also bring:\n\n\n\tFamiliarity with existing open source networking technologies - kernel (including eBPF, AF_XDP), OVS, OVN, SoNIC, DENT, Switchdev, DPDK, SPDK, 5G 3GPP, ONF stack, iwd, NetworkManager, etc.\n\tFamiliarity with data path hardware acceleration protocols and interfaces, such as RDMA, RoCE, iWARP, NVMe, SR-IOV\n\tComputer architecture knowledge of x86, ARM, and RISC-V\n\tExperience in complex IP network engineering and implementation\n\tExperience with virtualization technologies, e.g., QEMU, KVM, etc.\n\tPrevious contribution to open source projects and community involvement\n\tFamiliarity with Kubernetes, Cloud-native Network Functions, and Container Network Interface plugins\n\tPerformance engineering and security experience.\n\n\nWhat we offer colleagues\n\n\n\tWe consider geographical location, experience, and performance in shaping compensation worldwide.\n\tWe revisit compensation annually (and more often for graduates and associates) to ensure we recognise outstanding performance.\n\tIn addition to base pay, we offer a performance-driven annual bonus.\n\tWe provide all team members with additional benefits, which reflect our values and ideals.\n\tWe balance our programs to meet local needs and ensure fairness globally.\n\tDistributed work environment with twice-yearly team sprints in person\n\tPersonal learning and development budget of USD 2,000 per year\n\tAnnual compensation review\n\tRecognition rewards\n\tAnnual holiday leave\n\tMaternity and paternity leave\n\tEmployee Assistance Programme\n\tOpportunity to travel to new locations to meet colleagues\n\tPriority Pass, and travel upgrades for long haul company    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Finance Manager Job at Equity Specialist Hospital",
    "link": "https://www.jobgurus.com.ng/jobs/view/finance-manager-job-at-equity-specialist-hospital",
    "pubDate": "Fri, 04 Jul 2025 15:15:58 GMT",
    "source": "JobGurus",
    "keyword": "equity specialist hospital",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Equity Specialist Hospital is a modern medical facility in Lagos, Nigeria, committed to providing world-class, patient-centered care. Backed by Equity Health Group, the hospital offers advanced diagnostic and therapeutic services across key specialties, using cutting-edge medical technology. Its mission is to make high-quality healthcare accessible locally while reducing medical tourism.\n\nWe are recruiting to fill the position below:\n\nJob Position: Finance Manager\n\nJob Location: Lekki, Lagos\nEmployment Type: Full-time\nIndustry: Healthcare\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAre you a seasoned finance professional with strong leadership capabilities and a passion for making a difference in healthcare?\n\tEquity Specialist Hospitals is seeking a highly motivated and strategic Finance Manager to lead our Finance Department. As a key member of the hospital’s leadership team, you will play a pivotal role in ensuring financial sustainability, enhancing operational efficiency, and supporting strategic growth. Prior healthcare experience is required.\n\n\nKey Responsibilities\n\n\n\tLead the preparation and management of annual budgets, forecasts, and long-term financial plans aligned with the hospital's objectives.\n\tPrepare accurate and timely financial reports; analyze variances and trends; provide actionable insights to aid decision-making.\n\tOversee billing, insurance claims processing, accounts receivable, vendor payments, and cash flow optimization.\n\tEnsure full compliance with tax regulations, financial reporting standards, and healthcare industry-specific financial requirements.\n\tSupervise and mentor the finance team; assign roles, monitor performance, and strengthen internal controls.\n\tMonitor departmental expenditures, identify opportunities for cost savings, and recommend process improvements.\n\tPresent financial updates to senior leadership; support funding proposals; liaise with auditors, banks, and regulatory bodies.\n\n\nRequirements\n\n\n\tBachelor’s Degree in Finance, Accounting, Economics or related field (MBA or professional certification like ICAN, ACCA is an added advantage).\n\tMinimum of 4 years of progressive finance experience, preferably in the healthcare or service industry.\n\tStrong leadership, communication, and strategic thinking skills.\n\tProficiency in financial software and MS Excel.\n\tSound knowledge of financial regulations and healthcare industry standards.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and Cover Letter to: hr@equityng.com using \"Finance Manager\" as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Insurance Manager Job at Unicane Industries FZE",
    "link": "https://www.jobgurus.com.ng/jobs/view/insurance-manager-job-at-unicane-industries-fze",
    "pubDate": "Fri, 04 Jul 2025 15:15:58 GMT",
    "source": "JobGurus",
    "keyword": "unicane industries fze",
    "duplicate": false,
    "classifications": [],
    "content": "Unicane Industries FZE is the largest renner of Ethanol in Africa and also into production of Soya Oil and plastics Manufacturing. we seek experienced insurance professional to join our team. \n\nWe are recruiting to fill the position below:\n\nJob Position: Insurance Manager\n\nJob Location: Jamata Village, Lokoja LGA, Kogi \nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking an experienced Insurance Manager to manage and oversee all insurance-related matters for our large manufacturing enterprise.\n\tThe successful candidate will be responsible for ensuring adequate insurance coverage for our fleet, workplace compensation, manufacturing equipment, and other business assets.\n\n\nKey Responsibilities\nInsurance Policy Management:\n\n\n\tDevelop and implement insurance strategies to mitigate risks.\n\tManage and negotiate insurance policies for fleet, workplace compensation, equipment, and other business assets.\n\tEnsure compliance with regulatory requirements.\n\n\nRisk Assessment and Management:\n\n\n\tIdentify and assess potential risks to the organization.\n\tDevelop and implement risk management strategies to minimize losses.\n\n\nClaims Management:\n\n\n\tHandle insurance claims and ensure timely settlement.\n\tLiaise with insurance providers and other stakeholders.\n\n\nFleet Insurance:\n\n\n\tManage fleet insurance policies and ensure compliance with regulatory requirements.\n\tHandle claims and negotiate settlements.\n\n\nWorkplace Compensation:\n\n\n\tManage workers' compensation insurance and ensure compliance with regulatory requirements.\n\tHandle claims and negotiate settlements.\n\n\nEquipment and Asset Insurance:\n\n\n\tManage insurance policies for manufacturing equipment and other business assets.\n\tEnsure adequate coverage and handle claims.\n\n\nInsurance Compliance:\n\n\n\tEnsure compliance with regulatory requirements and industry standards.\n\tStay up-to-date with changes in insurance laws and regulations.\n\n\nRequirements\nQualifications:\n\n\n\tBachelor's Degree in Insurance, Risk Management, Business Administration, or related field.\n\tProfessional insurance certifications (e.g., Chartered Insurance Institute of Nigeria (CIIN)) are an advantage.\n\n\nExperience:\n\n\n\tMinimum of 5 years experience in insurance management, preferably in a manufacturing or industrial setting.\n\tProven track record of managing complex insurance issues.\n\n\nSkills:\n\n\n\tStrong analytical and problem-solving skills.\n\tExcellent communication and negotiation skills.\n\tAbility to work independently and as part of a team.\n\n\nMethod of Application\nInterested and qualified candidates should send their application including Resume and Cover Letter to: eon@africa.industriesusing the Job Position as the subject of the mail.\n\nNote: If you are a motivated and experienced insurance professional looking for a challenging role, please apply.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Project Manager - Active Telecommunication Infrastructure Engineer Job at Snowview Support Services Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/project-manager-active-telecommunication-infrastructure-engineer-job-at-snowview-support-services-limited",
    "pubDate": "Fri, 04 Jul 2025 15:15:58 GMT",
    "source": "JobGurus",
    "keyword": "snowview support services limited",
    "duplicate": false,
    "classifications": [],
    "content": "Snowview Support Services Limited (SSSL) is a leading infrastructure support company headquartered in Port Harcourt, Nigeria, with core operations in telecommunications and oil & gas.\n\nWe are recruiting to fill the position below:\n\nJob Position: Project Manager - Active Telecommunication Infrastructure Engineer\n\nJob Location: Port Harcourt, Rivers\nEmployment Type: Full-time\n\nJob Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tLead the end-to-end management of telecom infrastructure projects (BTS, Microwave Radio, GSM networks)\n\tSupervise project officers, field engineers, and subcontractors to ensure deliverables align with project goals\n\tDevelop project plans, timelines, and budgets, and track progress against key milestones\n\tCoordinate resource allocation and ensure optimal use of technical, human, and material resources\n\tEnsure timely installation, commissioning, and integration of network components (active telecom equipment)\n\tIdentify risks and develop contingency plans to address schedule delays, technical issues, or budget constraints\n\tOversee the implementation of network designs and validate system performance through test results\n\tConduct project reviews, documentation audits, and post-implementation evaluations\n\tLiaise with clients, vendors, and cross-functional teams for seamless execution and project handover\n\tStay up to date on new telecom technologies and recommend solutions for continuous improvement\n\n\nRequirements\n\n\n\tB.Eng./B.Sc. in Electrical/Electronic, Telecoms, or related field; PMP or PRINCE2 certification preferred.\n\tMinimum 4 years of hands-on telecom rollout/Operations & Maintenance experience with at least 2 years in a supervisory Project or Program Management role.\n\tStrong command of GSM, LTE/5G RAN, microwave backhaul, IP routing/switching, and site power systems (genset, DC plant, battery banks).\n\tProven budget control, vendor management, and advanced Excel/MS Project (or Primavera) skills.\n\n\nKey Skills:\n\n\n\tProject Management: Excellent planning, budgeting, and scheduling skills using tools like MS Project or Primavera.\n\tTechnical Knowledge: Deep understanding of GSM/LTE infrastructure, microwave backhaul, IP routing/switching, and site power systems.\n\tLeadership & Communication: Strong supervisory skills, able to lead multidisciplinary teams and communicate across all organizational levels.\n\tProblem Solving: Analytical mindset to resolve complex rollout, integration, and O&M issues.\n\tAnalytical Skills: Ability to analyze network performance data and identify areas for improvement.\n\tDocumentation & Reporting: Skilled in writing reports and appropriate documentation.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and a cover letter to: recruitment@snowviewssl.com using “Application - Project Manager (Active Telecommunication Infrastructure Maintenance)” as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]