[
  {
    "title": "Human Resources (HR) Officer Job at Kumesoft Technology",
    "link": "https://www.jobgurus.com.ng/jobs/view/human-resources-hr-officer-job-at-kumesoft-technology",
    "pubDate": "Mon, 09 Jun 2025 16:19:53 GMT",
    "source": "JobGurus",
    "keyword": "kumesoft technology",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Kumesoft Technology is a growing digital marketing agency with a strong focus on SEO. Our mission is to help businesses grow by providing customized, results-driven SEO services that increase visibility, drive traffic, and boost conversions.\n\nStarting with high-demand markets, we offer country-specific SEO strategies (e.g., “Local SEO in Nigeria,” “Local SEO in Canada”) to meet the unique needs of each region. As we build our client base and revenue, we plan to expand into PPC, social media, and content marketing.\n\nWe are recruiting to fill the position below:\n\nJob Position: Human Resources (HR) Officer\nJob Location: Nigeria\nEmployment Type: Contract\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Summary\n\n\n\tAs an HR Officer at Kumesoft Specialist, you will play a critical role in supporting the agency’s continued growth.\n\tYou’ll be responsible for sourcing talent, overseeing onboarding, and keeping the team accountable, organized, and aligned with our mission. This role is initially a 6-month contract, with the possibility of full-time employment.\n\n\nKey Responsibilities\n\n\n\tManage end-to-end recruitment: post job openings, source and screen candidates, schedule interviews, and oversee onboarding.\n\tKeep accurate HR records and maintain internal documentation (contracts, performance reviews, leave tracking, etc.).\n\tFoster a work culture of accountability, clarity, and professional growth.\n\tMediate internal concerns and maintain a respectful, inclusive work environment.\n\tEnsure policies are clearly communicated, up-to-date, and enforced across all teams.\n\tMonitor staff performance and attendance, providing structured feedback reports and supporting productivity.\n\tOrganize internal communications, including meetings, task follow-ups, and company-wide updates.\n\tSupport leadership in planning staff development activities (training, team-building, etc.).\n\tEnsure compliance with Nigerian labor laws and HR best practices.\n\n\nQualifications\n\n\n\tBachelor’s Degree in Human Resources, Business Administration, or related field.\n\tPrior experience in a dedicated HR role, preferably in a fast-paced or digital-focused company.\n\tDeep understanding of HR operations, recruitment processes, and labor regulations.\n\tExceptional organizational and interpersonal skills.\n\tProven ability to work independently and manage remote teams.\n\tTech-savvy and proficient in HR tools, digital task managers (e.g., Trello), and communication tools (e.g., Google Meet).\n\tStrong communication skills with high emotional intelligence.\n\n\nContract & Growth Opportunity\n\n\n\tThis is a 6-month contract position. If performance goals are met and the role proves to be integral to the company’s growth, there is a strong potential for full-time employment.\n\tWe’re looking for someone who brings structure, clarity, and lasting value to the team.\n\n\nSalary\nN70,000 - N100,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV and Cover Letter to: hello@rankreform.com using “HR Officer” as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Female Cashier Job at Hec Recruit",
    "link": "https://www.jobgurus.com.ng/jobs/view/female-cashier-job-at-hec-recruit",
    "pubDate": "Mon, 09 Jun 2025 16:19:53 GMT",
    "source": "JobGurus",
    "keyword": "hec recruit",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "Hec Recruit is a full-service HR consulting firm with a unique approach. Since 2020, we have been helping our clients find a job best suited for their skills and interests, and helping local companies locate the best employees.\n\nWe are recruiting to fill the position below:\n\nJob Position: Female Cashier\n\nJob Location: Warri, Delta\nEmployment Type: Full-time\n\nJob Duties\n\n\n\tProcess Payment;\n\tReceive cash;\n\tConfirm payment;\n\tIssues receipts;\n\tProvide customer care service;\n\tMonitor stock at check out; and\n\tEnsure clean work space\n\n\nRequirements\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tCandidates should possess an OND, HND, or B.Sc Degree\n\tMust be Computer literate\n\tProficient in Microsoft word, not social media shy, and good looking\n\tAge between 25 to 30.\n\n\nSalary\nN70,000 / Month\n\nMethod of Application\nInterested and qualified candidates should send their CV to: toluedun9@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Web Developer Job at Just Inches Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/web-developer-job-at-just-inches-limited",
    "pubDate": "Mon, 09 Jun 2025 16:19:53 GMT",
    "source": "JobGurus",
    "keyword": "just inches limited",
    "duplicate": false,
    "classifications": [
      "Software Engineering",
      "Marketing",
      "Finance"
    ],
    "content": "Just Inches Limited is a premier strategic communications company dedicated to helping talents, corporate organizations, and nations discover their unique positioning, craft and convey their messages effectively, and enhance their brand image. Our mission is to improve and sustain perspectives, relationships, and brand recognition, driving increased reach, visibility, engagement, and return on investment for our clients.\n\nWe are recruiting to fill the position below:\n\nJob Position: Web Developer\nJob Location: Lekki-Ajah, Lagos\nEmployment Type:\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDesign, develop, and maintain modern, responsive, and secure websites using WordPress and custom programming where necessary.\n\tCustomize themes and plugins to meet specific client and project needs.\n\tCollaborate with creative, content, and business development teams to ensure alignment with brand guidelines and objectives.\n\tOptimize websites for performance, SEO, and mobile responsiveness.\n\tTroubleshoot website issues, bugs, and server-side errors.\n\tEnsure proper website security, backups, and uptime.\n\tMaintain documentation of code, updates, and processes for internal use.\n\tManage hosting, domain configurations, and third-party integrations.\n\n\nRequirements\n\n\n\tMinimum of 3 years of experience as a Web Developer (agency or client-side).\n\tProven expertise in WordPress CMS – including theme development, plugin customization, and WooCommerce.\n\tStrong command of HTML5, CSS3, JavaScript, PHP, and MySQL.\n\tGraphic design skills (using tools like Figma, Adobe XD, Canva, or Photoshop) are an added advantage.\n\tExperience with APIs, third-party integrations, and version control systems (e.g., Git).\n\tUnderstanding of SEO best practices and web analytics tools (e.g., Google Analytics).\n\tExcellent problem-solving skills and attention to detail.\n\tAbility to manage multiple projects and meet deadlines under pressure.\n\n\nWhat We Offer\n\n\n\tA creative and collaborative work environment\n\tOpportunities for growth in a performance-driven team\n\tCompetitive salary and project-based bonuses\n\tFlexible work structure with room for innovation.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV, portfolio (with links to previous WordPress and web development work), and a brief cover letter to: hr@justinches.net using  “Application - Web Developer” as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Field / Marketing Officer Job at Extramileage Consults Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/field-marketing-officer-job-at-extramileage-consults-limited",
    "pubDate": "Mon, 09 Jun 2025 16:19:53 GMT",
    "source": "JobGurus",
    "keyword": "extramileage consults limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Extramileage Consults Limited is a full-service Human Resource Outsourcing company servicing different companies in different states across the nation\n\nWe are recruiting to fill the position below:\n\nJob Position: Field / Marketing Officer\nJob Locations: Ajah & Marina, Lagos\n\nRequirements\n\n\n\tMinimum of National Diploma\n\tCloseness to job location is compulsory.\n\n\nExperienced Applicants:\n\n\n\tMust have previously worked in a Microfinance organization\n\tMust have a ready pool of available prospects\n\n\nEntry-Level Applicants:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tMust have a passion for marketing\n\tMust possess an ability to drive sales & convince prospects.\n\n\nSalary\nN80,000 - N150,000 Monthly. (Entry-Level Applicants: Salary: N80,000 - N100,000 Monthly / Experienced Applicants:  Salary: N120,000 - N150,000 Monthly.)\n\nMethod of Application\nInterested and qualified applicants are to send their CVs to: extramileageconsultslimited@gmail.com using \"FIELD / MARKETING OFFICER\" as the subject of the email\n\nNote: For enquiries, WhatsApp: 08037910516.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Communications Manager Job at Phillips Outsourcing Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/communications-manager-job-at-phillips-outsourcing-limited",
    "pubDate": "Mon, 09 Jun 2025 16:19:53 GMT",
    "source": "JobGurus",
    "keyword": "phillips outsourcing limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Phillips Outsourcing Limited has been in existence for over 16 years. We have a vast experience in the outsourcing business as we currently manage resources for major clients in all sectors of the Nigerian economy. In addition, our prolific manpower cuts across the 36 states in Nigeria. After successfully gaining ground in all the 36 states of the federation, we are gradually spreading our tentacles to other African Nations. We are currently registered to also do business in Ghana. Our framework is developed to fully support the businesses of our clients, ensuring continuous improvement of the outsourced services. This ultimately thrusts our clients to achieve their business objectives.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Communications Manager\nJob Location: Victoria Island, Lagos\nEmployment Type: Full-time\nIndusrty: Media\n\nJob Summary\n\n\n\tWe are currently hiring a skilled and experienced Communications Manager to lead our communications strategy and initiatives.\n\tThis role is pivotal to driving our brand’s voice, enhancing engagement with our audience, and solidifying our position as a trusted source of African stories.\n\tThe ideal candidate is an adept storyteller with a strong media network, a strategic mindset, tasteful execution, and a passion for promoting African journalism.\n\n\nResponsibilities\n\n\n\tCraft and execute a comprehensive communications strategy that aligns with the organizations mission and goals.\n\tDevelop compelling messaging across various platforms, including press releases, newsletters, social media, and website content\n\tEstablish and maintain strong relationships with media outlets, journalists, and influencers. Proactively pitch stories and respond to media inquiries to ensure high-quality coverage.\n\tSafeguard and strengthen the organizations brand identity, ensuring all communications reflect our core values and mission.\n\tOversee social media presence, creating strategies that engage followers, build community, and increase brand visibility.\n\tLead and coordinate communications campaigns, audience surveys and collaborative partnerships to enhance audience reach and engagement.\n\tCollaborate with our sales team to drive sales and customer satisfaction through our digital and social media platforms.\n\tManage communications for special events, such as editorial launches, interviews, and public panels, to maximize audience participation and engagement.\n\tTrack and report on key metrics related to communications efforts. Use data-driven insights to refine strategies and improve outcomes.\n\n\nRequirements\n\n\n\tBachelor’s degree in communications, social sciences or a related field\n\t5+ years of full-time professional experience in a communications or public relations role, preferably in media or publishing.\n\tProven track record of managing successful communications campaigns, conducting surveys and building media relationships\n\tExceptional writing, editing, and verbal communication skills. (Demonstrable graphics and/or video editing experience is a big plus.)\n\tStrong understanding of digital marketing, social media and newsletter strategy, and analytics.\n\tProficiency with social media and newsletter design tools such as Buffer, Later, Canva and Mailchimp as well as extensive experience with productivity tools such as Notion and the Microsoft Office Suite.\n\tAbility to work independently and as part of a collaborative team.\n\tStrong organizational and time-management abilities.\n\tAbility to anticipate needs and handle multiple priorities.\n\tPassion for African journalism and an understanding of the unique challenges and opportunities in the African media landscape.\n\n\nSalary\nN700,000 Monthly (Net).\n\nMethod of Application\nInterested and qualified candidates should send their CV to: realrecruitment.jobs@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]