[
  {
    "title": "Investment Sales Advisor Job at Sow Real Estate Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/investment-sales-advisor-job-at-sow-real-estate-limited",
    "pubDate": "Sat, 21 Jun 2025 14:14:02 GMT",
    "source": "JobGurus",
    "keyword": "sow real estate limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Sow Real Estate Nigeria Limited is a real estate company that is focused on delivering affordable housing with quality materials and achieving customer satisfaction.\n\nWe are recruiting to fill the position below:\n\nJob Position: Investment Sales Advisor\nJob Location: Lekki Phase 1, Lagos\nEmployment Type: Full-time\n\nDescription\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking passionate and driven Investment Sales Advisors to join our dynamic team in Lagos.\n\tIdeal candidates should have 1 - 3 years of experience in sales, preferably within the real estate sector (though this is not compulsory).\n\tIf you have a strong network of buyers and are looking to grow in a supportive and professional environment, we want to hear from you.\n\n\nKey Responsibilities\n\n\n\tIdentify and engage prospective investors and buyers.\n\tPromote investment opportunities and guide clients through decision-making.\n\tBuild and maintain long-term client relationships.\n\tMeet and exceed sales targets.\n\tAttend team coaching and mentorship sessions.\n\n\nRequirements\n\n\n\tCandidates should possess relevant qualifications in a related field.\n\t1 - 3 years of sales experience in Real Estate.\n\tProven network or contacts of potential buyers.\n\tExcellent communication and interpersonal skills.\n\tSelf-motivated, proactive, and eager to learn.\n\n\nWhat We Offer\n\n\n\tCompetitive Monthly Salary, attractive commissions and performance-based incentives.\n\tA supportive, high-performance work environment.\n\tMentorship and hands-on coaching to boost your career.\n\tOpportunities for professional growth and leadership development.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV in PDF to: folakefolawewo.sowrealestate@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Project Manager Job at AL-Treuhand Better Design Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/project-manager-job-at-al-treuhand-better-design-limited",
    "pubDate": "Sat, 21 Jun 2025 14:14:02 GMT",
    "source": "JobGurus",
    "keyword": "al-treuhand better design limited",
    "duplicate": false,
    "classifications": [],
    "content": "AL-Treuhand Better Design Limited is an architectural anda multidisciplinary design companyfocused on providing premium design andachievable solutions. With a strong belief that everyone deserves better design. We focus on all kinds of designs and renovation, turnkey delivery, interiors, finishing and furnishingand general construction.\n\nWe are recruiting to fill the position below:\n\nJob Position: Project Manager\nJob Location: Wuse, Abuja (FCT)\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDevelop detailed project plans, including scope, timelines, budgets, and resource allocation.\n\tMonitor project progress, make adjustments as necessary, and ensure timely completion.\n\tPlanning, coordinating and managing all phases of all design and construction projects, including project initiation, planning, execution, monitoring and closeout.\n\tConduct risk assessments and develop mitigation strategies.\n\tCoordinate with the design team, operations and other contractorsto ensure all project timeline and deliverables are met.\n\tCollaborate with clients to understand project requirements and expectations.\n\tSelect and manage subcontractors, ensuring they meet project specifications.\n\tConduct regular site visits to monitor progress, quality, and safety.\n\tResolve any issues or challenges that may arise during construction.\n\tLead cross-functional project teams, including architects, engineers, and contractors.\n\tFoster collaboration and communication among stakeholders.\n\tManage conflicts and resolve disputes.\n\tLiaise with clients to understand requirements and expectations.\n\tProvide project updates and progress reportsand ensure client satisfaction\n\tEnsure adherence to regulatory requirements, building codes, and company policies.\n\tManage project documentation, records, and reporting.\n\tEnsure compliance with building codes, regulations, and safety standards.\n\tAssist in implementing best practices and standardized procedures to streamline projectworkflows.\n\tStay updated on industry trends and best practices in projectmanagement.\n\tTrain and supervise team membersensuring compliance with standard operating procedures.\n\tProvide regular status reports to Management and clients.\n\tSend monthly project report to Management.\n\tCarry out any other duty as assigned.\n\n\nRequirements\n\n\n\tA minimum of a Bachelor’s Degree in Engineering,Quality control, or other relevant fields.\n\tMinimum of 3 years of proven experience in a similar role in architectural or construction industry is an added advantage.\n\tProfessional certifications such as PMP (Project Management Professional), COREN, H.S E Certification or equivalent are preferred.\n\tMaster Degree is an added advantage\n\tStrong project management skills (scheduling, budgeting, risk management).\n\tExcellent communication, leadership, and interpersonal skills.\n\tProficient in project management software (MS Project, Primavera, Asana, Trello).\n\tFamiliarity with construction management systems (CMS).\n\tKnowledge of building codes, regulations, and safety standards.\n\tStrong attention to details and organizational skills.\n\tExcellent communication and problem-solving skills.\n\tAbility to supervise and train teammembers.\n\tExperience working with cross-functional teams is an advantage.\n\tAbility to multitask and manage time effectively.\n\n\nPreferred Candidates:\n\n\n\tExcellent time management, organization, and multitasking skills, with an ability to manage competing priorities in a fast paced environment.\n\tExceptional accuracy and attention to detail.\n\tStrong analytical mindset with the ability to leverage data to inform strategic decisions and drive operational improvements.\n\tA proactive problem solver who can anticipate and address challenges before they escalate.\n\tExceptional capacity for making sound judgments in high-pressure environments.\n\tClear, unambiguous communicator who is effectively responsive across multiple communication channels.\n\tBudget management and financial literacy a plus Proven experience in client service or account management roles.\n\tExcellent interpersonal skills for interacting with internal teams and external stakeholders.\n\tHave an understanding of architectural design and experience in construction industry is a plus.\n\n\nSalary\nN150,000 - N250,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV and Cover Letter to: truehandrecruitment@gmail.com using “Project Manager” as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]