[
  {
    "title": "Quality Control Manager Job at LD&D Consulting",
    "link": "https://www.jobgurus.com.ng/jobs/view/quality-control-manager-job-at-ldd-consulting",
    "pubDate": "Thu, 19 Jun 2025 15:41:18 GMT",
    "source": "JobGurus",
    "keyword": "ld&d consulting",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "At LD&D Consulting, we are a leading recruiting company in Nigeria and beyond. We offer top-notch Staffing Solutions, Recruitment, HR Outsourcing and Payroll services across various industries including Telecoms, IT, Construction, Transportation, Energy, Sports, Finance, Environmental and Health care, in both private and public sectors.\n\nWe are recruiting to fill the position below:\n\nJob Position: Quality Control Manager\n\nJob Location: Ajah, Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking an experienced and detail-oriented Quality Control Manager to oversee and ensure the quality standards of all furniture produced at our factory.\n\tThe ideal candidate will have a strong background in the furniture production industry and a keen eye for identifying defects, implementing improvements, and maintaining production excellence.\n\n\nKey Responsibilities\n\n\n\tSupervise and coordinate quality control operations across all stages of furniture production.\n\tDevelop and implement quality assurance policies, standards, and procedures to meet company and customer expectations.\n\tInspect raw materials, in-process items, and finished products to ensure they meet required specifications and standards.\n\tMaintain accurate and up-to-date quality records, inspection reports, and compliance documentation.\n\tTrain and guide production staff on quality procedures, material handling, and finishing best practices.\n\tIdentify quality issues, analyze root causes, and recommend corrective actions to reduce defects and improve production consistency.\n\tWork closely with the production team to ensure compliance with quality standards at each stage of manufacturing.\n\tMonitor equipment and tools to ensure optimal performance and reduce quality deviations.\n\tCommunicate effectively with management regarding quality concerns, customer feedback, and continuous improvement strategies.\n\tEnsure compliance with health, safety, and environmental regulations as they relate to production quality.\n\n\nRequirements\n\n\n\tMinimum of 5 years of hands-on experience in the furniture production industry, particularly in quality assurance or control roles.\n\tIn-depth knowledge of furniture materials (wood, metal, upholstery, hardware), production techniques, and finishing processes.\n\tStrong attention to detail with the ability to detect flaws and irregularities.\n\tExcellent analytical and problem-solving skills.\n\tGood leadership and team management skills.\n\tEffective communication skills, both verbal and written.\n\tFamiliarity with quality control tools, checklists, and inspection processes.\n\tAbility to work independently and under pressure in a factory environment.\n\n\nBenefits\n\n\n\tSalary: N180,000 - N200,000 / Month.\n\tOptional accommodation provided by the company\n\tOpportunity to be part of a growing and quality-driven team\n\tSupportive work environment focused on excellence and innovation.\n\n\nMethod of Application\nInterested and qualified candidates should send their Application to: sarah@ldd-consulting.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Tax Accountant Job at Vantegral Consulting",
    "link": "https://www.jobgurus.com.ng/jobs/view/tax-accountant-job-at-vantegral-consulting-1",
    "pubDate": "Thu, 19 Jun 2025 15:41:18 GMT",
    "source": "JobGurus",
    "keyword": "vantegral consulting",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Vantegral Consulting - We are a dynamic recruitment and consulting firm committed to connecting top talent with the right opportunities. Our mission is to help businesses streamline their hiring processes while supporting job seekers in achieving their career goals.\n\nWe are recruiting to fill the position below:\n\nJob Position: Tax Accountant\n\nJob Location: Lagos\nEmployment Type: Full-Time\n\nJob Summary\n\n\n\tWe’re seeking a detail-oriented professional to join our finance team and drive excellence in compliance, planning, and reporting.\n\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tPrepare and file corporate tax returns (CIT, WHT, VAT, etc.) in compliance with local and international regulations.\n\tProvide advice on the tax implications of operational decisions and investments.\n\tMonitor changes in tax laws affecting the oil and gas industry.\n\tManage tax provision and tax compliance processes.\n\tSupport tax audits and resolve tax issues with regulatory authorities.\n\tCollaborate with finance and legal teams on transfer pricing and tax planning strategies.\n\tEnsure timely reconciliation of tax accounts and reporting in accordance with IFRS.\n\n\nQualifications\n\n\n\tBachelor’s Degree in Accounting, Finance, or a related field (ICAN/ACCA/CITN certification).\n\t10+ years of tax accounting experience, ideally within Oil & Gas or Energy sectors.\n\tStrong understanding of upstream/downstream tax frameworks.\n\tFamiliarity with SAP or similar ERP systems is an advantage.\n\tExcellent analytical, communication, and stakeholder management skills.\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Customer Service Associate Job at Roqqu Nigeria Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/customer-service-associate-job-at-roqqu-nigeria-limited",
    "pubDate": "Thu, 19 Jun 2025 15:41:18 GMT",
    "source": "JobGurus",
    "keyword": "roqqu nigeria limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Roqqu Nigeria Limited is recruiting qualified candidates to fill the position below:\n\nJob Position: Customer Service Associate\nJob Location: Ikota Villa, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe are looking for a Customer Service Associate to join our team.\n\tThe ideal candidate should have strong customer service skills and experience in account reconciliation. Banking experience is a plus but not required.\n\tThis role involves providing timely and accurate support to customers, addressing inquiries, resolving issues, and ensuring a positive customer experience.\n\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tProvide prompt and courteous assistance to customers via various communication channels. including phone, email, and live chat. Address customer inquiries, concerns, and complaints promptly and professionally.\n\tAccount Reconciliation: Perform account reconciliation tasks to ensure the accuracy and integrity of customer accounts. Identify and resolve discrepancies promptly and communicate findings to relevant stakeholders.\n\tInvestigate and resolve customer issues, such as transaction disputes, account discrepancies, and payment processing errors, in a timely and efficient manner. Escalate complex issues to appropriate teams or management as needed.\n\tMaintain accurate and detailed records of customer interactions, transactions, and issue resolutions. Ensure compliance with data protection and privacy regulations in handling customer information.\n\tCollaborate with cross-functional teams, including operations, finance, and compliance, to address customer needs, streamline processes, and improve service delivery.\n\n\nQualifications\n\n\n\tBachelor's degree in Business Administration, Finance, or related field preferred.\n\t1-2 years of relevant work experience\n\tBanking operations experience is an added advantage.\n\tExcellent communication skills, both verbal and written.\n\tAbility to multitask, prioritize workload, and work effectively in a fast-paced environment.\n\tExceptional problem-solving skills and attention to detail.\n\tCommitment to providing outstanding customer service and building positive customer relationships.\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]