[
  {
    "title": "Electrical Engineering Officer Job at Emzor Pharmaceutical Industries Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/electrical-engineering-officer-job-at-emzor-pharmaceutical-industries-limited",
    "pubDate": "Thu, 26 Jun 2025 17:40:56 GMT",
    "source": "JobGurus",
    "keyword": "emzor pharmaceutical industries limited",
    "duplicate": false,
    "classifications": [],
    "content": "Emzor Pharmaceutical Industries Limited is a wholly private indigenous pharmaceutical manufacturing group founded in 1984 by Dr. Stella C. Okoli, OON. The company is into the manufacture of high quality pharmaceutical products and medical consumables. Today, Emzor has become a household name in Nigeria and a leader in the pharmaceutical market that is known for quality products at prices that offer real value. These products are widely distributed throughout Nigeria and the West African coast. Our commitment is to produce and deliver flawless products on time and every time.\n\nWe are recruiting to fill the position below:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Position: Electrical Engineering Officer\nJob Location: Mainland, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe are seeking an experienced and result-driven Electrical Engineering Officer to manage and maintain electrical systems across our pharmaceutical manufacturing plant.\n\tThe ideal candidate will be responsible for the reliability, safety, and regulatory compliance of all electrical infrastructure, contributing to the overall equipment effectiveness (OEE) and continuous production efficiency.\n\n\nKey Responsibilities\n\n\n\tLead the execution of preventive and corrective maintenance for electrical systems, panels, and industrial automation equipment.\n\tSupervise electrical installations, modifications, and commissioning of new machinery or system upgrades.\n\tTroubleshoot complex electrical issues across production lines, utility systems, and building infrastructure to minimize downtime.\n\tProvide technical mentorship to junior electrical staff and support their skill development.\n\tSupport the qualification and validation of electrical components in manufacturing and utility systems.\n\tEnsure all electrical equipment complies with GMP, WHO, and NAFDAC standards.\n\tMonitor electrical energy usage and propose strategies for efficiency improvement and cost reduction.\n\tMaintain comprehensive electrical documentation including P&IDs, schematics, and logbooks for audit readiness.\n\tCollaborate with cross-functional teams—engineering, production and QA/QC—to ensure safe and efficient operations.\n\n\nQualifications & Experience\n\n\n\tB.Eng. or HND in Electrical/Electronic Engineering.\n\tMinimum of 5 years of hands-on electrical engineering experience in a GMP-regulated pharmaceutical or industrial manufacturing setting.\n\tNABTEB.\n\tTrade Test 1,2 & 3\n\n\nKey Competencies:\n\n\n\tStrong expertise in electrical power systems, control panels, automation, and industrial instrumentation.\n\tSkilled in reading and interpreting electrical schematics, P&IDs, and technical documentation.\n\tIn-depth knowledge of PLCs, SCADA systems, variable speed drives (VSDs), and control logic.\n\tGood communication, and technical reporting skills.\n\tHigh attention to detail, analytical thinking, and a commitment to safety and compliance.\n\n\n What We Offer\n\n\n\tCompetitive salary and performance-based bonuses.\n\tA supportive and dynamic work environment with clear career growth opportunities.\n\tComprehensive medical insurance, pension, and other employee benefits.\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Marketing Manager Job at Recruit with Adenike",
    "link": "https://www.jobgurus.com.ng/jobs/view/marketing-manager-job-at-recruit-with-adenike",
    "pubDate": "Thu, 26 Jun 2025 17:40:56 GMT",
    "source": "JobGurus",
    "keyword": "recruit with adenike",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Recruit with Adenike is a recruitment and talent solutions brand committed to connecting high-performing professionals with forward-thinking organizations across diverse industries. From entry-level roles to executive placements, we help businesses attract, engage, and retain the right talent to fuel growth and success. Our approach is efficient, personalized, and rooted in a deep understanding of people and business needs.\n\nWe are recruiting to fill the position below:\n\nJob Position: Marketing Manager\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\nReports To: Country Head\n\nAbout the Role\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a highly strategic and experienced Marketing Manager to lead and execute our marketing initiatives in Nigeria. Based onsite in Ikeja, Lagos, this role is ideal for a marketing leader with a solid track record in the fintech or financial services sector.\n\tYou will be responsible for driving product visibility, customer acquisition, retention, and brand growth across multiple channels. Reporting directly to the Country Head, you will work closely with cross-functional teams to ensure our marketing strategy supports business objectives.\n\n\nKey Responsibilities\n\n\n\tDevelop and implement end-to-end marketing strategies for fintech products (e.g., digital payments, wallets, loans)\n\tPlan and execute digital campaigns (SEO, SEM, paid media, email marketing, content marketing)\n\tCollaborate with internal teams (product, sales, compliance) to align messaging and positioning\n\tLead market research initiatives to understand customer behavior and market trends\n\tOversee go-to-market planning for new product features and launches\n\tManage performance marketing and analyze key metrics to measure ROI\n\tBuild and maintain brand identity and customer engagement across touchpoints\n\tManage vendor relationships, marketing budgets, and external agencies\n\tEnsure compliance with regulatory standards (e.g., CBN, NDPR) in all communications\n\n\nRequirements\n\n\n\tBachelor’s degree in Marketing, Business Administration, or related field\n\tMinimum of 7 years of relevant marketing experience, with at least 3 years in fintech or financial services\n\tProven experience managing digital marketing campaigns and driving measurable growth\n\tStrong knowledge of tools like Google Analytics, Meta Ads Manager, CRM platforms, and marketing automation tools\n\tExcellent communication, project management, and stakeholder management skills\n\tAnalytical mindset and ability to interpret data into actionable strategy\n\tAbility to lead cross-functional initiatives and work in a fast-paced environment\n\n\nPreferred Qualifications:\n\n\n\tMaster’s degree or certifications in marketing or digital strategy\n\tExperience working in high-growth startups or scaling tech products\n\tFamiliarity with financial regulations and marketing compliance standards in Nigeria\n\tTeam leadership or mentorship experience is a plus\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: recruitmentforce.africa@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Social Media Manager Job at AK Entertainment",
    "link": "https://www.jobgurus.com.ng/jobs/view/social-media-manager-job-at-ak-entertainment-1",
    "pubDate": "Thu, 26 Jun 2025 17:40:56 GMT",
    "source": "JobGurus",
    "keyword": "ak entertainment",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "AK Entertainment is an innovative online platform dedicated to providing an immersive and engaging experience for players worldwide. At AK Entertainment, we prioritize community and interaction, offering features like leader boards, and social integration to enhance your experience. Join us and explore a world of endless entertainment, where excitement and camaraderie come together!\n\nWe are recruiting to fill the position below:\n\nJob Position: Social Media Manager\n\nJob Location: Jabi, Abuja (FCT)\nEmployment Type: Full-time (On-site)\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAs a Social Media Manager, you will be responsible for developing and implementing our social media strategy to enhance brand awareness and engagement.\n\tYou will create, curate, and manage published content across various platforms, analyze performance metrics, and engage with our online community.\n\n\nKey Responsibilities\n\n\n\tDevelop and execute social media campaigns.\n\tCreate and schedule daily content across platforms (e.g., Facebook, Twitter, Tiktok, Instagram, WhatsApp, Telegram).\n\tMonitor and respond to customer inquiries and comments.\n\tAnalyze social media metrics and adjust strategies accordingly.\n\tCollaborate with marketing and design teams to align messaging.\n\n\nRequirements\n\n\n\tBachelor’s Degree or HND qualification in Marketing, Communications, or a related field.\n\tProven experience in social media management or similar role (3+ years preferred).\n\tStrong understanding of social media platforms and best practices.\n\tExcellent communication and writing skills.\n\tProficiency in social media management tools (e.g., Hootsuite, Buffer).\n\tAbility to analyze data and generate reports.\n\tCreative mindset with attention to detail.\n\n\nSalary\nN200,000 monthly.\n\nMethod of Application\nInterested and qualified candidates should submit their CV to: akentertainment.hr@gmail.com using \"Social Media Manager Application\" as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Business Development Manager Job at Lagos Business School",
    "link": "https://www.jobgurus.com.ng/jobs/view/business-development-manager-job-at-lagos-business-school",
    "pubDate": "Thu, 26 Jun 2025 17:40:56 GMT",
    "source": "JobGurus",
    "keyword": "lagos business school",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "Lagos Business School is committed to creating and transmitting management and business knowledge based on a Christian conception of the human person and of economic activity relevant to Nigeria and Africa at large. We strive to be a world class business school which will have a significant impact on the practice of management.\n\nWe are recruiting to fill the position below:\n\nJob Position: Business Development Manager\n\nJob Location: Lagos\n\nPurpose of Position\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe jobholder will strategically position Lagos Business School as the premier provider of bespoke learning solutions and a trusted partner in co-creating corporate academy frameworks.\n\tThis role involves designing and managing tailored corporate learning experiences while driving the uptake of our academy solutions and management services.\n\tThe incumbent will enhance client acquisition and retention efforts to ensure long-term business sustainability, while consistently delivering prompt, professional, and customer-centric service.\n\n\nEssential Duties / Key Job Roles and Responsibilities \ninclude but are not limited to the following:\n\n\n\tDesign, propose, and execute innovative corporate learning solutions tailored to public sector institutions and corporate academies, ensuring alignment with client needs and institutional goals.\n\tIdentify and convert opportunities by positioning open enrolment programmes and seminars as customised solutions that address unique client challenges.\n\tPromote Lagos Business School’s state-of-the-art physical and virtual learning facilities as integrated learning solutions for organisational capability development.\n\tBuild, nurture, and manage long-term relationships with prospects and existing clients to generate referrals, secure repeat business, and strengthen LBS’s market position.\n\tDrive debt recovery efforts and enforce adherence to the School’s credit policy for all programmes and services under your portfolio.\n\tMaintain an accurate, up-to-date CRM database of clients, prospects, and their affiliated organisations to enable effective marketing, segmentation, and reporting.\n\tServe as the proposal development lead and strategic engagement partner for assigned corporate clients, ensuring timely and competitive submissions.\n\tConsistently meet and aim to exceed set revenue and growth targets through strategic client engagement and value delivery.\n\tEnsure timely fee payment by corporate clients, strictly following standard operating procedures and internal controls.\n\tCollaborate cross-functionally with programme managers, faculty, and other stakeholders to ensure the seamless execution and successful completion of executive education programmes.\n\tContribute to continuous improvement and innovation in programme delivery, client engagement, and business development processes.\n\tCarry out other duties or special assignments as may be delegated by the line manager, in alignment with strategic business objectives.\n\n\nKey Performance Indicators:\n\n\n\tAchieving agreed target revenues.\n\tDiversity of client portfolio across industry segments\n\tAchievement of agreed participant ratings per programme\n\tFeedback from customers- both internal and external\n\n\n.Requirements \n\n\n\tA minimum of a Bachelor’s Degree from a reputable tertiary institution is required, while a master’s degree will be considered an added advantage\n\tProven experience in sales, account management, banking, FMCG, business development, consulting, or project management will be a strong asset, offering valuable perspectives and transferable skills that enhance strategic client engagement and solution delivery.\n\n\nCompetencies Required:\nTo be successful in this role, the role holder should possess the following:\n\n\n\tMust have a demonstrated professional demeanor and proven ability to work on complex projects as a team leader and initiator.\n\tMust have an eye for detail, a drive for efficiency, and a passion for creativity and innovation.\n\tAble to work in a fast-paced environment and be calm under pressure, with the ability to analyze situations and respond quickly to deliver effective solutions.\n\tAble to establish and maintain effective working relationships with client-organisations, participants and co-workers.\n\tAbility to keep and maintain accurate records, read, analyze, and interpret commercial data.\n\tProficient with Microsoft Office, the school’s admissions and customer data tracking software including Odoo.\n\tKnowledge of sales funnel methodology, market segmentation, product and channels development.\n\tExcellent oral and written communication and business presentation skills.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Finance and Administrative Assistant Job at Cooperazione Internazionale",
    "link": "https://www.jobgurus.com.ng/jobs/view/finance-and-administrative-assistant-job-at-cooperazione-internazionale",
    "pubDate": "Thu, 26 Jun 2025 17:40:56 GMT",
    "source": "JobGurus",
    "keyword": "cooperazione internazionale",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "COOPI - Cooperazione Internazionale is an Italian humanitarian non-governmental organization founded in Milan in 1965. COOPI aims to help the world’s poorest to improve their access to healthcare, food, and financial security, and to overcome their special vulnerability to wars, civil conflicts and natural disasters. For 50 years of long-term support and constant presence in the field, COOPI has been engaged in breaking the cycle of poverty and responding to specific emergencies in numerous sectors, including Food Security, Humanitarian Aid, Health, Socio-Economical Services, Water and Sanitation, Disaster Risk Reduction, Human Rights, Education and Training, Migrations and Sustainable Energy.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Finance and Administrative Assistant\nJob Location: Sokoto\nEmployment Type: Full-time\nProject / Programme: BHA\nReports To: Project Administrator\nStartin Date: ASAP\n\nJob Summary\n\n\n\tThe Finance/Administrative Assistant is responsible for executing all the tasks concerning Finance and administrative duties in the field office in Sokoto.\n\n\nMain Responsibilities and Tasks\nUnder the direct supervision of the Project Administrator, and in collaboration with the Country office and other collaborators of the projects and of the Base, he/she will:\n\nFinance Task:\n\n\n\tEnsure the proper management of project accounting by the COOPI procedures and those of the donor guidelines.\n\tEnsure the correct management of the project cash (cashbox and bank) and, in particular, the monthly reconciliation under the supervision of the Project Administrator;\n\tProcess vendor payments and maintain strict control over all required documentation, including adherence to procurement procedures, and reporting any discrepancies to the Project Administrator\n\tOrganize, file, and scan all payment vouchers with related supporting documents;\n\tParticipate in audits or any checks issued by partners or head office, at the base level.\n\tParticipate in the consolidation of budget follow-ups and cash forecasts at the base level.\n\tCarry out pay-outs and advances, within established guidelines\n\tPrepare, classify, and archive all accounting elements required by the Project Administrator.\n\tSupervise the physical maintenance and safety of cash boxes.\n\tKeep the registry of cash pay-outs and the cashier’s register\n\tRecord budgetary transfers and keep accounting codes\n\tPrepare monthly closing, revision, and integrity of accounts for the base\n\tVerify cash balances daily and report any discrepancies to superior\n\tArchive accounting records according to COOPI’s procedures after a final verification of receipts etc.\n\tGuarantee the security of the cash and confidentiality of information.\n\tPay monthly tax and social taxes under the supervision of the Project Administrator\n\tAssist the Project Administrator with monthly budget forecasts and planning so that day-to-day needs, salary advances, salaries, etc. can be addressed.\n\n\nAdmin Task:\n\n\n\tDo bank runs including transfer requests, withdrawals, and issuing/receiving letters and bank statements, etc.\n\tAdditional responsibilities\n\tThis job description is not intended to be all-inclusive and the employee will also perform other related tasks as required and assigned by the Project Administrator, and coordination office.\n\tThis ToR shall be inclusive of any other task specifically assigned by the direct supervisor for what concerns the implementation of the program activities.\n\n\nSkills and competencies of the Candidate (Education, Training, Competences, Skills)\nMinimum Requirements:\n\n\n\tDegree/Diploma of Post-graduate degree in Accountancy, Social Science courses, Business Management, Business Administration, Public Administration, or related subject, with previous experience working in humanitarian projects.\n\tand evidence of NYSC discharge certificate, with previous experience working in developmental and emergency projects, especially in NGO/INGO or financial sector.\n\n\nDesired Competencies / Skills:\nEssential:\n\n\n\t2-3 years of Finance related work experience with an NGO, International NGO, and any other financial-related institution.\n\tExperience in data collection, collation and archiving\n\tWork-related skills: good knowledge of cash management, daily administration tasks, logistics and procurement tasks\n\tFluency in English\n\tAbility to plan and organize work write clear and concise reports and communicate effectively (both in writing and verbally)\n\tProven ability to prioritize tasks and meet deadlines\n\tExcellent communication skills.\n\tProven commitment to accountability\n\tExcellent computer skills with proficiency in MS Excel.\n\tStrong analysis skills (qualitative and qualitative)\n\tExcellent interpersonal skills, written and verbal communications\n\tStrong cultural awareness and sensitivity\n\tGood understanding of complex emergencies and crisis contexts\n\tDemonstrated skills in management, teamwork, negotiation and consensus-building\n\tFemales are strongly encouraged to apply\n\tApplicants with disabilities are strongly encouraged to apply.\n\n\nPreferred:\n\n\n\tExcellent knowledge of English, with a fair understanding of Hausa.\n\tWilling and able to be based and travel regularly within remote areas, where services are limited.\n\n\nBasic Salary\n\n\n\tAccording to COOPI salary grid.\n\n\n \n\nNote\n\n\n\tFemale and People With Disabilities are strongly encouraged to apply\n\tApplication shall be treated on a rolling basis.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]