[
  {
    "title": "Customer Service Representative Job at GreyStone Consulting Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/customer-service-representative-job-at-greystone-consulting-limited",
    "pubDate": "Mon, 30 Jun 2025 14:43:52 GMT",
    "source": "JobGurus",
    "keyword": "greystone consulting limited",
    "duplicate": false,
    "classifications": [],
    "content": "GreyStone Consulting Limited - Our client is a leading confectionary is recruiting to fill the position below:\n\nJob Position: Customer Service Representative\n\nJob Location: Gbagada, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe are looking for a friendly, organized, and service-oriented Customer Service Representative to join our team.\n\tYou will be the face of the business, responsible for managing customer interactions, ensuring smooth service experiences, and helping maintain client satisfaction.\n\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tCustomer Interaction: Greet walk-in customers and answer phone or WhatsApp inquiries with professionalism and courtesy\n\tOrder Management: Receive, tag, and document incoming laundry orders accurately using POS or digital systems\n\tPayment Handling: Process payments (cash, card, transfers), issue receipts, and maintain accurate transaction records\n\tFollow-up: Call or message customers when orders are ready, delayed, or need clarification\n\tComplaint Handling: Address customer complaints or concerns politely and escalate unresolved issues to management\n\tCommunication: Inform customers about delivery/pick-up times, delays, or any issues with their garments\n\tCustomer Records: Maintain updated customer records and notes for personalized service\n\tClean Environment: Keep the front desk and customer waiting area clean, tidy, and welcoming\n\n\nQualifications & Skills\n\n\n\t1 - 2 years of experience in a customer service, front desk, or receptionist role (service or retail experience is preferred)\n\tExcellent verbal and written communication skills\n\tFriendly, confident, and patient personality\n\tBasic computer literacy and familiarity with POS or order management software\n\tStrong attention to detail and organizational skills\n\tProblem-solving attitude and ability to stay calm under pressure\n\tPunctual, trustworthy, and presentable appearance\n\tMust be fluent in English; additional local language skills are a plus.\n\n\nMethod of Application\nInterested and qualified candidates can send their CV to: consultgreystone@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Internal Auditor Job at Eat 'N’ Go Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/internal-auditor-job-at-eat-n-go-limited-1",
    "pubDate": "Mon, 30 Jun 2025 14:43:52 GMT",
    "source": "JobGurus",
    "keyword": "eat 'n’ go limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Eat 'N’ Go Limited is a restaurant group on a mission to become the premier food operator in Africa. So far, our growing family consists of three international brands, Domino's Pizza, Cold Stone Creamery & Pinkberry.\nEat ‘N’ Go limited officially started operation in August 2012 with the premier store at 4, Saka Tinubu Victoria Island, Lagos. Today, Eat N' Go has about 100 stores (outlet) across Nigeria and still growing.\n\nWe are recruiting to fill the position below:\n\nJob Position: Internal Auditor\nJob Location: Port Harcourt, Rivers\nEmployment Type: Contract\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Description\nThe following are some of the responsibilities of the Resident Auditor;\n\n\n\tConduct daily stock audit and issuing variance report for the two brands.\n\tRegular (Sales) cash , Card spot checks.\n\tRegular petty cash spot checks including all expenses such as (Transportation , Maintenance expenses and any other ops related expenses)\n\tStore supply verification from commissary and any other direct supplies.\n\tSales deposit (Cash and Card verification)\n\tFlexible schedule to audit the CSR’s during different day parts ( morning , Afternoon , evening and closing)\n\tShort-Banking validation and monitor items relating to LSM, free samples, proms, BOGOF, etc.\n\tReview and validation of Stock Variance Report of the Store\n\tReview all inter-stores transfers to ensure that all proper approvals and documentations are raised. etc.\n\n\nQualifications\n\n\n\tBachelor’s Degree or its equivalent in business related course (Accounting, Audit, Finance, Statistics or Economics)\n\t2 years of experience in an Audit function; QSR (Quick Service Restaurant) experience would be an added advantage.\n\tACA certification is an added advantage\n\tHigh Integrity, utmost confidentiality level\n\tGood analytical skill etc\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Accountant Job at Techdroid Integrated Services",
    "link": "https://www.jobgurus.com.ng/jobs/view/accountant-job-at-techdroid-integrated-services",
    "pubDate": "Mon, 30 Jun 2025 14:43:52 GMT",
    "source": "JobGurus",
    "keyword": "techdroid integrated services",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Techdroid Integrated Services is recruiting suitable candidates to fill the position below:\n\nJob Position: Accountant\n\nJob Location: Lagos\nEmployment Type: Full-time \n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAccurately record all financial transactions, including payments, expenses, invoices, and bank deposits, if any. \n\tPrepare and analyze various financial reports, such as balance sheets,  income statements, profit and loss, and cash flow statements. \n\tReconcile accounts payable and receivable, bank accounts, and other financial accounts. \n\tContribute to the development of budgets and financial forecasts. \n\tEnsure compliance with relevant accounting standards (e.g., GAAP), legal regulations, and internal policies \n\tPrepare asset, liability, and capital account entries by compiling and analyzing account information\n\tPrepare and send sales invoices and proposals to customers \n\tAnalyze financial data to identify trends, potential risks, and areas for  improvement. \n\t Ensure the integrity and accuracy of all financial data and implement appropriate internal controls. \n\tParticipate in or conduct internal and external audits periodically. \n\tMonitor accounts receivable and follow up with customers on outstanding balances\n\tPrepare and oversee budgeting, forecasting, and financial analysis reports to support informed decision-making by the Management\n\tEnsure submission of daily, weekly, monthly, yearly and every other  periodic reports\n\tOnboarding new client’s on software annual maintenance & renewals\n\tUpdate the vendor list and customer contacts.\n\tStay updated with product prices and conduct market surveys periodically\n\tResponsible for the Management of stocks (e.gs Hardware, etc) and distribution\n\tRecord all daily transactions and postings ( e.gs, imprest, petty cash expenses).\n\tAny other job as assigned by the Management.\n\n\nRequirements\n\n\n\tInterested candidates should possess relevant qualifications with 1 - 3 years of work experience.\n\n\nSalary\nN100,000 - N150,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hr@techdroidsystems.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Account Executive Job at Peridot Forte Solutions Consulting",
    "link": "https://www.jobgurus.com.ng/jobs/view/account-executive-job-at-peridot-forte-solutions-consulting",
    "pubDate": "Mon, 30 Jun 2025 14:43:52 GMT",
    "source": "JobGurus",
    "keyword": "peridot forte solutions consulting",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Peridot Forte Solutions Consulting was birthed out of the passion to assist and help organization to create a structure and frame work for their businesses thereby achieving high rate of organizational performance and profit. Organization strives achieving high rate of organizational performance and profit.\n\nWe are recruiting to fill the position below:\n\nJob Position: Account Executive\n\nJob Location: Lagos\nEmployment Type: Full Time\n\nJob Overview\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a highly motivated and detail-oriented Account Executive to join our team.\n\tThe ideal candidate will have a strong foundation in accounting principles and be responsible for supporting daily financial operations, including preparing bank reconciliation statements, managing accounts payable/receivable, and maintaining financial records.\n\n\nKey Responsibilities\n\n\n\tPrepare and analyze bank reconciliation statements on a regular basis to ensure accuracy and completeness of financial records.\n\tProcess and track invoices, receipts, payments, and other financial transactions.\n\tAssist with accounts payable and receivable functions.\n\tCommunicate with vendors, clients, and internal teams to resolve billing and payment issues.\n\tMaintain accurate and up-to-date financial records and documentation.\n\tSupport month-end and year-end closing processes.\n\tEnsure compliance with company policies and relevant accounting regulations.\n\tPerform other accounting duties as assigned by the Finance Manager.\n\n\nQualifications & Requirements\n\n\n\tFirst Degree in Accounting, Economics, or a related field.\n\t2 years of relevant work experience.\n\tStrong understanding of basic accounting principles.\n\tProficiency in Microsoft Excel and accounting software (e.g., QuickBooks, Sage, or similar).\n\tExcellent attention to detail and organizational skills.\n\tStrong analytical and problem-solving abilities.\n\tAbility to work independently and as part of a team.\n\tGood communication and interpersonal skills.\n\n\nMethod of Application\nInterested and qualified candidates should forward their CV to: peridotforte@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Sales Caller (Outbound B2B Sales) Job at Raphael Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/sales-caller-outbound-b2b-sales-job-at-raphael-group",
    "pubDate": "Mon, 30 Jun 2025 14:43:52 GMT",
    "source": "JobGurus",
    "keyword": "raphael group",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Raphael Group is a professional virtual assistant service that connects employers with skilled remote assistants. We offer a wide range of services to support individuals and businesses, including scheduling, email management, research, and more. We take the hassle out of finding and hiring qualified virtual assistants, allowing you to focus on growing your business.\n\nWe are recruiting to fill the position below:\n\nJob Position: Sales Caller (Outbound B2B Sales)\n\nJob Locations: Abuja (FCT) and Lagos\nEmployment Type: Full-time (Remote)\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a proven, results-driven Sales Caller to join our team. This role involves reaching out to businesses across various sectors to promote and close sales for our services.\n\tIf you have a track record of delivering sales results through cold calling and relationship building, we want you on our team.\n\n\nJob Responsibilities\n\n\n\tCalling a pre-existing list of businesses to pitch and sell our services\n\tSourcing new leads online and through social media (LinkedIn, Instagram, directories, etc.)\n\tFollowing up with warm leads and engaging them professionally\n\tCreating and improving sales call scripts for better performance\n\tLogging all communications, follow-ups, and outcomes daily\n\tReporting performance weekly and meeting KPIs.\n\n\nRequirements\n\n\n\tB.Sc Degree\n\tProven experience (3-5 years) in outbound B2B sales or telesales roles\n\tA clear and fluent English accent (Western or neutral preferred)\n\tPrevious experience working with Western businesses or clients (US, UK, Canada, etc.)\n\tStrong communication and persuasion skills\n\tExperience building and following a sales script that converts\n\tThe ability to work independently, manage leads, and stay organized\n\tA 1-minute voice note (VN) introducing yourself and explaining your experience is required.\n\n\nWho We're Looking For:\n\n\n\tWe're not just looking for any caller; we want a sales professional who knows how to turn leads into customers.\n\tYou should be able to demonstrate your previous success in similar roles.\n\n\nSalary\nN200,000 Monthly.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]