[
  {
    "title": "Recruitment Specialist Job at Comatrix Collection Service",
    "link": "https://www.jobgurus.com.ng/jobs/view/recruitment-specialist-job-at-comatrix-collection-service-3",
    "pubDate": "Mon, 12 Jan 2026 15:21:29 GMT",
    "source": "JobGurus",
    "keyword": "comatrix collection service",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Comatrix Collection Service - We are a professional collection service provider that deals with helping various loan agencies in retrieving back their bad-loans as fast and effectively as possible. We make calls to customers to pay their outstanding debts, Send messages to customers, Guide customers through the payment process, Persuade reluctant customers to make payment promptly, Meet weekly and monthly targets, Give proper and correct report of work. We build a professional team with experienced collectors for every loan agency, using SMS, calls, emails, various social media platforms to remind and encourage overdue customers to make repayments. Co-matrix provides financial solutions by helping loan companies recover back bad debts.\n     \n\n            \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Recruitment Specialist\nJob Location: Abule-Egba, Lagos\nEmployment Type: Full-time\n\nJob Description\n\n\n\tJob posting and advertising: Creating job descriptions and posting them on job boards and social media platforms to attract candidates.\n\tCandidate sourcing: Actively searching for potential candidates through various channels such as LinkedIn, job fairs, and networking events.\n\tScreening and shortlisting: Reviewing resumes, conducting initial interviews, and evaluating candidates to determine their suitability for the position.\n\tCoordination: Scheduling interviews, communicating with candidates, and coordinating the hiring process between candidates and hiring managers.\n\tOnboarding: Assisting with the onboarding process for new hires, which may include paperwork, orientation, and integration into the company culture.\n\n\nRequirements\n\n\n\tCandidates should possess an HND / B.Sc Degree with 1 - 2 years of relevant work experience.\n\n\nSalary\nN130,000 / month.\n\nMethod of Application \nInterested and qualified candidates should send their CV to: hr@comatrix-collection.com using \"Recruitment Specialist\" as the subject of the email.    \n\n    \n\n        Click here to Apply",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Vacancies at Lily Hospitals Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancies-at-lily-hospitals-limited-2",
    "pubDate": "Mon, 12 Jan 2026 15:21:29 GMT",
    "source": "JobGurus",
    "keyword": "lily hospitals limited",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Software Engineering"
    ],
    "content": "Lily Hospitals Limited, established since 1986 remains one of the foremost hospitals in Nigeria and within the South-South region of the country. It is the first private hospital in Nigeria to achieve ISO 9001:2000 quality management system certification from the Standards Organization of Nigeria (SON). Also we areconsistently committed to high standards; continuous improvement, service excellence, organizational citizenship, and outstanding work ethics.\n     \n\n            \n    \n\n\n\nAt Lily hospitals, weare consistently committed to high standards; continuous improvement, service excellence, organizational citizenship, and outstanding work ethics. running residency training programs in family medicine and radiology. Lily Hospitals is also involved in housemanship training, internship training in Pharmacy and Radiology. We have multiple locations in Benin, Warri, Okuokoko etc.\n\nWe are recruiting to fill the following positions below:\n\n1.) Pharmacy Technician\n\nJob Location: Warri, Delta\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tThe Pharmacy Technician will assist pharmacists in dispensing medications, maintaining inventories, and ensuring the smooth operation of the pharmacy department.\n\n\nKey Responsibilities\n\n\n\tAssist in the preparation and dispensing of prescribed medications.\n\tEnsure medications are labeled correctly and comply with the prescribed instructions.\n\tMonitor and manage pharmaceutical stock levels, ensuring availability of medications.\n\tAssist in receiving and storing medication deliveries, checking for accuracy and quality.\n\tConduct regular inventory checks and report on stock levels and expiry dates.\n\tProvide patients with medication instructions and answer questions regarding their prescriptions.\n\tAssist in preparing over-the-counter medications and pharmaceutical supplies for patient use.\n\tMaintain accurate records of medication dispensed and ensure proper documentation.\n\tSupport the pharmacy team in ensuring compliance with relevant health regulations and standards.\n\tWork closely with pharmacists, doctors, and other healthcare professionals to support patient care.\n\tAssist in processing medication orders and ensuring timely delivery to patients.\n\n\nRequirements\n\n\n\tPossess a Diploma in Pharmacy Technology from a recognized institution.\n\tMinimum of 1 year of experience in a pharmacy setting, preferably in a hospital or healthcare environment.\n\tMust be registered with the Pharmacy Council of Nigeria (PCN) and hold a valid license to practice.\n\tStrong knowledge of pharmaceutical products and terminology.\n\tExcellent attention to detail and accuracy.\n\tStrong organizational and time-management skills.\n\tAbility to work effectively in a team environment.\n\tGood communication and customer service skills.\n\tMust reside in Warri, Delta State or its environs.\n\n\nWhat We Offer\n\n\n\tCompetitive salary and benefits package.\n\tOpportunities for career growth and further training.\n\tAccess to modern pharmacy facilities and equipment.\n\tA collaborative and supportive work environment.\n\n\nApplication Closing Date: 14th January, 2026.\n\nMethod of Application \nInterested and qualifies candidates should send their CVs and Credentials to: recruitment@lilyhospitals.net using the Job Position as the subject of the email.\n\n \n\n \n\n2.) Industrial Training (IT) / SIWES Placement - Project and Property Management\n\nJob Location: Benin City, Edo\nEmployment Type: Internship\nDuration - 6 months - 1 year\n\nJob Description\n\n\n\tWe are inviting students seeking Industrial Training (IT) placement to apply for an opportunity within our Project and Property Management unit. This placement offers practical exposure to facility operations, asset management, and project coordination in a healthcare environment.\n\n\nKey Responsibilities\n\n\n\tAssist with routine facility inspections and maintenance activities\n\tSupport ongoing renovation, construction, and improvement projects\n\tHelp track assets, equipment, and property-related records\n\tAssist in coordinating vendors, contractors, and service providers\n\tSupport documentation, reporting, and filing of project activities\n\tObserve and comply with safety, health, and quality standards\n\tCarry out other assigned duties within the Project/Property Management unit.\n\n\nEligibility Requirements\n\n\n\tStudent seeking Industrial Training (IT) / SIWES placement\n\tStudying Estate Management, Building Technology, Engineering, Architecture, Project Management, or related disciplines\n\tBasic understanding of property or facility management is an advantage\n\tWillingness to learn and able to follow instructions\n\tGood communication and interpersonal skills\n\tBasic knowledge of Microsoft Office tools.\n\n\nWhat You Will Gain\n\n\n\tPractical industry experience in a hospital environment\n\tExposure to real-life project and property management operations\n\tStructured learning and supervision\n\tOpportunity to develop professional workplace skills.\n\n\nApplication Closing Date: 15th January, 2026.\n\nMethod of Application \nInterested and qualified candidates should send their CV and IT / SIWES placement letter - Benin to: recruitment@lilyhospitals.net using \"HMO Associate - Benin\" as the subject of the email.\n\n \n\n \n\n3.) HMO Associate\n\nJob Location: Benin City, Edo\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tThe HMO Associate is responsible for the day to day operational activities of the customer service unit as it relates to HMO department in the area of communicating relevant information to HMO clients and the organization’s service units.\n\tThe role is also responsible for managing the health insurance service desk which includes client servicing and the collaboration for new businesses and the expansion of existing client portfolio.\n\n\nKey Result Areas (KRA)\nThe key result areas of this role are:\n\n\n\tDesign, implement and continuously improve the overall customer experience\n\tFoster customer loyalty.\n\n\nKey Responsibilities\n\n\n\tEnsure all monthly invoices are dispatched before the commencement of subsequent billing cycle.\n\tMaintain accurate records by saving all invoices in secured hard drives.\n\tPrepare customer/patient invoices for sales and services rendered by the organization.\n\tCollaborate with the Credit Control Unit by availing records to help them work effectively.\n\tEnsure that all services within the organization have monetary value at all time.\n\tEnsure that the approved tariff is executed for all transactions at all times\n\tEnsure that there is full satisfaction for both internal and external customers\n\tEnsure that all invoices that exit the facility have a form of acknowledgement, either in hard copies, soft copies or documented phone agreements\n\tSupport the Head of Department in contracts and tariff reviews periodically\n\tEnsure that all financial and operational data are reported monthly\n\tEnsure full patients’ confidentiality\n\tUploading and Coding of all Invoices/Claims required by Clients in claims processing and submission.\n\tPerform any other tasks assigned to you by Senior Leadership.\n\n\nQualifications\n\n\n\tInterested candidates should possess a Bachelor's Degree or HND with 2 years of experience.\n\n\nApplication Closing Date: 20th January, 2026.\n\nMethod of Application \nInterested and qualified candidates should send their CV and Credentials to: recruitment@lilyhospitals.net using \"HMO Associate - Benin\" as the subject of the email.\n\n     \n\n    \n\n        Click here to Apply",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Communications Manager Job at Duob Recruitment",
    "link": "https://www.jobgurus.com.ng/jobs/view/communications-manager-job-at-duob-recruitment",
    "pubDate": "Mon, 12 Jan 2026 15:21:29 GMT",
    "source": "JobGurus",
    "keyword": "duob recruitment",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance"
    ],
    "content": "Duob Recruitment, a recruitment firm, is recruiting suitably qualified candidates to fill the position below:\n\nJob Position: Communications Manager\n\nJob Location: Abuja (FCT) \nEmployment Type: Part-time\n\nKey Responsibilities\nCorporate Communications & Public Relations:\n     \n\n            \n    \n\n\n\n\n\tDevelop and implement integrated communication strategies aligned with SAO Group’s mission and business objectives.\n\tManage media relations, press releases, interviews, and public statements.\n\tBuild strong relationships with media houses, journalists, influencers, and external partners.\n\n\nBrand Management & Visibility:\n\n\n\tStrengthen and maintain consistent brand identity across all SAO subsidiaries (Agro, Energy, Advisory, Capital, etc.).\n\tOversee production of branded materials, corporate documents, and marketing assets.\n\tEnsure high-quality representation of the Group at events, conferences, and stakeholder engagements.\n\n\nDigital & Social Media Management:\n\n\n\tLead content strategy and management across social media platforms, website, newsletters, and online campaigns.\n\tOversee creation of engaging content—articles, videos, graphics, reports, and human-interest stories.\n\tTrack and analyze digital performance metrics to improve reach and engagement.\n\n\nInternal Communications:\n\n\n\tDevelop communication channels that support collaboration and alignment across SAO Group teams and departments.\n\tCoordinate internal announcements, employee updates, and organizational messaging.\n\n\nStrategic Support to Leadership:\n\n\n\tPrepare speeches, presentations, briefs, and communication materials for executives.\n\tProvide communication guidance during major projects, events, partnerships, and organizational changes.\n\tSupport crisis communication and reputation management efforts.\n\n\nMonitoring, Reporting & Continuous Improvement:\n\n\n\tTrack brand visibility, media coverage, and campaign performance.\n\tProduce communication reports, insights, and recommendations for leadership.\n\tImplement communication best practices and stay updated with industry trends.\n\n\nRequired Qualifications & Experience\n\n\n\tBachelor’s Degree in Communications, Public Relations, Mass Communication, Marketing, or related field.\n\t5–8+ years of experience in communications, PR, media, marketing, or corporate affairs.\n\tMaster’s Degree is an added advantage.\n\tProven experience managing corporate communication in a multi-sector or high-impact organization.\n\tStrong writing, editing, storytelling, and presentation skills.\n\tExperience developing and executing digital content strategies.\n\tFamiliarity with design tools (Canva, Adobe Suite) is a plus.\n\n\nMethod of Application \nInterested and qualified candidates should send their CV to: jobs@duobrecruitment.com using the Job Position as the Subject of the mail.    \n\n    \n\n        Click here to Apply",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Head of Operation Job at Just Recruitment Agency",
    "link": "https://www.jobgurus.com.ng/jobs/view/head-of-operation-job-at-just-recruitment-agency",
    "pubDate": "Mon, 12 Jan 2026 15:21:29 GMT",
    "source": "JobGurus",
    "keyword": "just recruitment agency",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "Just Recruitment Agency specialized services encompass a wide range of industries, including but not limited to IT, finance, sales, marketing, HR, and more. Whether your company operates in a niche market or a large-scale industry, our freelance recruitment agency have the expertise to source top talent that aligns with your specific requirements.\n\nWe are recruiting to fill the position below:\n\nJob Position: Head of Operation\nJob Location: Ajah, Lagos\nEmployment Type: Full-time\n\nRole Responsibilities\n     \n\n            \n    \n\n\n\n\n\tOversee daily operations of the company and ensure efficiency across departments.\n\tDevelop and implement operational policies and procedures.\n\tMonitor performance metrics and drive continuous improvement.\n\tCollaborate with senior management to set strategic goals and achieve company objectives.\n\tEnsure compliance with all legal and regulatory requirements in the real estate sector.\n\tManage, mentor, and develop operational staff to maximize performance.\n\tCoordinate with clients, vendors, and partners to maintain strong relationships.\n\tPrepare operational reports and provide insights for decision-making.\n\n\nRequirements\n\n\n\tMinimum of 2 years of experience in real estate or a related managerial position.\n\tStrong leadership and team management skills.\n\tExcellent organizational and problem-solving abilities.\n\tComputer literate with proficiency in MS Office and relevant software.\n\tAbility to work under pressure and meet deadlines.\n\tStrong communication and interpersonal skills.\n\tMale or Female candidates are welcome to apply.\n\n\nWhy Join Us?\n\n\n\tCompetitive and negotiable salary package.\n\tOpportunity to lead and shape operations in a growing real estate company.\n\tProfessional development and growth opportunities.\n\n\nMethod of Application \nInterested and qualified candidates should send their CV to: jravacancies652@gmail.com using Job Position as the subject of the email.\n\nNote: For more information, WhatsApp: 08073393652.    \n\n    \n\n        Click here to Apply",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Project Manager Job at Reposebay Human Resource Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/project-manager-job-at-reposebay-human-resource-limited",
    "pubDate": "Mon, 12 Jan 2026 15:21:29 GMT",
    "source": "JobGurus",
    "keyword": "reposebay human resource limited",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "(function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){\n        (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),\n        m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)\n    })(window,document,'script','//www.google-analytics.com/analytics.js','ga');\n\n    ga('create', 'UA-43112273-1', 'jobgurus.com.ng');\n    ga('send', 'pageview');\n\n\n\n\n    \n        \n    Home\n    Jobs\n    Free Aptitude Test Practice\n    Employer? Post a Job\n            Register\n        Sign in\n        Contact us\n    \n\n    \n\n        \n    \n        \n\n            \n\n                \n\n                    \n                        Toggle navigation\n                        \n                        \n                        \n                    \n\n                    \n                \n            \n\n            \n                \n\n\tJobs\n\tJob Seekers\n\tAptitude Test\n\tScholarships\n\n            \n\n            \n                \n\n                                            Register\n                        Sign in\n                    \n                    Employer? Post a Job\n                \n            \n\n        \n\n    \n\n        \n        \n            \n            \n                 \n    \n                    \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n        \n     \n\n\n                            \n                    \n        \n                        CLICK HERE TO JOIN OUR WHATSAPP CHANNEL \n                    \n    \n\n    \n                                \n                    \n\n                        \n                            \n                        \n\n                        \n                            \n                                Any Specialization\n                                                                    Accounting / Audit / Finance\n                                                                    Administration/ Office/ Operations\n                                                                    Advertising/ Social Media/ Marketing/ PR\n                                                                    Agriculture / Agro Allied\n                                                                    Analyst/ Quality Control\n                                                                    Automotive/ Car Services\n                                                                    Aviation / Airline\n                                                                    Banking / Insurance\n                                                                    Building Design / Architecture\n                                                                    Construction / Mining\n                                                                    Consulting / Business Strategy/ Planning\n                                                                    Craftsmen / Artisans\n                                                                    Creatives (Arts, Design, Fashion)\n                                                                    Customer Service\n                                                                    Domestic / Janitorial Services\n                                                                    Driving / Haulage\n                                                                    Education / Teaching / Training\n                                                                    Engineering / Technical\n                                                                    Executive / Management\n                                                                    Freelance / Data Entry\n                                                                    Government Agencies / Public Sector\n                                                                    Graduates / Freshers\n                                                                    Grants /  Scholarships\n                                                                    Hospitality / Food Services\n                                                                    HSE / Safety Management\n                                                                    Human Resources / Recruitment\n                                                                    Information Technology / ICT\n                                                                    Internship/ Industrial Training\n                                                                    Legal / Law\n                                                                    Logistics / Transportation/ Supply\n                                                                    Manufacturing / Production\n                                                                    Maritime Services / Shipping\n                                                                    Media / Art / Entertainment\n                                                                    Medical/ Healthcare / Pharmaceutical\n                                                                    Military / Para-Military\n                                                                    NGO / Community Services\n                                                                    Oil & Gas / Energy\n                                                                    Procurement/ Purchasing\n                                                                    Project Management\n                                                                    Real Estate / Property / Surveying\n                                                                    Research / Survey\n                                                                    Risk Management / Compliance\n                                                                    Sales / Business Development\n                                                                    Secretarial / PA\n                                                                    Security / Intelligence\n                                                                    Software/ Programming / Web development\n                                                                    Sports / Fitness\n                                                                    Supply Chain/ Store\n                                                                    Technicians\n                                                                    Telecommunications\n                                                                    Tourism / Travels\n                                                                    Vocational Trade and Services\n                                                            \n                        \n\n                        \n                            \n                                Any Work Level\n                                                                    Entry Level (Trainee)\n                                                                    Executive (Director, Head of Dept)\n                                                                    Experienced (Non-Manager)\n                                                                    Internship\n                                                                    Manager (Staff Supervisor)\n                                                                    Senior Executive (MD, CEO, COO)\n                                                                    Vocational (Skilled/Unskilled Labour)\n                                                            \n                        \n\n                        \n                            \n                                 Search\n                            \n                        \n                    \n                \n                            \n            \n\n\n\n\n\n\n            \n\n                \n                                        \n                    \n                                        \n                    \n                    \n\n                    \n                        \n                        \n\n{\n  \"@context\": \"https://schema.org\",\n  \"@type\": \"JobPosting\",\n  \"title\": \"Project Manager\",\n  \"description\": \"Reposebay Human Resource Limited offers HR consulting and career development services through a robust technology web application that is powered by Artificial intelligence (AI). This solution has helped prepare young graduates for the world of work and has helped MSMEs afford professional HR consultants to provide services in workforce management, employee engagement, retention, standard operating procedures, and workplace policies.&amp;nbsp;Our all-inclusive solution has also helped job seekers get the right employment and business owners get the best out of their employees.\n\nWe are recruiting to fill the position below:\n\nJob Position: Project Manager\n\nJob Location:&amp;nbsp;Victoria Island, Lagos\nEmployment Type: Full-time\n\nPosition Overview\n\n\n\tThe Project Manager oversees the planning, execution, and delivery of key initiatives within the organization.\n\tThis role ensures that renovation projects, new property openings, operational improvements, and technology implementations are completed on time, within budget, and in alignment with brand standards and guest-experience goals.\n\tThe Project Manager collaborates closely with cross-functional teams, including Operations, Engineering, Finance, IT, HR, and external vendors.\n\n\nKey Responsibilities\nProject Planning &amp;amp; Execution:\n\n\n\tLead end-to-end planning for hospitality projects such as hotel renovations, new build openings, brand conversions, service enhancements, and technology rollouts.\n\tDefine project scope, goals, timelines, budgets, and deliverables.\n\tDevelop and maintain detailed project plans, schedules, and documentation.\n\tCoordinate internal and external stakeholders to ensure smooth project execution.\n\n\nOperational Coordination:\n\n\n\tWork with hotel General Managers, Operations Directors, and department heads to minimize guest disruption during projects.\n\tEnsure all projects meet brand standards for guest experience, safety, and service quality.\n\tFacilitate staff communication and readiness for operational changes or new processes.\n\n\nVendor &amp;amp; Contractor Management:\n\n\n\tSource, evaluate, and manage vendors, contractors, and consultants.\n\tNegotiate contracts and monitor performance to ensure high-quality results.\n\tConduct site visits to verify project progress and compliance.\n\n\nBudget &amp;amp; Risk Management:\n\n\n\tDevelop and manage project budgets, tracking costs and ensuring financial accountability.\n\tIdentify risks, issues, and dependencies; create mitigation plans and escalate concerns when necessary.\n\tPrepare and present regular progress reports to senior leadership.\n\n\nQuality &amp;amp; Compliance:\n\n\n\tEnsure all work complies with local regulations, health and safety standards, and brand guidelines.\n\tConduct final inspections and project close-out processes, ensuring all deliverables meet quality expectations.\n\n\nQualifications &amp;amp; Experience\n\n\n\tBachelor&amp;rsquo;s degree in Project Management, Hospitality Management, Business Administration, Engineering, or a related field.\n\t3&amp;ndash;7+ years of project management experience, ideally within the hospitality, hotel development, or real estate sectors.\n\tStrong understanding of hotel operations, guest experience standards, and service culture.\n\tDemonstrated experience managing multiple projects simultaneously.\n\tProficiency with project management tools (e.g., MS Project, Asana, Smartsheet).\n\tExcellent communication, stakeholder management, and leadership skills.\n\tAbility to travel to property sites as needed.\n\n\nCore Competencies:\n\n\n\tStrategic planning and organizational skills\n\tProblem-solving and decision-making\n\tBudget and financial management\n\tCross-functional collaboration\n\tNegotiation and vendor management\n\tAdaptability and agility in a fast-paced environment.\n\n\nSalary\nN700,000 Monthly.\n\nMethod of Application&amp;nbsp;\nInterested and qualified candidates should send their updated CV to:&amp;nbsp;celestina@reposebayhr.com&amp;nbsp;using the Job Position as the subject of the mail.\",\n  \"datePosted\": \"2026-01-12\",\n  \"validThrough\": \"2026-01-16\",\n  \"employmentType\": \"Full-Time\",\n  \"hiringOrganization\": {\n    \"@type\": \"Organization\",\n    \"name\": \"Reposebay Human Resource Limited\"\n    \n  },\n  \"jobLocation\": {\n    \"@type\": \"Place\",\n    \"address\": {\n      \"@type\": \"PostalAddress\",\n       \"postalCode\": \". \",\n       \"addressRegion\": \". \",\n       \"streetAddress\": \". \",\n      \"addressLocality\": \"Lagos\",\n      \"addressCountry\": \"NG\"\n     \n      \n    }\n  },\n  \"identifier\": {\n    \"@type\": \"PropertyValue\",\n    \"name\": \"\",\n    \"value\": \"192847\"\n  },\n  \"baseSalary\": {\n    \"@type\": \"MonetaryAmount\",\n    \"currency\": \"NGN\",\n    \"value\": {\n      \"@type\": \"QuantitativeValue\",\n      \"minValue\": 600000,\n      \"maxValue\": 900000,\n      \"unitText\": \"MONTH\"\n    }\n  }\n}\n\n\n\nProject Manager Job at Reposebay Human Resource Limited\n\n\n\n\n        \n    \n\n        \n        Reposebay Human Resource Limited offers HR consulting and career development services through a robust technology web application that is powered by Artificial intelligence (AI). This solution has helped prepare young graduates for the world of work and has helped MSMEs afford professional HR consultants to provide services in workforce management, employee engagement, retention, standard operating procedures, and workplace policies. Our all-inclusive solution has also helped job seekers get the right employment and business owners get the best out of their employees.\n\nWe are recruiting to fill the position below:\n\nJob Position: Project Manager\n     \n\n            \n    \n\n\n\nJob Location: Victoria Island, Lagos\nEmployment Type: Full-time\n\nPosition Overview\n\n\n\tThe Project Manager oversees the planning, execution, and delivery of key initiatives within the organization.\n\tThis role ensures that renovation projects, new property openings, operational improvements, and technology implementations are completed on time, within budget, and in alignment with brand standards and guest-experience goals.\n\tThe Project Manager collaborates closely with cross-functional teams, including Operations, Engineering, Finance, IT, HR, and external vendors.\n\n\nKey Responsibilities\nProject Planning & Execution:\n\n\n\tLead end-to-end planning for hospitality projects such as hotel renovations, new build openings, brand conversions, service enhancements, and technology rollouts.\n\tDefine project scope, goals, timelines, budgets, and deliverables.\n\tDevelop and maintain detailed project plans, schedules, and documentation.\n\tCoordinate internal and external stakeholders to ensure smooth project execution.\n\n\nOperational Coordination:\n\n\n\tWork with hotel General Managers, Operations Directors, and department heads to minimize guest disruption during projects.\n\tEnsure all projects meet brand standards for guest experience, safety, and service quality.\n\tFacilitate staff communication and readiness for operational changes or new processes.\n\n\nVendor & Contractor Management:\n\n\n\tSource, evaluate, and manage vendors, contractors, and consultants.\n\tNegotiate contracts and monitor performance to ensure high-quality results.\n\tConduct site visits to verify project progress and compliance.\n\n\nBudget & Risk Management:\n\n\n\tDevelop and manage project budgets, tracking costs and ensuring financial accountability.\n\tIdentify risks, issues, and dependencies; create mitigation plans and escalate concerns when necessary.\n\tPrepare and present regular progress reports to senior leadership.\n\n\nQuality & Compliance:\n\n\n\tEnsure all work complies with local regulations, health and safety standards, and brand guidelines.\n\tConduct final inspections and project close-out processes, ensuring all deliverables meet quality expectations.\n\n\nQualifications & Experience\n\n\n\tBachelor’s degree in Project Management, Hospitality Management, Business Administration, Engineering, or a related field.\n\t3–7+ years of project management experience, ideally within the hospitality, hotel development, or real estate sectors.\n\tStrong understanding of hotel operations, guest experience standards, and service culture.\n\tDemonstrated experience managing multiple projects simultaneously.\n\tProficiency with project management tools (e.g., MS Project, Asana, Smartsheet).\n\tExcellent communication, stakeholder management, and leadership skills.\n\tAbility to travel to property sites as needed.\n\n\nCore Competencies:\n\n\n\tStrategic planning and organizational skills\n\tProblem-solving and decision-making\n\tBudget and financial management\n\tCross-functional collaboration\n\tNegotiation and vendor management\n\tAdaptability and agility in a fast-paced environment.\n\n\nSalary\nN700,000 Monthly.\n\nMethod of Application \nInterested and qualified candidates should send their updated CV to: celestina@reposebayhr.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n\n\n\n        \n        \n\n            \n    \n\n\n\n\n   \n\n\n    \n        Similar Jobs\n    \n\n    \n        \n                        Project Manager, Music & Live Events (Concerts & Creative Programs) Job at Biz Afric Solutions\n                        Job Vacancies at Lily Hospitals Limited\n                        Project Officer (Shift Project) Job at Planned Parenthood Federation of Nigeria (PPFN)\n                        Project Engineer (Pipeline) Job at Felton Energy Services Limited\n                        Project Officer Job at International Alert\n                        Project Manager Job at International Alert\n                        Project & Administrative Personal Assistant Job in Abuja\n                        Job Openings at Alfred & Victoria Associates\n                        Construction Project Manager Job at Talent Towers\n                        Project and Property Management Personnel (NYSC) Job at Lily Hospitals Limited\n                    \n    \n\n\n\n                        \n                    \n\n                    \n                        \n\n\n\n    \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n\n\n\n\n\n          \n\n\n    \n\n        Hottest Jobs\n\n        \n        \n            \n\n                Job Vacancies at Watolex Crown Integrated Service\n\n               \n            \n        \n            \n\n                Job Vacancies at Neptune Microfinance Bank\n\n               \n            \n        \n            \n\n                Job Vacancies at Sterling Health HMO\n\n               \n            \n        \n            \n\n                Customer Service Officer Job at Bridge Clinic\n\n               \n            \n        \n            \n\n                Job Openings at Bridge Clinic\n\n               \n            \n        \n            \n\n                Customer Service Representative Job at Beginner Base\n\n               \n            \n        \n            \n\n                Call Centre Representative Job at Tribest Corporate Support Limited\n\n               \n            \n        \n            \n\n                Customer Service Representative Job at SRS Collection\n\n               \n            \n        \n            \n\n                Job Openings at Olam Agri\n\n               \n            \n        \n            \n\n                Receptionist Job at Flour Mills of Nigeria Plc\n\n               \n            \n        \n        \n\n    \n\n\n\n\n        \n        \n   \n\n\n                    \n                            \n            \n        \n        \n        \n\n        \n\n    \n\n        \n\n            \n\n                \n\n                    Job Seekers\n\n                    \n\n                        Search for Jobs\n                         Featured Jobs\n                         Jobs by Specialization\n                         Jobs by Industry\n                         Jobs by Location\n                         \n                        Companies Currently Hiring\n\n                        Upload CV\n\n                        Free Aptitude Test Practice\n                        \n                        Scholarships and Financial Aid\n\n                        Testimonies\n                    \n\n                \n\n                \n\n                    Employers\n\n                    \n\n                        Post A Job\n\n                        Search Resumes/Profiles\n\n                        Create Employer Account\n\n                        Advertise\n\n                        Pricing\n\n                    \n\n                \n\n                \n\n                    Tools & Resources\n\n                    \n\n                        Contact us\n                        \n                        Our Blog\n\n                        Job XML/RSS Feeds\n \n                        Free Aptitude Test Practice\n\n                        Bank Details\n\n                        FAQ & Support\n\n                    \n\n                \n\n                \n\n                    Connect with us\n\n                    \n\n                        \n\n                            \n\n                            \n\n                        \n\n                        \n\n                            \n\n                            \n\n                        \n\n                \n\n                        \n\n                            \n\n                            \n\n                        \n\n                    \n\n\n\n                    \n\n                        Customer Care\n\n                        09134259221 \n\n                        (9am - 5pm) weekdays\n\n                         info [at] jobgurus.com.ng\n\n                    \n\n\n\n                \n\n            \n\n        \n\n    \n\n\n\n    \n\n        \n\n\n\n            \n\n                Privacy Policy\n\n                Terms & Conditions\n\n                Sitemap\n                \n                About us\n\n            \n\n\n\n            Copyright © 2026 Jobgurus.com.ng - Latest Jobs in Nigeria 2025. All right reserved.",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]