[
  {
    "title": "Supermarket Store Manager Job at Lorache Consulting Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/supermarket-store-manager-job-at-lorache-consulting-limited",
    "pubDate": "Tue, 08 Jul 2025 15:17:17 GMT",
    "source": "JobGurus",
    "keyword": "lorache consulting limited",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance"
    ],
    "content": "Lorache Consulting Limited operates as a Business Process and Strategy, Human capital Development and Marketing Management Consultancy firm. The firm is piloted by a team of experienced professionals and exceptional management strategist who are distinguished and seasoned in their various fields of specialization.\n\nWe are recruiting to fill the position below:\n\nJob Position: Supermarket Store Manager\n\nJob Location: Port Harcourt, Rivers\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tStore manager or assistant in Supermarket Retail industry, is responsible for leading a team of Sales Associates to assist customers in their shopping needs.\n\tTheir duties include hiring and training qualified store employees, taking inventory of products or placing orders as needed and helping Sales Associates handle customer questions or complaints.\n\n\nResponsibilties\n\n\n\tManage store operational requirements by scheduling and assigning employees\n\tRecruit, select, orient and train employees\n\tMaintain results by coaching, counseling and disciplining employees\n\tPrepare annual budget, schedule expenditure, analyze variances and initiate corrective actions\n\tIdentify current and future customer requirements by establishing rapport with potential and existing customers\n\tEnsure availability of merchandise and marketing products in store\n\tSecure merchandise by implementing security systems and measures\n\tProtect employees and customers by providing a safe and clean store environment\n\tMaintain the stability and reputation of the store by complying with legal requirements\n\tProvide training to improve the knowledge base of the staff and use cross-training methods to maintain productivity when employees are absent\n\tManage all controllable costs to keep operations profitable\n\tManage stock levels and make key decisions about inventory control\n\tAnalyze sales figures, forecast future sales and interpret trends to facilitate planning\n\tEnsure standards for quality, customer service, and health and safety are met\n\tRespond to customer complaints and comments\n\tOrganize special promotions, displays and events\n\tUpdate colleagues on business performance, new initiatives, and other pertinent issues\n\tMaintain awareness of market trends in the retail industry, understanding forthcoming customer initiatives and monitoring what local competitors are doing\n\tInitiate changes to improve the business, e.g. revising opening hours to ensure the store can compete effectively in the local market.\n\n\nRequirements\n\n\n\tHave a Bachelor's Degree in any subject\n\tHave at least five years of experience in Store manager or retail and one year experience in leadership\n\tAre able to motivate a team, delegate work fairly, and contribute as a team player\n\tHave a relentless commitment to delivering customer service excellence and building strong customer relationships\n\tCan show knowledge of budgeting, marketing, strategic planning, and vendor relationship management\n\tHave sound knowledge of technology products and the current retail environment\n\tConsistently deliver results and have first-class sales skills\n\tAre highly organized and able to communicate well both verbally and in writing.\n\n\nSalary\nN400,000 monthly (net).\n\nMethod of Application\nInterested and qualified candidates should send their applications to: lorachevacancy@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Senior HR Officer Job at Lorache Consulting Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/senior-hr-officer-job-at-lorache-consulting-limited",
    "pubDate": "Tue, 08 Jul 2025 15:17:17 GMT",
    "source": "JobGurus",
    "keyword": "lorache consulting limited",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "Lorache Consulting Limited operates as a Business Process and Strategy, Human capital Development and Marketing Management Consultancy firm. The firm is piloted by a team of experienced professionals and exceptional management strategist who are distinguished and seasoned in their various fields of specialization.\n\nWe are recruiting to fill the position below:\n\nJob Position: Senior HR Officer\n\nJob Location: Port Harcourt, Rivers\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Senior HR Officer will lead talent management, performance evaluation, and work culture initiatives while overseeing payroll, employee benefits, and statutory compliance.\n\n\nKey Responsibilities\nTalent & Performance Management:\n\n\n\tDevelop talent retention strategies and performance evaluation systems.\n\tTrack employee efficiency and drive engagement programs.\n\n\nPayroll & Benefits Administration:\n\n\n\tProcess payroll, ensuring compliance with tax, pension, and labor laws.\n\tManage employee benefits (HMO, allowances, etc.) and policy reviews.\n\n\nStatutory Compliance:\n\n\n\tEnsure adherence to labor regulations (NSITF, PenCom, ITF).\n\tMaintain HR records for audits and legal compliance.\n\n\nRequirements\n\n\n\tEducation: Bachelor’s Degree in HR or related field (CIPM/SHRM certification is a plus).\n\tExperience: 5+ years in HR, with expertise in talent management, payroll, and labor laws.\n\tSkills: Strong analytical, communication, and HR software proficiency.\n\n\nSalary\nN330,000 / month (Gross).\n\nMethod of Application\nInterested and qualified candidates should send their applications to: lorachevacancy@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Warehouse Manager Job at Lorache Consulting Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/warehouse-manager-job-at-lorache-consulting-limited",
    "pubDate": "Tue, 08 Jul 2025 15:17:17 GMT",
    "source": "JobGurus",
    "keyword": "lorache consulting limited",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "Lorache Consulting Limited operates as a Business Process and Strategy, Human capital Development and Marketing Management Consultancy firm. The firm is piloted by a team of experienced professionals and exceptional management strategist who are distinguished and seasoned in their various fields of specialization.\n\nWe are recruiting to fill the position below:\n\nJob Position: Warehouse Manager\nJob Location: Port Harcourt, Rivers\nEmployment Type: Full-time\n\nSummary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are looking for an experienced and detail-oriented Warehouse Manager to oversee daily warehouse operations and ensure optimal productivity and safety.\n\tThe ideal candidate will lead a team of warehouse staff, manage inventory, coordinate logistics, and maintain compliance with company standards and regulations.\n\n\nResponsibilities\n\n\n\tOversee the day-to-day operations of the warehouse\n\tManage receiving, storage, inventory, order fulfillment, and shipping processes\n\tLead, train, and schedule warehouse staff to meet productivity goals\n\tCoordinate with suppliers, logistics teams, and delivery providers\n\tImplement continuous improvement processes to enhance warehouse efficiency\n\tEnsure accurate inventory management through regular audits and recordkeeping\n\tMonitor safety standards and enforce proper warehouse safety procedures\n\tMaintain warehouse cleanliness and equipment maintenance schedules\n\tTrack key performance metrics and prepare regular operations reports\n\tHandle issues related to damaged or missing inventory and resolve shipment discrepancies\n\n\nRequirements\n\n\n\tBachelor’s degree in Supply Chain Management, Logistics, Business, or related field (preferred)\n\t5 years of experience in warehouse and logistics management\n\tStrong leadership and team management skills\n\tExcellent organizational and multitasking abilities\n\tFamiliarity with warehouse management systems (WMS) and logistics software\n\tStrong problem-solving skills and attention to detail\n\tKnowledge of health and safety regulations in warehouse environments\n\tEffective communication and decision-making abilities\n\tAbility to lift and move heavy items when necessary\n\tExperience using inventory software or ERP systems\n\tOSHA certification or other warehouse safety training is a plus.\n\n\nMethod of Application\nInterested and qualified candidates should send their applications to: lorachevacancy@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Sales Personnel Job at Zhongxin Network Technology Company Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/sales-personnel-job-at-zhongxin-network-technology-company-limited",
    "pubDate": "Tue, 08 Jul 2025 15:17:17 GMT",
    "source": "JobGurus",
    "keyword": "zhongxin network technology company limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Zhongxin Network Technology Company Limited is a start-up company that is into sales of computer, phone and accessories.\n\nWe are recruiting to fill the position below:\n\nJob Position: Sales Personnel\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking to hire a high-performing Enterprise Sales Executive to drive business growth and client acquisition in the enterprise connectivity space.\n\tThis role requires a strategic and consultative approach to sales, from identifying leads to closing deals, while working closely with internal teams to deliver a top-notch service.\n\n\nResponsibilities\n\n\n\tIdentify and secure new enterprise clients.\n\tDesign and implement effective sales plans: consistently meet or exceed monthly and quarterly sales targets.\n\tClient Engagement: Conduct consultations to assess enterprise connectivity needs.\n\tPresent customized solutions to key decision-makers: Build and nurture strong, long-term client relationships.\n\tManage the full sales lifecycle (proposals, quotations, negotiation, closure).\n\tMaintain accurate sales metrics and forecasts: Address client inquiries, issues, and post-sale support needs.\n\tStay informed on connectivity trends, technologies, and competitors.\n\tProvide expert advice on appropriate networking solutions: Collaborate with technical teams for seamless solution delivery.\n\tPartner with marketing, technical, and support teams.\n\tMaintain detailed sales and client interaction records in CRM.\n\n\nRequirements\n\n\n\tB.Sc or M.Sc. in Business Administration, Marketing, or a related field.\n\tProven success in meeting/exceeding sales targets.\n\tStrong consultative selling, negotiation, and presentation skills.\n\tProficient with Microsoft Office Suite and CRM tools.\n\tExcellent written and verbal communication skills.\n\tRelevant professional certifications (sales, networking) are a plus.\n\n\nKey Competencies:\n\n\n\tBusiness acumen & commercial awareness\n\tProblem-solving & critical thinking\n\tCustomer focus & relationship management\n\tResilience & performance-driven mindset\n\tTeam collaboration & adaptability\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hrzhongxinnetwork@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Marketing Officer Job at Gabs Cooperative",
    "link": "https://www.jobgurus.com.ng/jobs/view/marketing-officer-job-at-gabs-cooperative",
    "pubDate": "Tue, 08 Jul 2025 15:17:17 GMT",
    "source": "JobGurus",
    "keyword": "gabs cooperative",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Gabs Cooperative is a leading financial institution dedicated to empowering SMEs, public servants, and civil servants with easy access to affordable loans. With a focus on financial inclusion and growth, we offer low-interest-rate loans tailored to meet diverse financial needs. Our mission is to provide reliable and flexible financial solutions that drive economic stability and prosperity. At Gabs Cooperative, we are committed to helping our clients achieve their financial goals with transparency, integrity, and exceptional service.\n\nWe are recruiting to fill the position below:\n\nJob Position: Marketing Officer\nJob Location: FCT-ABUJA\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tProcessing loan applications and documentation within specified limits.\n\tMaintain and update account records to ensure accuracy and compliance.\n\tDevelop referral networks and explore alternate channels to enhance customer acquisition.\n\tCross-sell products and services to achieve sales targets.\n\tBuild and maintain trust relationships with customers to enhance loyalty and satisfaction throughout the underwriting process.\n\tEnsure compliance with lending laws, regulations, and company policies.\n\n\nRequirements\n\n\n\tMinimum educational qualification: SSCE.\n\tStrong communication and negotiation skills.\n\tAbility to work independently and as part of a team.\n\tMust be based in Abuja.\n\n\nMethod of Application\nInterested and qualified candidates should send their applications to: hr@gabscooperative.comusing the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]