[
  {
    "title": "Customer Relationship Officer Job at Ascentech Services Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/customer-relationship-officer-job-at-ascentech-services-limited",
    "pubDate": "Thu, 03 Jul 2025 10:45:18 GMT",
    "source": "JobGurus",
    "keyword": "ascentech services limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Ascentech Services Limited is a full-fledged Human Resource Solution Provider incorporated in 2013 with its Head Office in Lagos, Nigeria. We are committed to forging long-term partnerships with our clients by creating and delivering robust and flexible services that address the changing needs of their business.\n\nWe are recruiting to fill the position below:\n\nJob Position: Customer Relationship Officer\nJob Location: Akure, Ondo\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a proactive and customer-focused Customer Relationship Officer to manage ongoing relationships with customers holding active loans.\n\tThe role involves monitoring loan performance, ensuring timely repayments, resolving client issues, and fostering strong relationships to support customer retention and business growth.\n\n\nKey Responsibilities\n\n\n\tServe as the primary point of contact for customers with active loans, providing ongoing support and communication.\n\tMonitor loan performance regularly and promptly follow up on missed or late payments to minimize delinquency.\n\tBuild and maintain strong, trust-based relationships with clients to encourage timely repayment and promote repeat borrowing.\n\tAddress client inquiries, concerns, and issues related to their loans, providing clear and effective resolutions.\n\tCollaborate with credit, collections, and risk teams to manage loan accounts and mitigate risks.\n\tProvide feedback to management on client needs, market trends, and potential credit risks.\n\tMaintain accurate records of customer interactions, repayments, and follow-up actions.\n\n\nQualifications & Experience\n\n\n\tBachelor’s degree in Finance, Business Administration, or a related field preferred.\n\t1 - 2 years of experience in credit management, customer relationship management, or collections within a financial institution.\n\tStrong interpersonal and communication skills with a customer-centric approach.\n\tAbility to analyze loan accounts and identify payment issues proactively.\n\tGood problem-solving skills and ability to handle difficult situations tactfully.\n\tProficient in using CRM systems and loan management software.\n\n\nSalary\nN150,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should forward their CVs to: cv@ascentech.com.ng using the Job Position and Location as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "General Manager Job at Zibac Consulting",
    "link": "https://www.jobgurus.com.ng/jobs/view/general-manager-job-at-zibac-consulting",
    "pubDate": "Thu, 03 Jul 2025 10:45:18 GMT",
    "source": "JobGurus",
    "keyword": "zibac consulting",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Zibac Consulting - Our client, a vibrant and fast-growing restaurant, is recruiting to fill the position below:\n\nJob Position: General Manager\nJob Location: Victoria Island, Lagos\nWork Schedule: 6 days per week, 8-hour shift\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThey are looking for an experienced and results-driven General Manager to oversee all aspects of restaurant operations, drive profitability, and ensure the highest standards of service and efficiency.\n\tThe ideal candidate has 2–3 years of management experience, with a proven ability to lead teams, streamline processes, and manage performance. Experience in the hospitality industry is an added advantage.\n\n\nKey Responsibilities\n\n\n\tOversee the daily operations of the restaurant, ensuring a smooth, efficient, and profitable workflow.\n\tLead and supervise department heads, including restaurant, kitchen, finance, and support teams.\n\tDevelop and implement business strategies that enhance productivity, service quality, and customer satisfaction.\n\tManage budgets, control costs, and ensure financial targets are met.\n\tMonitor inventory, procurement, and supplier relationships for efficiency and cost-effectiveness.\n\tEnsure compliance with health, safety, and hygiene standards.\n\tTrain, mentor, and evaluate staff performance to build a motivated and capable team.\n\tAnalyze business performance data and prepare regular reports for senior stakeholders.\n\tResolve customer complaints and implement service improvements.\n\tPromote a positive and professional work culture within the organization.\n\n\nRequirements\n\n\n\tBachelor’s degree in Business Administration, Hospitality Management, or a related field.\n\t2–3 years of proven experience in a managerial role; experience in the hospitality or restaurant industry is an added advantage.\n\tStrong leadership, communication, and interpersonal skills.\n\tExcellent problem-solving and decision-making abilities.\n\tFinancial acumen with experience managing budgets and operational KPIs.\n\tProficiency in Microsoft Office and familiarity with POS or restaurant management systems.\n\tAbility to work flexible hours, including evenings and weekends.\n\n\nBenefits\n\n\n\tCompetitive Salary: N250,000 monthly.\n\tPerformance-based bonuses\n\tOpportunity for career growth in a reputable and growing brand\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "General Manager Job at Prixair Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/general-manager-job-at-prixair-group",
    "pubDate": "Thu, 03 Jul 2025 10:45:18 GMT",
    "source": "JobGurus",
    "keyword": "prixair group",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "Prixair Group is a diversified Nigerian conglomerate founded in 2011 by entrepreneur Demola Banjo.Headquartered in Abuja, the group operates across multiple sectors, including real estate development and investment, property management, hotel operations, catering services, media services, and bottled water production.\n\nPrixair Group, our vision is to be a leading conglomerate that delivers exceptional products and services across various industries, contributing significantly to Nigeria’s economic growth and setting benchmarks for excellence and innovation.\n\nWe are recruiting to fill the position below:\n\nJob Position: General Manager\nJob Location: Minna, Niger\nEmployment Type: Full-time\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nKey Responsibilities\n\n\n\tOversee daily operations of the mall, including buka (restaurant), supermarket, cafe, and other businesses\n\tManage and supervise department managers, providing guidance and support to ensure business objectives are met\n\tDevelop and implement business strategies to drive sales growth, improve customer satisfaction, and increase market share\n\tAnalyze financial statements, sales reports, and other performance indicators to identify areas for improvement\n\tFoster strong relationships with suppliers, vendors, and stakeholders to ensure timely delivery of products and services\n\tEnsure excellent customer service, employee engagement, and talent development across all departments\n\n\nQualifications\n\n\n\tMaster's degree in Business Administration or a related field\n\tProven experience as a General Manager or similar executive role\n\tStrong understanding of corporate governance, general management best practices, and industry trends.\n\n\nEssential Skills and Experience:\nRestaurant Experience:\n\n\n\tProven track record of managing a restaurant or food service establishment\n\tKnowledge of food safety, hygiene, and customer service standards\n\tExperience with menu planning, inventory management, and staff supervision\n\n\nSupermarket Experience:\n\n\n\tVendor management, including supplier relationships and contract negotiation\n\tUpselling and cross-selling techniques to drive sales growth\n\tPractical sales experience and knowledge of inventory management systems\n\n\nBusiness Development:\n\n\n\tStrong business acumen and strategic planning skills\n\tAbility to meet sales targets and drive business growth\n\tExperience with marketing and sales initiatives\n\n\nPeople Management:\n\n\n\tExcellent leadership and communication skills\n\tAbility to motivate and develop high-performing teams\n\tExperience with conflict resolution and performance management\n\n\nFinancial Management:\n\n\n\tBudgeting and financial planning skills\n\tAbility to analyze financial statements and make informed business decisions.\n\n\nSalary\n\n\n\tN250,000 - N300,000 per month.\n\n\nWhat We Offer:\n\n\n\tCompetitive salary and benefits package of 250k - 300k monthly net.\n\tOpportunity to work with a dynamic and growing retail organization\n\tProfessional development and career growth opportunities.\n\n\nMethod of Application\nInterested and qualified candidates should forward their CVs to: hrprixairgroup@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Procurement Manager Job at PRESTIGE",
    "link": "https://www.jobgurus.com.ng/jobs/view/procurement-manager-job-at-prestige",
    "pubDate": "Thu, 03 Jul 2025 10:45:18 GMT",
    "source": "JobGurus",
    "keyword": "prestige",
    "duplicate": false,
    "classifications": [],
    "content": "PRESTIGE is an evolving, multi-location grocery headquartered in Iyana-Ipaja, Lagos, Nigeria. We are the aqueduct to personal and basic household needs. We maintain a conducive shopping atmosphere, pleasant shopping experience, and we pay attention to customers’ needs and feedbacks. PRESTIGE was founded in July 2019; and has built a reputation as a world-class grocery that consistently leaves shoppers with a smile. Our operations spans across three (3) outlets in the populated areas of Lagos metropolis and one (1) outlet in Ogun State. At PRESTIGE, we see our shoppers as part of our family, and we place premium on satisfactory customer experience daily; this has earned us customer loyalty.\n\nWe are recruiting to fill the position below:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Position: Procurement Manager\n\nJob Location: Ajuwon, Akute - Ogun\nEmployment Type: Full-time\n\nJob Description\n\n\n\tWe are seeking a highly organized and results-driven Procurement Manager to oversee and manage our sourcing and purchasing operations.\n\tThe ideal candidate will ensure the availability of quality goods at competitive prices, manage vendor relationships, and optimize inventory levels in line with the store's strategic goals.\n\tThe Procurement Manager will be responsible for evaluating suppliers, negotiating contracts, maintaining cost-efficiency, and ensuring that procurement activities align with the operational needs of the supermarket.\n\n\nKey Responsibilities\n\n\n\tDevelop and implement procurement strategies to meet the store’s supply needs.\n\tIdentify and evaluate reliable suppliers and vendors.\n\tNegotiate prices, contracts, and terms with suppliers to obtain the best value.\n\tCoordinate with store departments to understand product requirements.\n\tMaintain accurate procurement records and reports.\n\tMonitor inventory levels to prevent stockouts or overstock situations.\n\tEnsure timely and cost-effective procurement of goods.\n\tMonitor market trends and price fluctuations to make informed purchasing decisions.\n\tEnsure compliance with company policies and regulatory requirements.\n\tResolve vendor grievances and claims against suppliers.\n\n\nRequirements\n\n\n\tEducation: Bachelor’s Degree in Supply Chain Management, Business Administration, Procurement, or a related field.\n\tExperience: Minimum of 2–5 years of relevant experience in procurement, preferably in a retail or supermarket environment.\n\n\nSkills:\n\n\n\tStrong negotiation and communication skills.\n\tExcellent organizational and decision-making abilities.\n\tSound knowledge of supply chain procedures and vendor management.\n\tProficiency in Microsoft Office Suite; experience with inventory management systems is an advantage.\n\tAttention to detail and ability to manage multiple tasks simultaneously.\n\n\nOther:\n\n\n\tFamiliarity with the local market (Ogun/Lagos area) is a plus.\n\tMust be able to work independently and under pressure.\n\n\nMethod of Application\nInterested and qualified candidates should submit their CV to: feedback.prestigesuperstores@gmail.com using “Procurement Manager - Prestige Superstores” as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Supermarket Manager Job at Prixair Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/supermarket-manager-job-at-prixair-group",
    "pubDate": "Thu, 03 Jul 2025 10:45:18 GMT",
    "source": "JobGurus",
    "keyword": "prixair group",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance"
    ],
    "content": "Prixair Group, our vision is to be a leading conglomerate that delivers exceptional products and services across various industries, contributing significantly to Nigeria’s economic growth and setting benchmarks for excellence and innovation..\n\nWe are recruiting to fill the position below:\n\nJob Position: Supermarket Manager\n\nJob Location: Minna, Niger\nEmployment Type: Full-time\n\nSummary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking an experienced and results-driven Supermarket Manager to lead our team in Minna.\n\tThe ideal candidate will have a proven track record of success in managing a supermarket, driving business growth, and exceeding sales targets.\n\n\nKey Responsibilities\n\n\n\tManage daily supermarket operations, ensuring excellent customer service and efficient stock management\n\tDevelop and implement business strategies to drive sales growth, increase customer loyalty, and expand market share\n\tUtilize marketing skills to promote products, manage promotions, and create engaging in-store experiences\n\tIdentify opportunities to implement effective sales strategies\n\tBuild and maintain strong relationships with suppliers and vendors to ensure timely delivery of products\n\tAnalyze sales data and market trends to inform business decisions and optimize product offerings\n\tMeet or exceed monthly sales targets and contribute to the overall growth and profitability of the supermarket.\n\n\nRequirements\n\n\n\tInterested candidates should possess a Bachelor's Degree\n\tMinimum 5 - 8 years of experience in managing a supermarket or similar retail environment\n\tProven business development and marketing skills, with a focus on driving sales growth and customer engagement\n\tExcellent knowledge of the fast-moving consumer goods (FMCG) industry, including market trends and consumer behavior\n\tStrong relationships with suppliers and vendors, with experience in negotiating prices and managing inventory\n\tIn-depth knowledge of the Minna market, including consumer preferences and shopping habits\n\tStrong leadership and management skills, with the ability to motivate and develop a high-performing team\n\tExcellent communication and interpersonal skills, with the ability to build strong relationships with customers, suppliers, and stakeholders\n\tAbility to meet and exceed sales targets, with a focus on achieving business objectives.\n\n\n\n\n\nWhat We Offer\n\n\n\tCompetitive salary and benefits package - N200,000 - N250,000 monthly net salary\n\tOpportunity to work with a dynamic and growing retail organization\n\tProfessional development and career growth opportunities.\n\n\nMethod of Application\nInterested and qualified candidates should forward their application, including your resume and a cover letter to: hr@lvpgroup.net or hrprixairgroup@gmail.com using the Job Position as the subject of the email.\n\nNote: If you are a motivated and experienced retail professional looking for a new challenge, please submit your application.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]