[
  {
    "title": "Inventory Executive Job at DMOT Enterprises",
    "link": "https://www.jobgurus.com.ng/jobs/view/inventory-executive-job-at-dmot-enterprises",
    "pubDate": "Wed, 11 Jun 2025 17:41:03 GMT",
    "source": "JobGurus",
    "keyword": "dmot enterprises",
    "duplicate": false,
    "classifications": [],
    "content": "DMOT Enterprises - Our client, a leading FMCG company, is recruiting suitably qualified candidates to fill the position below:\n\nJob Position: Inventory Executive\n\nJob Location: Enugu\nEmployment Type: Full-time\n\nRequirements\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tCandidates should possess relevant qualifications with 2 - 3 years of experience as an Inventory Executive.\n\tKnowledge of SAP is Key.\n\tShould be ready to work in Enugu.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: ayomaku@yahoo.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Accountant Job at Brainshare Technologies & Services Nigeria Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/accountant-job-at-brainshare-technologies-services-nigeria-limited",
    "pubDate": "Wed, 11 Jun 2025 17:41:03 GMT",
    "source": "JobGurus",
    "keyword": "brainshare technologies & services nigeria limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Brainshare Technologies & Services Nigeria Limited is a Telecom services provider. We provider internet services and other value added services through our fiber optic infrastructure.\n\nWe are recruiting to fill the position below:\n\nJob Position: Accountant\nJob Location: Lagos Island, Lagos\nEmployment Type: Full-time\n\nMain Duties\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAssisting the CFO in day-to-day financial operations, including budgeting, financial forecasting, and cash flow management.\n\tResponsible for ensuring compliance with the monthly tax remittances – VAT, WHT. PAYE Tax and other similar taxes to FIRS and LIRS.\n\tEnsure compliance with monthly staff Pension remittance and other statutory deduction.\n\tSupport in the preparation for the tax audit exercise – documentation and other activities precedent to, during and after the tax audit.\n\tSupport in the filing and documentation of all statutory compliance Certificates, required for the company's business operations.\n\tSupport in the update and review of periodic financial and management reports.\n\tSupport in the application and documentation for the various financing arrangements.\n\tSupport during the statutory audit exercise.\n\tSupport the CFO in financial analysis, providing insights and recommendations to improve financial performance.\n\tCollaborating with other departments to gather financial information and support decision-making processes.\n\tMonitoring financial transactions, ensuring proper documentation and adherence to internal controls.\n\tAssisting in the preparation of annual budgets and variance analysis.\n\tStaying up-to-date with changes in accounting regulations and ensuring compliance in financial operations.\n\tPerforming other duties as assigned by the CFO.\n\n\nPersonal Qualities & Qualifications\n\n\n\tBachelor's Degree in Accounting, Finance, or a related field.\n\tMust have 3 years plus of cognate experience in a similar position from reputable big organization.\n\tStrong knowledge of accounting principles, practices, and regulations.\n\tProficiency in advanced MS Excel and accounting software especially Zoho Books.\n\tExcellent analytical and problem-solving abilities.\n\tStrong attention to detail and accuracy in financial data analysis.\n\tAbility to work independently and meet tight deadlines.\n\tEffective communication skills to collaborate with cross-functional teams and present financial information.\n\tExperience with financial reporting and auditing processes.\n\tKnowledge of tax regulations and compliance.\n\tAbility to maintain confidentiality and handle sensitive financial information.\n\tDemonstrates sense of urgency & tenacious at work.\n\tCandidate must reside around Lagos Island, Lekki-Ajah Axis.\n\n\nSalary\nN250,000 - N300,000 / Month.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: careers@brainshare.ng using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Procurement Manager Job at Monument Distillers Nigeria Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/procurement-manager-job-at-monument-distillers-nigeria-limited",
    "pubDate": "Wed, 11 Jun 2025 17:41:03 GMT",
    "source": "JobGurus",
    "keyword": "monument distillers nigeria limited",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "Monument Distillers Nigeria Limited (MDN) launched in Nigeria in March 2019 with the acquisition of the 1960 Rootz Bitters brand and the state-of-the-art manufacturing plant. Since then, the company has gone from strength to strength, moving Rootz’ production facility to Lagos.\n\nWe are recruiting to fill the position below:\n\nJob Position: Procurement Manager\n\nJob Location: Victoria Island, Lagos\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe’re looking for a Procurement Manager who will lead and manage the organization’s end-to-end procurement processes.\n\tThis role is responsible for sourcing, negotiating, contracting, and maintaining strong vendor relationships, ensuring cost-effective and timely acquisition of goods and services critical to our business.\n\n\nResponsibilities\nThis role reports to the Chief Operating Officer (COO).\n\nThe candidate will have the following duties and responsibilities:\n\n\n\tDevelop and implement the procurement policy for the organization in line with best practice and ensure strict adherence to procedure.\n\tLead and manage the end-to-end procurement cycle (P2P), including sourcing, vendor selection, contracting, and delivery tracking.\n\tAchieve the most value for the organization by negotiating terms, conditions, and pricing with the suppliers. This entails striking a balance between cost, quality, and timeliness.\n\tDevelop and manage a vendor selection and evaluation system, including identifying, assessing, registering, and maintaining a reliable database of qualified suppliers to meet MDN’s procurement needs.\n\tWork closely with the warehouse and inventory teams to ensure stock levels are maintained within the set KPI level and to ensure no stockouts.\n\tIdentify and implement cost-savings opportunities without compromising quality or delivery timelines.\n\tWork closely with the demand and planning team to ensure a proper reorder level to avoid stockouts.\n\tDevelop & lead the Procurement Team, supervising all procurement activities and fostering continuous improvement.\n\tTrack and report on key procurement metrics, such as spend, cost savings, and supplier performance.\n\tIdentify and mitigate risks associated with Procurement, such as supply chain disruptions or defaults.\n\tCollaborate with internal stakeholders, which include operations, marketing, finance, legal, Admin, HR teams, etc., and oversee close coordination of procurement efforts to align with organizational goals and objectives\n\tEvaluate supplier performance, address non-conformities, and resolve any issues or conflicts to ensure service quality and compliance.\n\tPrepare and maintain all procurement documentation/records, including analysis, reports, prices, suppliers’ information, etc.\n\tWork closely with finance to resolve invoices and other issues related to vendors’ delivery.\n\n\nQualifications & Experience\n\n\n\tB.Sc. / HND in Supply Chain Management, Accounting, any related science, Social Science, and Engineering discipline from a reputable institution\n\tMinimum of 10 years of experience in a procurement function (preferably FMCG), with at least 3 years in a supervisory role\n\tProfessional/Post-Graduate Qualification is an advantage\n\tExperience in sourcing techniques, contract management, Supplier relationship management, and Supply chain management.\n\n\nOur ideal candidate must have:\n\n\n\tStrong knowledge of Procurement Principles, Process, and Documentation\n\tRelationship Building/Management & Stakeholder Management Skills\n\tGood Communication & Negotiation Skills\n\tTeam Spirit & Collaboration Skills\n\tLeadership Skills\n\tTime Management, Planning & Organisational Skills\n\tGood Analytical & Strategic Thinking Skills\n\tAbility to deliver under a set time frame\n\tBusiness & Report Writing Skills\n\tStrong Business Acumen & Decision-Making Skills\n\tIT Proficiency (Microsoft Excel & Procurement Software).\n\n\nMethod of Application\nInterested and qualified candidates should send their CV as an attachment to: recruitment@kensingtondistillers.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Human Resources & Administration Assistant Manager Job at DreamCity Property & Investment Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/human-resources-administration-assistant-manager-job-at-dreamcity-property-investment-limited",
    "pubDate": "Wed, 11 Jun 2025 17:41:03 GMT",
    "source": "JobGurus",
    "keyword": "dreamcity property & investment limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "DreamCity Property & Investment Limited remains at the vanguard of residential and commercial real estate development across major cities in Nigeria delivering reliable structures with qualified infrastructure, luxury apartments in highbrow cities, and commercial real estate with good returns for our investors, who have over time become part of our success story.\n\nWe are recruiting to fill the position below:\n\nJob Position: Human Resources & Administration Assistant Manager\nJob Location: Abuja (FCT) and Lagos\nEmployment Type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDevelop and implement comprehensive HR strategies, policies, and programs to align with organizational objectives.\n\tOversee recruitment, selection, and onboarding processes for new hires, ensuring a seamless and positive experience.\n\tManage employee relations, performance evaluations, training initiatives, and career development programs.\n\tLead administrative functions, including office management, facilities oversight, and vendor relations.\n\tEnsure compliance with labor laws, regulations, and company policies in all HR and administrative practices.\n\tHandle employee grievances, conflict resolution, and disciplinary actions in a fair and impartial manner.\n\tCoordinate payroll processing, benefits administration, and HR-related documentation and records.\n\tDrive initiatives to enhance employee engagement, retention, and professional growth within the organization.\n\tCollaborate with senior management to align HR and administrative strategies with business objectives.\n\tMaintain a positive organizational culture through effective communication, policies, and employee programs.\n\n\nRequirements\n\n\n\tHND qualification\n\tMinimum of 5 years of combined experience in human resources and administration roles, specifically in the real estate and property construction industry.\n\tRelevant educational qualifications in HR management, business administration, or a related field.\n\tProven track record of successful HR and administrative initiatives, talent management, and operational efficiency within a similar industry setting.\n\tStrong knowledge of labor laws, regulations, and best practices in HR and administration to ensure legal compliance and ethical standards.\n\tExcellent leadership, communication, and interpersonal skills to engage effectively with employees, stakeholders, and external partners.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: recruitment.office@dreamcityproperty.com using the Job Position and Location as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Group Head, Administration Job at Sifax Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/group-head-administration-job-at-sifax-group",
    "pubDate": "Wed, 11 Jun 2025 17:41:03 GMT",
    "source": "JobGurus",
    "keyword": "sifax group",
    "duplicate": false,
    "classifications": [],
    "content": "Sifax Group is one of Africa’s fastest growing multinational corporations with diverse interests in Maritime, Aviation, Haulage & Logistics, Oil & Gas and Hospitality.\n\nWe are recruiting to fill the position below:\n\nJob Position: Group Head, Administration\n\nJob Location: Apapa, Lagos\nEmployment Type: Full-Time\nWork Mode: Fully Onsite\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAs the Group Head, Administration, you will oversee daily administrative operations and lead a multi-disciplinary team to ensure efficient, secure, and cost-effective support services across the Group.\n\tYou will be instrumental in developing strategic initiatives that align with the organization's growth objectives, while streamlining processes and enhancing service delivery across all administrative domains.\n\tYou will report directly to the Group Corporate Director and supervise key units including facility management, fleet, protocol, store/inventory, and corporate security operations.\n\n\nKey Responsibilities\n\n\n\tDevelop and implement strategic administrative processes to support organizational goals.\n\tSupervise general administrative functions across all business units.\n\tManage facilities, property, fleet, and security operations to ensure compliance, efficiency, and safety.\n\tOversee expatriate quota management and support services.\n\tMonitor and control administrative budgets across the Group.\n\tEnsure business continuity through proactive risk and security management.\n\tDrive improvements in inventory management and procurement systems.\n\tDeliver high-quality logistics and travel operations.\n\tManage vendor relationships and contracts for outsourced services.\n\tFoster a culture of professionalism, continuous improvement, and excellence within the administrative team.\n\n\nQualifications\n\n\n\tBachelor’s Degree (HND/BSc) in Business Administration, Accounting, Economics, or a related field.\n\tMinimum of 10 years of experience in administration, with at least 4 years in a senior leadership role.\n\tMBA or advanced degree is an advantage.\n\tRelevant professional certifications (e.g., Certified Administrative Professional) are highly desirable.\n\tProven experience managing large teams and multi-location administrative functions.\n\tStrong project management, planning, and organizational skills.\n\tExcellent stakeholder management and vendor coordination abilities.\n\tMust possess solid government liaison experience (e.g., Nigerian Police Force, LASBCA, other parastatals).\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]