[
  {
    "title": "Female Restaurant Manager Job at Apex Forte Professionals",
    "link": "https://www.jobgurus.com.ng/jobs/view/female-restaurant-manager-job-at-apex-forte-professionals-1",
    "pubDate": "Thu, 12 Jun 2025 15:17:16 GMT",
    "source": "JobGurus",
    "keyword": "apex forte professionals",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "Apex Forte Professionals is a company specializing in providing recruitment and staffing solutions. Their primary objective is to connect highly skilled professionals with organizations that need their expertise, ensuring a good match between the candidates' skills and the clients' requirements. This involves a range of services, including talent acquisition, workforce management, and consulting to help businesses build effective teams and achieve their goals.\n\nWe are recruiting to fill the position below:\n\nJob Position: Female Restaurant Manager\n\nJob Location: Opebi - Ikeja, Lagos\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tSupervise day-to-day restaurant operations to ensure a smooth and efficient service.\n\tHire, train, and manage front-of-house and back-of-house staff.\n\tEnsure high levels of customer satisfaction through excellent service.\n\tMonitor food quality, cleanliness, and presentation standards.\n\tHandle customer inquiries, complaints, and feedback in a professional manner.\n\tAssist with marketing and promotional activities to boost sales.\n\tManage scheduling, payroll, and labor cost control.\n\tMaintain inventory and coordinate with suppliers to manage stock levels.\n\tOversee compliance with health and safety regulations and licensing laws.\n\tMonitor and manage restaurant budgets, sales targets, and cost controls.\n\tGenerate and analyze daily, weekly, and monthly reports on sales, labor, and customer trends.\n\n\nRequirements\n\n\n\tInterested candidates should possess a BSc Degree with 3 - 6 years of work experience.\n\n\nSalary\nN165,000 - N170,000 / month.\n\nMethod of Application\nInterested and qualified candidates should send their Resume to: apexforteprofs@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Sales Manager Job at  HRD Solutions",
    "link": "https://www.jobgurus.com.ng/jobs/view/sales-manager-job-at-hrd-solutions",
    "pubDate": "Thu, 12 Jun 2025 15:17:16 GMT",
    "source": "JobGurus",
    "keyword": " hrd solutions",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "At HRD Solutions, we provide performance focused support to businesses in the areas of business strategy, organizational design and Human Resource Consulting.\n\nWe are recruiting to fill the position below:\n\nJob Position: Sales Manager\n\nJob Locations: Lagos, South West, Port Harcourt City - Rivers, Enugu, Benin - Edo, North West and North Central region\nEmployment Type: Full-time\nNature of Work: Day and Onsite\n\nResponsibilties\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDevelop and maintain strong, enduring and profitable relationship with distributors and consumers within coverage area\n\tIncrease sales revenue and market share by identifying new accounts and constantly increasing sales pipelines\n\tEnsure prompt attention to enquiries and complaints from customers and distributors\n\tUse the knowledge and understanding of the various SKUs of the company to drive sales penetration and gain competitive edge in area of coverage\n\tEnsure prompt supply of customers’ order\n\tProvide regular market feedback from customers and distributors in assigned geographical location\n\tEnsure each of the SKU is ahead of competing brands in coverage area.\n\tEnsure all distributors in coverage areas stock the company’s product\n\tMaintain and develop relationship with existing customers in person and via telephone calls and emails\n\tEnsure accurate records of all sales activities\n\tGather market and customers’ information and provide feedback on trends on a regular basis.\n\n\nRequirements\n\n\n\tFirst Degree or its equivalent in Sales and Marketing or other relevant discipline\n\tMinimum of 10 years of progressive experience in sales, with at least two years at a managerial level.\n\tProfessional Certification in Sales, such as ISM, NASP, ICSP, etc. is an added advantage.\n\tExperience in similar bottling FMCG industry is required.\n\n\nSalary\nN10,000,000 - N12,000,000 annually. \n\nMethod of Application\nInterested and qualified candidates should send their Resume to: hrdsolutionsnig@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "IT Administrator Job at Fortis Global Insurance Plc",
    "link": "https://www.jobgurus.com.ng/jobs/view/it-administrator-job-at-fortis-global-insurance-plc",
    "pubDate": "Thu, 12 Jun 2025 15:17:16 GMT",
    "source": "JobGurus",
    "keyword": "fortis global insurance plc",
    "duplicate": false,
    "classifications": [],
    "content": "Fortis Global Insurance Plc. ’FGI’ is a dynamic and innovative force poised to redefine the insurance landscape in Nigeria. We are driven by a singular vision: to deliver unparalleled value and a seamless experience to every customer.\n\nAt FGI, we believe the future of insurance is intelligent, intuitive, and deeply personal. We are built from the ground up as a technology-driven enterprise, leveraging cutting-edge solutions to simplify complex processes, enhance accessibility, and provide swift, reliable service. Our digital-first approach ensures that managing the insurance needs of our clients is effortless, secure, and always at their fingertips.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: IT Administrator\n\nJob Location: Victoria Island, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tThe IT Administrator is responsible for ensuring the robust, secure, and compliant operation of all IT infrastructure, systems, and networks.\n\tThis position is vital for supporting seamless policy issuance, claims processing, customer interactions, and back-office operations.\n\tThe IT Administrator will not only provide essential technical support but also proactively manage IT assets and contribute to strategies that enhance the reliability, security, and performance of the technology used in the organisation.\n\n\nKey Responsibilities\nSystem and Network Administration for Core Underwriting Operations:\n\n\n\tInstall, configure, maintain, and troubleshoot server hardware and software (Windows Server, Linux, and virtualization platforms like VMware/Hyper-V).\n\tManage and monitor network infrastructure (routers, switches, firewalls, Wi-Fi access points) ensuring high availability for internal users and external policyholders/partners.\n\tImplement and maintain secure network configurations, including VPNs for remote access for agents and staff, and robust access controls.\n\tAdminister and maintain cloud-based services (e.g., Microsoft 365, Google Workspace, specialized insurance SaaS platforms, AWS, Azure) ensuring optimal performance and integration.\n\tPerform regular, verified system backups and ensure comprehensive data recovery procedures are in place and tested to safeguard sensitive customer and policy data.\n\n\nSpecialized Application Support & Integration:\n\n\n\tProvide technical support for software applications (e.g., policy administration systems, claims management systems, CRM platforms, actuarial software).\n\tAssist with the integration of new insurance-specific tools and platforms.\n\tTroubleshoot issues related to data flow between various systems.\n\n\nUser Support and Helpdesk Management:\n\n\n\tProvide technical support to end-users (underwriters, claims adjusters, agents, customer service) for hardware, software, and network issues, understanding their specific workflows.\n\tDiagnose and resolve technical problems efficiently, minimising downtime for operations.\n\tManage helpdesk tickets, prioritising issues based on business impact (e.g., claims processing urgency).\n\tOnboard and off-board employees, including setting up application access, equipment, and compliance-driven permissions.\n\n\nHardware and Software Lifecycle Management:\n\n\n\tProcure, deploy, and maintain IT equipment (desktops, laptops, mobile devices, biometric scanners, specialized printers).\n\tInstall, update, and manage software applications and licenses, ensuring compliance with vendor agreements.\n\tMaintain an accurate inventory of IT assets, including software licenses and subscriptions.\n\n\nInformation Security & Regulatory Compliance:\n\n\n\tImplement and enforce strict IT security policies and best practices aligned with financial services and data privacy regulations (e.g., NDPR, NAICOM GUidelines etc).\n\tProactively monitor systems for security breaches, fraud attempts, and unauthorized access, and respond to incidents promptly.\n\tEnsure compliance with relevant industry-specific regulations and internal security standards related to customer data (e.g., Personally Identifiable Information - PII).\n\tConduct regular vulnerability assessments and implement remediation plans to protect sensitive policyholder data.\n\n\nDocumentation and Reporting:\n\n\n\tMaintain comprehensive documentation of IT systems, configurations, network diagrams, and operational procedures, with emphasis on compliance-related records.\n\tGenerate reports on system performance, security incidents, compliance adherence, and user support metrics.\n\tDocument solutions for insurance-specific application issues to enhance the knowledge base.\n\n\nIT Project Participation & Strategic Input:\n\n\n\tAssist in the planning, implementation, and deployment of new IT projects that directly support product development, customer service enhancements, or operational efficiency.\n\tEvaluate new technologies and recommend solutions to improve IT efficiency and effectiveness within an insurance context.\n\tCollaborate with business units (Underwriting, Claims, Sales) to understand their evolving IT needs and provide tailored solutions.\n\n\nQualifications\n\n\n\tEducation: Bachelor's Degree in Computer Science, Information Technology, or a related field (or equivalent practical experience).\n\tExperience: 5 -7 years of experience in IT administration, network administration, ideally within the financial services or insurance industry.\n\n\nTechnical Skills:\n\n\n\tStrong knowledge of Windows Server operating systems and Active Directory.\n\tExpertise with network protocols (TCP/IP, DNS, DHCP) and network hardware (routers, switches, firewalls).\n\tFamiliarity with cloud platforms (e.g., Microsoft 365, Google Workspace, AWS, Azure).\n\tProficiency in troubleshooting hardware and software issues for desktops, laptops, and mobile devices.\n\tDemonstrable understanding of cybersecurity principles, data privacy regulations (e.g., GDPR, local data protection laws), and compliance best practices in financial services.\n\t(Optional) Experience with virtualization technologies (VMware, Hyper-V).\n\t(Optional) Familiarity with Linux operating systems.\n\t(Highly Desirable) Exposure to or experience with core insurance software platforms (e.g., policy administration, claims, CRM for insurance).\n\n\nSoft Skills:\n\n\n\tExceptional problem-solving and analytical skills, with a keen eye for security vulnerabilities.\n\tStrong communication and interpersonal skills, capable of translating technical concepts to non-technical insurance professionals.\n\tAbility to work independently and collaboratively in a team environment.\n\tHigh level of organization and meticulous attention to detail, especially regarding sensitive data.\n\tAbility to manage multiple tasks and prioritise effectively, especially under pressure during critical incidents impacting operations.\n\tStrong customer-service oriented approach, understanding the impact of IT on policyholders and internal stakeholders.\n\n\nPreferred Certifications (Optional but highly desirable):\n\n\n\tCompTIA A+, Network+, Security+\n\tMicrosoft Certified: Azure Administrator Associate, Microsoft 365 Certified: Modern Desktop Administrator Associate, etc.\n\tCisco Certified Network Associate (CCNA)\n\t(Relevant Security Certifications like CISSP, CISM, or CompTIA CySA+).\n\n\nMethod of Application\nInterested candidates who meet the above requirements are encouraged to send their updated Resume to: recruitment@fortisglobalinsurance.com using \"Application: IT Administrator\" as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Front Office & Sales Executive Job at Infinity Tyres Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/front-office-sales-executive-job-at-infinity-tyres-limited",
    "pubDate": "Thu, 12 Jun 2025 15:17:16 GMT",
    "source": "JobGurus",
    "keyword": "infinity tyres limited",
    "duplicate": false,
    "classifications": [],
    "content": "Infinty Tyres Limted is knows for Tyres Business and other related business from last 40 years. Founded 40 years ago, Infinity Group has established itself as the most preferred company for automotive aftermarket products in Nigeria. The group has expanded its footprint into Ghana and has taken a leadership position in the west African region, for tyres, batteries, lubricants, spare parts and coolants. The group services its customers through vast network of retail sales & service centers across Nigeria & Ghana.\n\nWe are recruiting to fill the position below:\n\nJob Position: Front Office & Sales Executive\nJob Location: Victoria Island, Lagos\nEmployment Type: Full-time\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nResponsibilities\n\n\n\tGreet and welcome customers with professionalism and a friendly demeanor.\n\tAnswer customer inquiries and provide information on products, services, and pricing.\n\tAssist customers in selecting products and services that meet their requirements.\n\tMaintain accurate customer records, warranty registrations, and transaction details in the CRM system.\n\tHandle customer complaints or concerns, ensuring timely resolution.\n\tRecommend tyres, batteries, lubricants, or other products based on customer needs.\n\tEnsure proper documentation of customer interactions, sales, and inventory.\n\tProcess and maintain daily, weekly, and monthly reports of sales and inventory\n\n\nRequirements\n\n\n\tMust have strong analytical and sales experience\n\tMust be good in excel,ERP and other sales software.\n\tShould have a good managerial skills\n\tCandidates that stays within the preferred location Victoria island or its environment will be considered\n\n\nMethod of Application\nInterested and qualified candidates should send their updated CV to: infinitytyreslimited@gmail.com using the Job Position as the subject of the mail.\n\nNote: For Inquiries, send a WhatsApp message to: +234 805 509 2172.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Record Management Officer / Operations Support Job at Workforce Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/record-management-officer-operations-support-job-at-workforce-group",
    "pubDate": "Thu, 12 Jun 2025 15:17:16 GMT",
    "source": "JobGurus",
    "keyword": "workforce group",
    "duplicate": false,
    "classifications": [],
    "content": "Workforce group is a leading provider of end-to-end, integrated and result focused Business and Human Resource solutions in Nigeria. From inception in 2004, we have helped clients across diverse industries and sectors such as Financial Services, Telecoms, Oil and Gas, Real Estate, Hospitality, Power, Entertainment, FMCG, etc., to achieve their strategic goals and objectives.\n\nWorkforce Group is a top business and HR consulting firm in Nigeria, offering advisory, outsourcing, recruitment and assessment, learning and development, market entry and technology services and solutions. Our reputation for excellence in service was built from over a decade of providing business and human resource consulting across several states in Nigeria.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Record Management Officer / Operations Support\nJob Location: Lagos\nEmployment Type: Full-time\nDepartment: Human Resources\n\nJob Summary\n\n\n\tAre you detail-oriented, organized, and passionate about operational excellence in HR? Join our team as a Record Management Officer / Operations Support, where you’ll play a vital role in maintaining accurate employee records, processing benefits, and ensuring seamless HR operations.\n\n\nKey Responsibilities\n\n\n\tManage and organize both physical and electronic filing systems\n\tMaintain accurate recruitment, training, and onboarding documentation\n\tImplement and support the e-filing system\n\tPrepare and process employee benefits and regulatory remittances\n\tMaintain up-to-date training reports and support onboarding experiences\n\tProvide timely resolution and retrieval of HR-related documents\n\tLiaise with internal teams and external stakeholders (banks, NSITF, NHF, tax consultants).\n\n\nKey Success Metrics\n\n\n\t100% accuracy in reports and memos\n\t100% prompt regulatory remittances processing\n\tFull compliance with HR operational procedures and benefit processing.\n\n\nRequirements & Qualifications\n\n\n\tBachelor's degree in Human Resources, Business Administration, or related field\n\t1–3 years of experience in HR operations, record management, or administrative support\n\tStrong proficiency in Microsoft Word and Excel\n\tAbility to work independently and handle confidential information with discretion\n\tExcellent organisational and file management skills (both physical and electronic)\n\tFamiliarity with employee benefits processing and regulatory remittances (e.g., NSITF, NHF, PAYE)\n\tStrong interpersonal and communication skills\n\tExperience with HR documentation and onboarding support is an added advantage\n\n\nWhat We’re Looking For:\n\n\n\tStrong interpersonal and communication skills\n\tExcellent organisational and documentation abilities\n\tProficient in Microsoft Word and Excel\n\tDetail-oriented, with a high level of accuracy\n\tA team player with a positive and proactive attitude\n\tAbility to handle confidential information with discretion.\n\n\nSalary\nN275,000 Monthly. (Net).\n\nNote: If you're looking to grow your HR operations career in a dynamic, structured environment this role is for you!    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]