[
  {
    "title": "QA/QC Lead Job at Maventeq Systems Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/qaqc-lead-job-at-maventeq-systems-limited",
    "pubDate": "Thu, 03 Jul 2025 21:38:17 GMT",
    "source": "JobGurus",
    "keyword": "maventeq systems limited",
    "duplicate": false,
    "classifications": [
      "Software Engineering"
    ],
    "content": "Maventeq Systems Limited - Our client, an Oil and Gas company in Nigeria is currently recruiting suitably qualified candidates to fill the position below:\n\nJob Position(s): QA/QC Lead (Lagos)\n\nJob Location: Lagos\n\nThe ideal candidate shall be responsible for the development, implementation, and oversight of the project's Quality Management System (QMS), ensuring all activities and deliverables comply with specifications, standards, and regulatory requirements.\n\n Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDevelopment of the Project Quality Management Plan (PQMP) aligned with ISO 9001 requirements\n\tEnsure that all project specifications and standards incorporate required quality parameters from the\n\toutset.\n\tEnsure the quality of all materials and equipment acquired, including oversight of vendor inspections\n\tand quality documentation.\n\tEstablish and monitor quality control points for fabrication and manufacturing processes.\n\tDefine quality control procedures for materials, welding, and construction\n\tConduct ongoing quality audits and inspections throughout the construction and installation activities.\n\tManage non-conformities, implementing corrective actions, and preventive actions to maintain quality\n\tstandards.\n\tOversee implementation of quality control procedures at site and monitor welding procedures and nondestructive testing (NDT) activities.\n\tManage quality documentation and records generated during these phases.\n\n\nJob Requirements\n\n\n\t13+ years of QA/QC experience in oil/gas with 5+ years in pipeline construction projects\n\tCSWIP 3.1/3.2 or AWS-CWI (mandatory)\n\tASNT Level II in minimum 2 NDT methods\n\tISO 9001 Lead Auditor\n\tCOREN registration (preferred)\n\tMinimum 3 major pipeline projects\n\tNigerian content compliance experience\n\tPipeline welding inspection (API 1104/ASME IX) & Non-destructive testing (RT/UT/MPI/DPI) supervision\n\tQuality management systems (ISO 9001:2015)\n\tMaterial certification verification & Construction quality surveillance\n\tFluency in English (written and spoken)\n\n\nMethod of Application\n\nCandidates should send their CV to: careers@maventeqsystems.com    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]