[
  {
    "title": "Food & Beverage Service Expert Job at Marriott International",
    "link": "https://www.jobgurus.com.ng/jobs/view/food-beverage-service-expert-job-at-marriott-international",
    "pubDate": "Thu, 12 Jun 2025 14:15:57 GMT",
    "source": "JobGurus",
    "keyword": "marriott international",
    "duplicate": false,
    "classifications": [],
    "content": "Marriott International is a leading global Lodging company based in Bethesda, Maryland, USA, with more than 4,100 properties in 79 countries and reported revenues of nearly $14 billion in fiscal year 2014. Its heritage can be traced to a root beer stand opened in Washington, D.C., in 1927 by J. Willard and Alice S. Marriott.\n\nMarriott has more than 361,000 people working worldwide at managed or franchised properties and corporate offices. Marriott has been consistently recognized as a top employer and for its superior business ethics. The company also manages the award-winning guest loyalty program, Marriott Rewards® and The Ritz-Carlton Rewards® program, which together surpass 49M members.\n\nWe are recruiting to fill the position below:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Position: Food & Beverage Service Expert\n\nJob ID: 25095397\nJob Location: Owerri, Imo\nPosition Type: Full Time\n\nDescription\n\n\n\tOur jobs aren’t just about putting food on the table that our guests will enjoy until they ask for their bill.\n\tInstead, we want to build an experience that is memorable and unique – with food and drinks on the side.\n\tOur Guest Service Experts take the initiative and deliver a wide range of services to make sure that guests enjoy their meal.\n\tWhether setting tables, communicating with the kitchen, interacting and serving guests, or cleaning work areas and supplies, the Guest Service Expert makes transactions feel like part of the experience.\n\tNo matter what position you are in, there are a few things that are critical to success – creating a safe workplace, following company policies and procedures, upholding quality standards, and ensuring your uniform, personal appearance, and communications are professional.\n\tGuest Service Experts will be on their feet and moving around (stand, sit, or walk for an extended time; moving over sloping, uneven, or slippery surfaces), managing the menu (read and visually verify information), and taking a hands-on approach to work (move, lift, carry, push, pull, and place objects weighing less than or equal to 25 pounds without assistance and 50 pounds with assistance; reach overhead and below the knees, including bending, twisting, pulling, and stooping).\n\tDoing all these things well (and other reasonable job duties as requested) is critical for Guest Service Experts – to get it right for our guests and our business each and every time.\n\n\nPreferred Qualifications\n\n\n\tEducation: High school diploma or G.E.D. equivalent.\n\tRelated Work Experience: Less than 1 year of related work experience.\n\tSupervisory Experience: No supervisory experience.\n\tLicense or Certification: None\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Quality, Health, Safety, Security and Environment (QHSSE) Cordinator Job at Well Fluid Services Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/quality-health-safety-security-and-environment-qhsse-cordinator-job-at-well-fluid-services-limited",
    "pubDate": "Thu, 12 Jun 2025 14:15:57 GMT",
    "source": "JobGurus",
    "keyword": "well fluid services limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Well Fluid Services Limited is an indigenous Oil and Gas Service company established in 2001. We deliver Technical Services to the Oil and Gas Industries across Africa.\n\nWe are recruiting to fill the position below:\n\nJob Position: Quality, Health, Safety, Security and Environment (QHSSE) Cordinator\n\nJob Location: Port Harcourt, Rivers\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tImplementation of pre-task planning tools: (Job Safety Analysis, Tool Box Talk, etc.)\n\tImplementation of proactive tools (Bsafe Cards, Stop Work, Near Miss reporting.)\n\tAssist in Shorebase induction, delivery, and coaching including Safety Takes Me Home deployment.\n\tParticipate in day-to-day incident management, including incident investigation.\n\tConducting ‘QHSE campaigns’ for onshore facilities and assisting in campaign application onboard vessels\n\tMaintain shore-based incidents databases including; Incident reports, Investigation reports, Medical reports , Witness statements, TaprootSnap Charts, Corrective action plans, Photos, drawings/sketches, etc\n\tCoordinate shore base drills according to the drill matrix contained in the Emergency Response Procedure for Onshore facilities.\n\tIdentify gaps and training needs for Emergency Response Teams and communicate the same to the management for implementation.\n\tConduct monthly inspections at the guest houses accommodating staff and highlighting areas of improvement with feedback to the management.\n\tCollate all general and client-specific monthly and weekly QHSE statistics.\n\tMaintain shore medical facility including first aid box.\n\tUpdate all records including HSE statistics on, offshore visits, client meetings, etc.\n\tConduct Risk Assessment at shore base locations and develop action plan for effective close-out of any identified gaps and updating the JSAs whenever required.\n\tConduct daily walk-round inspection of Shorebase facilities and carry out “hazard hunt’\n\tOrganise shore base safety meetings/training, inductions, seminars, campaigns, QHSE departmental, etc as Indicated in the QHSE Plan or as instructed by the QHSE Manager\n\n\nQualifications\n\n\n\tBachelor's Degree in occupational health and safety, Environmental Science, Engineering, or a related field.\n\tA minimum of 7 years of experience in HSE management.\n\t5 years and above minimum experience in HSE in a multinational.\n\tA Master’s Degree in a relevant field will be an added advantage\n\tStrong knowledge of HSE regulations and best practices.\n\tProven ability to conduct risk assessments and develop mitigation strategies.\n\tNEBOSH IGC or ISPON certification.\n\tExcellent communication, leadership and interpersonal skills.\n\tProficiency in Microsoft Office applications.\n\tEffective negotiation, conflict resolution and strong influencing abilities.\n\tDemonstrated ability to lead teams and foster cooperation to achieve safety objectives.\n\n\nSkills:\n\n\n\tRisk Assessment\n\tIncident Investigation\n\tEmergency Response\n\tSoftware Proficiency\n\tHazard Identification\n\tSafety Audits\n\n\nSoft Skills:\n\n\n\tCommunication Skills\n\tInterpersonal Skills\n\tProblem-Solving Skills\n\tAttention to Detail\n\tContinual Improvement\n\tAdaptability\n\tCollaboration.\n\tAnalytical Skills\n\tLeadership Skills\n\tOrganizational Skills\n\n\nSalary\nN250,000 - N300,000 Monthly.\n\nMethod of Application\n\nInterested and qualified candidates should send their CV to: humanresource@wellfluidservices.com using the Job Position as the subject of the mail\n\nApplication Deadline  13th June, 2025.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Front Desk Officer Job at Coronation Insurance Plc",
    "link": "https://www.jobgurus.com.ng/jobs/view/front-desk-officer-job-at-coronation-insurance-plc",
    "pubDate": "Thu, 12 Jun 2025 14:15:57 GMT",
    "source": "JobGurus",
    "keyword": "coronation insurance plc",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Coronation is a leading financial service partner that helps build enduring legacies for sustainable wealth creation in Africa. Having established a 30-year record of achievements in banking across Africa and beyond, our founders established a Pan-African platform focused on building a better financial future for Africa. Today, our businesses are entrusted with our over $1billion of clients’ assets and are recognized as Nigeria's fastest-growing investment managers. Our purpose at Coronation is to create a prosperous future for our clients and the African continent. Coronation is proud to be an Equal Opportunity Employer. We enable an inclusive workplace by identity, disability, and other statuses protected by law.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nCoronation Insurance Plc is an affiliated company to Coronation Group Limited which is a leading insurance provider of a diverse range of products and services covering general and special risk businesses to individuals and corporate entities.\n\nWe are recruiting to fill the position below:\n\nJob Position: Front Desk Officer\nJob Location: Lagos\nEmployment Type: Full-time\n\nKey Duties and Responsibilities\n\n\n\tAttend to visitors and clients in a courteous and professional manner.\n\tReceive incoming calls and direct them to the appropriate parties.\n\tMaintain a professional and friendly office environment, ensuring that visitors and employees receive excellent service.\n\tMaintain a clean and organized front desk area, adhering to company standards.\n\tMaintain a high level of customer service, ensuring that all interactions are professional, friendly, and courteous.\n\tReceive and direct visitors, clients, and employees to the relevant personnel or departments.\n\tMaintain confidentiality & handle sensitive information appropriately.\n\tProvide information and assistance to clients, visitors, and employees, responding to their queries and resolving issues.\n\n\nKey Requirements\nEducation and Work Experience: \n\n\n\tA minimum of a Bachelor's Degree in Business Administration or a related field.\n\tMinimum of two years’ experience in office administration or related field.\n\n\nSkills and Competencies:\n\n\n\tExcellent communication, multitasking, and organizational skills.\n\tHigh level of attention to detail and accuracy.\n\tAbility to maintain confidentiality and handle sensitive information.\n\tProficient in the use of computer applications such as Microsoft Office Suite.\n\tAbility to work independently and as part of a team in a fast-paced environment.\n\n\nMethod of Application\n\nInterested and qualified candidates should send their CV to: careers@coronationinsurance.com.ng using the Job Position as the subject of the email    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Senior Financial Accountant Job at Swift Networks Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/senior-financial-accountant-job-at-swift-networks-limited",
    "pubDate": "Thu, 12 Jun 2025 14:15:57 GMT",
    "source": "JobGurus",
    "keyword": "swift networks limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Our company, Swift Networks, is an Indigenous Internet Service Provider Company with outlets spread all over Lagos State. Our core services are the provision of high-speed internet services, telephony and IP - VPN services to both residential and enterprise subscribers.\n\nWe are recruiting to fill the position below:\n\nJob Position: Senior Financial Accountant \n\nJob Location: Victoria Island, Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThis is a full-time on-site role located in Lagos for a Senior Financial Accountant at Swift Networks Limited. \n\tThe Senior Financial Accountant will be responsible for financial statements, analytical tasks, finance-related activities, utilising accounting software, and financial reporting.\n\n\nResponsibilities\n\n\n\tPrepare monthly, quarterly and annual financial statements and management reports\n\tMaintain and reconcile the general ledger and oversee daily accounting operations\n\tManage accounts payable and receivable, payroll processing and statutory deductions\n\tPerform monthly bank and cash reconciliations and monitor company cash flow\n\tTake full ownership offinancial control, including budget management, cost control and variance analysis\n\tLead annual budgeting and support financial forecasting activities\n\tEnsure timely compliance with FIRS, LIRS and other regulatory requirements\n\tCollaborate with external auditors and tax consultants as needed\n\tMaintain the fixed asset register and manage depreciation schedules\n\tReview and improve internal accounting processes, policies and controls.\n\n\nQualifications\n\n\n\tBachelor's Degree in Accounting, Finance, or a related field (Second Class Upper/HND Upper Credit is a must)\n\tProfessional certification in Accounting (e.g., ICAN, CPA, ACCA)\n\tFinancial Statements and Financial Reporting skills\n\tAnalytical Skills\n\tExperience in Finance and Accounting Software\n\tStrong attention to detail and accuracy\n\tAbility to work well under pressure and meet deadlines\n\tFinance or any related field from a reputable Nigerian or international institution.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hr@swiftng.net using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Fraud Investigations Officer Job at Moniepoint",
    "link": "https://www.jobgurus.com.ng/jobs/view/fraud-investigations-officer-job-at-moniepoint",
    "pubDate": "Thu, 12 Jun 2025 14:15:57 GMT",
    "source": "JobGurus",
    "keyword": "moniepoint",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Moniepoint Incorporated is a global business payments and banking platform and recently became QED Investors’ first investment in Africa. We are the partner of choice for over 600,000 businesses of all sizes, powering the dreams of SMBs and providing them with equal access to the tools they need to grow and scale.\n\nWe are recruiting to fill the position below:\n\nJob Position: Fraud Investigations Officer\n\nJob Location: Lagos, Nigeria\n\nAbout the Role\nAs a Fraud Investigations & Recovery Officer, you would:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tConduct in-depth analysis of suspicious transactions, including fraudulent inflows, outflows, and unauthorized activities, using transaction patterns, KYC details, and historical fraud reports.\n\tReview flagged accounts, place liens on fraudulent transactions, and ensure compliance with regulatory and legal requirements for sustaining restrictions.\n\tWork with the legal team to process court orders, counter-court orders, and regulatory requests from the CBN, EFCC, NDIC, and NPF, ensuring the proper handling of fraud-related cases.\n\tAssists in recovering fraudulently transferred funds, escalates confirmed fraud cases to the Fraud Recovery Team, and collaborates with banks to pursue reversals.\n\tContinuously review high-risk transactions and accounts, blacklists or watchlists of fraud-linked BVNs, and recommends improvements in fraud detection strategies.\n\tEnsure compliance with financial regulations, document findings, prepare reports on fraud trends, and provide insights to strengthen fraud prevention measures.\n\tCollaborate with internal teams, educate stakeholders on fraud risks, and provide training on emerging fraud patterns and mitigation strategies.\n\n\nQualifications\n\n\n\tBachelor's Degree in a relevant field (such as Accounting, Business Administration, Computer Science, IT, Information Security, Economics). Relevant accounting or security certifications such as ACA, CFE, Security+ is an added advantage.\n\n\nExperience:\n\n\n\t2 - 4 years of experience in transaction monitoring, customer service, fraud investigation or fraud examination with proficiency in using fraud detection software and tools in Banking, Finance, FMCG, Insurance, or FinTech industries. A combination of any two or more experience(s) is a strong advantage.\n\n\nCompetencies:\n\n\n\tStrong understanding of payment transaction trends and account statement analysis.\n\tAn excellent team player, target driven, and highly motivated.\n\tExcellent analytical and problem-solving skills.\n\tExcellent understanding of transaction routing and processing.\n\tStrong verbal, speaking and written communication and interpersonal skills.\n\tExcellent time management skills\n\tKnowledge of banking or FinTech industry regulations or standards may be necessary.\n\n\n \n\nWhat to expect in the hiring process\n\n\n\tA preliminary phone call with the recruiter\n\tA technical panel interview with Department Leads\n\tA behavioral and technical interview with a member of the Executive team\n\tAll interviews stages are Virtual\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]