[
  {
    "title": "Administrative Officer Job at Moniepoint",
    "link": "https://www.jobgurus.com.ng/jobs/view/administrative-officer-job-at-moniepoint",
    "pubDate": "Thu, 26 Jun 2025 15:41:46 GMT",
    "source": "JobGurus",
    "keyword": "moniepoint",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Moniepoint Incorporated is a global business payments and banking platform and recently became QED Investors’ first investment in Africa. We are the partner of choice for over 600,000 businesses of all sizes, powering the dreams of SMBs and providing them with equal access to the tools they need to grow and scale.\n\nWe are recruiting to fill the position below:\n\nJob Position: Administrative Officer\n\nJob Location: Port Harcourt, Rivers\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Administrator ensures smooth and standardized administrative operations in the assigned state.\n\tThis role is responsible for correspondence handling, facilities maintenance, inventory control, and workspace management, ensuring Moniepoint’s offices operate efficiently and safely.\n\tThe ideal candidate is detail-oriented, proactive, and capable of driving consistent service quality across diverse functions.\n\n\nResponsibilities\n\n\n\tAdministrative Coordination: Manage administrative processes including correspondence handling, filing systems, office documentation, and internal communications. Ensure timely dissemination and tracking of internal and external correspondence while maintaining compliance with organizational standards.\n\tFacility Management: Oversee upkeep of the office infrastructure, including generators, meters, water dispensers, and cleaning services. Track utility consumption, implement scheduled maintenance, and resolve emerging facility issues while ensuring a safe and hygienic work environment.\n\tOffice Experience & Support Services: Maintain a functional and professional workspace by coordinating logistics for meetings, ensuring availability of supplies (e.g., CWAY water, stationery), and supervising daily operations. Collaborate with staff to meet facility-related needs and gather feedback for continuous improvement.\n\tInventory Oversight: Maintain accurate inventory records, monitor stock levels, and coordinate timely replenishment of consumables and equipment. Implement controls to minimize loss and optimize usage while ensuring effective vendor liaison and documentation.\n\tInternal Control & Compliance: Implement administrative control systems, including checklists, inspection routines, and SOP compliance monitoring. Conduct periodic audits to identify gaps, ensure policy adherence, and support risk mitigation across administrative functions.\n\tPerformance Reporting: Generate weekly and monthly reports on correspondence trends, facility conditions, inventory status, and control implementation. Provide actionable insights to improve efficiency, cost management, and service delivery.\n\n\nRequirements\n\n\n\tBachelor’s Degree in Business Administration, Public Administration, or related field.\n\tMinimum of 4 years of experience in administrative, office, or facilities management roles.\n\tProficiency in Microsoft Office Suite and documentation systems.\n\tStrong communication, organizational, and interpersonal skills.\n\tFamiliarity with inventory systems and facilities maintenance planning.\n\tAbility to multitask and manage operations across diverse functions independently.\n\n\nWhat to expect in the hiring process:\n\n\n\tA preliminary phone call with the Recruiter\n\tAn interview with the Hiring Manager\n\tAn interview with a member of our Executive team. \n\n\nBenefits \n\n\n\tCulture -We put our people first and prioritize the well-being of every team member. We’ve built a company where all opinions carry weight and where all voices are heard. We value and respect each other and always look out for one another. Above all, we are human.\n\tLearning - We have a learning and development-focused environment with an emphasis on knowledge sharing, training, and regular internal technical talks.\n\tCompensation - You’ll receive an attractive salary, pension, health insurance, annual bonus, plus other benefits.\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Banker, Business Job at Stanbic IBTC Bank",
    "link": "https://www.jobgurus.com.ng/jobs/view/banker-business-job-at-stanbic-ibtc-bank-1",
    "pubDate": "Thu, 26 Jun 2025 15:41:46 GMT",
    "source": "JobGurus",
    "keyword": "stanbic ibtc bank",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Stanbic IBTC Bank is a leading African banking group focused on emerging markets globally. It has been a mainstay of South Africa's financial system for 150 years, and now spans 16 countries across the African continent.\n\nStandard Bank is a firm believer in technical innovation, to help us guarantee exceptional client service and leading edge financial solutions. Our growing global success reflects our commitment to the latest solutions, the best people, and a uniquely flexible and vibrant working culture. To help us drive our success into the future, we are looking for resourceful individuals to join our dedicated team at our offices.\n\nWe are recruiting to fill the position below:\n\nJob Position: Banker, Business\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Ref ID: 80428268A-0001\nJob Location: Port Harcourt Road, Enugu\nJob type: Full-time\nBusiness Segment: Business & Commercial Banking\n\nJob Description\n\n\n\tStanbic IBTC is positioned to continue to build capacity and create a sustainable talent pipeline within the organization. The organization is running a recruitment exercise for Relationship Managers to manage its existing portfolio of clients, while onboarding new clients/businesses.\n\tThe key responsibilities listed below, show the required knowledge for sales and relationship management roles. Please send in your application if you have any knowledge of or interests in managing relationships and if you meet all the criteria required for this role.\n\n\nQualifications\n\n\n\tFirst Degree in any field with 3 - 6 years of experience\n\tCognate experience in sales and relationship management of customers to be able to drive profitability and build relationships\n\tExperience within the financial industry with experience in managing small businesses.\n\n\nAdditional Information:\nBehavioural Competencies:\n\n\n\tGenerating Ideas\n\tDeveloping Strategies\n\tInterpreting Data\n\tConvincing People\n\tTeam Working\n\n\nTechnical Competencies:\n\n\n\tCustomer Understanding\n\tProduct Knowledge\n\tApplication and Submission Verification\n\tAccount opening and maintenance\n\tProduct Related Systems\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Logistics Officer Job at Goonite (NG) Hygiene Product FZE",
    "link": "https://www.jobgurus.com.ng/jobs/view/logistics-officer-job-at-goonite-ng-hygiene-product-fze-1",
    "pubDate": "Thu, 26 Jun 2025 15:41:46 GMT",
    "source": "JobGurus",
    "keyword": "goonite (ng) hygiene product fze",
    "duplicate": false,
    "classifications": [],
    "content": "Goonite (NG) Hygiene Product FZE, a major manufacturer and distributor company in the FMCG Distribution Sector for premium brands in the Health and Personal Care category like Lebrace Diaper and Besense Sanitary Pads meeting household needs in a vastly diversified demography.\n\nWe are recruiting to fill the position below:\n\nJob Position: Logistics Officer\n\nJob Location: Ibeju-Lekki, Lagos\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWill be responsible for onboarding credible transporters with high emphasis on cost reduction/control.\n\tUnderstand the types and qualities of trucks required for shipment.\n\tWill be responsible for following up with transporters regarding truck bookings and transit issues.\n\tMust ensure that the respective expected time of arrivals are met.\n\tMust ensure trucks arrivals are timely and trucks offload without shortages\n\tMust have a good understanding of the parameters that affect rate fluctuation.\n\tMust be abreast of the rate for various locations.\n\tCollaborating with Sales Managers to optimize shipping routes for efficient results.\n\tProvide excellent customer service to internal and external stakeholders, addressing any concerns or questions related to shipments.\n\n\nRequirements\n\n\n\tHND or BSc in any related field.\n\tMust have 1 - 2 Years of working experience in same role.\n\tMust have worked in the FMCG Industry Preferably Diaper & Sanitary Pad companies.\n\tExcellent communication and analytical skills.\n\tProficient with Microsoft Office Suite or related software.\n\tMust reside within Ibeju-Lekki and it immediate environs.\n\n\nInterested and qualified candidates should send their updated CV to: estherajideofficial@gmail.com using the Job Position as the subject of the email.\n\nNote: Only qualified candidates who lives in the above location will be contacted.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Training Manager Job at RSIN Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/training-manager-job-at-rsin-group",
    "pubDate": "Thu, 26 Jun 2025 15:41:46 GMT",
    "source": "JobGurus",
    "keyword": "rsin group",
    "duplicate": false,
    "classifications": [],
    "content": "RSIN was founded in 2003 and is headquartered in Fuzhou, Fujian Province. We mainly conduct business in Nigeria and other western African countries. Over the past 20 years of development, we have become a multinational corporation with diversified industrial clusters of iron and steel, textile, fiber chemical and lead-acid battery manufacturing based on the construction of circular economy industrial park.\n\nWe are recruiting to fill the position below:\n\nJob Position: Training Manager\nJob Locations: Abuja (FCT), Lagos\nEmployment Type: Full-time\n\nJob Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tBased on the company's business objectives and employee needs, develop a training plan and ensure its implementation.\n\tDesign and develop various training programs, including new employee onboarding training, skill enhancement training, leadership development training, etc.\n\tRegularly communicate with various departments to understand their training needs, and analyze and organize them.\n\tComplete other tasks assigned by the leader.\n\n\nJob Requirements\n\n\n\tBachelor's Degree or above, with priority given to majors related to Human Resource Management, Enterprise Management, etc.\n\tAt least 3 years of training work experience, and at least 3 years of training manager/supervisor or related position experience.\n\tFamiliar with training processes and methods, possessing good course design, evaluation, and implementation abilities.\n\tGood communication and coordination skills and teamwork spirit.\n\tProficient in using office software and training related software.\n\t25 - 35 years old, in good health and without any bad habits.\n\n\nMethod of Application\nInterested and qualified candidates should send their Application / CV to: rsingrouphr@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Human Resources Manager Job at SAHA Africa",
    "link": "https://www.jobgurus.com.ng/jobs/view/human-resources-manager-job-at-saha-africa",
    "pubDate": "Thu, 26 Jun 2025 15:41:46 GMT",
    "source": "JobGurus",
    "keyword": "saha africa",
    "duplicate": false,
    "classifications": [],
    "content": "At SAHA Africa, we are dedicated to elevating the hospitality industry by connecting businesses with top-tier talent and providing comprehensive training for hospitality professionals. With years of experience in the industry, we specialize in recruitment services that help hotels, restaurants, and hospitality establishments find skilled and passionate staff. Our extensive network and deep understanding of the sector ensure that we match the right talent with the right opportunities, helping businesses thrive.\n\nWe are recruiting to fill the position below:\n\nJob Position: Human Resources Manager\n\nJob Location: Lagos\nJob Type: Full Time\n\nAbout the Role\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAs the HR Manager, you will play a key role in overseeing staff recruitment, onboarding, training, welfare, and performance management. You’ll work closely with management to ensure a productive, professional, and people-centered workplace.\n\n\nWhat You’ll Do\n\n\n\tLead end-to-end recruitment, onboarding, and orientation processes.\n\tCoordinate training and development programs tailored to hospitality staff.\n\tSupport team performance management and employee engagement.\n\tManage HR documentation, schedules, and compliance with labor laws.\n\tFoster a positive work environment and mediate staff concerns effectively.\n\tOversee policy implementation and maintain proper HR systems.\n\n\nWhat We’re Looking For\n\n\n\tA certified HR professional (CIPM, PHRi, or equivalent).\n\tMinimum of 5 years of HR experience, ideally in the hospitality sector.\n\tStrong understanding of Nigerian labor laws and HR best practices.\n\tExceptional communication, people, and leadership skills.\n\tOrganized, proactive, and able to thrive in a fast-paced environment.\n\n\nMethod of Application\nInterested and qualified candidates should send their CVs to: hr@sahaafrica.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]