[
  {
    "title": "HR / Business Manager Job at Aeroport Travels and Tours Limited (ATTL)",
    "link": "https://www.jobgurus.com.ng/jobs/view/hr-business-manager-job-at-aeroport-travels-and-tours-limited-attl",
    "pubDate": "Tue, 17 Jun 2025 11:37:40 GMT",
    "source": "JobGurus",
    "keyword": "aeroport travels and tours limited (attl)",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Aeroport Travels and Tours Ltd is a full fledged travel management company located in Lagos, Nigeria. At ATTL, we strive to provide our customers with the very best service in the industry today\n\nWe are recruiting to fill the position below:\n\nJob Position: HR / Business Manager\n\nJob Location: Oshodi / Ajao Estate, Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe HR/Business Manager will play a crucial role in ensuring the smooth functioning of the organization, including financial management, organizational development, performance management, compensation and benefits and employee relations.\n\n\nKey Responsibilties\nFinancial Management:\n\n\n\tManage the company's finances, including budgeting, accounting, and financial reporting.\n\tDevelop and implement financial policies and procedures to ensure compliance and transparency.\n\tWork closely with the Business Development teamto oversee revenue generation, meeting and exceeding sales targets.\n\tMonitor expenses, analyze financial data, and provide regular reports to the MD/CEO.\n\n\nOrganizational Development:\n\n\n\tOversee day-to-day operations and administrative functions of the company.\n\tImplement policies and procedures to optimize efficiency and productivity.\n\tFoster a positive and inclusive work environment that promotes teamwork and collaboration.\n\n\nRecruitment and Staffing:\n\n\n\tIdentify staffing needs in different departments\n\tDevelop Job descriptions and post job vacancies\n\tConduct interviews and select qualified candidates\n\tOversee the onboarding process for new employees.\n\n\nCollaboration:\n\n\n\tWork closely with department heads and management to align HR strategies with business objectives\n\tServe as intermediary between the CEO and department heads.\n\n\nPerformance Management:\n\n\n\tImplement performance appraisal systems and set performance goals\n\tProvide feedback and coaching to employees for continuous improvement\n\tProactively identify talent gaps and make plans to overcome them.\n\n\nCompensation And Benefits:\n\n\n\tManage payroll, including processing wages and addressing payroll inquiries\n\tAdminister employee benefits, such as healthcare\n\tOversee pay distributions to employees.\n\n\nEmployee Relations:\n\n\n\tFoster a positive workplace culture that promotes employee satisfaction and retention\n\tAddress employee concerns and grievances effectively\n\tPromote open communication channels within the organization.\n\n\nRequirements\n\n\n\tMinimum of a Bachelor's Degree in Human Resources, Business Administration, Management, Finance, or related fields with 4 - 5 years work experience\n\tStrong financial management skills, including budgeting, financial analysis, and reporting.\n\tExcellent leadership abilities with a track record of building and leading high-performing teams.\n\tStrategic thinker with the ability to develop and execute effective plans and initiatives.\n\tExcellent communication and interpersonal skills, with the ability to engage diverse stakeholders.\n\n\nSalary\nN300,000 - N350,000 monthly. \n\nMethod of Application\nInterested and qualified candidates should send their CV to: jobs@aeroporttravels.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Administrative Officer I Job at University of Nigeria, Nsukka (UNN)",
    "link": "https://www.jobgurus.com.ng/jobs/view/administrative-officer-i-job-at-university-of-nigeria-nsukka-unn",
    "pubDate": "Tue, 17 Jun 2025 11:37:40 GMT",
    "source": "JobGurus",
    "keyword": "university of nigeria, nsukka (unn)",
    "duplicate": false,
    "classifications": [],
    "content": "The University of Nigeria, commonly referred to as UNN, is a federal university located in Nsukka, Enugu State, Eastern part of Nigeria. Founded by Nnamdi Azikiwe in 1955 and formally opened on 7 October 1960, the University of Nigeria has three campuses in Enugu State– Nsukka, Enugu, and Ituku-Ozalla.\n\nThe University of Nigeria is the first full-fledged indigenous and first autonomous university in Nigeria, modelled upon the American educational system. It was the first land-grant university in Africa and one of the five most reputed universities in Nigeria. The university has 17 Faculties and 102 academic departments. The university offers 108 undergraduate programs and 211 postgraduate programmes.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nApplications are invited from suitable candidates to fill the position below:\n\nJob Position: Administrative Officer I - CONTISS 8\n\nJob Ref.: UNP/SSR.37/06/25\nJob Location: Nsukka, Enugu\n\nRequirements\n\n\n\tCandidates should possess a good Honours Degree of not below Second-class Lower Division (2') plus minimum three (3) years post qualification cognate experience in University.\n\n\nMethod of Application\nInterested and qualified candidates should submit 25 (Twenty-Five) copies of their Application, accompanied with a detailed Curriculum Vitae and copies of each certificate claimed, giving the following details in STRICT ORDER:\n\n\n\tFull Name with surname first\n\tPost Desired\n\tDate and Place of Birth\n\tPermanent Home Address\n\tContact Address\n\tPhone No. and Email Address\n\tSex\n\tLocal Government and State of Origin\n\tAge\n\tNationality\n\tMarital Status\n\tNumber and ages of Children (if any)\n\tEducational Institutions attended with dates\n\tAcademic and Professional qualifications obtained with dates\n\tWorking experience\n\tList of Publications (if any), with relevant details\n\tEvidence of Community Services\n\tPresent Employer\n\tStatus and salary\n\tExtra-Curricular activities\n\tAddresses of three(3) referees.\n\n\nAll applications, together with Referee reports and NYSC certificate or exemption, are to be submitted under confidential cover marked \"Administrative Officer I\" to:\nThe Registrar,\nUniversity of Nigeria, Nsukka (UNN),\nNsukka, Enugu State.\n\nElectronic copies of the application should be sent to: personnel.unn@unn.edu.ng using the Job Position as the subject of the email\n\nNote: Applications not received by the time and date stated above will not be accepted.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Data Entry / Processing Officer Job at University of Nigeria, Nsukka (UNN)",
    "link": "https://www.jobgurus.com.ng/jobs/view/data-entry-processing-officer-job-at-university-of-nigeria-nsukka-unn",
    "pubDate": "Tue, 17 Jun 2025 11:37:40 GMT",
    "source": "JobGurus",
    "keyword": "university of nigeria, nsukka (unn)",
    "duplicate": false,
    "classifications": [],
    "content": "The University of Nigeria, commonly referred to as UNN, is a federal university located in Nsukka, Enugu State, Eastern part of Nigeria. Founded by Nnamdi Azikiwe in 1955 and formally opened on 7 October 1960, the University of Nigeria has three campuses in Enugu State– Nsukka, Enugu, and Ituku-Ozalla.\n\nThe University of Nigeria is the first full-fledged indigenous and first autonomous university in Nigeria, modelled upon the American educational system. It was the first land-grant university in Africa and one of the five most reputed universities in Nigeria. The university has 17 Faculties and 102 academic departments. The university offers 108 undergraduate programs and 211 postgraduate programmes.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nApplications are invited from suitable candidates to fill the position below:\n\nJob Position: Data Entry / Processing Officer\n\nJob Ref.: UNP/SSR.37/06/25\nJob Location: Nsukka, Enugu\n\nRequirements\n\n\n\t\n\tCandidates should possess WASC/GCE(O/L) in four credits or a minimum of three credits and two passes including Mathematics with special aptitude for computer operation.\n\t\n\n\nSalary Grade\nCONTISS 3\n\nMethod of Application\nInterested and qualified candidates should submit 25 (Twenty-Five) copies of their Application, accompanied with a detailed Curriculum Vitae and copies of each certificate claimed, giving the following details in STRICT ORDER:\n\n\n\tFull Name with surname first\n\tPost Desired\n\tDate and Place of Birth\n\tPermanent Home Address\n\tContact Address\n\tPhone No. and Email Address\n\tSex\n\tLocal Government and State of Origin\n\tAge\n\tNationality\n\tMarital Status\n\tNumber and ages of Children (if any)\n\tEducational Institutions attended with dates\n\tAcademic and Professional qualifications obtained with dates\n\tWorking experience\n\tList of Publications (if any), with relevant details\n\tEvidence of Community Services\n\tPresent Employer\n\tStatus and salary\n\tExtra-Curricular activities\n\tAddresses of three(3) referees.\n\n\nAll applications, together with Referee reports are to be submitted under confidential cover marked \"Data Entry / Processing Officer\" to:\nThe Registrar,\nUniversity of Nigeria, Nsukka (UNN),\nNsukka, Enugu State.\n\nElectronic copies of the application should be sent to: personnel.unn@unn.edu.ng using the Job Position as the subject of the email\n\nNote: Applications not received by the time and date stated above will not be accepted.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Personal Assistant Job at ODYSSEY HR Solutions",
    "link": "https://www.jobgurus.com.ng/jobs/view/personal-assistant-job-at-odyssey-hr-solutions",
    "pubDate": "Tue, 17 Jun 2025 11:37:40 GMT",
    "source": "JobGurus",
    "keyword": "odyssey hr solutions",
    "duplicate": false,
    "classifications": [],
    "content": "ODYSSEY HR Solutions is an independentHuman Resources (HR) consulting firm with focus on ‘People Management’ in organisations. We help oversee all HR-related aspects of an organisation using strategic HR Best-Practices and adhere to current employment laws geared towards enhancing organisational performance. Odyssey HR Solutions is duly registered with the Corporate Affairs Commission of Nigeria.\n\nWe are recruiting to fill the position below:\n\nJob Position: Personal Assistant\nJob Location: Ajah, Lagos\nEmployment Type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tSchedule and Calendar Management\n\tDraft, edit, and manage correspondence with accuracy and in line with the organisation’s objectives\n\tLiaise with both internal and external stakeholders to maintain effective communication at all times\n\tPrepare excellent presentations, reports, and briefing documents for meetings and events\n\tConduct research and compile data towards the support of decision-making in the organisation\n\tOversee cash flow management ensuring proper documentation and accountability\n\tMaintain records, reports, and documentation related to all office activities\n\tLipase with event organizers, protocol officers and other stakeholders for seamless execution of events\n\tParticipate in meetings and provide administrative support, including minute-takings and follow ups to ensure actions from the meetings are implemented appropriately\n\n\nQualification\n\n\n\tEducation: Bachelor’s degree in Business Administration, Public Administration, Communications or any related field\n\tExperience: 5-7years in an administrative role in an environmental sustainability, or corporate setting\n\n\nSkills:\n\n\n\tExcellent organizational and time management skills\n\tVerbal and written communication abilities\n\tProficiency in Microsoft Office Suite (Word, Excel, PowerPoint)\n\tFinancial management skills: Petty cashflow management and documentation\n\tBriefing and Presentations Skills\n\tDiscretion and confidentiality.\n\n\n \n\nNote: Only shortlisted candidates will be contacted in this process.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Business Development Executive Job at Aureole Consulting Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/business-development-executive-job-at-aureole-consulting-limited",
    "pubDate": "Tue, 17 Jun 2025 11:37:40 GMT",
    "source": "JobGurus",
    "keyword": "aureole consulting limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Aureole Consulting Limited is an HR consulting company which specialize in talent acquisition services, Outsourcing Services, Executive Search, Social Media Job Advertisement, HR consulting amongst other services. Our aim is to revolutionize HR consulting in Africa.\n\nWe are recruiting to fill the position below:\n\nJob Position: Business Development Executive\n\nJob Location: Lagos \nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a result-driven and dynamic Business Development Executive to help grow our business by identifying new opportunities, building and nurturing client relationships, and contributing to our overall growth strategy.\n\tThis role goes beyond traditional business development, requiring a strong grasp of digital marketing tools and strategies to generate leads, enhance brand visibility, and support targeted sales efforts in a data-driven manner.\n\n\nKey Responsibilities\n\n\n\tIdentify and develop new business opportunities across relevant markets.\n\tBuild and maintain strong relationships with potential clients.\n\tPresent our range of services to prospective clients.\n\tConduct market research and analyze competitor activity to find opportunities.\n\tManage the sales pipeline via CRM tools and prepare proposals and presentations.\n\tCollaborate with internal teams to align objectives and deliver value.\n\tUtilize digital marketing strategies (Google Ads, Facebook Ads, SEO) to support lead generation.\n\tRepresent the company at client meetings, industry events, and networking opportunities.\n\n\nQualifications\n\n\n\tBachelor's Degree in Business, Marketing, Real Estate, or a related field.\n\t3+ years of experience in business development, sales, or client relationship management, ideally in the construction or real estate sector.\n\tSolid understanding of digital marketing (social media, email campaigns, online ads,\n\tbasic SEO).\n\tProven ability to generate leads and close deals through both traditional and digital channels.\n\tStrong communication, negotiation, and presentation skills.\n\tProficient with CRM tools, Microsoft Office, and marketing platforms like Mailchimp, Meta Ads Manager, and Google Ads.\n\tKnowledge of real estate regulations, land acquisition, or construction processes is a plus.\n\n\nSalary\nN200,000 - N250,000 monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: careers@aureole.ng using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]