[
  {
    "title": "Project Quality Engineer Job at Karbak Ventures Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/project-quality-engineer-job-at-karbak-ventures-limited-1",
    "pubDate": "Thu, 19 Jun 2025 10:44:22 GMT",
    "source": "JobGurus",
    "keyword": "karbak ventures limited",
    "duplicate": false,
    "classifications": [],
    "content": "Karbak Ventures Limited (ISO NG19/90729) is an Engineering, Procurement and Construction Company, with approximately two decades of experience in Electro-Mechanical Projects for FMCG companies in West and East Africa. We have vast experience with plant/equipment installation of numerous sizes and complexity and we pride ourselves in the vast capacity built over the years in providing design, procurement and installation support to numerous FMCG firms such as Coca-Cola, Nigeria Breweries, Guinness, Friesland, PZ Wilmar, Murzah Wilmar (Tanzania), Kasapreko (Ghana), etc. and supports for OEMS such Sidel, KHS, Krones, Pentair, etc.\n\nWe are recruiting to fill the position below:\n\nJob Position: Project Quality Engineer\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Description\n\n\n\tWe are looking to hire a Project Quality Engineer to oversee all aspects of quality management for our projects.\n\tThe project quality engineer will be engaged in inspecting materials, processes, and products, ensuring compliance with new and existing quality standards and regulations, implementing quality management actions, and contributing to the development of company policies and procedures.\n\tThe project quality engineer shall provide quality support to projects from the planning phase to project completion.\n\n\nResponsibilities\n\n\n\tEnsuring compliance with the organization’s quality management system.\n\tDevelop and manage all welding-related documentation as required by clients and the organization’s procedures.\n\tMonitoring and reporting on all project activities, processes, and procedures.\n\tPerforming regular inspections of projects to ensure employees adhere to quality standards.\n\tAssisting with the development of company policies, processes, and procedures.\n\tDeveloping internal auditing tools and conducting internal quality audits and reports.\n\tDetermining data-driven solutions and implementing quality improvement plans.\n\tProviding projects with quality planning and support.\n\tConducting or assisting with regulatory and quality training sessions.\n\tPreparing and maintaining quality management documentation.\n\n\nRequirements\n\n\n\tA Degree in Engineering or any relevant course.\n\t2+ years of experience working with quality management systems\n\t2+ years of work experience in a steel fabrication environment\n\tProficiency in Microsoft Office and quality management systems\n\tExcellent communication, interpersonal, and public speaking skills\n\tExcellent decision-making and problem-solving skills\n\tStrong organizational skills.\n\n\nSalary\nN200,000 Monthly\n\nMethod of Application\nInterested and qualified candidates should send their CV to: recruitmentkarbakltd@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Social Media and Marketing Executive Job at Mara Cruiz Organics",
    "link": "https://www.jobgurus.com.ng/jobs/view/social-media-and-marketing-executive-job-at-mara-cruiz-organics",
    "pubDate": "Thu, 19 Jun 2025 10:44:22 GMT",
    "source": "JobGurus",
    "keyword": "mara cruiz organics",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Mara Cruiz Organics is a Nigerian hair care brand specializing in natural, plant-based products designed for African hair textures.\n\nWe are recruiting to fill the position below:\n\nJob Position: Social Media and Marketing Executive\n\nJob Location: Surulere, Lagos\nEmployment Type: Full-time\n\nKey Responsibilities\nMedia Strategy & Planning:\n\n\n\tDevelop and implement media plans to increase brand awareness and drive engagement.\n\tCoordinate media campaigns aligned with marketing goals and brand guidelines.\n\n\nContent Creation & Management:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tCreate engaging visual and written content for social media, blog, newsletter, and website.\n\tCollaborate with graphic designers, photographers, and videographers to produce high-quality content.\n\n\nSocial Media Management:\n\n\n\tManage the day-to-day running of all social media platforms (Instagram, Facebook, TikTok, etc.)\n\tSchedule posts, engage followers, respond to comments, and analyze performance metrics.\n\n\nMedia Buying & PR Coordination:\n\n\n\tCoordinate paid advertising campaigns (Google Ads, Meta Ads, influencer marketing, etc.)\n\tBuild relationships with media houses and influencers to secure press coverage and collaborations.\n\n\nAnalytics & Reporting:\n\n\n\tTrack and report on media and campaign performance using tools like Google Analytics, Meta Business Suite,\n\tRecommend adjustments based on insights and trends.\n\n\nRequirements\n\n\n\tInterested candidates should possess a Bachelor's / Master`s Degree / HND / OND / NCE qualification with 2 - 6 years of work experience.\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "HR Officer Job at Bricklane Consulting",
    "link": "https://www.jobgurus.com.ng/jobs/view/hr-officer-job-at-bricklane-consulting",
    "pubDate": "Thu, 19 Jun 2025 10:44:22 GMT",
    "source": "JobGurus",
    "keyword": "bricklane consulting",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Bricklane Consulting, a recruitment consulting firm, is recruiting suitable candidates to fill the position below:\n\nJob Position: HR Officer\n\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe are looking for a skilled HR Officer who will recruit, support and develop talent through developing policies and managing procedures.\n\tYou will be responsible for administrative tasks and you’ll contribute to making the company a better place to work.\n\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tSupport the development and implementation of HR initiatives and systems.\n\tProvide counseling on policies and procedures.\n\tBe actively involved in recruitment by preparing job descriptions, posting ads and managing the hiring process.\n\tAssist in performance management processes.\n\tSupport the management of disciplinary and grievance issues.\n\tCreate and implement effective onboarding plans.\n\tDevelop training and development programs.\n\tMaintain employee records (attendance, EEO data etc.) according to policy and legal requirements.\n\tReview employment and working conditions to ensure legal compliance.\n\n\nRequirements and Skills\n\n\n\tB.Sc / BA in Business Administration, Social Studies or relevant field; further training will be a plus.\n\tProven experience as HR officer, administrator or other HR position.\n\tKnowledge of HR functions (pay & benefits, recruitment, training & development etc.).\n\tUnderstanding of labor laws and disciplinary procedures.\n\tProficient in MS Office; knowledge of HRMS is a plus.\n\tOutstanding organizational and time-management abilities.\n\tExcellent communication and interpersonal skills.\n\tProblem-solving and decision-making aptitude.\n\tStrong ethics and reliability.\n\n\nSalary\nN350,000 / Month.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: bricklanerecruitment@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Front Desk Officer Job at Chrisvirgy Apartment",
    "link": "https://www.jobgurus.com.ng/jobs/view/front-desk-officer-job-at-chrisvirgy-apartment",
    "pubDate": "Thu, 19 Jun 2025 10:44:22 GMT",
    "source": "JobGurus",
    "keyword": "chrisvirgy apartment",
    "duplicate": false,
    "classifications": [],
    "content": "Chrisvirgy Apartment is a luxury service apartment located at Sirakoro Street, Wuse 2, Abuja. We specialize in delivering unrivalled hospitality services to our esteemed clients both locally and overseas. As a result of our avid commitment to customer satisfaction, we’ve designed a super comfortable and luxurious apartment that exudes class and replicates home. We’ve been able to achieve this tremendous feat owing to our unwavering commitment to ensuring that our clients get value for their money.\n\nWe are recruiting to fill the position below:\n\nJob Position: Front Desk Officer\n\nJob Location: Abuja (FCT)\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tPerform all check-in and check-out tasks\n\tManage online and phone reservations\n\tInform customers about payment methods and verify their credit card data\n\tRegister guests, collecting necessary information (like contact details and exact dates of their stay)\n\tLiaise with our housekeeping staff to ensure all rooms are clean, tidy and fully-\n\tfurnished to accommodate guests’ needs\n\tWelcome guests upon their arrival and assign rooms\n\tProvide information about our hotel, available rooms, rates and amenities\n\tRespond to clients’ complaints in a timely and professional manner\n\tConfirm group reservations and arrange personalized services for VIP customers and event attendees, like wedding guests\n\tUpsell additional facilities and services, when appropriate\n\tMaintain updated records of bookings and payments\n\n\nRequirements and Skills\n\n\n\tDegree in hotel management is a plus.\n\tWork experience as a Hotel Front Desk Agent, Receptionist or similar role\n\tExperience with hotel reservations software, like Cloudbeds and RoomKeyPMS\n\tUnderstanding of how travel planning websites operate, like Booking and TripAdvisor\n\tCustomer service attitude\n\tExcellent communication and organizational skills\n\n\nMethod of Application\nInterested and qualified candidates should send their CV / Resume and picture to: career@chrisvirgy.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Internal Control Officer Job at Ultimum Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/internal-control-officer-job-at-ultimum-limited",
    "pubDate": "Thu, 19 Jun 2025 10:44:22 GMT",
    "source": "JobGurus",
    "keyword": "ultimum limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Ultimum Limited is a fast-growing alcoholic & non-alcoholic Beverage’s manufacturing company and Nigerian-based subsidiary of Union Camerounaise de Brasseries – a leading Total Beverages Manufacturer with over 50 years presence and tremendous success in Cameroon; also, a proud sponsor of the 2024 African Cup of Nations (AFCON) in Abidjan. Ivory Coast. We are committed to developing quality products that satisfy all aspirations of our customers, and constantly innovating on ways to improve our products and deliver quality and special experience for our customers.\n\nWe are recruiting to fill the position below:\n\nJob Position: Internal Control Officer\n\nJob Location: Lagos\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nResponsibilities\n\n\n\tReview and appraise the soundness, effectiveness, and proper application of accounting and\n\tfinancial controls, compliance procedures and controls and timeliness of documentation generation\n\tIdentify the risks that a business faces and develop preventive strategies.\n\tReview Vendor creation, Customer Creation (Agreements), Credit setting for customers.\n\tReview Capex project briefs and compliance with procedures.\n\tReviewing of SOP from time to time.\n\tProvide training on policy and controls.\n\tCredit control (Receivables, staff float outstanding).\n\tField force expenses management and control.\n\tChecking of Consumptions vs Bill of Materials to detect and eliminate any shortages/pilferages.\n\tChecking the asset disposal bidding process.\n\tReviewing the Fixed assets register from time to time, a physical asset count exercise.\n\tSupervise the physical Stock Take for all locations (RM, WIP, PM, FG, Engg Spares, etc).\n\tChecking of payroll, such as overtime, leave allowance, incentives, etc.\n\tEvaluating SAP audit trail.\n\tTax and Regulatory Affairs: Ensure all tax and regulatory filings are made promptly.\n\n\nDesired Skills and Experience\n\n\n\tB.Sc Accounting, A.C.A, M.Sc in view.\n\t3-5 years of experience in the manufacturing industry and/or with an audit firm.\n\tAnalytical skills and a high level of attention to detail.\n\tExcellent Communication skills and perfect command of the English language.\n\tConversant with the SAP ERP system.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]