[
  {
    "title": "Quality Assurance / Quality Control Personnel Job at Prestigious Homes Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/quality-assurance-quality-control-personnel-job-at-prestigious-homes-limited",
    "pubDate": "Mon, 16 Jun 2025 18:49:25 GMT",
    "source": "JobGurus",
    "keyword": "prestigious homes limited",
    "duplicate": false,
    "classifications": [],
    "content": "Prestigious Homes Limited is a luxury-home builder, delivering homes to their owners just the way they envisioned it. We create incredible majestic homes with superior craftsmanship, exquisite architectural designs, and the finest interior finishing. We expand our clients' imagination to countless features and details that bear a distinctive elegance and sophistication. We believe every building must be environmentally friendly and green and our clients come back rejoicing.\n\nWe are recruiting to fill the position below:\n\nJob Position: Quality Assurance / Quality Control Personnel\n\nJob Location: Lekki Phase 1, Lagos.\nIndustry: Real Estate Development.\n\nDescription\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDo you have an eagle eye for detail and a firm grasp of construction standards and finishing excellence? We’re seeking a highly experienced QA/QC Engineer to oversee and enforce top-tier quality assurance and control across our sites.\n\n\nKey Responsibilities\n\n\n\tEnsure that all construction and finishing works meet approved quality standards and project specifications\n\tConduct routine inspections and audits on materials, workmanship, and processes\n\tEstablish QA/QC plans, site checklists, and standard documentation procedures\n\tMaintain detailed reports on site conditions, deviations, and corrective actions\n\tSupervise snag lists, punch lists, and ensure timely closures\n\tCollaborate closely with site engineers, architects, and subcontractors\n\tSupport handover processes with clear QA/QC documentation\n\n\nRequirements\n\n\n\tMinimum of 10 years of experience in a QA/QC role, especially in building construction and finishing\n\tStrong knowledge of building codes, structural detailing, finishes, and MEP coordination\n\tExperience working with premium projects and reputable companies in construction or real estate\n\tProficiency in QA/QC reporting tools and snagging software (e.g., Procore, PlanGrid, etc.)\n\tExcellent communication, documentation, and leadership skills\n\tMeticulous attention to detail, with a proactive mindset\n\n\nIdeal Candidate:\n\n\n\tHas a deep understanding of both structural works and interior finishes\n\tCan uphold quality under pressure and ensure zero-compromise delivery\n\tBrings a professional, no-shortcuts attitude to every stage of the project\n\n\nRemuneration\nAttractive and Competitive.\n\nMethod of Application\nInterested and qualified candidates should send their detailed Resume to: hr@prestigioushomeslimited.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Accountant Job at Excellent Jobs",
    "link": "https://www.jobgurus.com.ng/jobs/view/accountant-job-at-excellent-jobs-3",
    "pubDate": "Mon, 16 Jun 2025 18:49:25 GMT",
    "source": "JobGurus",
    "keyword": "excellent jobs",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Excellent Jobs is a consulting andrecruitment firm, dedicated to hiring and managing great talents for its clients.\n\nWe are recruiting to fill the position below:\n\nJob Position: Accountant\n\nJob Location: Magboro, Ogun\nEmployment Type: Full-time\n\nJob Description\n\n\n\tAs an Account Officer, you will play a crucial role in ensuring the financial health and compliance of our organization.\n\tYou will be responsible for managing financial transactions, maintaining accurate records, and collaborating with other departments to support the overall financial operations.\n\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tMaintain accurate and up-to-date financial records for the organization.\n\tRecord daily financial transactions, including expenses, revenue, and bank deposits.\n\tAssist in the preparation and management of budgets to ensure efficient financial planning and control.\n\tAssist in financial audits by providing relevant documentation and explanations to auditors.\n\tPrepare regular financial reports, including income statements, balance sheets, and cash flow statements, for management and stakeholders.\n\tInvestigate and explain discrepancies between budgeted and actual financial performance.\n\tAnalyze financial data to identify trends, variances, and opportunities for cost savings or revenue generation.\n\tPrepare and file tax returns, ensuring compliance with tax laws and regulations.\n\tHandle payroll activities, including calculating salaries, deductions, and tax withholdings.\n\tMonitor and control expenses to ensure they align with the budget and company policies.\n\tUse historical data and financial trends to forecast future financial performance.\n\tUtilize accounting software and tools to streamline financial processes and maintain data accuracy.\n\tEnsure compliance with accounting standards, laws, and regulations in financial reporting and transactions.\n\tManage cash flow by monitoring accounts receivable and payable and optimizing cash reserves.\n\tProvide financial advice and recommendations to management for decision-making, such as investment opportunities or cost-saving strategies.\n\n\nQualifications\n\n\n\tBachelor's Degree or its equivalent in accounting, finance, or a related field.\n\tProfessional certification such as Certified Public Accountant (CPA) or Chartered Accountant (CA).\n\tProficiency in accounting software (e.g., QuickBooks, SAP, Oracle) and Microsoft Excel.\n\tStrong analytical skills and attention to detail.\n\tKnowledge of relevant accounting principles and regulations.\n\tExcellent communication and interpersonal skills.\n\tAbility to work independently and as part of a team.\n\tEthical behavior and a commitment to maintaining confidentiality.\n\n\nRequired Skills:\n\n\n\tStrong analytical and problem-solving skills\n\tExcellent communication and interpersonal skills\n\tAttention to detail and accuracy\n\tOrganizational skills\n\tTime management skills\n\n\nSalary\nN120,000 - N150,000 / month.\n\nMethod of Application\nInterested and qualified candidates should forward their CV to: excellentjobs95@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "General Manager Job at Yemsays Properties and Investment Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/general-manager-job-at-yemsays-properties-and-investment-limited",
    "pubDate": "Mon, 16 Jun 2025 18:49:25 GMT",
    "source": "JobGurus",
    "keyword": "yemsays properties and investment limited",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance"
    ],
    "content": "Yemsays Properties and Investment Limited is a leading real estate firm based in Lagos, Nigeria, specializing in property development, investment, and marketing. We are committed to providing top-notch services that connect clients with the best real estate opportunities, ensuring transparency, innovation, and excellence in all our dealings. At Yemsays, we pride ourselves on our dynamic team, which works tirelessly to deliver exceptional results. We foster a collaborative and professional work environment where every team member’s input is valued and growth is encouraged.\n\nWe are recruiting to fill the position below:\n\nJob Position: General Manager\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Location: Ajah, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tAs our General Manager, you will drive the company’s sales growth, team performance, and operational execution, reporting directly to the CEO. This role requires a highly strategic thinker with strong leadership skills, industry experience, and the ability to drive results across all departments.\n\n\nKey Responsibilties\n\n\n\tOversee daily operations across departments (sales, marketing, admin, client relations)\n\tSet and monitor performance KPIs for the entire team\n\tLead and coordinate strategic property marketing campaigns\n\tSupervise real estate consultants, interns, and marketing officers\n\tYemsays Properties and Investment Limited\n\tRepresent the company at events, client meetings, and site inspections\n\tEnsure smooth project execution and timely delivery\n\n\nRequirements\n\n\n\tBachelor's Degree in Business Admin, Marketing, Estate Management, or similar (MBA is a plus)\n\tProven experience as a General Manager or senior leadership role in real estate marketing\n\tStrong leadership, sales, and administrative management skills\n\tExcellent communication, negotiation, and people management skills\n\tTech-savvy and comfortable with CRM tools, digital reporting, and collaboration software\n\tResides around Ajah, Sangotedo, Abraham Adesanya, or Lekki Axis.\n\n\nWhat We Offer\n\n\n\tCompetitive salary + performance bonuses\n\tSupportive leadership and growth opportunities\n\tDynamic work culture with a strong digital focus\n\tThe chance to lead and make real impact in a fast-growing real estate firm\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and a short cover letter explaining your fit for the role to: yemsaysproperties@gmail.com using the Job Position as the subject of the email (E:g \"General Manager Application – [Your Name]\").    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Reservation / Front Office Staff Job at Divine AG Solutions Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/reservation-front-office-staff-job-at-divine-ag-solutions-limited",
    "pubDate": "Mon, 16 Jun 2025 18:49:25 GMT",
    "source": "JobGurus",
    "keyword": "divine ag solutions limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Divine AG Solutions Limited (RC 1243335) was incorporated in 2015 to provide recruitment and outsourcing services in accordance with the terms agreed between us and our clients. Our goal is to meet the needs of our clients ranging from individual clients, government parastatals, corporate organizations, manufacturing companies, public sectors/organizations, hotels, churches as well as multinationals companies and corporations.\n\nWe are recruiting to fill the position below:\n\nJob Position: Reservation / Front Office Staff\n\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\n\nKey Responsibilities\nReservations Management:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tHandle room and restaurant reservations via phone, email, online booking platforms, and walk-ins.\n\tConfirm bookings, process payments or deposits, and send confirmation details.\n\tUpdate reservation systems with accurate booking data.\n\tMonitor room and table availability and avoid overbooking situations.\n\tCoordinate with housekeeping, maintenance, and restaurant staff for guest readiness.\n\n\nCustomer Service:\n\n\n\tGreet residents, guests, and diners warmly and assist with check-ins, check-outs, and seating.\n\tProvide information about apartment amenities, restaurant offerings, local attractions, and services.\n\tRespond to inquiries, concerns, or complaints in a courteous and professional manner.\n\tAssist with special requests such as early check-in, late check-out, dietary preferences, or event arrangements.\n\tRecord and report feedback to improve services.\n\n\nAdministrative Duties:\n\n\n\tMaintain accurate records of guest interactions, payments, and complaints.\n\tAssist with billing, invoicing, refunds, and basic accounting tasks when required.\n\tManage guest databases, including frequent visitor preferences and contact information.\n\tPrepare daily arrival/departure and reservation reports for management.\n\n\nCollaboration:\n\n\n\tWork closely with the housekeeping team to ensure rooms are ready for new guests.\n\tLiaise with the restaurant staff to coordinate reservations, private events, and peak-time planning.\n\tSupport marketing efforts by promoting special offers, events, or loyalty programs to guests.\n\n\nQualifications\n\n\n\tPrevious experience in reservations, front desk, or customer service (hotel or restaurant environment preferred).\n\tExcellent communication, interpersonal, and problem-solving skills.\n\tFluent in English; additional languages are a plus.\n\n\nKey Attributes:\n\n\n\tWarm and professional demeanor.\n\tAttention to detail and accuracy.\n\tAbility to multitask and stay calm under pressure.\n\tA proactive, team-oriented approach to guest satisfaction.\n\n\nSalary\nN100,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CVs to: divineagsolutionsltd@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Quality Control Officer Job at R & R Recruitment Services",
    "link": "https://www.jobgurus.com.ng/jobs/view/quality-control-officer-job-at-r-r-recruitment-services",
    "pubDate": "Mon, 16 Jun 2025 18:49:25 GMT",
    "source": "JobGurus",
    "keyword": "r & r recruitment services",
    "duplicate": false,
    "classifications": [],
    "content": "R & R Recruitment Services, a recruitment agency, training, consulting & human resources management company.\n\nWe are recruiting to fill the position below:\n\nJob Position: Quality Control Officer\n\nJob Location: Ajao Estate, Lagos\nEmployment Type: Full-time\nSlot: 3 Positions\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tConduct routine laboratory tests and inspections on raw materials and finished products\n\tEnsure compliance with industry standards and company procedures\n\tDocument and report quality issues, suggesting corrective actions\n\tSupport process improvement initiatives in the QC department.\n\n\nRequirements\n\n\n\tQualification: B.Sc. in Microbiology\n\tExperience: Minimum of 4 years in a related field.\n\n\nSalary\nN200,000 - N250,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: r2recruitmentservices@gmail.com using the Job Position as the subject of the email\n\nNote: For inquiries, send a WhatsApp message to: 09035411252.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]