[
  {
    "title": "Remote Virtual Assistant Job at Styaks Legal",
    "link": "https://www.jobgurus.com.ng/jobs/view/remote-virtual-assistant-job-at-styaks-legal",
    "pubDate": "Mon, 09 Jun 2025 11:37:36 GMT",
    "source": "JobGurus",
    "keyword": "styaks legal",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Styaks Legal - Our client is recruiting suitable candidates to fill the position below:\n\nJob Position: Remote Virtual Assistant\nJob Location: Abuja / Lagos / Abeokuta - Ogun / Ibadan - Oyo (Remote)\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tOur client is looking for a sharp, reliable, and detail-oriented Virtual Assistant to support their dynamic consulting and compliance practice.\n\tThis is a remote role, open to qualified candidates based in Abuja, Lagos, Abeokuta - Ogun &  Ibadan - Oyo\n\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tManage calendars, meetings, and professional correspondence using Outlook\n\tMaintain organized client records and workflows in HubSpot CRM\n\tPrepare and format reports, presentations, and documents using PowerPoint, Word, and Excel\n\tCoordinate and manage files and folders using SharePoint\n\tAssist with internal communications, follow-ups, and task tracking\n\tProvide day-to-day virtual support to the leadership and consulting teams.\n\n\nRequired Skills & Experience\n\n\n\tProficient in SharePoint for document management and collaboration\n\tExperience using HubSpot or similar CRM platforms\n\tStrong Microsoft Office skills (Outlook, Word, Excel, PowerPoint)\n\tPrevious experience supporting consulting, compliance, or legal professionals\n\tReliable internet connection and work-from-home setup\n\tFamiliarity with Canva or basic graphic tools\n\tExcellent communication and organizational abilities\n\tHighly professional, self-motivated, and able to work independently\n\tExperience with social media scheduling or content assistance\n\tPrior remote work experience in a professional services setting\n\n\nSalary\nN200,000 - N300,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their Resume to: styakslegal@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Social Media Manager Job at Choice Talents NG",
    "link": "https://www.jobgurus.com.ng/jobs/view/social-media-manager-job-at-choice-talents-ng-1",
    "pubDate": "Mon, 09 Jun 2025 11:37:36 GMT",
    "source": "JobGurus",
    "keyword": "choice talents ng",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Choice Talents NG is Nigeria’s preferred talents management company. Our goal is to help build successful businesses through effective talent, resource and process management.\n\nWe are recruiting to fill the position below:\n\nJob Position: Social Media Manager\nJob Location: Lagos\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tMonitor and analyze social media trends and their impact on its brand for enhanced visibility and top-of-mind awareness.\n\tProvide monthly and comprehensive analytics on social media usage, e-channel metrics, and insights to inform marketing strategies and boost engagement.\n\tEngage in real-time interactions by responding to questions, offering solutions, and creating content that fosters vibrant discussions on social media to grow the Institute's community.\n\tCapture, post, and promote all its events online to ensure maximum reach and engagement.\n\tExplore new opportunities for social marketing platforms, identifying trending networks that cater to its stakeholders and community.\n\tMarket its offerings effectively through social media.\n\tPlan and execute targeted social media campaigns, including paid advertising, to achieve specific objectives like lead generation and brand awareness.\n\tTrack, analyze, and report on key social media metrics (e.g., engagement, reach, conversions) using tools like Hootsuite, Sprout Social, or native platform analytics, and provide insights for continuous improvement.\n\tIncrease the Institute's social media following and engagement.\n\tDevelop and implement social media strategies to enhance brand visibility, engagement, and followers across relevant platforms.\n\tManage community engagement by responding promptly to comments, messages, and mentions to maintain a positive brand image.\n\tStay up to date with the latest social media trends, tools, and best practices, incorporating them into the strategy as appropriate.\n\tEngage with influencers, brand advocates, and key industry figures to amplify its brand reach and credibility.\n\tAddress negative social media feedback or crises in collaboration with the Team Lead and Corporate Communications, ensuring that the brand's reputation is safeguarded.\n\tUtilize social media listening tools to track brand mentions, competitor activity, and industry trends to inform strategy adjustments.\n\tAlign social media efforts with the broader digital marketing strategy and business goals.\n\tPerform other related tasks as assigned.\n\n\nRequirements\n\n\n\tInterested candidates should possess an HND / BSc Degree with 3 - 7 years of work experience.\n\tProven experience as a Social Media Manager or similar role.\n\tStrong knowledge of major social media platforms and their features.\n\tProficiency in graphic design tools (e.g., Canva, Adobe Suite) and video editing software.\n\tExcellent written and verbal communication skills.\n\tCreative mindset with a keen eye for design and storytelling.\n\tAbility to analyze data and translate it into actionable strategies.\n\tStrong organizational and multitasking skills, with the ability to meet deadlines.\n\tFamiliarity with influencer marketing and brand collaborations is a plus.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and a Portfolio of your previous works to: jobs@choicetalents.com.ng using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Loan Collection Officer Job at Befreedom Outsourcing Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/loan-collection-officer-job-at-befreedom-outsourcing-limited",
    "pubDate": "Mon, 09 Jun 2025 11:37:36 GMT",
    "source": "JobGurus",
    "keyword": "befreedom outsourcing limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Befreedom Outsourcing Limited is a professional collection service provider that deals with helping various loan agencies in retrieving back their bad-loans as fast and effectively as possible.\n\nWe make calls to customers to pay their outstanding debts, Send messages to customers, Guide customers through the payment process, Persuade reluctant customers to make payment promptly, Meet weekly and monthly targets, Give proper and correct report of work. We build a professional team with experienced collectors for every loan agency, using SMS, calls, emails, various social media platforms to remind and encourage overdue customers to make repayments. BFREEDOMprovides financial solutions by helping loan companies recover back bad debts.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Loan Collection Officer\nJob Location: Jankara ijaiye, Lagos\nEmployment Type: Full-time\n\nDescription\n\n\n\tThe Ideal candidate should understand how to manage clients.\n\tMake calls to customers to pay their outstanding debt.\n\tSend messages to customers.\n\tGuide customers through the payment process.\n\tPersuade reluctant customers to make payments promptly.\n\tMeet weekly and monthly targets.\n\tGive proper and correct report of work.\n\n\nRequirements\n\n\n\tInterested candidates should possess a Bachelor's Degree, HND or NCE in relevant fields with 0 - 1 year of work experience.\n\tMust be computer literate.\n\tShould be willing to work from the office (Monday-Saturday)1 day off.5 days at work.\n\n\nBenefits\n\n\n\tSalary: Basic Salary: N60,000\n\tBonuses: Up to N70000 monthly.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hr@comatrix-collection.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Director, Human Resources Job at Outsource Nigeria",
    "link": "https://www.jobgurus.com.ng/jobs/view/director-human-resources-job-at-outsource-nigeria",
    "pubDate": "Mon, 09 Jun 2025 11:37:36 GMT",
    "source": "JobGurus",
    "keyword": "outsource nigeria",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Outsource Nigeria is a full-service Human Resources agency, specializing in providing outsourced turnkey manpower solutions to growing companies. Our solution include HR Services, Recruiting, Accounting, IT Support, Business Intelligence, Developers, and Operations including management and field / phone / automated based resources. The core of Outsource Nigeria’s success is its people.\n\nWe are recruiting to fill the position below:\n\nJob Position: Director, Human Resources\nJob Location: Lekki, Lagos\nEmployment Type: Full-time\nReporting To: Managing Director, Nigeria and West Africa & Chief People Officer\nKey Interactions: Team Directors, CEO\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWhat You’ll Be Doing\nPeople & Culture:\n\n\n\tBe a culture champion. Lead the rollout of people-first HR strategies and initiatives that align with our mission, values, and goals\n\tBe a trusted partner. Support managers with expert HR advice – from diagnosing challenges to co-creating solutions that unlock team potential.\n\tHire right. Own end-to-end talent acquisition for Nigeria – sourcing, interviewing, and onboarding the best and brightest with the right skills and the right attitude.\n\tNurture growth. Help employees tap into learning opportunities. Design training programs or partner with providers to develop our people.\n\tCreate a winning experience. Ensure every touchpoint in the employee lifecycle – from onboarding to exit – is seamless, compliant, and meaningful.\n\tKnow the market. Stay on top of compensation trends to ensure Pulse remains competitive, fair, and attractive to top talent.\n\tDrive performance. Manage our performance cycle with intention – from regular check-ins to formal reviews – keeping goals aligned and teams motivated.\n\tKeep us compliant. Maintain up-to-date records – from payroll to work permits – and ensure we’re always audit-ready.\n\tTrack the pulse. Use HR metrics to monitor engagement and guide decision-making that drives a thriving workplace.\n\n\nKey Responsibilities:\n\n\n\tHR Strategy & Culture, Talent Acquisition & Onboarding, Performance Management, Officer Operations & Admin\n\n\nOther Responsibilities:\n\n\n\tThe Director of HR will be expected to lead the strategic people agenda, partner closely with the executive team, and drive organizational effectiveness across a dynamic and growing business.\n\n\nCriteria\n\n\n\tProven experience working closely with senior management and other executives, particularly in providing strategic input on recruitment, performance management, talent development, and organizational growth\n\tStrong ability to navigate and manage a complex organizational structure\n\tSector experience in media, marketing, telecommunications, or advertising is highly preferred\n\tNotice period of no more than one to two months\n\n\nCompensation Package\n\n\n\tMonthly gross salary:NGN 1,500,000\n\tQuarterly variable pay:NGN 600,000, awarded based on achievement of set KPIs\n\tAccess to training and growth opportunities within the organization\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: jobs@outsourcenigeria.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Social Media Manager Job at Outsource Nigeria",
    "link": "https://www.jobgurus.com.ng/jobs/view/social-media-manager-job-at-outsource-nigeria-1",
    "pubDate": "Mon, 09 Jun 2025 11:37:36 GMT",
    "source": "JobGurus",
    "keyword": "outsource nigeria",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Outsource Nigeria is a full-service Human Resources agency, specializing in providing outsourced turnkey manpower solutions to growing companies. Our solution include HR Services, Recruiting, Accounting, IT Support, Business Intelligence, Developers, and Operations including management and field / phone / automated based resources. The core of Outsource Nigeria’s success is its people.\n\nWe are recruiting to fill the position below:\n\nJob Position: Social Media Manager\n\nJob Location: Head Office, Lekki, Lagos\nEmployment Type: Full-time\nReports to: Marketing Lead / Brand & Communications Manager\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Social Media Manager is responsible for managing the company’s online presence, brand voice, and engagement across all social media platforms to drive visibility, trust, and customer engagement.\n\n\nKey Responsibilities\n\n\n\tDevelop and execute a comprehensive social media strategy.\n\tCreate, curate, and manage content for platforms such as Instagram, Facebook, X (Twitter), LinkedIn, and TikTok.\n\tMonitor platform metrics, engagement rates, and conversion KPIs.\n\tCollaborate with customer service to respond to inquiries via social platforms.\n\tPlan and implement social media campaigns, promotions, and product launches.\n\tManage the social media calendar and brand consistency across content.\n\tStay updated with industry trends, digital tools, and competitor strategies.\n\n\nRequirements\n\n\n\tBachelor's Degree in Mass Communication, Marketing, or a related field.\n\t3 - 5 years of experience in digital marketing or social media management.\n\tStrong copywriting, design coordination, and data analytics skills.\n\tProficient with social media tools like Canva, Hootsuite, Buffer, Meta Business Suite.\n\n\nSalary\nN250,000 Monthly + PFA + HMO.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: jobs@outsourcenigeria.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]