[
  {
    "title": "Finance Manager Job at Alan & Grant",
    "link": "https://www.jobgurus.com.ng/jobs/view/finance-manager-job-at-alan-grant-2",
    "pubDate": "Fri, 27 Jun 2025 10:44:49 GMT",
    "source": "JobGurus",
    "keyword": "alan & grant",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Alan & Grant - Our client is a hospitality conglomerate based in Nigeria with diverse business interests including restaurants, catering, snack food manufacturing, hotels, cinemas, and real estate development.\n\nThey are recruiting to fill the position below:\n\nJob Position: Finance Manager\n\nJob Location: Port Harcourt, Rivers\nJob type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Finance Manager is responsible for overseeing all financial activities of the hotel, including budgeting, forecasting, financial reporting, cash flow management, internal controls, and statutory compliance.\n\tThe role ensures the financial health of the hotel, supports operational decision-making, and contributes to achieving the property’s revenue and profitability goals.\n\n\nKey Responsibilities\n\n\n\tDevelop and manage financial budgets and forecasts\n\tPrepare and present financial reports to management\n\tEnsure compliance with financial regulations and hotel policies\n\tAnalyze financial performance and provide recommendations\n\tIdentify areas for cost reduction and implement cost-saving initiatives\n\tAnalyze revenue streams and provide recommendations for growth\n\tLead the annual budgeting process, collaborating with department heads to develop realistic and effective budgets\n\tManage daily cash flow, ensuring optimal liquidity for hotel operations.\n\n\nRequirements\n\n\n\tBachelor's Degree in Finance, Accounting, Business Administration, or a related field\n\t7 - 10 years of experience in similar capacity\n\tProven experience in a finance management role, specifically within the hotel or hospitality industry.\n\tExcellent communication and leadership abilities\n\tA Master's degree or professional accounting qualification (e.g., ACA, ACCA, CPA) is highly preferred.\n\tProficiency in financial management software and hotel property management systems (PMS).\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Automation Engineer Job at Worknigeria",
    "link": "https://www.jobgurus.com.ng/jobs/view/automation-engineer-job-at-worknigeria",
    "pubDate": "Fri, 27 Jun 2025 10:44:49 GMT",
    "source": "JobGurus",
    "keyword": "worknigeria",
    "duplicate": false,
    "classifications": [],
    "content": "Worknigeria was established with a Singular Vision. To help the vast Nigerian workforce find meaningful jobs. We are also on a mission to upskill them in the best ways possible and help them grow with and within their careers.\n\nWe are recruiting to fill the position below:\n\nJob Position: Automation Engineer\nJob Location: Ogun\nEmployment Type: Shift Work\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking an experienced Automation Engineer to support our plant's process automation and minimize losses due to process malfunctions. The ideal candidate will have expertise in Krones machines and a strong background in automation and process control.\n\n\nKey Responsibilities\n\n\n\tSupport the entire plant in process automation and loss minimization\n\tProvide corrective maintenance support in automation and process control\n\tManage calibration activities, software modifications, and backups\n\tAssess and train technicians and operators in automation\n\tDevelop and maintain a database of automation information\n\tProvide innovative ideas for continuous improvement\n\n\nRequirements\n\n\n\tFirst Degree in Electrical/Electronic Engineering, Process Control, or related field\n\t10+ years of experience in FMCG (bottling) industry with Krones machine expertise\n\tMembership of NSE and COREN certification\n\tStrong communication skills in English.\n\n\nMethod of Application\nInterested and qualified candidates should send their CVs to: careers@worknigeria.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Human Resources Lead Job at Hobark International Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/human-resources-lead-job-at-hobark-international-limited-1",
    "pubDate": "Fri, 27 Jun 2025 10:44:49 GMT",
    "source": "JobGurus",
    "keyword": "hobark international limited",
    "duplicate": false,
    "classifications": [],
    "content": "Hobark International Limited (HIL) is the parent company of the Hobark group operating in the oil and gas industry. The company was incorporated in 1998, starting as a staffing agency based in Port Harcourt. Currently we have offices in 4 countries with our head office in Lagos.\n\nWe are recruiting to fill the position below:\n\nJob Position: Human Resources Lead\n\nJob Location: Lagos, Nigeria\nJob Type: Permanent/Full time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe HR Lead will provide high-level administrative and operational support across all HR functions, ensuring the smooth running  of day-to-day activities and processes within the HR department\n\tDevelop and implement HR strategies and policies aligned with the company’s vision and goals.\n\tManage end-to-end recruitment processes to attract, select, and retain top talent.\n\tDrive performance management processes including KPIs, appraisals, and development plans.\n\n\nRequirements\n\n\n\tB.Sc. Degree in Social Science discipline or any other relevant field\n\tThe ideal candidate is a seasoned HR professional with at least 8 years of experience in administration, performance management, and generalist HR functions, ideally within the upstream oil & gas or similar sectors.\n\tHR certification (e.g. ACIPM, APHRI, HRCI) is an added advantage.\n\tFamiliarity with labor laws and HR best practices in Nigeria.\n\tThey must be proactive, highly organized, and capable of aligning HR strategy with business objectives. Strong expertise in recruitment, performance management, employee relations, compliance, and learning & development is essential.\n\tThe candidate should possess excellent interpersonal, communication, and analytical skills, as well as proficiency in HR systems and Microsoft Office tools.\n\tThe candidate must be detail-oriented, discreet, and able to work independently in a fast-paced, high-performance environment.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]