[
  {
    "title": "Analyst - Treasury Operations, Finance Job at MTN Nigeria",
    "link": "https://www.jobgurus.com.ng/jobs/view/analyst-treasury-operations-finance-job-at-mtn-nigeria",
    "pubDate": "Sat, 05 Jul 2025 17:13:05 GMT",
    "source": "JobGurus",
    "keyword": "mtn nigeria",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "MTN Nigeria - The leader in telecommunications in Nigeria, and a part of a diverse community in Africa and the Middle East, our brand is instantly recognisable. It is through our compelling brand that we are able to attract the right talents who we carefully nurture by continuously improving our employment offerings even beyond reward and recognition.\n\nWe are recruiting to fill the position below:\n\nJob Position: Analyst - Treasury Operations, Finance\n\nJob Identification: 6025\nJob Location: Ikoyi, Lagos\nJob Category: MTN Level 2\nJob Schedule: Full-time\nReports To: Manager - Treasury Operations\nDivision: Finance\n\nMission\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tTo perform and manage treasury-related analyses to ensure that there is efficient management of liquidity, optimal bank transactions and/or investments, and compliance with funding contractual obligations by MTNN.\n\n\nDescription\n\n\n\tQuery and verify all general ledger balances relating to bank accounts.\n\tMonitor cash sweeps from the various sub accounts to the main accounts plus other transfers.\n\tCarry out ratio analysis on banks, collate and analyze data on risk ratings and exposure limits, cash movements, exchange rate movements, bank charges, interest rates, lending rates, placements etc.\n\tEvaluate banks and ensure regulatory compliance (e.g., CBN, NOTAP).\n\tCollate information on economic conditions, the financial climate, and changes in corporate requirements.\n\tPrepare management reports on market, competitor, and general intelligence that impact the business.\n\tPerform a first review and recommendation of bank proposals before further review by the Treasury Manager.\n\tProvide support to the business units requiring assistance in Treasury matters.\n\tMaintain Treasury records and audit trails in strict compliance with MTNN policies and procedures.\n\tImplement Treasury policies, processes, procedures, and tools for corporate cash management.\n\tReport the year-end audit as it relates to Treasury.\n\n\nRequirements\nEducation:\n\n\n\tA First Degree in Accounting, Economics, or any other related discipline\n\tFluent in English\n\tPart-time qualification or membership in a professional accounting association will be an added advantage. (ACA, ACCA, ACMA)\n\n\nExperience:\n3-7 years of experience in an area of specialization; with experience working with others\n\n\n\tExperience working in a medium organization\n\tExperience in financial environment, in treasury, banking or in FMCG environment.\n\tFamiliarity with good accounting practices and the Nigerian policy environment.\n\tExtensive Bank Reconciliation Experience\n\tUp-to-date knowledge of the money and capital markets\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Analyst - Customer Acquisition and Compliance Job at MTN Nigeria",
    "link": "https://www.jobgurus.com.ng/jobs/view/analyst-customer-acquisition-and-compliance-job-at-mtn-nigeria",
    "pubDate": "Sat, 05 Jul 2025 17:13:05 GMT",
    "source": "JobGurus",
    "keyword": "mtn nigeria",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "MTN Nigeria - The leader in telecommunications in Nigeria, and a part of a diverse community in Africa and the Middle East, our brand is instantly recognisable. It is through our compelling brand that we are able to attract the right talents who we carefully nurture by continuously improving our employment offerings even beyond reward and recognition.\n\nWe are recruiting to fill the position below:\n\nJob Position: Analyst - Customer Acquisition and Compliance\n\nJob Identification: 6012\nJob Location: Enugu\nJob Category: MTN Level 2\nJob Schedule: Full-time\nReports To: Manager - Customer Acquisition and Compliance East\nDivision: Sales and Distribution\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nMission\n\n\n\tTo collate and analyze SIM Cards registration, SIMS availability/Supply and Distribution, Activations, Customer Retention and churn  intelligence information on an on-going basis, (in relation to benchmarking and competition) and provide insight to  Customer Acquisition Channel performance.\n\n\nDescription\n\n\n\tEvaluate performance measured against SIM registration channel objectives  in the following areas:\n\t\n\t\tTrade Partner and Customer Acquisition AND compliance Partners\n\t\tWalk-in-Centers\n\t\tMobile Lite \n\t\tConnect Stores and Connect Points\n\t\tOther Sim Registration Agents (Pentagon).\n\t\n\t\n\tCollect, analyze and interpret a wide variety of Channel data and develop weekly /monthly reports in preparation for business review meetings.\n\tEnd- to-end device life-cycle management, tracking, monitoring of device’ heartbeat, utilization and efficiency.\n\tEngage the regions to follow up on implementation of Customer Acquisition Channel Initiatives.\n\tProvide and maintain a strong and reliable database to facilitate tracking and improvement of channel services and providing information enabling channel business decisions to be made.\n\tPrepare monthly, quarterly and year to date (YTD) measurement reports.\n\tProvide functional support to Customer Acquisition Manager\n\tSupport seamlessly, the end-to-end SIM Acquisition agent’s system up, training, onboardings and exit.\n\tAnalyze relevant best practices and provide recommendations to Customer Acquisition Manager.\n\tAttend regulatory meetings at state level and share outcome with regional leadership\n\n\nRequirements\nEducation:\n\n\n\tFirst Degree in Computer Science, Statistics, Economics, Business Administration, Accounting or any related discipline\n\tFluent in English\n\n\nExperience:\n3-7 years work experience which includes\n\n\n\tMinimum of 3 years of experience in an area of specialization; with experience working with others\n\tExperience working in a medium organization:\n\tProject planning and reporting, sales/marketing or related function\n\tExperience using Data Mining Tools\n\tTelecoms experience would be an added advantage\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Senior Sales Executive Job at TeamAce Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/senior-sales-executive-job-at-teamace-limited-1",
    "pubDate": "Sat, 05 Jul 2025 17:13:05 GMT",
    "source": "JobGurus",
    "keyword": "teamace limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "TeamAce Limited - Our client, a Financial Institution, is recruiting to fill the position below:\n\nJob Position: Senior Sales Executive\n\nJob Location: Warri, Delta\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDevelop sales strategies, explore new markets, and achieve targets.\n\tManage key client relationships and resolve issues.\n\tMonitor performance, meet targets, and provide updates.\n\tDrive business growth through research, lead generation, and meetings.\n\tNegotiate and secure profitable deals to close sales.\n\tMentor team members and collaborate with marketing and product teams.\n\n\nRequirements\n\n\n\tMinimum of OND in any related field.\n\tMinimum of 2-3 years of experience in field sales.\n\n\nSalary\nN150,000 – N200,000 + commissions and other benefits.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]