[
  {
    "title": "Junior Account Manager - Receivables Job at Julius Berger Nigeria Plc",
    "link": "https://www.jobgurus.com.ng/jobs/view/junior-account-manager-receivables-job-at-julius-berger-nigeria-plc",
    "pubDate": "Wed, 04 Jun 2025 11:38:03 GMT",
    "source": "JobGurus",
    "keyword": "julius berger nigeria plc",
    "duplicate": false,
    "classifications": [],
    "content": "Julius Berger Nigeria Plc (Julius Berger) is a leading construction company offering integrated solutions and related services. Julius Berger specializes in executing complex works that require the highest level of technical expertise and Nigeria-specific know how.\n\nWe appreciate your interest in our company. Our success largely depends on the passion, precision and competence of our employees from. Become part of our team and help us in the realization of innovative and pioneering engineering projects. Experienced professionals and young professionals, we offer opportunities in technical and commercial fields. Take the chance and apply online with us.\n\nWe are recruiting to fill the position below:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Position: Junior Account Manager - Receivables\nJob Location: Abuja\nEmployment Type: Full Time\n\nWhat duties will you have?\n\n\n\tManage accounts receivable and record customer invoices, incoming payments, credit notes and other relevant transactions.\n\tRegular checking and reconciliation of outstanding receivables.\n\tProactive processing of open items, discrepancies and payment delays.\n\tCreating evaluations of receivables balances and other relevant financial reports.\n\tWorking closely with commercial departments and management for accurate reporting of accounts receivable data.\n\tParticipation in quarterly and year-end closing activities.\n\n\nJob Requirements\nWhat skills must you have?:\n\n\n\tA degree with a focus on business administration.\n\tAt least two years of professional experience as an accounts receivable accountant (m/f/d).\n\tConfident in the use of Microsoft Office applications, especially Excel, as well as in the use of ERP systems (e.g. SAP FI/CO)\n\tVery good written and spoken English.\n\tYou are characterized by a precise and structured way of working and a strong understanding of numbers.\n\tYou demonstrate strong communication skills at all hierarchical levels and the independent motivation for further training.\n\n\nWhat do we offer you?\n\n\n\tResponsible job with very good remuneration, various allowances, social benefits, low tax burden and good training opportunities.\n\tComprehensive travel package including G35 examinations, vaccinations, visa and flight.\n\tFurnished, air-conditioned accommodation in the company's own camp with sports and leisure facilities, clubhouse and international TV programs.\n\tFamily reunification of the spouse is possible, depending on the assignment location.\n\tProvision of transportation between accommodation and place of work\n\tA comprehensive security concept in Nigeria by external partners\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "HR Operations Officer Job at Estrada International Staffing Solutions",
    "link": "https://www.jobgurus.com.ng/jobs/view/hr-operations-officer-job-at-estrada-international-staffing-solutions",
    "pubDate": "Wed, 04 Jun 2025 11:38:03 GMT",
    "source": "JobGurus",
    "keyword": "estrada international staffing solutions",
    "duplicate": false,
    "classifications": [],
    "content": "Estrada International Staffing Solutions  - Our client, a top-tier player in Nigeria’s agribusiness space, with a significant market presence across the Southeast, is seeking results-driven candidates to fill the position below:\n\nJob Position: HR Operations Officer\n\nJob Location: Igbariam, Anambra\nEmployment Type: Full-time (On-site)\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tLead end-to-end HR operations: recruitment, onboarding, staff records, and documentation.\n\tHandle employee relations, conflict resolution, and engagement activities.\n\tProvide regular reports on HR metrics, workforce analysis, and strategic inputs.\n\tInterface with local institutions, unions, and regulatory bodies when needed.\n\tEnsure compliance with HR policies, Nigerian labour laws, and internal regulations.\n\tSupervise attendance, leave, payroll coordination, and performance management.\n\tSupport workforce planning and execution of HR strategies.\n\n\nRequirements\n\n\n\tB.Sc Degree / HND in HR Management, Business Administration or a related field.\n\t4 - 7 years of experience in HR operations (FMCG, agriculture or manufacturing preferred).HR professional (CIPM or equivalent) is a strong added advantage.\n\tStrong working knowledge of Nigerian labour law and HR systems.\n\tExcellent people skills, documentation accuracy, and ethical judgement.\n\tMale candidate from or residing in Anambra State is preferred.\n\n\nBenefits\n\n\n\tSalary: N400,000 - N600,000 Monthly. \n\tFree staff bus transportation to and from site\n\tCompany-provided accommodation (for the first 6 months)\n\tHealth Insurance (HMO)\n\tDaily lunch meal provided\n\tPension scheme\n\t13th-month salary\n\tLeave allowance.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: a.okpaire@estradaintl.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Cashier Job at Startup Soar",
    "link": "https://www.jobgurus.com.ng/jobs/view/cashier-job-at-startup-soar",
    "pubDate": "Wed, 04 Jun 2025 11:38:03 GMT",
    "source": "JobGurus",
    "keyword": "startup soar",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Startup Soar (Recruitment Services) - Our client is a rapidly expanding restaurant located in the heart of Lokoja, known for its warm hospitality, exceptional food, and a dynamic customer-focused culture. As the brand continues to grow, it remains committed to delivering a seamless and pleasant dining experience for every guest.\n\nThey are recruiting to fill the position below:\n\nJob Position: Cashier\n\nJob Location: Lokogoma, Lokoja - Kogi\nEmployment Type: Full-time\nIndustry: Hospitality\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a reliable and detail-oriented Cashier to join our team. The ideal candidate will be responsible for managing customer payments, handling cash and electronic transactions, and providing excellent customer service.\n\tThis role is key to ensuring smooth financial operations and a positive customer experience at the point of sale.\n\n\nKey Responsibilities\n\n\n\tGreet customers and provide friendly and efficient service during payment transactions.\n\tAccurately handle cash, credit card, and other payment methods.\n\tIssue receipts, refunds, or change due to customers.\n\tCoordinate with the kitchen and service team to address any billing or order issues.\n\tKeep the cashier area clean and organized.\n\tBalance cash drawer at the beginning and end of shifts.\n\tMaintain accurate records of transactions and prepare reports as required.\n\tAddress customer inquiries or direct them to the appropriate personnel.\n\tFollow all company policies and procedures related to cash handling and security.\n\n\nRequirements\n\n\n\tCandidates should possess a B.Sc or HND in Finance, Accounting, Banking, or another related field is preferred.\n\t3–4 years of experience as a cashier or in a similar role, preferably in hospitality or retail.\n\tStrong numerical skills and attention to detail.\n\tExcellent communication and interpersonal skills.\n\tAbility to handle transactions accurately and responsibly.\n\tBasic computer proficiency and familiarity with POS systems.\n\tHonest, trustworthy, and reliable with a strong sense of integrity.\n\tAbility to work flexible shifts, including weekends and holidays.\n\tA team player with a positive attitude and good problem-solving skills.\n\n\nCompensation and Benefits\n\n\n\tCompetitive salary based on experience and performance\n\tFree accommodation for 3–4 months upon resumption\n\tFree meals will be provided to staff\n\tCareer growth opportunities within a fast-growing brand\n\tSupportive, inclusive, and customer-focused work environment\n\tOn-the-job training and development programs\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and a brief Cover Letter to to: startupsoarhr@gmail.com using \"Application for Cashier Position\" as the subject of the mail.\n\nNote: Only shortlisted candidates will be contacted.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Senior Network Engineer Job at Ascentech Services Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/senior-network-engineer-job-at-ascentech-services-limited",
    "pubDate": "Wed, 04 Jun 2025 11:38:03 GMT",
    "source": "JobGurus",
    "keyword": "ascentech services limited",
    "duplicate": false,
    "classifications": [],
    "content": "Ascentech Services Limited is a full-fledged Human Resource Solution Provider incorporated in 2013 with its Head Office in Lagos, Nigeria. We are committed to forging long-term partnerships with our clients by creating and delivering robust and flexible services that address the changing needs of their business.\n\nWe are recruiting to fill the position below:\n\nJob Position: Senior Network Engineer\n\nJob Location: Surelere, Lagos\nEmployment Type: Full-time\nReports To: IT Infrastructure Manager / Network Manager\nDepartment: IT / Network Operations\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a highly skilled Senior Network Engineer with 5 - 7 years of experience in designing, implementing, and maintaining complex network infrastructures.\n\tThe ideal candidate will have extensive hands-on experience with Sophos firewalls, along with a strong background in network security, LAN/WAN technologies, and troubleshooting.\n\n\nKey Responsibilities\n\n\n\tDesign, implement, and maintain enterprise network infrastructure to ensure high availability and security.\n\tAdminister and manage Sophos firewalls, including rule creation, VPN setup, firmware upgrades, logging, and reporting.\n\tConfigure and troubleshoot routers, switches, firewalls, and wireless access points.\n\tMonitor network performance and proactively identify and resolve issues.\n\tMaintain network documentation including diagrams, configurations, and SOPs.\n\tEnsure compliance with IT security policies and procedures.\n\tPerform regular network risk assessments and apply mitigation strategies.\n\tCollaborate with cross-functional teams on new implementations and integrations.\n\tProvide Level 2/3 technical support for network-related incidents and service requests.\n\tPlan and execute network upgrades, patches, and backups.\n\n\nKey Requirements\n\n\n\t5 to 7 years of experience in network engineering or IT infrastructure roles.\n\tProven expertise with Sophos firewall technologies (XG, XGS series).\n\tStrong understanding of TCP/IP, VLANs, VPNs, NAT, routing protocols (BGP, OSPF), and wireless networking.\n\tExperience with network monitoring and analysis tools (e.g., Wireshark, PRTG, SolarWinds).\n\tWorking knowledge of security best practices, firewall policies, and access controls.\n\tFamiliarity with cloud networking (AWS, Azure) is a plus.\n\tExperience with other firewall solutions (e.g., Fortinet, Palo Alto) is a bonus.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: cv@ascentech.com.ng using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Backend Software Developer Job at Ouranos Technologies (Ouranos)",
    "link": "https://www.jobgurus.com.ng/jobs/view/backend-software-developer-job-at-ouranos-technologies-ouranos",
    "pubDate": "Wed, 04 Jun 2025 11:38:03 GMT",
    "source": "JobGurus",
    "keyword": "ouranos technologies (ouranos)",
    "duplicate": false,
    "classifications": [
      "Software Engineering",
      "Finance"
    ],
    "content": "Ouranos Technologies (Ouranos) has established itself as a force to be reckoned with in delivering IT infrastructure services and solutions to clients in West Africa and beyond. At Ouranos, we design, build and provide solutions for business applications and core infrastructure including systems and storage, datacenters and enterprise, wide communication and networking.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nOur in-depth industry knowledge, technical expertise and flexible delivery models help customers harness the best out of their IT investments by creating a reliable and scalable infrastructure. Our systems integration services have a comprehensive portfolio of implementation, support and consulting services solutions with exceptional people supporting business technology in action - talented professionals who bring technical insight, process excellence and resource flexibility to help customers in various verticals.\n\nWe are recruiting to fill the position below:\n\nJob Position: Backend Software Developer\nJob Location: Ikeja, Lagos\nEmployment Type: Contract\n\nJob Summary\n\n\n\tWe are seeking a Back-End Developer to join our team and work on the modernization of our legacy Java Enterprise Edition (JEE) system, which has been running for over 15 years in an on premise data center.\n\tThis monolithic system, built on WebSphere Application Server, uses Hibernate and Oracle databases and is now undergoing a major transformation, including a migration to Azure Zulu JDK 17 and an upgrade to IBM Liberty.\n\tAs we move forward with exposing remitter APIs, you will play a key role in the development, optimization, and migration of back-end services, ensuring system stability while integrating modern cloud-ready architectures.\n\n\nRequired Skills and Experience\n\n\n\tInterested candidates should possess relevant qualifications\n\tBack-End Development: 10+ years of experience in Java Enterprise Edition (JEE).\n\tJava 8+ & OpenJDK: Experience migrating and maintaining Java applications.\n\tWebSphere & IBM Liberty: Hands-on experience with WebSphere Application Server and knowledge of IBM Liberty.\n\tPerformance Optimization: Ability to fine-tune queries and optimize back-end processes.\n\tCI/CD & Deployment Pipelines: Familiarity with Git, Jenkins, or Azure DevOps for back-end automation.\n\tHibernate & ORM: Strong understanding of Hibernate and database interaction with Oracle databases.\n\tAPI Development: Experience with RESTful APIs and integrating internal/external systems.\n\tCloud Exposure: Some knowledge of Azure Cloud services is a plus.\n\tBanking/Financial Sector Experience: Understanding of security and compliance regulations.\n\n\nPreferred Qualification:\n\n\n\tExperience with Spring Boot (even though it's not currently in use).\n\tKnowledge of microservices architecture for future transformation planning.\n\tFamiliarity with containerization tools like Docker or Kubernetes.\n\tExposure to message brokers (Kafka, RabbitMQ).\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]