[
  {
    "title": "Customer Service Representative Job at Elvaridah Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/customer-service-representative-job-at-elvaridah-limited",
    "pubDate": "Fri, 27 Jun 2025 13:27:46 GMT",
    "source": "JobGurus",
    "keyword": "elvaridah limited",
    "duplicate": false,
    "classifications": [],
    "content": "Elvaridah Limited - Our client is a premium laundry and dry-cleaning business located in Lagos. They specialize in delivering high-quality, efficient, and reliable garment care services tailored to modern lifestyles. Our mission is to make laundry stress-free while maintaining the highest standards of hygiene, fabric care, and customer satisfaction. With a growing client base and a commitment to excellence, we’re expanding our team to ensure we continue delivering the top-tier service our customers love and trust.\n\nThey are recruiting to fill the position below:\n\nJob Position: Customer Service Representative\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are looking for a friendly, organized, and service-oriented Customer Service Representative to join our team.\n\tYou will be the face of the business, responsible for managing customer interactions, ensuring smooth service experiences, and helping maintain client satisfaction.\n\n\nKey Responsibilities\n\n\n\tCustomer Interaction: Greet walk-in customers and answer phone or WhatsApp inquiries with professionalism and courtesy\n\tOrder Management: Receive, tag, and document incoming laundry orders accurately using POS or digital systems\n\tComplaint Handling: Address customer complaints or concerns politely and escalate unresolved issues to management\n\tCommunication: Inform customers about delivery/pick-up times, delays, or any issues with their garments\n\tPayment Handling: Process payments (cash, card, transfers), issue receipts, and maintain accurate transaction records\n\tCoordination: Liaise with internal teams (washing, ironing, quality control, dispatch) to ensure smooth workflow\n\tFollow-up: Call or message customers when orders are ready, delayed, or need clarification\n\tCustomer Records: Maintain updated customer records and notes for personalized service\n\tClean Environment: Keep the front desk and customer waiting area clean, tidy, and welcoming\n\n\nQualifications & Skills\n\n\n\t1 - 2 years of experience in a customer service, front desk, or receptionist role (service or retail experience is preferred)\n\tExcellent verbal and written communication skills\n\tFriendly, confident, and patient personality\n\tBasic computer literacy and familiarity with POS or order management software\n\tStrong attention to detail and organizational skills\n\tProblem-solving attitude and ability to stay calm under pressure\n\tPunctual, trustworthy, and presentable appearance\n\tMust be fluent in English; additional local language skills are a plus.\n\n\nSalary\nN100,000 / month.\n\nMethod of Application\nInterested and qualified candidates should send their CV and Cover Letter to: careers@elvaridah.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Administrative Officer Job at Moniepoint",
    "link": "https://www.jobgurus.com.ng/jobs/view/administrative-officer-job-at-moniepoint-1",
    "pubDate": "Fri, 27 Jun 2025 13:27:46 GMT",
    "source": "JobGurus",
    "keyword": "moniepoint",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Moniepoint Incorporated is a global business payments and banking platform and recently became QED Investors’ first investment in Africa. We are the partner of choice for over 600,000 businesses of all sizes, powering the dreams of SMBs and providing them with equal access to the tools they need to grow and scale.\n\nWe are recruiting to fill the position below:\n\nJob Position: Administrative Officer\n\nJob Location: Ogba, Lagos\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tIn order to facilitate the smooth running of the company and the execution of its projects, the Admin Officer is responsible for the professional and efficient management of the company’s inventory, logistics, and, operations.\n\n\nPrincipal Duties and Responsibilities\n\n\n\tCoordinating and tracking the distribution, location, condition, maintenance and care of, allocation and use of the company’s inventory and goods (e.g. accessories, appliances, cases, costumes, equipment, furniture, furnishings, hardware, instruments, merchandise, props, software, technology, vehicles, wardrobe, etc.) at all times and ensuring appropriate levels are available in the store for the efficient execution of all projects and running of the business at all times.\n\tEffective and efficient record keeping and reporting including cataloguing new inventory; managing it in an efficient database thereafter; and, preparing accurate reports for management regularly, including interim reports as required. Planning and managing the company’s international and domestic logistics.\n\tWorking with other units to support the projects’ logistics from proposal through to delivery and evaluation and follow-up; on time and within budget. This includes assisting with the liaisons with suppliers and other third parties to handle the transportation, accommodation, subsistence and timing and movement of people; and freight, shipment and deliveries of inventory, goods and equipment.\n\tArranging the logistics (including but not limited to, transportation, accommodation, feeding, shipment and deliveries, whether by sea, air and ground); and liaising with other staff and third parties‌.\n\tLiaising with suppliers and managing them through to the completion of the project and beyond for follow-up activities and reports, for instance, hotels, caterers, airlines, travel agents, etc.\n\tHandling all aspects of the tracking of the timing and movement of people, equipment, materials, freight, etc. from origin to the final destination in a timely manner.\n\tResponsibility for and management of office information systems; utilities and resources (e.g. diesel, gas, water, electricity, refuse clearance, generator); vehicles; sundries; and, premises, at all times to address the company's needs. This includes forecasting the requirements, managing and tracking their use; monitoring their maintenance and service histories through systems and logs.\n\tResponsibility for ticket booking, expatriate quota, visa preparation and office purchases, and general processes involved in immigration handling for the company’s expatriates and international guests.\n\n\nGeneral:\n\n\n\tConstantly communicating with all stakeholders to keep them updated, including attending meetings and preparing regular reports for the management team.\n\tUndertaking any necessary duties to ensure a first-class service is provided at all times.\n\n\nQualifications, Competency & Skills Required\n\n\n\tGraduate Degree or equivalent qualification in Administration or Mass Communications or minimum of three years previous travel, logistics, inventory management, operations or office administration experience.\n\tExperienced Microsoft Office user, particularly Word, Excel, PowerPoint and Outlook.\n\tExperienced database and financial software user e.g. Excel, Sage, QuickBooks.\n\tCompetent Internet, email and Google applications user.\n\tSound knowledge of the entertainment industry within Nigeria.\n\n\nCandidate Abilities & Personality Profile:\n\n\n\tAn organised and assertive individual who is proactive, creative, and resourceful.\n\tAn outstanding team player and self-starter, able to work with minimum supervision.\n\tGreat at staying calm and diplomatic under intense pressure.\n\tAble to manage own time and prioritise work to ensure deadlines are met and targets achieved, and take personal responsibility for own work and actions.\n\tAble to work within a secure and confidential environment, maintain confidentiality and demonstrate tact and diplomacy at all times.\n\tAble to develop excellent working relationships both internally and externally.\n\tExcellent organisational skills.\n\tAble to use own initiative and make simple or business-critical decisions as required.\n\tClear verbal communicator with excellent telephone manners.\n\tAble to work accurately with excellent attention to detail at all times.\n\tAbility to liaise with staff at all levels, both internally and externally.\n\tDemonstrates strong interpersonal skills and a professional manner and approach at all times including an equable temperament and a neat appearance.\n\tAble to cope well when under pressure from competing priorities, unpredictable requests and interruptions.\n\tKeenly interested in the FinTech, hospitality and logistics industries in Nigeria.\n\n\nWhat we can offer you\n\n\n\tCulture -We put our people first and prioritize the well-being of every team member. We’ve built a company where all opinions carry weight and where all voices are heard. We value and respect each other and always look out for one another. Above all, we are human.\n\tLearning - We have a learning and development-focused environment with an emphasis on knowledge sharing, training, and regular internal technical talks.\n\tCompensation - You’ll receive an attractive salary, pension, health insurance,, Employee Stock Options, annual bonus, plus other benefits.\n\n\nWhat to expect in the hiring process\n\n\n\tA preliminary phone call with the Recruiter\n\tAn interview with the Hiring Manager\n\tAn interview with a member of our Executive team.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Personal Assistant (Male) Job at Macabo Resources",
    "link": "https://www.jobgurus.com.ng/jobs/view/personal-assistant-male-job-at-macabo-resources",
    "pubDate": "Fri, 27 Jun 2025 13:27:46 GMT",
    "source": "JobGurus",
    "keyword": "macabo resources",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Macabo Resources is a people-focused business solutions provider dedicated to empowering organizations and individuals to thrive through strategic HR consulting, administrative support, and growth-driven services. Founded on the shared values of unity, integrity, and innovation, our brand draws inspiration from six distinct leaders and visionaries whose names form the foundation of our identity. At Macabo Resources, we prioritize results and relationships, ensuring that every client receives tailored solutions that align with their goals and values.\n\nWe are recruiting to fill the position below:\n\nJob Position: Personal Assistant (Male)\nJob Location: Lagos\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe position of Personal Assistant in a Law Firm to the Managing Director involves providing comprehensive administrative and organizational support to the Managing Director.\n\tAs a personal Assistant, you will assist in managing schedules, handling correspondence, coordinating appointments and ensuring efficient day-to day operations.\n\n\nResponsibilities\n\n\n\tManage and organize Managing Director’s schedule, appointment and travel arrangements.\n\tScreen and respond to emails, phone calls and inquires on behalf of the Managing Director.\n\tHandle confidential and sensitive information with discretion and professionalism.\n\tConduct research, gather data, and prepare summaries or reports as needed.\n\tPrepare expense reports manage invoices and handle financial documentation.\n\tPrepare and edit correspondence, reports, presentations and other materials and follow-up actions.\n\tMaintain and update important contacts and addresses and information\n\tAssist in personal tasks and errands such as shopping reservations and household coordination.\n\tProvide general administrative support including filling, scanning and organizing documents.\n\n\nQualifications / Requirements\n\n\n\tBachelor’s Degree in Business Administration, or a related field is preferred.\n\tProven experience as a Personal Assistant or a similar administrative role.\n\tExcellence organizational and time management skill to manage schedules and priorities.\n\tStrong communication skills to interact effectively with internal and external contacts.\n\tProficiency in Microsoft office suite (Word, Excel, PowerPoint, Outlook and ability to handle all social media).\n\tDiscretion and integrity and professionalism in handling sensitive information.\n\tAbility to work independently and proactively manage tasks with minimal supervision.\n\tAdaptability to changing priorities and willingness to take diverse responsibilities.\n\tStrong problem-soling skills and attention to details.\n\tMust be a Male.\n\n\nSkills:\n\n\n\tOrganization: Managing schedules, tasks, and priorities efficiently.\n\tCommunication: Effective communication to interact with contacts and convey information.\n\tDiscretion: Handling confidential and sensitive information with professionalism.\n\tTime Management: Managing time effectively to meet deadlines and manage tasks\n\tProblem-Solving: Identifying and resoling challenges by proposing effective solutions.\n\tAdaptability: adjusting to changing priorities and taking on diverse responsibilities.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: macaboresources@gmail.com using the Job Position \"Personal Assistant\" as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Junior UX Designer Job at Canonical Nigeria",
    "link": "https://www.jobgurus.com.ng/jobs/view/junior-ux-designer-job-at-canonical-nigeria-2",
    "pubDate": "Fri, 27 Jun 2025 13:27:46 GMT",
    "source": "JobGurus",
    "keyword": "canonical nigeria",
    "duplicate": false,
    "classifications": [],
    "content": "(adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\nCanonical - We deliver open source to the world faster, more securely, and more cost-effectively than any other company. We develop Ubuntu, the world’s most popular enterprise Linux from cloud to edge, together with a passionate global community of 200,000 contributors. Ubuntu means 'humanity to others. We chose it because it embodies the generosity at the heart of open source, the new normal for platforms and innovation. Together with a community of 200,000, we publish an operating system that runs from the tiny connected devices up to the world's biggest mainframes, the platform that everybody uses on the public cloud, and the workstation experience of the world's most productive developers. Secure and reliable, elegant and intuitive, and open for innovation - Ubuntu is the future of open source, which is why it's the fastest-growing Linux in the world despite already being the most widely deployed.\n\nWe are recruiting to fill the position below:\n\nJob Position: Junior UX Designer\n\nJob Location: Remote\n\nThe role entails\n\n\n\tWorking with the open source community and Canonical customers to research new features and improvements\n\tCollaborating with product managers and engineers to shape the future of Canonical products\n\tEngaging with the design team to keep our efforts aligned with product strategy and best practices\n\tWorking to evolve and evangelise design systems that drive consistency and efficiency\n\tUnderstanding the broader scope of your work and its numerous interconnected constraints\n\tSupporting one of our working groups to enable Canonical design’s horizontal efforts\n\n\nWhat we are looking for in you\n\n\n\tExceptional academic track record from both high school and university\n\tBachelor’s or equivalent in User Experience, Design, or STEM or a compelling narrative about your alternative chosen path\n\tKnowledge and passion for user experience, technology and design\n\tCommitment to continuous learning and improvement - curious, flexible, scientific\n\tResult-oriented with a drive to finish work and celebrate success\n\tConfidence in user research practices\n\tEngagement with the latest design research and innovation\n\tAbility to travel internationally twice a year, for company events up to two weeks long.\n\n\nWhat we offer you\n\n\n\tWe consider geographical location, experience, and performance when shaping compensation worldwide.\n\tWe revisit compensation annually (and more often for graduates and associates) to ensure we recognise outstanding performance. In addition to base pay, we offer a performance-driven commission structure.\n\tWe provide all team members with additional benefits, which reflect our values and ideals.\n\tWe balance our programs to meet local needs and ensure fairness globally.\n\tDistributed work environment with twice-yearly team sprints in person\n\tPersonal learning and development budget of USD 2,000 per year\n\tAnnual compensation review\n\tRecognition rewards\n\tAnnual holiday leave\n\tMaternity and paternity leave\n\tEmployee Assistance Program\n\tOpportunity to travel to new locations to meet colleagues\n\tPriority Pass, and travel upgrades for long haul company    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "HR Officer Job at St. David's Pharmacy",
    "link": "https://www.jobgurus.com.ng/jobs/view/hr-officer-job-at-st-davids-pharmacy",
    "pubDate": "Fri, 27 Jun 2025 13:27:46 GMT",
    "source": "JobGurus",
    "keyword": "st. david's pharmacy",
    "duplicate": false,
    "classifications": [],
    "content": "St. David's Pharmacy is a reputable pharmaceutical company that provides direct patient care services that optimize the use of medication and promote health, wellness, and disease prevention.\n\nWe are recruiting to fill the position below:\n\nJob Position: HR Officer\n\nJob Location: Agungi, Lagos\nEmployment Type: Full-time\n\nRequirements\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe seek to hire an HR Officer with good knowledge of HR practice.\n\tMust have at least 1 year experience in HR/Admin. Must reside close to advertised locations (Agungi).\n\tPrevious experience in recruitment and talent managment will be an added advantage.\n\n\nSalary\nN120,000 - N150,000 monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hrstdavidspharmacy@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]