[
  {
    "title": "Chief Operating Officer Job at Field Intelligence",
    "link": "https://www.jobgurus.com.ng/jobs/view/chief-operating-officer-job-at-field-intelligence",
    "pubDate": "Thu, 26 Jun 2025 14:43:37 GMT",
    "source": "JobGurus",
    "keyword": "field intelligence",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Field Intelligence - Where immunizations, contraception, anti-infectives, essential devices and diagnostics, or chronic care at the local clinic or pharmacy are expired, too expensive, or simply unavailable, providers, patients, and whole communities pay the price.\n\nEquitable, sustainable development, and with it the promise of emerging and frontier markets, starts with the ability of health systems to deliver access. The challenge, opportunity, and imperative in that drive us. We are helping digitize, modernise, strengthen, and sustain the supply chains that enable this access, becoming long-term partners with the communities we serve, and helping make good on the promise of healthcare for millions.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Chief Operating Officer\n\nJob Location: Lagos\nEmployment Type: Full time\n\nJob Description\n\n\n\tField is looking for a seasoned professional for a management-track, full-time Chief Operating Officer role, leading and developing teams.  \n\tStrong leadership and strategic thinking are essential.\n\n\nKey responsibilities\nData-driven strategy development and implementation with each department:\n\n\n\tLead data strategy across Growth, Credit, Supply Chain, Customer Success, and Product departments\n\tEnsure successful use of data in departmental planning, problem solving, and reporting\n\tLead training and capacity development across departments\n\tCollaborate with Finance to develop investment plans for new initiatives, including inventory investment case development, monitoring, and reporting\n\n\nData productization and monetization:\n\n\n\tWork with external stakeholders to define requirements and deliver data products and services\n\tCoordinate across Product and Data teams\n\n\nCollaboration with Data Team:\n\n\n\tStakeholder or owner for the upstream pipeline, process, and database improvement plans\n\tDevelopment of the analytics team\n\tPrimary stakeholder in the improvement of data tools and processes\n\n\nQualifications\n\n\n\t10+ years of experience\n\tBachelor's or Master's Degree\n\tBoth prior management consulting and operator experienceare  preferred\n\tDemonstrated quantitative reasoning and written communication skills\n\tExpertise in Excel/Sheets and SQL\n\tExcitement for healthcare, technology, including AI, emerging markets, and working in a fast-paced setting with diverse teams.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Video Editor / Graphic Designer Job at Speedaf Express",
    "link": "https://www.jobgurus.com.ng/jobs/view/video-editor-graphic-designer-job-at-speedaf-express",
    "pubDate": "Thu, 26 Jun 2025 14:43:37 GMT",
    "source": "JobGurus",
    "keyword": "speedaf express",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Speedaf was established in 2019. We are a joint-venture company invested by Chinese leading express enterprises. Since founded, we continuously expanded global network, developed and optimized products, improved customer experience, and introduce IT technologies and equipment to realize automatic operations. Currently, we are building a local and cross-border service network to support air, sea and road transportation with the aim to be the leading diversified integrated logistics solution provider between China and emerging markets. By doing so, it will reduce end-to-end logistics costs between China and emerging markets while providing a stable and recognized logistics services to our customers.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nSpeedaf is localization-oriented, and we believe in creating both opportunities and possibilities of every region we operate in. We work with local teams and understand needs of customers. We offer a variety of products and value added service to cover different commercial or personal scenarios for our customers.\n\nWe are recruiting to fill the position below:\n\nJob Position: Video Editor / Graphic Designer\n\nJob Location: Berger, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe’re seeking a creative and detail-oriented Video Editor & Graphic Designer to join our growing team.\n\tThis role is responsible for creating visually compelling designs and video content that align with our brand, communicate our message, and engage customers, employees, and partners across various platforms.\n\n\nKey Responsibilities\n\n\n\tCreate, edit, and produce high-quality videos for marketing campaigns, social media, internal communications, and training.\n\tTransform raw footage into polished videos with sound, motion graphics, and visual effects.\n\tRepurpose long-form content (e.g., webinars, interviews) into short, engaging clips.\n\tMaintain organized archives of video content.\n\tDesign promotional materials such as flyers, banners, infographics, brochures, and social media posts.\n\tCollaborate with the content and marketing teams to develop visual campaigns that enhance brand awareness.\n\tCreate branded templates for presentations, proposals, and internal documents.\n\tMaintain consistency of design and brand guidelines across all content.\n\n\nRequirements\n\n\n\tMinimum of 2 - 3 years of experience in video editing and graphic design.\n\tProficient in Adobe Creative Suite (Premiere Pro, After Effects, Photoshop, Illustrator, InDesign).\n\tStrong understanding of storytelling, pacing, and visual communication.\n\tExperience creating assets for social media platforms (Instagram, LinkedIn, YouTube, etc.).\n\tExcellent attention to detail and ability to meet deadlines.\n\tKnowledge of animation and motion graphics is a strong plus.\n\tFamiliarity with logistics or the e-commerce industry is an advantage.\n\n\nKey Competencies:\n\n\n\tCreativity & innovation\n\tStrong communication skills\n\tTime management & ability to multitask\n\tTeam collaboration\n\tProblem-solving mindset\n\tAdaptability in a fast-paced, deadline-driven environment.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: recruitment@speedaf.com using the Job Position as the subject of the mail.\n\nNote: Only qualified candidates will be selected.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]