[
  {
    "title": "Job Vacancies at MSI Nigeria Reproductive Choices",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancies-at-msi-nigeria-reproductive-choices-1",
    "pubDate": "Wed, 02 Jul 2025 19:36:32 GMT",
    "source": "JobGurus",
    "keyword": "msi nigeria reproductive choices",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance"
    ],
    "content": "MSI Nigeria Reproductive Choices is a result-oriented social enterprise, which uses modern management and marketing techniques to provide reproductive health care and allied services. MSION’s goal is to meet the needs of underserved Nigerians and dramatically improve access and use of a range of reproductive health services.\nMSI Nigeria Reproductive Choices is part of Marie Stopes International’s Global Partnership which is in over 37 countries worldwide and it operates in Nigeria through six service delivery channels.\n\nWe are recruiting to fill the following positions below:\n\n1.) Regional Quality Advisor (RQA)\n\nJob Location: Ibadan, Oyo\nEmployment Type: Full-time\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nOverall Responsibility\n\n\n\tThe Regional Quality Advisor is a member of the Clinical Services Team and is responsible for ensuring high quality clinical standards in line with the global Marie Stopes International (MSI) mantra of One World One Standard.\n\tThe duties and responsibilities presented below may change as centre activities evolve and expand.\n\n\nClinical Responsibilities:\n\n\n\tDirectly conduct competency assessment of all Doctors and Nurses for all services including Tubal Ligation and Vasectomy services.\n\tDirectly supervise the set up and roll out Centres in the region and support the centres to provide all clinical services (Core and Non-Core) in line with SOP\n\tInvestigate minor and major clinical incidents using the Incident Reporting Template and submit report\n\tParticipate actively in relevant workshops and conferences and contribute to the review of clinical standards and protocols for the benefit of MSI NIGERA REPRODUCIVE CHOICES and its affiliates.\n\n\nQuality Assurance Responsibilities:\n\n\n\tResponsible for clinical quality service provision technical assistance and competencies in MSI’s core services throughout MSI NIGERA REPRODUCIVE CHOICES ’s channels: Clinics, MS Ladies, Public sectors facilities and Outreach within the designated region\n\tPerform needs assessment at all MSI NIGERA REPRODUCIVE CHOICES clinical service delivery sites (SCTOs/ MS Ladies Sup, CTOs)\n\tProvide guidance in preparation of materials and logistics for various levels of facilities/service providers before, during and after each clinical Quality Assurance activity.\n\tHave and in-depth understanding of QTA and be conversant with various MSI QTA Tools, such as Centre, Star Scan, QTA check list etc.\n\tEnsure availability of all relevant MSI guidelines and training materials needed in training various levels\n\tof trainees\n\tShall maintain a database of all clinicians including locums and ensure their competencies are up to date.\n\tShall be responsible for the quality of all medical products in the regional store ensuring their storage and use are up to standards.\n\n\nProviding Technical Quality Assurance:\n\n\n\tConduct regular internal QTA visits and track progress in all MSI NIGERA REPRODUCIVE CHOICES clinical services delivery points to ensure that high quality clinical standards are consistently met.\n\tProvide advice and guidance to the supervisors in the region on MSI NIGERA REPRODUCIVE CHOICES s quality assurance processes.\n\tCoordinate Clinical Training Officers within the region and provide appropriate and relevant training materials, documents, models and stationery to be purchased for each training.\n\tSupport the training advisors to Coordinate delivery of clinical trainings to ensure that the quality of trainings conforms set standards.\n\tFollow up on all challenges/ complaints emanating from any clinical training sessions and ensure they are addressed professionally where necessary.\n\tWhile on monitoring visits, identify appropriate training needs within the region facilities/service providers and arrange for appropriate trainings.\n\tWillingness to travel at least 60%\n\n\nSupportive Supervisory Functions:\n\n\n\tShall be responsible for the conduct of competency assessment for all clinicians under his/her purview.\n\tShall be responsible for ensuring certificates and licensure are tracked and up to date amongst clinician assigned to him/her.\n\n\nCommunication and Administration:\n\n\n\tMaintain an updated database of key trainings/orientations/supervisory visits offered teams and other partners\n\tKeep and manage records of all centre activities including minutes of centre teams’ meetings CMEs, Data bases reports of SSV and training reports.\n\tFollow up on all supervisor’s complaints relating to any of the MSIN services and make recommendations.\n\n\nExperience / Education\n\n\n\tDegree in Medicine and Surgery or Nursing/Midwifery with at least B.Sc or MPH\n\tAt least 5 years of post-graduation experience [ESSENTIAL]\n\tMaster’s degree in public health or International Health is an added advantage\n\tSenior Nurse/Midwives with training experience in Sexual and Reproductive health care delivery\n\tEvidence of good standing with a recognised clinical related professional body.\n\tEvidence of basic managerial qualification\n\tExperience of working in Sexual and Reproductive Health [ESSENTIAL]\n\tExperience in implementing quality assurance/quality improvement projects\n\tExcellent project management and coordination skills (ESSENTIAL)\n\tOutstanding written and verbal communication skills [ESSENTIAL]\n\tWork experience with a non-governmental organization (DESIRABLE)\n\tArticulate and analytical with attention to details (ESSENTIAL)\n\tMust have requisite experience to work with minimum supervision.\n\n\nApplication Closing Date: 6th July, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their brief cover letter as ONE MS Word document or PDF to: msngrecruitment@msichoices.org.ng using the Job Position as the subject of the mail.\n\n \n\n2.) Trade Marketing Manager\n\nJob Location: Abuja (FCT)\nEmployment Type: Full-time\n\nObjectives\n\n\n\tThe Trade Marketing Manager is responsible for the development and execution of the 4 Ps.\n\tHe/she shall execute programs which aim at generating interests, engagements, and demand for the company’s products (ethical, OTC and consumer goods) at key channels.\n\tPart of the marketing strategy entails trade message development, trade materials development and brand awareness to achieve sales objectives of the defined hospital, wholesale, and retail product portfolio.\n\tThe Manager will work in conjunction with the Head of Marketing and Head of Sales to deliver the annual Trade Business Plan in line with the company’s broader activation approach and strategic objectives\n\n\nOverall Responsibilities\n\n\n\tCreate and implement strategies to drive the sales pipeline and meet revenue goals for target geographies across Nigeria.\n\tCreate integrated Channel (Hospital, Grocery, Wholesale and Retail) marketing programs utilising local market insights and sales input to ensure relevance in key geographies, to maximise sell-through.\n\tBe the expert in Trade (Channel) Marketing strategy development and effective execution to timelines.\n\tDirectly engage with external Partner (customer) Accounts, to build long-term relationships, across retail, online, and B2B (wholesale and distributor) business\n\tLead Trade Marketing in coordinating mini-campaigns, supporting product launches and seasonal business needs.\n\tFacilitate and enhance the Sales Team’s efforts in driving incentive programs and ensure successful execution of channel marketing activations.\n\tWork closely with Sales, Marketing, Digital and Creative teams to ensure consistent messaging across all channel partner activities.\n\tConnect with the Marketing team to support key projects, including events, promotional activities and trade shows as required.\n\tOversee the activation of best-in-class POS material both in-store and online to maximise consumer engagement, brand presence and product awareness.\n\tMaintain a solid foundation of customer & shopper knowledge and awareness around the customer journey, particularly with the evolution of e-Commerce.\n\tCollaborate with and oversee the work of external agencies, providing clear design briefs and optimising all projects.\n\tDevelop and maintain portfolio merchandising practices and guidelines appropriate for the market and support with necessary implementation training.\n\tThrough regular field visits and understanding of brand performance metrics, identify additional market-focused trade activity opportunities and work with planning teams to ensure requirements can be executed in a timely manner.\n\tInput to competitor analysis by understanding competitor activity by trade segment and sharing this with the relevant Market and Competitive Intelligence team.\n\tEvaluate trade activity and gain insight to inform future activity.\n\tEnsure insights and recommendations are shared with internal stakeholders.\n\tMeasure financial ROI/KPIs for programs and activities, linking with sell-through data.\n\n\nRequired Qualifications\n\n\n\tGraduate or postgraduate qualification in Social Sciences, Biological Sciences, or a similar field\n\t3 - 5 years of work experience in a consumer goods environment, ideally with some experience in FMCG or the Pharma industry\n\tSome sales experience would be an advantage\n\tTrade or Customer Marketing experience, preferably in the FMCG industry (Pharma industry will be a plus)\n\tUnderstanding of hospital, retail & wholesale trade\n\tCommercial thinking to inform trade opportunities and investment choices.\n\tCross-functional working relationship\n\tStrong communication skills with the ability to deliver key messages succinctly.\n\tStrong organisational and administrative skills\n\tCreative Flair\n\tConfident with Tenacity\n\tLogical Thinking\n\tCollaborative approach.\n\n\nApplication Closing Date: 14th July, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their brief cover letter as ONE MS Word document or PDF to: msngrecruitment@msichoices.org.ng using the Job Position and the location as the subject of the mail.\n\nNote\n\n\n\tThere are no relocation allowances available for this position.\n\tApplication that do not follow the underlined instructions are not followed, will not be considered.\n\tKindly note that this role is open until filled, and interviews will be conducted on a rolling basis even while the advertisement is still active.\n\tMSI Nigeria Reproductive Choices provides equal opportunity in employment and prohibits discrimination in employment on the basis of race, sex, colour, religion, sexual orientation, age, marital status, or disability.\n\n\n \n\n \n\n3.) MSI Ladies Supervisor\n\nJob Locations: Benue and Nasarawa\nEmployment Type: Full-time\n\nOverall Responsibilities\n\n\n\tThe role holder will have three (3) key responsibilities in supervising the MSI Ladies (MSL) as they provide MSI NIGERA services of interest.\n\tThese include clinical, stakeholder liaison and business management support to the MSLs.\n\tS/He will train and support a selected number of private providers who are either registered nurses, midwives or Senior CHEWs spread across the assigned state/location so that women in Nigeria have easy access to options of high-quality reproductive health services, including family planning.\n\tS/he will support in provider management of clinical quality, assuring client safety and satisfaction, data reporting, increasing providers’ business management skills, as well as stakeholder engagement within his/her location of operations.\n\n\nCore Responsibilities:\n\n\n\tEnsure effective and impactful training and supportive supervision of assigned providers, addressing the MSI Quality Assurance thematic areas\n\tEnsure effective and impactful training and supportive supervision of assigned providers, addressing MSI stakeholder engagement strategy for the MSL channel, looking at the sustainability of this approach through provider and government ownership\n\tEnsure effective and impactful training and supportive supervision of assigned providers, addressing MSI Business Management fundamentals of bookkeeping, basic accounting and access to financial support towards expanding the scope and scale of MSLs' businesses\n\tEnsure competency of the providers in areas of counselling, infection prevention, medical emergency preparedness and services provision are maintained at a high level, documented and properly conveyed in monthly reports\n\tEnsure adequate supply of commodities as well as relevant procedural equipment, including overall support and management of the provider's business and delivery of service\n\tEnsure MSI NIGERA ’s data reporting and management procedures, guidelines protocols are strictly followed\n\tEnsure Service delivery points are fully compliant with MSI Clinical Governance frameworks\n\tFacilitates timely identification and reporting of clinical incidents, ensures action plans are in place, and lessons from resolved incidents are shared at SDPs.\n\n\nTraining and Supportive Supervision:\n\n\n\tEnsure all assigned providers are on competency level one all year round\n\n\nConducts once every two months supportive supervision, coaching and mentoring of all trained providers based on needs\n\n\n\tKeeps the Continuous Supportive Supervision checklists and records, follows up on action plans and ensures updates are tracked and reported.\n\tMust collate and maintain up-to-date training and competency database for all team members supervised while using sthe ame to develop the Training Needs Assessment\n\tSupport the preparation and submission of monthly and quarterly facility performance reports on training and quality assessment activities in the assigned state;\n\tIn collaboration with RM and Quality Advisor, lead review meetings aimed at performance improvement, based onthe  outcome of supportive supervision, mentoring and quality assessments findings using best practice at the regional/state level\n\tDocuments best practices and/or lessons learned from MSI NIGERIA’s MSL operations\n\tSupports in logistic planning and delivery of clinical trainings in the most effective and efficient manner, ensuring maximum knowledge gain.\n\n\nSupply Management and Business Capability Support to Providers:\n\n\n\tEnsure zero stock of commodities with all assigned providers, including consumables, during SSVs\n\tEnsure the availability of clinical governance guidelines, manuals and job aids used by these providers is in adequate quantity and track referral linkages of service utilisation\n\tFacilitate, follow up and support providers’ referral and reporting of clinical incidents related to FP and PAC services.\n\tEnsure all infection prevention materials are in place and in use\n\tFacilitates the availability of clinical supplies at service delivery points (SDPs) and ensures that expired stocks are not present at these SDPs\n\tThrough trainings, SSVs and other opportunities address MSI NIGERIA Business Management fundamentals of bookkeeping, basic accounting and access to financial support, including MSLs' business development skills and continuous risk assessment for MSL businesses\n\tCreate in the MSLs provider a culture of cash flow tracking and management, including knowledge of profit made from all service provision or sales relating to the MSLs business. This will include following up with all accreditation standard requirements as applicable, looking at client's profile, behaviour, willingness to pay and provider's knowledge of the health market within his/her catchment\n\n\nAdvocacy, Client Generation for Service and Community Mobilisation Support to MSLs:\n\n\n\tIn collaboration with the RM, act as the focal person for MSI NIGERA at the state level, including representing MSI NIGERA at some level meeting/platforms where necessary as concerns the MSLs operations\n\tSupport the development and maintenance of excellent relationships by the MSLs with the community structure, other health partners, including public institutions in the state with a view to strengthening MSN's impact and increasing service delivery\n\tEnsure strong links between communication about available services at the SDPs and interpersonal communication agents (IPCAs), community mobilisation activities, and overall referral systems\n\tWork with the MSLs providers to identify viable demand creation options in line with MSI NIGERA ’s Demand Creation strategy while ensuring the MSLs understand these demand creation details towards ensuring continuation even after MSI NIGERA's direct support of these activities\n\n\nData Reporting and Management:\n\n\n\tEnsure all service data from assigned providers is collected, collated and reported into ORION or any other available reporting platform by 3the rd of the new month\n\tEnsure all service data entered into ORION or any other available reporting platform is correct, complete, consistent, within reporting dates and up to date\n\tValidate the data reported by the providers and sign off before entry into ORION\n\tWith support from the Regional Monitoring and Evaluation Assistant (RRMEA), ensure that all reported data are archived chronologically in the state offices for data audit purposes.\n\tWorking with the RME unit, ensure assigned providers are trained on data reporting tools and ensure compliance as part of all SSVs\n\tEnsure data reporting tools are available and in use with all assigned providers all year round\n\tWhere applicable, conduct monthly collation of Client Record Audits and completed client feedback forms and transfer to RRMEA for analysis and records\n\tConduct monthly facility-level performance management, including reporting rate analysis for each provider under his/her supervision.\n\n\nKey Experience and Qualification\n\n\n\tRegistered nurse/Midwife or other related areas in Medical Sciences with a strong experience in community level demand creation for health services including basic business knowledge\n\tFamiliarity with the different cultural, social and religious identities in Nigeria including development issues and the international donor community\n\tExcellent communications, presentation, negotiation skills including strong interpersonal, oral, and written communication skills\n\tTechnical Expertise in long acting reversible contraception (LARCs) specifically Implants insertion and removal\n\tSignificant experience of providing competency-based training and certification for providers (Nurses/Midwives and CHEWS) in modern methods of family planning\n\tExperience of providing trainings for national and International NGOs in Nigeria (Experience of DFID, USAID, Gates funded projects, including working in a diverse team environment preferred)\n\tExperience in managing healthcare providers before now will be an added advantage\n\tWillingness to frequently travel to project implementation sites\n\tExperience in the usage of computers and office software packages is mandatory\n\tFamiliarity /Experience with geography of the intervention states is desired.\n\n\nApplication Closing Date: 5th July, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their brief cover letter as ONE MS Word document or PDF to: msngrecruitment@msichoices.org.ng using \"MS Ladies Supervisor Benue/Nasarawa\" as the subject of the mail.\n\nNote\n\n\n\tThere are no relocation allowances available for this position.\n\tIf you wish to be considered for the post, please specify the Position and Location in the subject line if you want your application to be considered.\n\tNote that if the underlined instructions are not followed application will not be considered.\n\tKindly note that this role is open until filled, and we will be conducting Interviews on a rolling basis even while the advertisement is still active.\n\tMSI Nigeria Reproductive Choices provides equal opportunity in employment and prohibits discrimination in employment on the basis of race, sex, colour, religion, sexual orientation, age, marital status, or disability.\n\tChildren by Choice not Chance.\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Payroll Officer Job at Lington & Bernie Consulting Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/payroll-officer-job-at-lington-bernie-consulting-limited-1",
    "pubDate": "Wed, 02 Jul 2025 19:36:32 GMT",
    "source": "JobGurus",
    "keyword": "lington & bernie consulting limited",
    "duplicate": false,
    "classifications": [],
    "content": "Lington & Bernie Consulting Limited was established on October 8, 1999 to provide efficient and qualitative consulting services to the oil and gas industry as well as banks and financial institutions in the areas of human resources placement and management, human resources consulting services, tax administration and payroll services as well as oil and gas fiscal and contractual terms advisory services.\n\nWe are recruiting to fill the position below:\n\nJob Position: Payroll Officer\n\nJob Location: Ikoyi, Lagos\nEmployment Type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tEnsure the accurate and timely preparation and distribution of salaries and wages\n\tProcess timesheets and maintains salary variations on a monthly basis, including all allowances, new staff, terminations, leave and other relevant information on the computerised database in current and accurate form.\n\tPrepares reports and correspondence related to the full range of day-to-day and cyclical payroll functions.\n\tEnsure compliance with all state and federal requirements in relation to statutory deductions\n\tPrepare and forward invoices to the clients\n\tReconciliation of Invoices to determine the accuracy and completeness of receipts from the clients\n\tAttends to personnel and payroll enquiries as necessary.\n\tIdentifies, investigates and resolves discrepancies in timesheet and payroll records\n\tLiaise with Human Resources and other departments when investigating and responding to queries regarding payroll.\n\tIn conjunction with the Payroll Manager, ensure the continuous implementation and improvement of payroll policies, procedures and processes.\n\n\nRequirements\n\n\n\tBSc / HND qualification in a related field.\n\tMinimum of 2 - 3 years of experience in payroll administration\n\tGood communication skills.\n\tExperience in the use of major software packages\n\tKeen attention to detail\n\tAccurate data entry skills\n\tExcellent time management & organisational skills\n\tGreat Excel and mathematical skills.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: jobs@lingtonandbernie.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Project / Site Supervisor Job at Teal Harmony Nigeria Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/project-site-supervisor-job-at-teal-harmony-nigeria-limited",
    "pubDate": "Wed, 02 Jul 2025 19:36:32 GMT",
    "source": "JobGurus",
    "keyword": "teal harmony nigeria limited",
    "duplicate": false,
    "classifications": [],
    "content": "Teal Harmony Nigeria Limited is a design and build company, we manufacture and sell furniture and import furniture fabrics, we also sell diffusers and accessories.We have a showroom to sell furnitures.\n\nWe are recruiting to fill the position below:\n\nJob Position: Project / Site Supervisor\nJob Location: Victoria Island, Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are looking for a detail-oriented Project/Site Supervisor to oversee interior design projects from start to finish.\n\tThe ideal candidate will have a keen eye for detail and a proven track record of successfully executing projects within an interior design firm.\n\n\nKey Responsibilities\n\n\n\tOversee all phases of interior design projects, from planning to completion.\n\tCoordinate with contractors, designers, and suppliers to ensure timely project execution.\n\tConduct regular site inspections to ensure quality and adherence to design specifications.\n\tManage project timelines, budgets, and resources effectively.\n\tResolve on-site issues and ensure compliance with safety and quality standards.\n\tProvide regular updates to project managers and clients on project progress.\n\n\nQualifications\n\n\n\tBachelor’s Degree in Construction Management, Architecture, or a related field.\n\t3-7 years of experience as a Project/Site Supervisor in an interior design or construction firm.\n\tExceptional attention to detail and ability to maintain high-quality standards.\n\tStrong leadership and problem-solving skills.\n\tProficiency in project management tools (e.g., MS Project, Procore, or similar).\n\tKnowledge of interior design processes and materials.\n\n\nSalary\nN150,000 - N200,000 per month.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: bunmi@teal-harmony.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Site Engineer Job at Ascentech Services Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/site-engineer-job-at-ascentech-services-limited-1",
    "pubDate": "Wed, 02 Jul 2025 19:36:32 GMT",
    "source": "JobGurus",
    "keyword": "ascentech services limited",
    "duplicate": false,
    "classifications": [],
    "content": "Ascentech Services Limited - Our client is recruiting to fill the position below:\n\nJob Position: Site Engineer\nJob Location: Oshodi, Lagos\nEmployment Type: Full-time\n\nJob Description\n\n\n\tOur client is seeking a detail-oriented and proactive Site Engineer to oversee on-site construction activities and ensure projects are executed efficiently, safely, and in compliance with design specifications.\n\tThe site engineer will supervise daily site activities, monitor workers and materials, ensure quality finishing, enforce safety protocols, and report progress to the Site Manager.\n\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tSupervise day-to-day site operations and ensure work is carried out as per drawings and specifications.\n\tMonitor project timelines, budgets, and quality standards.\n\tLiaise with clients, consultants, and subcontractors to ensure smooth workflow.\n\tConduct site inspections and ensure adherence to safety and regulatory standards.\n\tPrepare reports, documentation, and project updates as required.\n\n\nQualifications\n\n\n\tBachelor’s degree in Civil Engineering or a related field.\n\tProven experience in site supervision and construction management.\n\tStrong understanding of construction methods, materials, and regulations.\n\tExcellent communication, problem-solving, and organizational skills.\n\n\nSalary\nN200,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: cv@ascentech.com.ng using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Quality Control Officer - Laundry Business Job at Elvaridah",
    "link": "https://www.jobgurus.com.ng/jobs/view/quality-control-officer-laundry-business-job-at-elvaridah",
    "pubDate": "Wed, 02 Jul 2025 19:36:32 GMT",
    "source": "JobGurus",
    "keyword": "elvaridah",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "At Elvaridah, we emphasize on the critical matters and prospects of organizations such as business growth, strategy, planning, marketing, structure, and people management across different industries. We help companies focus on the growth of their businesses while aligning costs with strategy. With our all-inclusive approach and expertise, we capture values across the boundaries of any organization. Elvaridah focuses on optimizing all the different parts of a business as a unit.\n\nWe are recruiting to fill the position below:\n\nJob Position: Quality Control Officer - Laundry Business\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Quality Control Officer in the laundry business is responsible for ensuring that all laundry processes meet established quality standards.\n\tThis role involves inspecting and monitoring the washing, drying, and finishing of garments and linens to guarantee customer satisfaction, compliance with hygiene standards, and operational efficiency.\n\n\nKey Responsibilities\n\n\n\tConduct regular inspections of laundry processes, including washing, drying, ironing, folding, and packaging.\n\tMonitor and maintain quality standards to ensure garments are cleaned, treated, and handled according to company policies and customer requirements.\n\tIdentify defects such as stains, damage, color fading, shrinkage, or improper finishing, and take corrective actions.\n\tMaintain records of quality checks and prepare reports on quality performance.\n\tCoordinate with the operations team to address quality issues promptly and implement improvements.\n\tEnsure compliance with health and safety regulations and environmental standards.\n\tTrain and guide laundry staff on quality standards and best practices.\n\tCollaborate with suppliers to ensure quality of detergents and chemicals used.\n\tParticipate in audits and assist in certification processes related to quality management.\n\tStay updated on industry trends and quality control techniques.\n\n\nRequirements\n\n\n\tHigh School Diploma or equivalent; a Degree or Certification in Quality Management or Textile / Laundry Technology is a plus.\n\tProven experience in quality control, preferably in the laundry, textile, or garment care industry.\n\tStrong attention to detail and problem-solving skills.\n\tGood communication and interpersonal skills.\n\tAbility to work under pressure and meet deadlines.\n\tKnowledge of laundry equipment, detergents, and stain removal techniques.\n\tFamiliarity with quality standards such as ISO, if applicable.\n\n\nMethod of Appliction\nInterested and qualified candidates should send their CV to: careers@elvaridah.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]