[
  {
    "title": "Junior Account Officer Job at Secom Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/junior-account-officer-job-at-secom-limited-1",
    "pubDate": "Wed, 18 Jun 2025 10:17:02 GMT",
    "source": "JobGurus",
    "keyword": "secom limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Secom Limited was established as a financial services company. It began as a financial service company with steadfast commitment to exceptional customer service, and overtime, has grown into a leading professional Company in Nigerian. Secom is a diverse and innovative company able to handle large scale transactions and also manage such operations seamlessly.\n\nWe are recruiting to fill the position below:\n\nJob Position: Junior Account Officer\n\nJob Location: Okota, Lagos\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tComplying with all company, local, state, and federal accounting and financial regulations\n\tCompiled, analyzed, and reported financial data.\n\tCreating periodic reports, such as balance sheets, profit & loss statements, etc.\n\tPresenting data to managers, investors, and other entities.\n\tMaintaining accurate financial records.\n\tPerforming audits and resolving discrepancies.\n\tComputing taxes.\n\tKeeping informed about current legislation relating to finance and accounting.\n\tAssisting management in the decision-making process by preparing budgets and financial forecasts.\n\n\nRequirements\n\n\n\tBachelor’s Degree in accounting or a related field.\n\t1-2 years of experience as an accountant\n\tMore education or experience may be preferred.\n\tStrong analytical, communication, and computer skills.\n\tUnderstanding of mathematics, accounting, and financial processes.\n\tEthical behavior.\n\tAttention to detail.\n\n\nSalary\nN150,000 gross Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: resume@secomltd.comusing the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Quality Assurance Engineer Job at Renmoney",
    "link": "https://www.jobgurus.com.ng/jobs/view/quality-assurance-engineer-job-at-renmoney",
    "pubDate": "Wed, 18 Jun 2025 10:17:02 GMT",
    "source": "JobGurus",
    "keyword": "renmoney",
    "duplicate": false,
    "classifications": [
      "Software Engineering"
    ],
    "content": "Renmoney - We are a passionate team determined to challenge the status quo and make financial inclusion count for the millions of under-banked individuals and small business owners in Nigeria. We provide loans, savings, and fixed deposit solutions to our customers. Our vision is to be the most convenient lending company, delivering outstanding service experiences.\n\nWe are recruiting to fill the position below:\n\nJob Position: Quality Assurance Engineer\n\nJob Location: Lagos, Nigeria\nJob type: Full-time (On-site)\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAssure the process for contracting software is adequate\n\tPerform acceptance testing on the software\n\tAnalyze and define existing business processes and interdependencies.\n\tAnalyze functional specs for completeness & test ability.\n\tDefine and document test strategies and scripts based on functional specs.\n\tAssist in the development and execution of test cases of all complexity and risk.\n\tVerifies that the application functions according to expected results and system requirements\n\tIdentifies problems, reports defects and test progress\n\tAnalyze test output, identify discrepancies and clearly document defects.\n\tEnsure requirements are testable.\n\tRecognize & document issues and propose options for issue resolution.\n\tFamiliar with coding standards and various technologies (PHP, SQL, JAVA, etc.).\n\tTest Plan/Strategy\n\tTest scripts (aligned with functional specification)\n\tIAT Test Report\n\n\nRequirements\n\n\n\tCandidates should possess a B.Sc. degree in Computer Science or an Information Technology-related course.\n\tA minimum of 5 years of quality assurance and software testing\n\tUser support experience is desirable\n\tKnowledge of and experience in the IT Industry is a plus.\n\tProficient knowledge of testing tools and processes\n\tAble to receive and comprehend directions from senior members of the IT/QA team.\n\n\nBenefits\n\n\n\tYou’ll receive competitive compensation and work with amazing people.\n\tYou’ll work in a beautiful environment with a flat structure and solve complex, real-world challenges.\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Web Developer Job at Compovine Technologies Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/web-developer-job-at-compovine-technologies-limited-1",
    "pubDate": "Wed, 18 Jun 2025 10:17:02 GMT",
    "source": "JobGurus",
    "keyword": "compovine technologies limited",
    "duplicate": false,
    "classifications": [
      "Software Engineering"
    ],
    "content": "Compovine Technologies Limited is an indigenous company with the main aim of offering Information Technology, Sales and Services to individuals and corporate organizations. Compovine Technology Limited currently has branches in Ibadan, Abuja, Lagos, Lokoja, Kano, Kaduna, Jos, Minna, Port Harcourt and Enugu, and we are still expanding.\n\nWe are recruiting to fill the position below:\n\nJob Position: Web Developer\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\n\nRequirements\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tInterested candidates should possess an HND qualification / Bachelor's Degree with 3 - 10 years of work experience.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hr2@compovine.com using the Job Position as the subject of the email.\n\nNote: For Inquiries, Contact the Mobile Number: 09130376338, Telephone: 01 4546576, 01 2957715.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Secretary (Male / Female) Job at Integrated Warehousing Services Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/secretary-male-female-job-at-integrated-warehousing-services-limited",
    "pubDate": "Wed, 18 Jun 2025 10:17:02 GMT",
    "source": "JobGurus",
    "keyword": "integrated warehousing services limited",
    "duplicate": false,
    "classifications": [],
    "content": "Integrated Warehousing Services Limited was established to provide Comprehensive Warehousing Services, Control and Risk Management Services to Banks and Non-Banks Financiers for Custody Transfer, Receipt and Release of pledged imported or locally sourced goods.\n\nWe are recruiting to fill the position below:\n\nJob Position: Secretary (Male / Female)\n\nJob Location: Nigeria\n\nRequirement\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tInterested candidates should possess an HND / BSc Degree.\n\n\nMethod of Application\nInterested and qualified candidates should send their Resume to: info@iwsng.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Facility / Debt Recovery Officer Job at Confederated Facilitators Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/facility-debt-recovery-officer-job-at-confederated-facilitators-limited",
    "pubDate": "Wed, 18 Jun 2025 10:17:02 GMT",
    "source": "JobGurus",
    "keyword": "confederated facilitators limited",
    "duplicate": false,
    "classifications": [],
    "content": "Confederated Facilitators Limited (CFL Group) started in 1998 with a company known as Next Technology Nigeria Limited, a telecommunication company that provides internet services for teeming customers. The company was founded by Engr. Lai Omotola. In a space of Nine (9) years, additional 14 companies were added to make up CFL Group as it is known today. In 2015, CFL Group became a full fledge infrastructure company cutting across Real Estate, Energy, Power, Construction, Agriculture and Transportation. We are a fully indigenous Nigeria Company located in Lagos.\n\nWe are recruiting to fill the position below:\n\nJob Position: Facility / Debt Recovery Officer\nJob Location: Lagos\nEmployment Type: Full-time\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Summary\n\n\n\tWe are urgently seeking a Facility / Debt Recovery Officer with hands-on experience in property management, particularly within malls, service apartments, or commercial facilities.\n\tThe ideal candidate must possess strong facility management skills, a good understanding of electrical systems, and the ability to handle debt recovery from tenants or clients professionally.\n\n\nKey Responsibilities\n\n\n\tOversee daily operations and maintenance of the facility or property.\n\tCarry out regular inspections of the facility and report faults or necessary repairs.\n\tAssist in resolving tenant complaints and facility-related issues.\n\tWork with technical staff or vendors to ensure timely repair and maintenance of electrical systems.\n\tMonitor service quality, facility cleanliness, and vendor performance.\n\tHandle recovery of outstanding debts or service charges from tenants.\n\tConduct follow-ups via calls, emails, and physical visits to ensure payment compliance.\n\tPrepare and submit daily and weekly reports to management.\n\tEnsure compliance with health, safety, and building regulations.\n\n\nRequirements & Qualifications\n\n\n\tOND / HND / B.Sc. in Facility Management, Estate Management, Business Administration, or related fields.\n\tMinimum of 2 years of experience in facility management, especially in malls, estates, or commercial properties.\n\tExperience in debt recovery or customer relations is a strong advantage.\n\tBasic electrical knowledge and the ability to oversee simple repairs.\n\tStrong interpersonal and communication skills.\n\tAbility to work under pressure and meet recovery targets.\n\tMust be proactive, organized, and detail-oriented.\n\n\nSalary\nN170,000 - N200,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: jobs@cflgrouponline.com using the Job Position as the subject of the email.\n\nNote: Only shortlisted candidates will be contacted.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]