[
  {
    "title": "Job Vacancies at Perfetti Van Melle Nigeria Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancies-at-perfetti-van-melle-nigeria-limited-2",
    "pubDate": "Thu, 13 Nov 2025 17:41:04 GMT",
    "source": "JobGurus",
    "keyword": "perfetti van melle nigeria limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Perfetti Van Melle Nigeria Limited is a wholly owned subsidiary of Perfetti Van Melle group, one of the worlds largest manufacturers and distributors of confectionery and chewing gum, creating imaginative products and brands that are enjoyed in over 150 countries.\n\nWe are recruiting to fill the following positions below:\n\n1.) Territory Sales Manager\n\nJob Location: Lagos\n\nWhat You Will Do\n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDistribution set up - The incumbent will be responsible for designing the Beat plans for the distributor(s) for his/her territory in consultation with his/her Regional Sales Manager to ensure optimum coverage of the market.\n\tDistributor’s infrastructure – As part of appointing distributors, the incumbent will be responsible for getting the relevant infrastructure on board, being the following – Distribution units, Warehouse, Beat plan, Salesmen, Distributor’s finance.\n\tDistributor’s Management – For a long-term efficient performance, track distributors’ efficiencies and ensure that all distributor related issues are timely monitored and addressed. ROI Monitoring and reporting.\n\tManagement information system (MIS) – To ensure correct tracking of business, the Territory Sales Manager will be required to maintain all the MIS for his/her territory and report same to head office and the Regional Sales Manager on regular basis as agreed.\n\tSales Target – The incumbent will be responsible for achieving the sales target as set by the Sales Head for his/her territory and will lead the process for further breaking down the territory sales target to channels and beats. Both primary and secondary sales targets will be the responsibility of the TSM.\n\tTeam Management – Review Sales performances of the distributor sales team and implement relevant training programs for improved performance.\n\tMarket intelligence – Alert to competition activities in his/her territory in term of trade and consumer promotions, trade launches, consumer and trade activations, NPD launches etc. and report same on time to his/her Regional Sales Manager and Head of Sales accordingly.\n\n\nOur Perfect Candidate\n\n\n\tResult oriented\n\tTime Management\n\tAnalytical\n\tLeader\n\tGood communication.\n\n\nClick here to apply online\n\n \n\n2.) Manufacturing Quality Assurance Executive - Level 3 (E3)\n\nJob Location: Lagos\n\nResponsibilities\n\n\n\tEnsures the factory floor, equipment, work surfaces and environment are constantly maintained clean and safe for the production of good quality products. \n\tEnsures all raw & packaging materials meant for production use are suitable, certified okay and are well – stored.\n\tMonitor conditions of storage of materials in the WIP store and ensure safe keeping of materials prior to usage.\n\tEnsures production processes within the factory satisfy specifications and standard procedures of operations.\n\tConduct periodic verification/calibration of weighing scales, filters, metal detectors, flow meters, measuring devices and gauges within the factory.\n\tCarry out periodic online quality checks/tests (send samples to the laboratory for further analyses where applicable) and advise the production team to make adjustments, preventive/corrective measures where necessary for conformity to product specifications.\n\tImplement Hazard analysis and critical control points (HACCP) plans, including record keeping to monitor critical food safety systems.\n\n\nRequirements\n\n\n\tHolds a Degree in Chemistry or Biochemistry.\n\tBetween 6 - 8 years of relevant work experience within FMCG industry\n\tExperiene managing team.\n\tKnowledge of GMPs.\n\tGood presentation and report writing skills\n\tInnovative and result oriented.\n\n\nClick here to apply online\n\n \n\n3.) Automation Specialist\n\nJob Location: Lagos\n\nResponsibilities\n\n\n\tPerform troubleshooting and maintenance necessary to keep observing instruments operating at their peak efficiency on a daily basis.\n\tMust be able to inspect, tests, detect abnormal fluctuations, adjust and repair instruments used for measuring and indicating pressure, temperature etc.\n\tMust be able to test accuracy of measuring instruments, controllers and other recording, indicating or controlling instruments to locate defective components in system.\n\tInitiate, own and assist with the resolution of RCAs (Root Cause Analyses) and completion of resulting actions.\n\tPrepares schematic drawings, sketches, and reports to reflect changes or alterations made in instruments, circuits and systems.\n\tKeep supervisor informed on progress on assigned tasks, problems and concerns related to the instrumentation; provide status reports as required and accept priorities as assigned.\n\tCollaborate with plant technicians to create efficient, effective and unified work environment based on the principles of teamwork and mutual responsibility for shared objectives.\n\tEnsure awareness, understanding and application of QHSE policy on assigned.\n\n\nRequirements\n\n\n\tHND / B.Sc Degree in Electrical / Electronics Engineering.\n\t3 - 5 years of relevant work experience.\n\tProven ability to improve business operations.\n\tExcellent trouble-shooting skills.\n\tExcellent analytical skills.\n\tGood team player.\n\n\nClick here to apply online    \n\n    \n\n        Click here to Apply",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]