[
  {
    "title": "Civil Engineer Job at Pennek Nigeria Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/civil-engineer-job-at-pennek-nigeria-limited",
    "pubDate": "Wed, 04 Jun 2025 15:05:32 GMT",
    "source": "JobGurus",
    "keyword": "pennek nigeria limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Pennek Nigeria Limited is a real estate investment firm specializing in the procurement and offering of choice plots of land in rapidly-developing cities with high ROI potential. We aim to make land ownership accessible, and have established strong operational relationships with banking partners to provide financing facilities. Operating within the same economic and social environment as our clients, we understand the challenges they face and take proactive steps to remove obstacles to land ownership.\n\nWe are recruiting to fill the position below:\n\nJob Position: Civil Engineer\n\nJob Location: Abuja (FCT)\n\nRole Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThis is a full-time, on-site role for a Civil Engineer located in Abuja. The Civil Engineer will be responsible for designing, planning, and overseeing construction and maintenance of building structures and infrastructure. This includes managing stormwater systems and ensuring all civil engineering projects meet regulatory standards and safety regulations.\n\n\nQualifications\n\n\n\tCandidates should possess a Bachelor's Degree in Civil Engineering or a related field\n\tProfessional Engineer (PE) license is an advantage\n\tCivil Engineering Design and Civil Engineering skills\n\tExcellent problem-solving and analytical skills\n\tExperience working as a Civil Engineer\n\tProficiency in Planning and managing construction projects\n\tAbility to work independently and as part of a team.\n\n\nMethod of Application\nInterested and qualified candidates should send their a Cover Letter and CV to: info@pennek.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Human Resource Officer (HR) Job at Western Development Company Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/human-resource-officer-hr-job-at-western-development-company-limited",
    "pubDate": "Wed, 04 Jun 2025 15:05:32 GMT",
    "source": "JobGurus",
    "keyword": "western development company limited",
    "duplicate": false,
    "classifications": [],
    "content": "Western Development Company Limited (WDCL) is an independent limited liability company, established in Nigeria for over 13 years ago. WDCL is the sole representative of various overseas companies in the fields of Information Technology, Telecommunications, Mechanical Engineering and Electrical/Electronic Engineering.\n\nWe are recruiting to fill the position below:\n\nJob Position: Human Resource Officer (HR)\nJob Location: Nigeria\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a people-focused and detail-oriented Human Resources Officer to help manage key HR functions and foster a positive work environment.\n\tIf you’re passionate about employee welfare, recruitment, and HR best practices, we’d love to meet you.\n\n\nResponsibilities\n\n\n\tAssist in recruitment, onboarding, and orientation of new staff\n\tMaintain and update employee records and HR databases\n\tSupport payroll preparation by providing relevant data (e.g., attendance, leaves)\n\tEnsure compliance with company policies and labor regulations\n\tHandle employee queries and provide support as needed\n\tOrganize staff training, development programs, and performance appraisals\n\tSupport disciplinary and grievance procedures professionally.\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Public Relations Officer Job at Africa Plus Partners Nigeria Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/public-relations-officer-job-at-africa-plus-partners-nigeria-limited",
    "pubDate": "Wed, 04 Jun 2025 15:05:32 GMT",
    "source": "JobGurus",
    "keyword": "africa plus partners nigeria limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Africa Plus Partners Nigeria Limited (APPNL) is a SEC licensed asset management company focused on infrastructure fund management and on the execution of small-to-mid-sized infrastructure projects in Nigeria and sub-Saharan Africa. Since inception, we have established and managed multiple equity-based, Naira denominated infrastructure funds (AIPF 1, AIPF 2 & recently, InfraCo). With a rich and robust deals pipeline, in excess of N400bn, APPNL strives to harness resources at its disposal to unlock tremendous opportunities and leverage its structuring capabilities to maximize profitability, enhance the wealth and value of its managed funds whilst contributing towards the Sustainable Development Goals (SDGs).\n\nWe are recruiting to fill the position below:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Position: Public Relations Officer\n\nJob Location: Benin City, Edo\nJob type: Full-time\n\nResponsibilities\n\n\n\tMedia relations, corporate communications, stakeholder mgt.\n\n\nExperience\n\n\n\t7+ years\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hr@africapluspartners.com using the Job Postion as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Relationship Manager, Personal Banking Job at Optimus Bank",
    "link": "https://www.jobgurus.com.ng/jobs/view/relationship-manager-personal-banking-job-at-optimus-bank",
    "pubDate": "Wed, 04 Jun 2025 15:05:32 GMT",
    "source": "JobGurus",
    "keyword": "optimus bank",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Optimus Bank is a digital-driven financial service platform built with a bold ambition of offering optimum banking experiences to millions of customers globally.\n\nWe are recruiting to fill the position below:\n\nJob Position: Relationship Manager, Personal Banking\nJob Location: Port Harcourt, Rivers\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe are seeking a dedicated and dynamic Relationship Manager to join our Retail Banking team in Port Harcourt. \n\n\nResponsibilities\nThis Include:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tIdentify opportunities to cross-sell and upsell banking products and services\n\tProvide overall leadership and continually enhance team performance in various areas to achieve quality customer service delivery.\n\tDrive business growth and achieve set revenue, quality risks assets and deposit mobilization targets through effective relationship management.\n\tCustomer acquisition\n\tProper onboarding of new customer, (funding account, linking of ATM card and onboard on Mobile Application)\n\tBooking of quality loans\n\tPOS terminal deployment and driving of collection.\n\tRelationship management with all customers of the Bank\n\tDelivery of excellent customer services to customers\n\tDeveloping new relationships and managing existing ones\n\tDaily engagement with customers for deposit mobilization\n\tSalary accounts acquisition\n\tPreparation of weekly and monthly performance review documents\n\tResponsible for managing the team members (Account officers and DSA)\n\n\nRequirements\n\n\n\tBachelor's degree in Business, Finance, or related field\n\tMinimum of 4-5 years of experience in a similar role\n\tCandidate should be a resident of Port-Harcourt\n\tProven experience in personal banking\n\tExcellent communication and interpersonal skills\n\tAbility to work independently and as part of a team\n\tIn-depth knowledge of banking products and services\n\tConfidence and proficiency in personal banking operations\n\tProven track record of successful client relationship management\n\tStrong analytical and problem-solving skills.\n\n\nBenefits\n\n\n\tLimitless Growth\n\tPositive and Inclusive Work Environment\n\tTailored Rewards and Recognitions\n\tContinuous learning environment\n\tHealth and Wellness Benefits.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Openings at MKH Properties Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-mkh-properties-limited",
    "pubDate": "Wed, 04 Jun 2025 15:05:32 GMT",
    "source": "JobGurus",
    "keyword": "mkh properties limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "MKH Properties Limited is committed to providing unparalleled services that cater to the diverse needs of our esteemed clients, partners, and investors.\n\nWe are recruiting to fill the position below:\n\n1.) Customer Experience Officer\n\nJob Location: VGC, Lekki-Ajah - Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a highly motivated and detail-oriented Customer Experience Officer to join our team in the real estate sector.\n\tThe ideal candidate will be responsible for ensuring that our clients have a seamless and satisfactory experience throughout their real estate journey — from initial inquiry through property acquisition, after-sales services, and beyond.\n\tThis role requires strong communication, empathy, problem-solving, and process management skills.\n\n\nKey Responsibilities\n\n\n\tAct as the first point of contact for prospective and existing clients across all communication channels (phone, email, social media, walk-ins).\n\tHandle customer inquiries, complaints, and feedback professionally and promptly, escalating complex issues when necessary.\n\tMaintain accurate and updated client records using CRM tools.\n\tLiaise with internal departments (sales, legal, operations, etc.) to follow up on client requests, updates, and project timelines.\n\tAssist in the development and implementation of customer service policies, standards, and procedures.\n\tConduct periodic client check-ins and satisfaction surveys to assess service quality and identify improvement areas.\n\tEducate clients on product offerings, promos, payment plans, and other relevant information.\n\tTrack and analyze customer interactions to provide insight into customer trends and areas for improvement.\n\tPromote customer loyalty and retention through personalized and solution-driven service.\n\n\nRequirements and Qualifications\n\n\n\tBachelor's Degree in Business Administration, Marketing, Communications, or related field.\n\tMinimum of 1 – 2 years of experience in customer service, preferably in real estate or a related industry.\n\tExcellent verbal and written communication skills.\n\tStrong interpersonal and conflict resolution skills.\n\tFamiliarity with CRM systems and the Microsoft Office Suite.\n\tAttention to detail and commitment to delivering excellent customer service.\n\tProximity to Lekki – Ajah is required.\n\n\nApplication Closing Date: 18th June, 2025.\n\nMethod of Applicatio\nInterested and qualified candidates should send their Resume and a Cover letter to: hr.mkhproperties@gmail.com using the Job Position as the subject of the mail.\n\n \n\n2.) Business Development Manager\n\nJob Location: VGC, Lekki-Ajah - Lagos\nEmployment Type: Full-time\nDepartment: Sales & Business Development\n\nJob Summary\n\n\n\tThe Business Development Manager will be responsible for driving sales growth, forging strategic partnerships, identifying new business opportunities, and expanding the company’s client base in the real estate sector. \n\tThe ideal candidate will have a deep understanding of real estate markets, excellent networking skills, and a strong track record in sales or business development.\n\n\nKey Responsibilities\n\n\n\tIdentify and pursue new business opportunities in residential and commercial real estate.\n\tDevelop and maintain relationships with brokers, channel partners, corporate clients, investors, and developers.\n\tAttend industry events, exhibitions, and networking functions to promote the brand.\n\tPrepare business proposals, presentations, and strategic plans to support growth initiatives.\n\tConduct market research to identify trends, customer needs, and competitive activity.\n\tLead negotiations and close deals with potential clients and stakeholders.\n\tCollaborate with marketing and sales teams to develop targeted strategies for lead generation.\n\tMonitor sales performance, track KPIs, and report on progress to senior management.\n\tStay up to date with industry developments, zoning laws, and regulatory changes.\n\n\nRequirements\n\n\n\tBachelor’s Degree in Business Administration, Marketing, or related field.\n\t3 - 7 years of experience in business development, preferably in the real estate industry.\n\tProven track record of achieving sales targets and driving revenue growth.\n\tExcellent communication, negotiation, and interpersonal skills.\n\tStrong analytical and problem-solving capabilities.\n\tKnowledge of CRM tools and MS Office Suite.\n\tAbility to work independently and as part of a collaborative team.\n\tProximity to the location (VGS, Lekki-Ajah) is an added advantage.\n\n\nWhat We Offer\n\n\n\tCompetitive salary and performance-based incentives.\n\tOpportunities for career advancement.\n\tA dynamic and inclusive work culture.\n\tExposure to premium real estate projects and clientele\n\n\nApplication Closing Date: 17th June, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their Resume and a Cover letter to: hr.mkhproperties@gmail.com using \"Application for Business Development Manager – Real Estate\" as the subject of the mail.\n\n \n\n3.) Graphic Designer\n\nJob Location: Ajah, Lagos\nEmployment Type: Full-time\nDepartment: Brand & Communications\nReports To: Brand Manager\n\nJob Summary\n\n\n\tWe’re looking for a highly creative Graphics Designer to join our Brand & Communications team. \n\tYou will be responsible for creating compelling visual content that communicates the brand’s value, drives engagement, and supports sales and marketing efforts across all platforms.\n\n\nKey Responsibilities\n\n\n\tDesign visually appealing marketing materials including flyers, banners, social media graphics, signage, and digital ads.\n\tAdapt brand assets into formats for web, print, and offline distribution (e.g., roll-up banners, billboards, newsletters).\n\tEnsure visual consistency across all communication platforms in line with brand guidelines.\n\tCreate brochures, FAQs, project forms, and branded documents to support marketing and sales operations.\n\tDevelop engaging motion graphics for social media, ads, presentations, and explainer videos.\n\tPerform high-quality photo manipulation and enhancement to elevate property visuals.\n\tCollaborate with writers, marketers, video editors, and developers to create integrated campaign assets.\n\tWork with tight deadlines and respond quickly to design revisions and campaign needs.\n\tStay up to date with design trends, tools, and real estate visual storytelling approaches.\n\n\nRequirements\n\n\n\tHND / Bachelor’s Degree in Graphic Design, Visual Arts, or related field.\n\t2+ years of professional design experience (preferably in real estate, advertising, or lifestyle branding).\n\tProficiency in Adobe Creative Suite (Photoshop, Illustrator, InDesign, After Effects is a plus).\n\tStrong portfolio showcasing a mix of print, digital, and social media design.\n\tProximity to Location(Ajah) is an added advantage.\n\n\nSalary\nN200,000 - N250,000 / Month.\n\nApplication Closing Date: 14th June, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hr.mkhproperties@gmail.com using the Job Position as the subject of the mail.\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]