[
  {
    "title": "Business Development Manager Job at HEA Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/business-development-manager-job-at-hea-group",
    "pubDate": "Tue, 03 Jun 2025 10:17:23 GMT",
    "source": "JobGurus",
    "keyword": "hea group",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "HEA Group - We are a multifaceted service group operating across the energy, engineering, and environmental sectors in Nigeria. Our organization delivers comprehensive solutions that span technical project execution, workforce development, and sustainability consulting. With a strong emphasis on safety, quality, and regulatory compliance, we support clients in achieving operational excellence and long-term impact. Our energy services arm offers specialized support in upstream and downstream operations, including project management, procurement, technical manpower supply, and maintenance services. We collaborate closely with industry stakeholders to ensure seamless execution of complex energy projects, leveraging deep sector expertise and a responsive delivery model.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nIn the built and industrial environments, we provide expert manpower solutions and engineering support tailored to meet the unique needs of infrastructure, oil and gas, and industrial clients. From staffing critical project roles to managing field operations, our teams are equipped to deliver value at every stage of the project lifecycle. Our environmental division offers strategic advisory, compliance support, and project implementation services across a range of sustainability and environmental management areas. These include environmental impact assessments, audits, waste management, and regulatory liaison, helping clients meet both local and international environmental standards. Driven by innovation, guided by integrity, and committed to excellence, we operate with a unified vision: to be a trusted partner in powering progress, enabling sustainable growth, and delivering value across Nigeria’s key industrial sectors.\n\nWe are recruiting to fill the position below:\n\nJob Position: Business Development Manager\nJob Location: Lagos Island, Lagos\nEmployment Type: Full-time\n\nDescription\n\n\n\tWe are a leading provider of environmental management, sustainability, and compliance solutions—serving clients across oil & gas, energy, infrastructure, and development sectors.\n\tOur work balances business performance with environmental responsibility.\n\tWe're seeking a Business Development Manager with strong industry experience and a proven track record in winning business, managing bids, and building key client relationships.\n\n\nKey Responsibilities\n\n\n\tLead generation, conversion & BD strategy execution.\n\tIdentify, coordinate & submit high-quality bids/tenders.\n\tRepresent the company at events and client meetings.\n\tDevelop & implement BD and marketing plans.\n\tBuild strong client & partner relationships.\n\tConduct market research & analyze trends to unlock new income streams.\n\n\nRequirements\n\n\n\tBachelor’s / Master’s Degree in Environmental Science, Engineering or a related field.\n\t8 - 12 years of experience in Business Development (Environmental Services, Engineering, Energy, or Oil & Gas)\n\tSolid knowledge of EOI/bid processes\n\tStrong communication, negotiation & relationship-building skills\n\tHighly driven, ethical, and detail-oriented.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hea.careers@outlook.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Executive Assistant Job at Femaus Consults",
    "link": "https://www.jobgurus.com.ng/jobs/view/executive-assistant-job-at-femaus-consults",
    "pubDate": "Tue, 03 Jun 2025 10:17:23 GMT",
    "source": "JobGurus",
    "keyword": "femaus consults",
    "duplicate": false,
    "classifications": [],
    "content": "Femaus Consults - We are a dynamic brand dedicated to driving excellence across diverse sectors. We specialize in capacity building, recruitment tailored to elevate businesses and organizations.\n\nWe are recruiting to fill the position below:\n\nJob Position: Executive Assistant\nJob Location: Abuja\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a highly organized, proactive, and detail-oriented Executive Assistant to provide comprehensive support to the CEO.\n\tThe ideal candidate will be a self-starter with excellent communication skills, the ability to manage multiple priorities, and a strong sense of discretion and confidentiality.\n\tThis role requires a high level of professionalism, efficiency, and the ability to anticipate the needs of the executive and the organization.\n\n\nKey Responsibilities\nAdministrative Support:\n\n\n\tManage the executive’s calendar, including scheduling meetings, appointments, and travel arrangements.\n\tPrepare and edit correspondence, communications, presentations, and other documents.\n\tMaintain and organize files, records, and reports, ensuring confidentiality and accuracy.\n\tHandle incoming and outgoing communications, including emails and phone calls.\n\n\nMeeting Coordination:\n\n\n\tCoordinate and prepare materials for meetings, including agendas, presentations, and minutes.\n\tAttend meetings as required, take detailed notes, and follow up on action items.\n\tArrange and manage logistics for both internal and external meetings, including venue booking, catering, and technology setup..\n\n\nProject Management:\n\n\n\tAssist in the planning and execution of special projects and events.\n\tTrack project timelines, deliverables, and budgets, ensuring deadlines are met.\n\tLiaise with internal teams and external partners to ensure smooth project execution.\n\n\nCommunication and Liaison:\n\n\n\tAct as the primary point of contact between the executive and internal/external stakeholders.\n\tBuild and maintain strong relationships with key stakeholders, including clients, partners, and team members.\n\tRepresent the executive in a professional manner, both internally and externally.\n\n\nConfidentiality and Discretion:\n\n\n\tHandle sensitive information with the highest level of confidentiality and discretion.\n\tManage and protect the executive’s personal and professional information\n\n\nRequirements\n\n\n\tInterested candidates should possess an HND / BSc Degree with 2 - 4 years of work experience. \n\n\nSkills:\n\n\n\tExceptional organizational and time-management skills.\n\tStrong written and verbal communication skills.\n\tProficiency in Microsoft Office Suite (Word, Excel, PowerPoint, Outlook) and other relevant software.\n\tStrong problem-solving skills and the ability to work independently.\n\tProfessional demeanor and strong interpersonal skills.\n\tAbility to multitask and prioritize effectively in a fast-paced environment.\n\tHigh level of attention to detail and accuracy.\n\tKnowledge of graphic design is an added advantage.\n\n\nMethod of Application\nInterested and qualified candidates should send their Resume and a Cover Letter detailing their qualifications and experience to: femausconsults@gmail.com using “Executive Assistant” as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Sales Manager - Real Estate Job at Mshel Homes Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/sales-manager-real-estate-job-at-mshel-homes-limited",
    "pubDate": "Tue, 03 Jun 2025 10:17:23 GMT",
    "source": "JobGurus",
    "keyword": "mshel homes limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Mshel Homes Limited is a real estate development and marketing company incorporated in 2018 with a unique vision to be the leading real estate company in Nigeria, with an outstanding reputation for honesty, integrity and impeccable customer service.\n\nAt Mshel Homes Limited our mission is to create a lifetime relationship with our clientele by deliverying property solutions through innovative and technological driven processes that caters to your real estate needs whilst adhering to the highest standards, systems and performance goals necessary to achieving your dreams.\n\nWe are recruiting to fill the position below:\n\nJob Position: Sales Manager - Real Estate\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Location: Ikate, Lagos \nEmployment Type: Full-time\n\nJob Description\n\n\n\tWe are seeking a highly experienced Sales Manager with a proven track record of consistently closing deals and exceeding sales targets.\n\tThe ideal candidate will have deep knowledge of the real estate market, especially in land and building sales, and possess exceptional team management skills.\n\tThis is a fully onsite role based in Salem, Lagos with no accommodation provided.\n\n\nResponsibilities\n\n\n\tDrive sales of lands and buildings with a strategic approach to meet and exceed company targets.\n\tManage, motivate, and develop the sales team to maximize their potential and performance.\n\tPrepare and present sales reports to senior management.\n\tCollaborate with marketing and operations teams to align sales strategies.\n\tBuild and maintain strong relationships with clients, ensuring a seamless sales process.\n\tMonitor market trends and competitor activities to identify new sales opportunities.\n\tEnsure compliance with company policies and industry regulations.\n\n\nRequirements\n\n\n\tCandidates should possess relevant qualifications with extensive experience in real estate sales, particularly in Sites and Services and building transactions.\n\tProven track record of closing numerous deals and consistently meeting or exceeding sales targets.\n\tStrong leadership skills with experience managing and mentoring a sales team.\n\tExcellent negotiation, communication, and interpersonal skills.\n\tDeep understanding of the Lagos real estate market is highly desirable.\n\n\nBenefits\n\n\n\tSalary N300,000 - N400,000 / month\n\tAttractive commission structure plus your salary\n\tOpportunity for professional growth and career advancement within the company.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hr@mshelhomeslagos.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Supply Chain and Operations Specialist Job at Castville Solutions",
    "link": "https://www.jobgurus.com.ng/jobs/view/supply-chain-and-operations-specialist-job-at-castville-solutions",
    "pubDate": "Tue, 03 Jun 2025 10:17:23 GMT",
    "source": "JobGurus",
    "keyword": "castville solutions",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Castville Solutions is a recruitment and business solutions provider specializing in the healthcare sector. We focus on connecting healthcare facilities with highly skilled professionals, enabling efficient operations, and driving business growth. Our services extend to recruitment, Templates for process and operations management, SOP development, and healthcare-specific training, with a clear mission to transform the healthcare workforce and operations.\n\nWe are recruiting to fill the position below:\n\nJob Position: Supply Chain and Operations Specialist\n\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking for a highly motivated and experienced Supply Chain and Operations Specialist to join our dynamic healthcare organization.\n\tThis role requires strong leadership capabilities and a proven track record ofmanaging complex supply chain operations in a fast-paced environment.\n\n\nKey Responsibilities – Supply Chain Operations Specialist\nLead and Coordinate End-to-End Supply Chain Activities:\n\n\n\tOversee the entire supply chain process from procurement, inventory management, warehousing, and distribution of healthcare products and medications.\n\tEnsure seamless coordination between suppliers, logistics partners, internal stakeholders, and healthcare facilities to meet delivery timelines.\n\tAnticipate and resolve supply chain disruptions or delays to maintain product availability and patient care standards.\n\n\nOptimize Operational Workflows:\n\n\n\tAnalyze current supply chain operations and identify inefficiencies or bottlenecks in procurement, inventory, and distribution processes.\n\tImplement improved workflows that streamline operations, reduce cycle times, and minimize wastage or stock-outs.\n\n\nEnhance Performance, Reduce Costs, and Improve Service Levels:\n\n\n\tCollaborate with procurement and finance teams to negotiate favorable terms with vendors and suppliers while maintaining product quality.\n\tMonitor inventory turnover rates and implement demand forecasting methods to optimize stock levels and reduce holding costs.\n\n\nManage Cross-functional Teams and Foster Collaboration:\n\n\n\tFacilitate regular communication between departments to align supply chain activities with clinical and operational needs.\n\tProvide training, mentorship, and performance feedback to team members to foster a high-performing supply chain team culture.\n\n\nMonitor Key Performance Indicators (KPIs):\n\n\n\tEstablish and track key supply chain metrics such as order fulfillment rate, inventory accuracy, supplier performance, lead time, and logistics costs.\n\tUse dashboards and reporting tools to provide real-time visibility into supply chain performance.\n\n\nImplement Continuous Improvement Strategies:\n\n\n\tConduct regular audits and root-cause analyses to drive quality and efficiency across the supply chain.\n\tInitiate cost-saving initiatives and operational innovations in response to market changes or internal challenges.\n\n\nEnsure Regulatory Compliance and Policy Adherence:\n\n\n\tMaintain up-to-date knowledge of industry regulations, including Good Distribution Practices (GDP), healthcare logistics standards, and pharmaceutical handling guidelines.\n\n\nRisk Management and Business Continuity:\n\n\n\tDevelop and implement risk mitigation strategies for supply chain disruptions, such as supplier failures, transport delays, or product recalls.\n\tCreate contingency and emergency response plans to ensure continuity of medical supply chains during crises or pandemics.\n\tCollaborate with the quality and compliance teams to manage product recalls, shortages, or stock rationalizations.\n\n\nStakeholder Relationship Management:\n\n\n\tBuild and maintain effective relationships with suppliers, third-party logistics providers, and internal stakeholders.\n\tAct as a key point of contact for escalations and issue resolution related to supply chain activities.\n\tEvaluate and onboard new vendors and service providers based on performance, compliance, and value delivery.\n\n\nReporting and Strategic Planning:\n\n\n\tProvide regular performance reports and updates to senior leadership on supply chain metrics and improvement initiatives.\n\tContribute to the development of strategic supply chain plans aligned with overall organizational goals.\n\n\nQualifications\n\n\n\tBachelor's Degree in Supply Chain Management, Operations, Business Administration, or related field.\n\tMinimum of 5 years of experience in supply chain and operations, with at least 2 years in a leadership role.\n\tStrong analytical and problem-solving skills, highly proactive.\n\tExcellent communication and interpersonal skills.\n\n\nNote: For more information or enquiries, call or send a WhatsApp message to: 09010634633.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Openings at Dana Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-dana-group",
    "pubDate": "Tue, 03 Jun 2025 10:17:23 GMT",
    "source": "JobGurus",
    "keyword": "dana group",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Dana Group isa major Nigerian conglomerate with a diverse range of businesses spanning manufacturing, aviation, automotive, and pharmaceuticals.It's known for its contributions to Nigeria's industrialization and has diversified into various sectors over its history.\n\nWe are recruiting to fill the following positions below:\n\n1.) Regulatory Pharmacist\n\nJob Location: Oshodi - Isolo, Lagos\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDevelops strategies and procedures to ensure regulatory compliance.\n\tEnsure all legal and regulatory documents are filed and monitor compliance with laws and regulations.\n\tResponsible for authorisation of production, Batch Manufacturing Record (BMRs), and document review\n\tMake sure all professional activities undertaken by you or under your control are covered by adequate professional indemnity cover.\n\tEnsures Good Manufacturing Practice (GMP) is adhered to\n\tRegistration of products with the National Agency for Food Drugs. Administration and Control (NAFDAC)\n\tEnsure that Production and manufacturing operations are carried out in compliance with the current WHO GMP, National Regulatory Authority Standard (NAFDAC, PCN, Federal Ministry of Labour and Productivity), and NIS ISO 9001:2015.\n\tLiaising with bodies such as the Pharmaceutical Group of the Manufacturers Association of Nigeria (PMGMAN), National Agency for Food Drugs Administration and Control (NAFDAC), Pharmacists Council of Nigeria (PCN), Pharmaceutical Society of Nigeria (PSN), Federal and State Ministries of Health, Customs and Excise Authorities\n\tHandling of market complaints with QC/QA\n\tStay abreast of GMP, Pharmacovigilance, and CGMP guidelines regarding product development and compliance\n\tProcessing and obtaining chemical permit for Dana Group of companies\n\tOversee the registration and renewal of the premises (Including Warehouse) license with the Pharmacist Council of Nigeria (PCN) annually as contained in chapter 152 of the pharmacy law.\n\tOversee the activities of the regulatory unit as it concerns compliance, registration, and renewal of licenses.\n\tEnsure that all legal and professional requirements covering operations in the premises are adhered to\n\tGuiding the management and internal clients to comply with regulatory requirements\n\tParticipation in advocacy, public corporate responsibility programmes and maintains a cordial relationship with stakeholders in our business.\n\n\nRequirements\n\n\n\tInterested candidates should possess a B. Pharm Degree with 5 years of work experience. \n\n\nApplication Closing Date: 24th June, 2025. \n\nMethod of Application\nInterested and qualified candidates should send their CVs to: vacancies@danagroup.com using the Job Position as the subject of the mail.\n\n \n\n \n\n2.) Marketing Executive\n\nJob Location: Victoria Island, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe are seeking a highly motivated and creative Marketing Executive to join our organization. \n\tThe successful candidate will be responsible for developing, implementing, and overseeing marketing strategies and campaigns to promote our products and services. \n\tThis role requires a strong understanding of market trends, consumer behavior, and competitor analysis.\n\n\nResponsibilities\nMarketing Strategy and Planning:\n\n\n\tDevelop and improve upon existing marketing strategies to maximize company profit\n\tConduct market research to assess current trends, brand awareness, and competitor ventures\n\tCollaborate with cross-functional teams to achieve business goals.\n\n\nEvent Management and Activation:\n\n\n\tSupport events and activation programs to enhance brand visibility and customer engagement\n\tCoordinate and oversee promotional events, exhibitions, and communication campaigns.\n\n\nAdvertising and Media:\n\n\n\tMonitor ads like TV, Radio, Social media, etc. to ensure consistent brand messaging\n\tOversee content creation for publication across various marketing channels.\n\n\nMarketing Assets and Materials:\n\n\n\tMonitor the functionality and wellbeing of marketing assets like gift items, display stands, T-shirts, face caps, and other materials\n\tEnsure adequate availability of Point of Sale (POS) materials when needed.\n\n\nVendor Relationship Management:\n\n\n\tConduct competitive market research to inform marketing strategies\n\tMaintain good rapport with professionals from other automobile companies and vendors\n\tManage vendor relationships to ensure effective collaboration.\n\n\nData Management and Advertising Initiatives:\n\n\n\tManage all data and advertising initiatives to optimize marketing performance\n\tAnalyze data to track performance, measure user engagement, and refine marketing strategies.\n\n\nRecord Keeping and Financial Management:\n\n\n\tMaintain accurate record keeping of all marketing bills and payments\n\tEnsure timely payment and reconciliation of marketing expenses.\n\n\nContent Creation and Publication:\n\n\n\tOversee content creation for publication across various marketing channels\n\tEnsure consistent brand messaging and tone across all marketing materials.\n\n\nRequirements\n\n\n\tBSc / BA / HND in Marketing, Business Administration, or relevant field\n\tExperience: Proven experience as a Marketing Executive or similar role.\n\n\nSkills:\n\n\n\tGood understanding of market research techniques, data analysis, and statistics methods\n\tThorough knowledge of strategic planning principles and marketing best practices\n\tProficient in MS Office and marketing software (e.g., CRM)\n\tAbility to Meet Set Goals/Targets\n\tStrong organizational and time-management abilities\n\tFamiliarity with social media and web analytics (e.g., WebTrends)\n\tExcellent communication and people skills\n\tCreativity and commercial awareness.\n\n\nSalary\nN150,000 - N200,000 per month.\n\nApplication Closing Date: 17th June, 2025.\n\nMethod of Application\nInterested and qualified applicants are to send their CV to: vacancies@danagroup.com using the Job Position as subject of the email.\n\nNote: If you are a motivated and creative individual with a passion for marketing, we encourage you to apply for this excitingopportunity.\n\n \n\n \n\n3.) Security Officer\n\nJob Location: Ibadan, Oyo\nEmployment Type: Full-time\n\nJob Description\n\n\n\tWe are seeking an experienced and skilled Security Supervisor to join our team at Dana Pharmaceuticals, in Ibadan.\n\tThe successful candidate will be responsible for overseeing the security operations of our organization, ensuring the safety and security of our employees, assets, and premises.\n\n\nResponsibilities\nSupervise Security Personnel:\n\n\n\tOversee and manage a team of security guards\n\tEnsure that security personnel are properly trained and equipped to perform their duties.\n\n\nSecurity Operations:\n\n\n\tMonitor and respond to security breaches or incidents\n\tConduct regular patrols and inspections of premises\n\tEnsure that security protocols and procedures are followed.\n\n\nRisk Management:\n\n\n\tIdentify potential security risks and vulnerabilities\n\tDevelop and implement strategies to mitigate security risks.\n\n\nEmergency Response:\n\n\n\tRespond to emergency situations such as intrusions, fires, or medical emergencies\n\tCoordinate with emergency services as needed.\n\n\nRecord Keeping:\n\n\n\tMaintain accurate records of security incidents and breaches\n\tPrepare and submit security reports as required.\n\n\nCollaboration:\n\n\n\tWork closely with other departments to ensure a safe and secure working environment\n\tLiaise with law enforcement agencies and other external stakeholders as needed.\n\n\nRequirements / Qualifications\n\n\n\tNational Diploma (ND) in any field\n\tMinimum of 2-3 years of experience in a security supervisory role.\n\tPrevious Experience is an added advantage\n\n\nSkills:\n\n\n\tStrong leadership and management skills\n\tExcellent communication and interpersonal skills\n\tAbility to work independently and as part of a team\n\tStrong problem-solving and analytical skills\n\tFamiliarity with security protocols and procedures.\n\n\nApplication Closing Date: 24th June, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CVs to: vacancies@danagroup.com using the Job Position as the subject of the mail.\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]