[
  {
    "title": "Head, Customer Service Operations Job at Virtual Switch International",
    "link": "https://www.jobgurus.com.ng/jobs/view/head-customer-service-operations-job-at-virtual-switch-international",
    "pubDate": "Fri, 13 Jun 2025 13:28:05 GMT",
    "source": "JobGurus",
    "keyword": "virtual switch international",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "At Virtual Switch International, we are at the forefront of powering the future. With a legacy spanning 7 years, we have established ourselves as a leading force in the power industry. Our commitment to innovation, sustainability, and reliability has driven us to excel in providing cutting-edge solutions to meet the world's growing energy needs.\n\nWe are recruiting to fill the position below:\n\nJob Position: Head, Customer Service Operations\n\nJob Location: Abuja (FCT)\n\nDescription\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAs the Head of Customer Service Operations you will oversee and lead the company’s customer service department, ensuring the delivery of exceptional support experiences to customers across all touchpoints.\n\tThis role is responsible for driving customer satisfaction, streamlining service processes, managing the service team, and ensuring alignment with the company’s strategic goals.\n\n\nKey Responsibilities\n\n\n\tLead and manage the daily operations of the customer service department, ensuring consistent and high-quality service delivery.\n\tDevelop and implement customer service policies, procedures, and standards.\n\tSet performance targets for speed, efficiency, customer satisfaction, and quality, and monitor them through KPIs and dashboards.\n\tCoordinate with other departments (sales, marketing, IT, product development) to ensure a seamless customer journey.\n\tDevelop strategies for continuous improvement of the customer service function, including automation and digital support tools (e.g. chatbots, CRM, etc.).\n\tOversee the recruitment, training, and performance evaluation of customer service staff.\n\tImplement customer feedback mechanisms and ensure issues are escalated and resolved efficiently.\n\tIdentify trends in customer inquiries, complaints, and behavior to inform business improvements.\n\tManage customer service budgets, forecasts, and resource planning.\n\tChampion a customer-centric culture across the organization.\n\n\nEducational Qualifications and Experience\n\n\n\tBachelor’s Degree in Business Administration, Communications, Management, or a related field.\n\tMinimum of 6 –10 years of progressive experience in customer service or operations, with at least 3 years in a leadership or managerial role.\n\tExperience in fintech & e-commerce is preferred.\n\tA Master’s Degree (MBA or equivalent) is an added advantage.\n\tDemonstrated success in managing large customer service teams and implementing service improvement initiatives.\n\n\nKey Skills and Competencies:\n\n\n\tStrong leadership and people management skills.\n\tExcellent communication and interpersonal abilities.\n\tStrategic thinking with the ability to execute operational plans.\n\tAnalytical mindset with proficiency in interpreting customer data and KPIs.\n\tHigh level of emotional intelligence and conflict resolution skills.\n\tExperience with CRM tools, ticketing systems, and digital communication channels.\n\tAbility to work in a fast-paced, target-driven environment.\n\n\nWork Environment and Culture:\n\n\n\tFast-growing and innovation-driven organization.\n\tCollaborative and performance-oriented team culture.\n\tCustomer-obsessed, data-driven decision-making environment.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: humancapital@virtualswitch.org using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Social Media Manager Job at Professional Perfect Solutions",
    "link": "https://www.jobgurus.com.ng/jobs/view/social-media-manager-job-at-professional-perfect-solutions",
    "pubDate": "Fri, 13 Jun 2025 13:28:05 GMT",
    "source": "JobGurus",
    "keyword": "professional perfect solutions",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Professional Perfect Solutions is an information technology company poised at building and managing voice solutions aimed at enabling your customers to reach you anywhere. Seasoned software engineers centered at developing customer driven software and integrating already developed software.\n\nWe are recruiting to fill the position below:\n\nJob Position: Social Media Manager\n\nJob Location: Ajao Estate, Lagos\nEmployment Type: Part-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are looking for a Digital Marketing Officer to develop and implement digital marketing strategies and campaigns.\n\tThe ideal candidate will have strong digital marketing skills, creativity, and the ability to drive engagement and conversions through various online channels.\n\tThis role requires expertise in digital marketing tools, analytics, and content creation.\n\n\nResponsibilities\n\n\n\tDevelop and execute digital marketing strategies and campaigns to drive brand awareness, traffic, and engagement across digital channels, including websites, social media, email, and search engines.\n\tCreate and curate content for digital marketing initiatives, including blog posts, social media posts, emails, videos, and graphics.\n\tManage and optimize digital advertising campaigns, including pay-per-click (PPC) ads, display ads, and social media ads, to achieve campaign objectives and ROI targets.\n\tMonitor and analyze key performance indicators (KPIs), metrics, and analytics data to measure the effectiveness of digital marketing efforts and identify opportunities for improvement.\n\tConduct market research, competitive analysis, and audience segmentation to inform digital marketing strategies and tactics.\n\tCollaborate with internal teams, including marketing, sales, and product development, to align digital marketing activities with business goals and objectives.\n\tStay updated on digital marketing trends, tools, and best practices to ensure the organization remains competitive in the digital landscape.\n\tOptimize website content, user experience, and conversion funnels to improve online visibility, traffic, and conversion rates.\n\tManage relationships with external vendors, agencies, and partners to support digital marketing initiatives and projects.\n\tMaintain accurate and organized records of digital marketing activities, budgets, and performance metrics.\n\n\nRequirements and Qualifications\n\n\n\tBachelor's Degree in Marketing, Digital Marketing, Communications, or related field.\n\tProven experience in digital marketing, with a focus on digital strategy, content creation, and campaign management.\n\tProficiency in digital marketing software, content management systems (CMS), and analytics tools.\n\tExcellent communication and collaboration skills.\n\tStrong understanding of digital marketing channels, platforms, and tools, including SEO, SEM, social media, email marketing, and analytics.\n\tCreative and analytical mindset, with the ability to develop innovative digital marketing solutions and measure their impact.\n\tAbility to multitask and prioritize tasks in a fast-paced environment.\n\tAdaptability and willingness to learn and adapt to new technologies and trends.\n\tAttention to detail and accuracy in work.\n\tIntegrity and professionalism in representing the organization's brand and values.\n\n\nSkills Required:\n\n\n\tDigital marketing strategy\n\tContent creation\n\tCampaign management\n\tAnalytics\n\tMarket research\n\tCollaboration\n\tAdaptability\n\tCommunication\n\tAttention to detail\n\tIntegrity.\n\n\nMethod of Application\nInterested and qualified candidates should submit their Resume to: info@pps.com.ng using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Experienced Hotel Receptionist Job at Hotel Capitol",
    "link": "https://www.jobgurus.com.ng/jobs/view/experienced-hotel-receptionist-job-at-hotel-capitol-3",
    "pubDate": "Fri, 13 Jun 2025 13:28:05 GMT",
    "source": "JobGurus",
    "keyword": "hotel capitol",
    "duplicate": false,
    "classifications": [],
    "content": "Hotel Capitol is a modern and contemporary hotel that offers not only luxury but also comfort at its best. The three-star hotel is strategically located at the heart of Omole Phase 1, making it easily accessible with excellent road networks to other parts of the mainland and the city of Lagos as a whole. The 32-room Hotel offers tastefully furnished deluxe executive and super executive rooms as well as one- and two-bedroom luxury suites.\n\nWe are recruiting to fill the position below:\n\nJob Position: Experienced Hotel Receptionist\nJob Location: Ojodu-Ikeja, Lagos\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tGreet guests as they arrive and ensure they feel welcome.\n\tChecking guests in and out efficiently and accurately, following hotel procedures.\n\tHandling guest inquiries and providing accurate information about the hotel’s facilities, services, and local attractions.\n\tResolving guest complaints and concerns promptly and effectively, escalating to management when necessary.\n\tMaintaining an orderly front desk area and lobby, ensuring cleanliness and organization at all times.\n\tProcessing reservations by phone, email, or in person and ensuring all reservations are accurately recorded.\n\tHandling cash and credit card transactions accurately and efficiently, maintaining a balanced cash register.\n\tCollaborating with other hotel departments to ensure guests’ needs are met and special requests are handled appropriately.\n\tKeeping up-to-date with hotel policies, procedures, and promotions.\n\n\nSkills and Qualifications\n\n\n\tInterested candidates should possess an HND / Bachelor's Degree with 2 years of experience.\n\tPrevious experience in a customer service role, preferably in a hotel or hospitality environment.\n\tExcellent communication and interpersonal skills.\n\tStrong organizational skills and attention to detail.\n\tAbility to work effectively as part of a team as well as independently.\n\tProficiency in computer systems such as MS Office, hotel management software and POS systems.\n\tAbility to handle multiple tasks simultaneously in a fast-paced environment.\n\tFlexibility to work various shifts, including weekends and holidays.\n\tCandidates should reside within Ojodu, Akute, Ogba, Iyana Ipaja, Ketu\n\n\nSalary\nN80,000 - N100,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: jobs@hotelcapitol.com.ng using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Human Resource Manager Job at Total Secure Nigeria Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/human-resource-manager-job-at-total-secure-nigeria-limited",
    "pubDate": "Fri, 13 Jun 2025 13:28:05 GMT",
    "source": "JobGurus",
    "keyword": "total secure nigeria limited",
    "duplicate": false,
    "classifications": [],
    "content": "Total Secure Nigeria Limited - We design and manufacture innovative and quality physical security and defence products that are exported worldwide. Also, we help examine all risk areas of your business and operations - both internally and externally of your business - which can impact your business’ value.\n\nTo help protect this value, we mitigates the four core risk areas that impact businesses: Hazard & Event Risk, training, Operational & Physical Risk, Market & Economic Risk, and Technology & Informational Risk. We offer physical security and defense products We design and manufacture innovations and market leading automatic physical security solutions\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Human Resource Manager\nJob Location: Abuja\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tAs the Human Resource Manager you will be responsible for developing, implementing, and managing HR strategies, policies, and practices that support the overall business goals.\n\tThis role will oversee key HR functions including recruitment, employee relations, performance management, compensation and benefits, training and development, and compliance with labor laws.\n\n\nKey Responsibilities\n\n\n\tDevelop and implement HR strategies aligned with the company’s vision and objectives.\n\tLead the recruitment and onboarding process to ensure the company attracts and retains top talent.\n\tManage employee relations and ensure a positive workplace culture through conflict resolution and communication strategies.\n\tIdentify training needs and coordinate learning and development initiatives.\n\tMaintain and update HR records, reports, and documentation.\n\tServe as a strategic advisor to management on HR-related matters.\n\tDevelop and implement performance management systems and succession planning initiatives.\n\tEnsure legal compliance with labor and employment regulations in all HR practices and documentation.\n\tDesign and administer compensation, benefits, and reward programs.\n\tMonitor HR metrics and prepare periodic reports for senior leadership.\n\tManage disciplinary processes in line with company policies and best practices.\n\n\nEducation and Experience Requirements\n\n\n\tBachelor’s degree in Human Resource Management, Business Administration, Industrial Relations, or related field.\n\tMinimum of 8 years of progressive HR experience, with at least 5 years in a managerial role.\n\tMaster’s degree or HR professional certifications (e.g., CIPM, SHRM, PHR) is an added advantage.\n\tExperience in managing HR functions in a multi-unit or multi-location organization is preferred.\n\n\nRequired Skills and Competencies:\n\n\n\tStrong knowledge of employment laws and HR best practices.\n\tExcellent interpersonal and communication skills.\n\tAbility to lead and influence at all levels of the organization.\n\tStrong organizational and problem-solving abilities.\n\tHigh level of professionalism, integrity, and confidentiality.\n\tCompetency in HR software, HRIS systems, and Microsoft Office Suite.\n\tStrategic thinking with hands-on execution capability.\n\tConflict resolution and employee engagement skills.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: humancapital@totalsecureng.comusing the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]