[
  {
    "title": "Flutter Developer Job at Integrated Software Services Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/flutter-developer-job-at-integrated-software-services-limited",
    "pubDate": "Tue, 01 Jul 2025 17:14:16 GMT",
    "source": "JobGurus",
    "keyword": "integrated software services limited",
    "duplicate": false,
    "classifications": [
      "Software Engineering"
    ],
    "content": "Integrated Software Services Limited is a software development and information technology consulting company providing information technology services, solutions and products to business enterprises in Africa.\n\nWe are recruiting to fill the position below:\n\nJob Position: Flutter Developer\nJob Location: Surulere, Lagos\nEmployment Type: Full-time\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDevelop cross-platform mobile applications for iOS and Android using the Flutter framework\n\tEnhance and optimize micro code for mobile platforms using Flutter widgets\n\tAnalyze, design, implement, and test new applications using Flutter SDK and Dart\n\tBuild and maintain reliable, reusable, and high-performance Dart code\n\tOptimize application performance, responsiveness, and scalability\n\tEnsure app quality and performance by following best development practices\n\tTranslate UI/UX designs and wireframes into clean, efficient code\n\tMaintain code quality, structure, and automation standards\n\tIntegrate and work with RESTful and SOAP APIs\n\n\nQualifications & Requirements\n\n\n\tBachelor’s Degree in Computer Science, Information Technology, or a related field\n\t1-3 years of relevant experience in software development\n\tAbility to thrive under tight deadlines in a high-pressure environment\n\tStrong proficiency in relevant tools, languages, and mobile development frameworks eg. React...\n\tHands-on experience with Git or other version control systems\n\tSound knowledge of mobile UI/UX design principles\n\tExcellent communication and reporting skills—both written and verbal\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Sales / Marketing Officer Job at ABIS Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/sales-marketing-officer-job-at-abis-group",
    "pubDate": "Tue, 01 Jul 2025 17:14:16 GMT",
    "source": "JobGurus",
    "keyword": "abis group",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "ABIS Group, a leading player in Nigeria’s growing livestock processing Industry, is at the forefront of driving innovation and expanding Nigeria’s capacity to meet both local and international demand for high-quality livestock products.\n\nWe are recruiting to fill the position below:\n\nJob Position: Sales / Marketing Officer\nJob Locations: Lagos\nJob type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tPromote and sell company products/services to potential clients\n\tDevelop and execute marketing strategies, campaigns, and promotional materials\n\tConduct market research and competitor analysis\n\tMeet sales targets and report weekly/monthly results\n\tBuild and maintain strong customer relationships\n\tPrepare and deliver persuasive sales presentations and proposals\n\n\nBasic Requirements\n\n\n\tMinimum of OND/HND/Bachelor's degree in Marketing, Business Administration, or related field\n\tProven experience in sales, marketing, or related role (1-3 years preferred)\n\tStrong communication, negotiation, and interpersonal skills\n\tAbility to meet targets and work under pressure\n\tProficiency in MS Office and social media platforms.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: careers@abisgroup.africa using the Job Position as subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Project Architect Job at Kloverharris Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/project-architect-job-at-kloverharris-limited",
    "pubDate": "Tue, 01 Jul 2025 17:14:16 GMT",
    "source": "JobGurus",
    "keyword": "kloverharris limited",
    "duplicate": false,
    "classifications": [],
    "content": "Kloverharris Limited is a Human resource/IT Consulting company that provides high quality services to businesses across Africa. We pride ourselves in how well we assist organizations overcome challenges that bother on optimal performance by proffering a wide array of solutions through the use of deep IT expertise, industry- wide expertise and highly proficient tools.\n\nWe are recruiting to fill the position below:\n\nJob Positiomn: Project Architect\nJob Location: Lekki Phase 1 (Admiralty Way), Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a highly skilled and creative Project Architect to join our team.\n\tThe ideal candidate will have a strong background in architectural design and project management, with the ability to lead projects from concept through completion.\n\tThis is a great opportunity to work in a collaborative environment on a variety of exciting projects.\n\n\nKey Responsibilities\n\n\n\tManage architectural projects from design through construction.\n\tPrepare detailed drawings, plans, and specifications using AutoCAD, Revit, and other tools.\n\tCoordinate with consultants, contractors, and internal teams to ensure timely project delivery.\n\tConduct site visits and monitor construction to ensure design and quality standards are met.\n\tEnsure compliance with all building codes, zoning laws, and regulations.\n\tProvide leadership and technical guidance to junior team members\n\n\nRequirements\n\n\n\tBachelor’s or Master’s degree in Architecture.\n\tMinimum of 7–8 years of experience in architectural design and project execution.\n\tProficiency in AutoCAD, Revit, SketchUp, and other architectural software.\n\tStrong understanding of building codes and construction methodologies.\n\tExcellent communication and organizational skills.\n\tRegistration with ARCON or other relevant professional body is a plus.\n\n\nBenefits\n\n\n\tCompetitive salary and benefits package.\n\tOpportunities for professional development and career growth.\n\tCollaborative and innovative work environment.\n\tExposure to diverse and high-profile projects.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: Recruitment@kloverharris.com using ''Project Architect'' as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Brand Manager Job at Awake to Power Communications",
    "link": "https://www.jobgurus.com.ng/jobs/view/brand-manager-job-at-awake-to-power-communications",
    "pubDate": "Tue, 01 Jul 2025 17:14:16 GMT",
    "source": "JobGurus",
    "keyword": "awake to power communications",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Awake to Power Communications - We empower Corps Members with digital skills and connect them with opportunities, enabling them to monetize their skills and thrive.\n\nWe are recruiting to fill the position below:\n\nJob Position: Brand Manager\n\nJob Location: Lagos\nJob type: Full-time\n\nRole Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are looking for a creative, strategic, and hands-on Brand Manager to lead brand storytelling, drive awareness, and manage visual communications across all channels.\n\tThe ideal candidate will be responsible for shaping the public perception of the brand through compelling content, including short videos, reels, promotional materials, and digital campaigns.\n\n\nKey Responsibilities\n\n\n\tDevelop and implement comprehensive brand strategies aligned with business goals\n\tCreate engaging multimedia content for social media, websites, and other digital platforms\n\tShoot, edit, and produce high-quality videos for marketing, brand campaigns, and internal use\n\tCollaborate with cross-functional teams including sales, product, and management to support promotional activities\n\tManage social media presence in line with brand identity and business objectives\n\tLead the development of brand guidelines and ensure consistent application across all touchpoints\n\tMonitor market trends, audience insights, and competitor activity to refine brand messaging\n\tOversee performance of brand campaigns and generate reports to track brand health and engagement\n\n\nRequirements\n\n\n\tBachelor's Degree in Marketing, Mass Communication, Media Production, or related field.\n\tMinimum of 5 years of experience in brand management, content development, and video editing.\n\tProven expertise in video production tools (e.g., Adobe Premiere Pro)\n\tStrong portfolio demonstrating creativity and proficiency in storytelling through visual media.\n\tExcellent communication, leadership, and project management skills.\n\tAbility to work onsite full-time from the Lekki Phase 1 office.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: careers@awaketopowercom.com using \"Application - Brand Manager\" as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Software Engineer in Test (SDET) Job at Apex Network",
    "link": "https://www.jobgurus.com.ng/jobs/view/software-engineer-in-test-sdet-job-at-apex-network",
    "pubDate": "Tue, 01 Jul 2025 17:14:16 GMT",
    "source": "JobGurus",
    "keyword": "apex network",
    "duplicate": false,
    "classifications": [
      "Software Engineering",
      "Finance"
    ],
    "content": "Apex Network is a Financial servicing firm, where anyone anywhere can easily and securely transact Bitcoin, which is the future of Money and a catalyst for creating and open financial system in Africa and the World.\n\nWe are recruiting to fill the position below:\n\nJob Position: Software Engineer in Test (SDET)\n\nJob Location: Lagos\nEmployment Type: Full Time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAs a Senior QA Engineer, you will champion quality across our distributed systems.\n\tPartnering with engineering (Golang, Laravel), frontend (VueJS), and API teams, you’ll design and execute test strategies, build automation frameworks, and ensure our micro-services ecosystem meets reliability and performance standards.\n\n\nRequirements\n\n\n\tDevelop and maintain comprehensive test plans: functional, regression, integration, API, and UI\n\tDesign, implement, and scale automated test frameworks (e.g., Selenium, Cypress, Postman, or equivalent)\n\tCollaborate with developers to define testable acceptance criteria and improve testability\n\tExecute manual and automated test suites, analyze results, and report defects\n\tPerform performance, load, and stress testing on microservices and APIs\n\tEstablish and monitor quality metrics (e.g., test coverage, defect rates, MTTR)\n\tIntegrate automated tests into CI/CD pipelines (GitHub Actions, GitLab CI, Jenkins)\n\tMentor junior QA engineers and drive best practices in test automation and quality engineering\n\n\nQualifications\n\n\n\t 5+ years of QA experience in software engineering environments\n\tStrong proficiency in test automation tools and frameworks for API and UI testing\n\tExperience testing microservices architectures and RESTful/gRPC APIs\n\tFamiliarity with Golang and Laravel codebases—able to write basic test scripts or helpers\n\tHands-on experience with frontend testing in VueJS applications\n\tSolid understanding of CI/CD pipelines and integrating test suites\n\tSkilled in defect tracking tools (Jira, GitHub Issues) and version control (Git)\n\tExcellent analytical skills and attention to detail\n\tStrong communication and collaboration mindset\n\n\nStand-Out Qualities:\n\n\n\tBackground in fintech or e-commerce platforms\n\tKnowledge of performance testing tools (k6, JMeter, Locust)\n\tExperience with containerized testing environments (Docker)\n\tFamiliarity with monitoring and observability tools (Prometheus, Grafana)\n\tSecurity testing experience (SAST/DAST toools).\n\n\nBenefits\n\n\n\tCompetitive salary and equity options\n\tFlexible working hours and remote-first culture\n\tComprehensive health insurance package\n\tCollaborative and inclusive team environment.\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]