[
  {
    "title": "Facility Officer Job at Bricklane Consulting",
    "link": "https://www.jobgurus.com.ng/jobs/view/facility-officer-job-at-bricklane-consulting",
    "pubDate": "Fri, 04 Jul 2025 15:40:26 GMT",
    "source": "JobGurus",
    "keyword": "bricklane consulting",
    "duplicate": false,
    "classifications": [],
    "content": "Bricklane Consulting, a recruitment consulting firm, is recruiting suitably qualified candidates to fill the position below:\n\nJob Position: Facility Officer\n\nJob Locations: Ajah & Magodo, Lagos\nEmployment Type: Full-time\nWork Mode: 7:00AM - 5:00PM; Monday- Sunday, two days off\n\nDescription\n\n\n\tOur company is searching for a qualified facilities manager to work alongside security and maintenance staff to ensure our buildings and grounds are clean and safe.\n\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tPerform routine maintenance and repairs on electrical systems, equipment, and facilities.\n\tTroubleshoot and resolve electrical issues promptly.\n\tInstall and configure new equipment and systems as needed.\n\tEnsure compliance with safety regulations and standards.\n\tCollaborate with other teams to ensure seamless operations.\n\tMaintain accurate records of maintenance and repairs.\n\n\nRequirements\n\n\n\tCertification in Engineering or a related field.\n\tAt least 2 years of experience in facility maintenance, Gym repairs, Generator repairs.\n\tStrong knowledge of electrical systems and safety protocols.\n\tExcellent problem-solving skills.\n\tGood communication skills.\n\tThe officers will be required to work in both branches as part of their role.\n\n\nSalary\nN180,000 / Month.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: bricklanerecruitment@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Office Assistant Job at Secom Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/office-assistant-job-at-secom-limited",
    "pubDate": "Fri, 04 Jul 2025 15:40:26 GMT",
    "source": "JobGurus",
    "keyword": "secom limited",
    "duplicate": false,
    "classifications": [],
    "content": "Secom Limited - Our client, an audit firm, is recruiting to fill the position below:\n\nJob Position: Office Assistant\n\nJob Location: Sabo Yaba, Lagos\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAnswer and direct phone calls\n\tOrganize and schedule appointments\n\tRun errands for the office\n\tWrite and distribute emails, correspondence memos, letters, faxes, and forms\n\tDevelop and maintain a filing system\n\tUpdate and maintain office policies and procedures\n\tOrder office supplies and research new deals and suppliers\n\tMaintain contact lists.\n\n\nRequirements\n\n\n\tMinimum of OND qualification\n\t1 - 2 years of experience as an Office Assistant.\n\tMale gender is preferred for gender balance\n\tKnowledge of office management systems and procedures\n\tWorking knowledge of office equipment, like printers and fax machines\n\tProficiency in MS Office (MS Excel and MS PowerPoint, in particular)\n\tExcellent time management skills and the ability to prioritize work\n\tAttention to detail and problem-solving skills\n\tExcellent written and verbal communication skills\n\tStrong organizational skills with the ability to multi-task.\n\tProximity is key.\n\n\nSalary\nN70,000 monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: jobs@secomltd.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Sales Manager Job at Johnvents Industries Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/sales-manager-job-at-johnvents-industries-limited",
    "pubDate": "Fri, 04 Jul 2025 15:40:26 GMT",
    "source": "JobGurus",
    "keyword": "johnvents industries limited",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "Johnvents Foods Limited launched Johnvents Pure Cocoa Powder, an everyday beverage that provides 100% cocoa nourishment. It acquired and set up a cocoa product factory in Idanre for the production of Oluji Pure Cocoa Powder, Johnvents Chocolate drink, Cocoa Pops, Cocoa Cube, and other cocoa-based consumer products.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nAt Johnvents Foods, the goal is to create nourishing experiences that foster happiness, build bonds and nurture unforgettable moments. Whether you’re hosting a special occasion, enjoying an intimate dinner for two, or simply treating yourself to a moment of food bliss, you can be sure of an unforgettable moment filled with nourishment, innovative flavors, treasured memories, and sensational experiences. This is because we believe food is a catalyst for creating meaningful experiences that nourish both the body and the soul.\n\nWe are recruiting to fill the position below:\n\nJob Position: Sales Manager\n\nJob Locations: Kaduna, Niger, Gombe, Lagos, Oyo, Ekiti, Osogbo - Osun, Onitsha - Anambra, Edo and Delta\nEmployment Type: Full-time\n\nSummary\n\n\n\tAre you a passionate, target-driven sales professional ready to take your career to the next level? We are hiring Sales Managers across several locations in Nigeria!\n\n\nKey Responsibilities\n\n\n\tLead and manage sales operations within the assigned territory\n\tDevelop and adapt state-level plans to meet local market dynamics.\n\tRecruit, train, supervise, and evaluate Sales Representatives.\n\tSet sales targets for the team and monitor performance.\n\tIdentify and grow new business opportunities within the state.\n\tExpand distribution channels and increase market share.\n\tBuild and maintain strong relationships with key customers, distributors, and retailers.\n\tEnsure high levels of customer satisfaction and service delivery.\n\tTrack sales performance metrics and provide regular reports to the Regional/National Sales Manager.\n\tMonitor competitors’ activities and market trends.\n\tEnsure efficient stock movement, proper territory coverage, and route planning and collaborate with logistics and supply chain teams for timely products delivery.\n\tDrive revenue and volume targets within the state.\n\tPlan and oversee promotional activities, trade activations, and market storms.\n\n\nRequirements\n\n\n\tBachelor's Degree in Business, Marketing, or a related field.\n\tMinimum of 4 - 5 years of experience in sales management.\n\tStrong leadership and communication skills.\n\tAbility to thrive in a target-driven environment.\n\n\nWhy Join Us?\n\n\n\tCompetitive salary and incentives.\n\tGrowth and career advancement opportunities.\n\tSupportive and performance-driven culture.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and location of interest to: humanresources_foods@johnvents.com using \"Sales Manager – (Preferred Location)\" as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Openings at The Concept Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-the-concept-group-3",
    "pubDate": "Fri, 04 Jul 2025 15:40:26 GMT",
    "source": "JobGurus",
    "keyword": "the concept group",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance"
    ],
    "content": "The Concept Group is a holding company for companies established in 1992. Subsidiaries under the Group include: Rosabon Financial Services - Nigeria Leading Equipment Leasing and Financial Intermediary Company, Concept Nova - Bespoke Enterprise Software Development Company, Percy Aitkins - Bureau De Change.\n\nWe are recruiting to fill the following positions below:\n\n1.) Deputy Manager, Marketing & Communications\n\nJob Location: Yaba, Lagos\nEmployment Type: Full-time\n\nScope and Impact\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Deputy Manager, Marketing & Communications plays a key role in executing and supporting the organization’s marketing, brand, and communication strategies.\n\tThis position is responsible for ensuring consistent messaging, driving audience engagement, supporting integrated campaigns, and enhancing brand visibility and reputation across all internaland external touchpoints.\n\n\nJob Summary\n\n\n\tThe Deputy Manager, Marketing & Communications plays a key role in executing integrated marketing strategies and managing brand communications across multiple platforms.\n\tThe role supports planning, coordinating, and implementing campaigns that drive brand visibility, engagement, and business growth.\n\tIt involves working with creative agencies, media vendors, internal teams, and external stakeholders to ensure consistent brand messaging and effective communication delivery.\n\n\nResponsibilities\nMarketing Strategy & Execution:\n\n\n\tSupport the development and implementation of annual marketing plans and campaigns.\n\tCoordinate integrated marketing efforts across traditional, digital, and experiential platforms.\n\tEnsure all campaigns align with brand positioning and strategic objectives.\n\tMonitor, analyze, and report on campaign performance and ROI.\n\n\nBrand Management:\n\n\n\tEnsure brand consistency across all touchpoints, including content, design, and communications.\n\tWork with creative teams, agencies, and internal stakeholders to develop marketing materials and content.\n\tLead the development and rollout of brand guidelines and toolkits.\n\n\nPublic Relations:\n\n\n\tManage the perception and image of the brand through media relations, stakeholders’ engagement, writing and publishing of feature stores, press releases and op eds.\n\n\nInternal & External Communications: \n\n\n\tDraft and manage corporate communications such as press releases, speeches, newsletters, and internal memos.\n\tServe as a liaison with PR agencies and media outlets for coverage, partnerships, and crisis management.\n\tSupport internal communications to foster a strong company culture and employee engagement.\n\n\nEvents, Sponsorships & Activations:\n\n\n\tPlan and manage events, sponsorships, and brand activations, ensuring alignment with brand strategy.\n\tWork with vendors, partners, and internal teams to deliver seamless event experiences.\n\n\nStakeholder & Team Collaboration:\n\n\n\tWork closely with Sales, Strategy, Product, and HR teams to support cross-functional initiatives.\n\tSupervise and guide junior marketing staff, interns, and agency partners as needed.\n\n\nKey Performance Indicators\n\n\n\tCampaign engagement and conversion metrics\n\tBrand awareness and sentiment improvement\n\tMedia coverage and public perception metrics\n\tInternal stakeholder satisfaction and cross-functional collaboration\n\tOn-time, on-budget delivery of projects and campaigns\n\n\nRequirements\n\n\n\tBachelor’s degree in Marketing, Communications, Public Relations, or related field\n\t5+ years of relevant experience in marketing, brand, or communications\n\tMaster’s degree or professional certification (e.g., CIM, NIMN, APCON, Digital Marketing) is an added advantage\n\tProven track record of supporting or leading successful marketing campaigns\n\tIndustry experience in media, financial services, retail, telecom, or FMCG is a plus\n\tFamiliarity with SEC and regulatory guidelines relating to investment promotions.\n\tStrong understanding of financial products and investment terminology.\n\n\nJob Knowledge:\n\n\n\tMarketing Strategy Development: Sound knowledge of creating and executing marketing plans across digital, ATL, and BTL channels.\n\tContent Creation & Storytelling: Ability to develop compelling content across mediums including social media, TV, print, and PR.\n\tCampaign Management: Skilled in end-to-end campaign planning, budgeting, execution, and performance evaluation.\n\tMedia Planning & Buying: Understanding of media mix optimization, audience targeting, and negotiation with media houses.\n\tDigital Marketing: Knowledge of SEO, social media management, Google Ads, email marketing, and analytics.\n\tBrand Management: Deep understanding of brand equity, identity systems, and maintaining brand consistency.\n\tInternal & External Communications: Experience in managing press releases, crisis communication, and stakeholder messaging.\n\tCreative and Agency Collaboration: Familiarity with briefing, reviewing, andmanaging agencies to deliveron-brand materials.\n\n\nSkills / Competencies:\n\n\n\tStrong verbal and written communication skills\n\tProject management and multitasking ability\n\tCreativity and a good eye for design and messaging\n\tKnowledge of digital marketing tools and platforms (e.g., Google Ads, Meta Ads, Mailchimp, etc.)\n\tStrategic thinking with attention to detail\n\tMedia relations andcrisis communicationexperience (a plus)\n\n\nSalary\nN550,000 - N600,000 per month. \n\nMethod of Application\nInterested and qualified candidates should send their Applications to: careers@conceptgroup-ng.com using the Job Title as the subject of the email.\n\n \n\n2.) Treasury Officer (Funds Mobilization/ Wealth Management)\n\nJob Location: Yaba, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tThe Treasury Officer is responsible for building and managing strategic relationships for fixed deposit customers, serving as the single point of contact for new business as well as existing portfolios.\n\tHe/She will manage the funds of HNI (high net worth) customers.\n\n\nResponsibilities\n\n\n\tSource appropriately priced and structured deposit liabilities for the company from retail and institutional sources.\n\tCultivate new clientele on a regular basis.\n\tCultivate and maintain courteous and efficient relationship with clients.\n\tTimely response to feedback and other customer related issues or requests.\n\tParticipate in creating new and better marketing based on field experience.\n\tVisit, engage prospects and maintain liability generated\n\tPropose services, upselling and cross-selling whenever possible\n\tRecruit, train and build sales team across the country\n\tIncrease number of Treasury services taken up by Clients\n\tEnsure the effective, high-quality management of Clients\n\tConduct periodic competitor analysis, reviewing product rates and requirements\n\tPrepare and send periodic report to management\n\tOn-board and manage subordinates to maintain a consistently high number of prospects, and with a high conversion rate\n\tTrain IMTs and Treasury Admin on the various Treasury products and relevant company policies.\n\n\nQualifications\n\n\n\tMinimum education level –First degree in any discipline from a reputable academic institution. Post-graduate qualification(s) and professional membership will be an added advantage.\n\t3+ years of experience in sales and business development.\n\tDemonstrated track record of meeting/exceeding goals as an individual contributor.\n\tSuccessful experience building a territory from little or nothing.\n\tSkilled at building rapport, opening doors, and understanding business requirements of senior decision makers.\n\n\nMethod of Application\nInterested and qualified candidates should send their Applications to: careers@conceptgroup-ng.com using the Job Title as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Admin Executive Job at the Vault Recruitment (TVR)",
    "link": "https://www.jobgurus.com.ng/jobs/view/admin-executive-job-at-the-vault-recruitment-tvr-1",
    "pubDate": "Fri, 04 Jul 2025 15:40:26 GMT",
    "source": "JobGurus",
    "keyword": "the vault recruitment (tvr)",
    "duplicate": false,
    "classifications": [],
    "content": "The Vault Recruitment (TVR) is a fast growing recruitment firm specializing in connecting top talent with SME's and Startup organizations. Our team of experienced recruiters understands the unique needs and challenges of the modern job market and uses our extensive network and industry knowledge to find the best candidates for our clients.\n\nWe are recruiting to fill the position below:\n\nJob Position: Admin Executive\n\nVacancy Code: SSC012\nJob Location: Idumota, Lagos Island - Lagos\nEmployment Type: Full-time\nWork Mode: On-site\n\nRequirements\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tMinimum of OND in any field with 1 - 2 years of work experience\n\tBasic knowledge of Microsoft Office (Ms Word).\n\tOperate computer systems and software efficiently.\n\tGender: Male or Female\n\tManage documents, perform data entry, and maintain accurate records.\n\tMonitor system performance and troubleshoot basic issues.\n\tGood typing speed and attention to detail.\n\tAbility to follow instructions and work independently.\n\tMust reside around Idumota, Lagos Island (e.g., Obalende, CMS, Ebute Metta, etc.).\n\tMust be available to resume immediately.\n\n\nSalary\nN80,000 - N90,000 monthly.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]