[
  {
    "title": "Job Openings at Wendernek Consulting Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-wendernek-consulting-limited-1",
    "pubDate": "Thu, 06 Nov 2025 13:28:18 GMT",
    "source": "JobGurus",
    "keyword": "wendernek consulting limited",
    "duplicate": false,
    "classifications": [
      "Software Engineering",
      "Finance"
    ],
    "content": "Wendernek Consulting Limited is a leading human resource outsourcing management solutions provider in Nigeria. Our purpose is to provide applied and bespoke solutions to our clients.\n\nWe are recruiting to fill the following positions below:\n\n1.) Quality Assurance / Quality Control Manager\n\nJob Location: Port Harcourt, Rivers\nEmployment Type: Full-time\n\nResponsibilities\nThis role responsibilites cover the following:\nOperations & Administration:\n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDevelop a project quality plan in line with ISO 9001: 2015 international Standard and Contractual requirements, including QA/QC plans and procedures.\n\tResponsible for ensuring implementation of the quality management activities in an organised and efficient manner following the Project Quality Plan, Contract Scope of Work, and ISO 9001:2015 International Standard.\n\tPlan, prepare, implement, and continuously review the project quality management documentation and Client's mandatory quality requirements, specifications, and statutory requirements.\n\tPrepare and implement the quality plan, the QA/QC audit program, and QA/QC procedures.\n\tEnsure regulatory compliance on QA/QC matters.\n\tDetermine, establish, and enforce the quality policy and objectives for the workforce.\n\tAssign duties to all QA/QC inspectors and follow up for prompt and efficient delivery.\n\tConvene internal QA/QC meetings regularly to discuss quality matters as necessary.\n\tCompile quality information needed for the management review.\n\tSupport the implementation of site Health and Safety practices.\n\n\nPeople Operations Management:\n\n\n\tConduct quality induction training for project personnel to ensure they fully grasp the need to continually follow quality policy/objectives and project specifications.\n\tProvide leadership, mentorship, and direction to all the QA/QC personnel.\n\tMonitor personnel for compliance to safety rules and guidelines.\n\tEnsure all equipment is operated in a safe manner.\n\tMonitor all QA/QC personnel for use of PPE.\n\n\nProject Management:\n\n\n\tIdentify contractual requirements and advise the project manager and relevant discipline managers.\n\tDefine required QA/QC resources needed during various project execution phases and manage QA/QC activities.\n\tReview material requisitions to ensure that the contractual quality-related requirements, specifications, and standards are incorporated.\n\tOversee inspection, testing and equipment pre-mobilization activities.\n\tEstablish measurable quality metrics/objectives based on the project needs at all levels of the organization.\n\tPlan, conduct, and report internal & external audits and reviews according to the agreed project audit program\n\tMaintain interface with other discipline managers, i.e., Engineering, Construction, Material Control, and Procurement, to ensure implementation of all quality concerns following the project specification, quality plan, and other supporting QA/QC procedures.\n\tReport promptly to the Chief Operations Officer/Project Manager on any quality-related problems and intended resolutions identified and which need to be resolved, including suggestions on improving project quality management activities.\n\n\nQuality Audits and Inspections:\n\n\n\tEstablish and implement the Inspection and Test Plan.\n\tPerform internal and external audits and, where necessary, raise appropriate corrective action requests and follow up with effective re-audit and closeout.\n\tPlan, execute, and lead quality management system audits for the design, procurement, construction, and commissioning processes.\n\tCarry out sub-subcontractors and suppliers Quality Audits under the external audit program.\n\tManage all inspection and testing activities provided by sub-subcontractors and verify their inspection reports for accuracy\n\tReview and approve inspection and test plans, quality control procedures, welding procedure specifications, qualification records, and inspection records.\n\tIdentify and develop solutions to correct deficiencies raised during inspections.\n\n\nVendor/Sub-contractor Quality Management:\n\n\n\tParticipate in the pre-qualification/appraisal of suppliers (Sub-subcontractors /vendors).\n\tAttending bid clarification meetings with vendors and sub-subcontractors as necessary to reinforce the Client's position regarding quality.\n\tEstablish criteria for evaluating and selecting suppliers.\n\tEnsure the activities carried out by Sub-contractors meet quality requirements.\n\tReview sub-subcontractor, Vendor, and Supplier Inspection & Test Plan, to assign inspection levels (hold, witness & review) as applicable.\n\n\nRequirements\n\n\n\tBachelor’s degree in Engineering or a related field plus 10 years progressive work experience in a similar field.\n\tExtensive knowledge of quality assurance/quality control skills and procedures.\n\tAbility to perform a broad range of duties in quality assurance and quality control functions including the policy and procedure development.\n\tStrong knowledge of industry standards API, ASME, FMEA, SPC, Control Plans, and Experience in an ISO-9000/2015 quality environment.\n\tWorking knowledge of formal structured problem-solving techniques and corrective action management and reporting.\n\tProficient in the use of Microsoft Word, Excel and PowerPoint and willingness to learn other job-related programs and software.\n\tDetail oriented individual with proven ability to work independently and as part of a team to prioritize work, multi-task and get results.\n\tExcellent Interpersonal and communication skills.\n\n\nSalary\nN1,000,000 per month (One Million Naira p/m).\n\nApplication Closing Date: 28th November, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: recruitment@wendernek.com using the Job Position as the subject of the email.\n\n \n\n \n\n2.) Accounting Officer\n\nJob Location: Port Harcourt, Rivers\nEmployment Type: Full-time\n\nJob Description\n\n\n\tProcess invoices, receipts, and other financial documents.\n\tAssist with the preparation and analysis of financial statements, reports, and budgets.\n\tMaintain accurate and organized financial records, including journal entries, ledgers, and accounts receivable/payable.\n\tReconcile financial transactions, accounts, and discrepancies to ensure accuracy and integrity of financial data.\n\tAssist with month-end and year-end closing processes, including reconciliations, adjustments, and accruals.\n\tAnalyzing and reconciling procurement-related financial transactions, ensuring accuracy and compliance with company policies and procedures.\n\tPreparing and maintaining detailed financial reports, budgets, and forecasts related to procurement activities.\n\tCollaborating with cross-functional teams to identify cost-saving opportunities and optimize procurement strategies.\n\tMonitoring and evaluating supplier performance, negotiating contracts, and ensuring timely payments.\n\tProviding financial insights and recommendations to support strategic decision-making in the procurement department.\n\tProvide support and assistance to auditors, tax professionals, and regulatory agencies during audits and examinations.\n\tStay updated on accounting standards, regulations, and best practices to ensure compliance and accuracy in financial reporting.\n\n\nRequirements\n\n\n\tA minimum of a HND or Bachelor's Degree in Accounting.\n\tAt least 3 years of proven experience in accounting, finance, or a related role.\n\tStrong understanding of accounting principles, procedures, and regulations.\n\tProficiency in accounting software, such as QuickBooks, SAP, or Oracle.\n\tExcellent analytical and problem-solving skills.\n\tAttention to detail and accuracy in work.\n\tOrganizational and time management skills.\n\tCommunication and interpersonal abilities.\n\tIntegrity and professionalism in handling confidential financial information.\n\tAdaptability and willingness to learn and grow in the role.\n\n\nApplication Closing Date: 7th November, 2025.\n\nMethod of Application \nInterested and qualified candidates should send their CV to: recruitment@wendernek.com using the Job Position as the subject of the email.\n\n \n\n \n\n3.) Human Resources / Legal Officer\n\nJob Location: Port Harcourt, Rivers\nEmployment Type: Full-time\n\nResponsibilities\n\n\n\tPreparing job descriptions, advertising vacant positions, and managing the employment process.\n\tOrientating new employees and training existing employees.\n\tProvide legal guidance on HR policies, procedures, and compliance.\n\tManage and resolve employment litigation and disputes.\n\tEnsure compliance with local, state, and federal labor laws and regulations.\n\tOversee internal investigations related to HR issues.\n\tDevelop and implement HR-related legal strategies and initiatives.\n\tCollaborate with the Human Resource Departmentand management on employee relations matters.\n\tDraft and review employment contracts and other legal documents with keen focus on legal precision, ensuring compliance with applicable laws and regulations.\n\tConduct training sessions on legal aspects of HR for staff members.\n\tOversee Drafting, Review, and Negotiations when necessary.\n\n\nRequirements\n\n\n\tA Bachelor's Degree in Law and must have been called to the Bar.\n\tMust have at least 2 (two) years of combined experience in HR and legal roles.\n\tExcellent knowledge of employment legislation.\n\tOutstanding verbal and written communication skills.\n\tStrong analytical and research skills.\n\tSound understanding of the HR functionand best practices.\n\tEffective interpersonal and communication skills.\n\tAbility to work well within a team and individually.\n\n\nApplication Closing Date: 7th November, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: recruitment@wendernek.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Vacancies at Catilas Resources Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancies-at-catilas-resources-limited",
    "pubDate": "Thu, 06 Nov 2025 13:28:18 GMT",
    "source": "JobGurus",
    "keyword": "catilas resources limited",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance"
    ],
    "content": "Catilas Resources Limited is an outsourcing and advisory services Company. Our focus is to help our clients leverage their core capabilities to optimize market opportunities.\n\nWe are recruiting to fill the following positions below:\n\n1.) Store Manager\n\nJob Location: Ikoyi, Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking to hire an experienced and dynamic Store Manager to oversee the daily operations of our retail store.\n\tThe ideal candidate will provide leadership, ensure smooth store performance, and deliver exceptional customer experiences through effective team supervision and product promotion.\n\n\nResponsibilities\n\n\n\tOversee daily store operations, maintenance, and product displays.\n\tDevelop employee schedules and ensure adequate shift coverage.\n\tPromote products and drive sales to meet business targets.\n\tProvide excellent customer support and resolve inquiries promptly.\n\tMonitor store performance and maintain operational standards.\n\n\nRequirements\n\n\n\tHND / B.Sc. Degree in Business Administration, Marketing, or related field.\n\t2 - 5 years of proven experience in retail or store management.\n\tStrong leadership, communication (oral and written), and interpersonal skills.\n\tHigh level of flexibility and customer service orientation.\n\n\nSalary\nN250,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hrbp@catilas.com using \"Store Manager\" as the subject of the email.\n\n‎Note: Only shortlisted candidates will be contacted.\n\n \n\n \n\n2.) Digital Marketer\n\nJob Location: Ikoyi, Lagos\nEmployment Type: Full-time\n\nJob Description\n\n\n\tWe are seeking a creative and results-driven Digital Marketer to develop and implement online marketing strategies that drive brand awareness, engagement, and conversions across digital platforms.\n\n\n‎Responsibilities\n\n\n\t‎Manage and optimize digital campaigns (social media, email, and paid ads).\n\t‎Create engaging content and track performance metrics.\n\t‎Improve website traffic and conversion rates.\n\n\n‎‎Requirements\n\n\n\t‎HND / B.Sc. in Marketing or related field.\n\t‎Strong knowledge of digital marketing tools and analytics.\n\t‎Excellent communication and creativity skills.\n\n\nMethod of Application \nInterested and qualified candidates should send their CV to: hrbp@catilas.com using the Job Position as the subject of the email.\n\nNote: Only shortlisted candidates will be contacted.\n\n \n\n \n\n3.) Cashier\n\nJob Location: Ikoyi, Lagos\nEmployment Type: Full-time\n\nJob Description\n\n\n\tWe are seeking a reliable and detail-oriented Cashier to manage financial transactions and provide excellent customer service in a fast-paced environment.\n\n\nResponsibilities\n\n\n\tHandle customer payments, deposits, and withdrawals efficiently.\n\tMaintain accurate cash records and reconcile daily transactions.\n\tSupport account updates and assist customers with payment-related inquiries.\n\n\nRequirements\n\n\n\tHND qualification / B.Sc. Degree in Accounting, Finance, or related field.\n\tStrong numerical accuracy and attention to detail.\n\tGood knowledge of digital payment systems.\n\tExcellent communication and customer service skills.\n\n\nSalary\nN150,000 - N200,000 monthly.\n\nMethod of Application \nInterested and qualified candidates should send their CV to: hrbp@catilas.com using \"Cashier\" as the subject of the mail.\n\n‎Note: Only shortlisted candidates will be contacted.    \n\n    \n\n        Click here to Apply",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Openings at Limewood Villa Hotel",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-limewood-villa-hotel",
    "pubDate": "Thu, 06 Nov 2025 13:28:18 GMT",
    "source": "JobGurus",
    "keyword": "limewood villa hotel",
    "duplicate": false,
    "classifications": [],
    "content": "(adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\nLimewood Villa Hotel, is Located in the heart of Lekki Phase 1. Limewood Villa has accommodations with a restaurant, free parking, pool, bar and lounge. The facility offers 24 hours front desk and room service to its customers, along with free Wi-Fi throughout the property. Nearby attractions include points like Filmhouse Imax Cinema, Upbeat recreation center, Nike art gallery and Lekki conservation centre. With an excellent pool site, restaurant, garden sit out area and a roof top bar. At the hotel each room, is unique to the other. No room is the same, the rooms come with air conditioning, smart flat screen TVs, in-built Bluetooth speakers, luggage holder, electric tea pot, shower, free toiletries. All rooms have mini fridge in them. Featuring our executive suits, which are more spacious than the normal suits with a tube in the bathroom. Also, certain rooms comes with a balcony area to relax.\n\nWe are recruiting to fill the following positions below:\n\n1.) Waitress\n\nJob Location: Lekki Phase 1, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tA well-established hotel in Lekki Phase 1 is seeking a friendly, attentive, and service-oriented Waitress to join our hospitality team.\n\tIf you enjoy creating memorable guest experiences and thrive in a fast-paced environment, we’d love to hear from you.\n\n\nKey Responsibilities\n\n\n\tGreet and attend to guests in a professional and courteous manner.\n\tTake food and drink orders accurately and promptly.\n\tServe meals and beverages efficiently.\n\tEnsure tables are clean and properly set before and after service.\n\tHandle guest inquiries and resolve complaints with grace.\n\tCollaborate with kitchen and bar staff to ensure smooth service.\n\n\nIdeal Candidate\n\n\n\tPrevious experience in food service or hospitality is a plus.\n\tExcellent communication and interpersonal skills.\n\tNeat appearance and good personal hygiene.\n\tAbility to multitask and stay calm under pressure.\n\tWillingness to work flexible shifts, including weekends and holidays.\n\n\nWhat We Offer\n\n\n\tSalary: N60,000 per month.\n\tSupportive team and positive work environment.\n\tDaily staff meals.\n\tTraining and career growth opportunities.\n\n\nMethod of Application \nInterested and qualified candidates should send their CV to: hospitalityjobopening1@gmail.com using the Job Position as the subject of the mail..\n\nNote: You can also WhatsApp: 08058043665 (Please send a message only).\n\n \n\n \n\n2.) Cook\n\nJob Location: Lekki Phase 1, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tAre you a skilled and reliable Cook with a passion for preparing delicious meals in a fast-paced hospitality environment?\n\tOur Hotel is seeking a dedicated team player to join our kitchen and help deliver exceptional dining experiences to our guests.\n\n\nKey Responsibilities\n\n\n\tPrepare and cook meals according to established recipes and standards\n\tEnsure food quality, taste, and presentation meet hotel expectations\n\tMaintain cleanliness and organization of the kitchen and workstations\n\tAssist with inventory management and proper storage of ingredients\n\tFollow all health, safety, and hygiene regulations\n\tSupport the Chef and kitchen team in daily operations.\n\n\nIdeal Candidate\n\n\n\tPrevious experience as a cook in a hotel, restaurant, or catering environment\n\tStrong knowledge of food preparation techniques and kitchen safety\n\tAbility to work efficiently under pressure and in a team setting\n\tGood communication and time management skills\n\tFlexibility to work shifts, weekends, and holidays as needed.\n\n\nWhat We Offer\n\n\n\tCompetitive salary (N90,000 - N100,000 monthly) and staff meals\n\tSupportive team environment\n\tOpportunities for training and career growth\n\tA chance to be part of a respected hospitality brand.\n\n\nMethod of Application \nInterested and qualified candidates should send their CV to: hospitalityjobopening1@gmail.com using the Job Position as the subject of the mail..\n\nNote: You can also WhatsApp: 08058043665 (Please send a message only).\n\n \n\n \n\n3.) Housekeeper\n\nJob Location: Lekki Phase 1, Lagos,\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tHousekeeper is responsible for taking care of a Hotel building’s general cleanliness to provide tidy and sanitary amenities to guests.\n\tTheir duties include cleaning floors, making beds and dusting surfaces throughout the Hotel.\n\n\nResponsibilities\n\n\n\tA Housekeeper needs to clean the work area to the standards of limewood Villa Hotel.\n\tThis requires attention to detail, physical strength and the stamina to work long shifts.\n\tHere are examples of a Housekeeper’s duties:\n\t\n\t\tUnderstand the company’s policy on work shifts, guest’s possessions and privacy issues.\n\t\tProvide basic housekeeping duties including changing the sheets, changing and arranging the towels, restocking toilet supplies, vacuuming, dusting and rearranging the room after guests check out.\n\t\tReport and return any guest properties found in the rooms while rendering service.\n\t\tReport cases of property damage in commercial spaces to supervisor.\n\t\tWork with a team of housekeepers on each shift.\n\t\tClean, disinfect and store all equipment at the end of the shift.\n\t\tMaintain a positive relationship with employees and guests.\n\t\tMonitor and report on the inventory of cleaning supplies.\n\t\tRespond to calls for housekeeping problems, such as spills and broken glass.\n\t\tCollect and remove trash and debris.\n\t\tAssist with laundry management, including washing, drying, ironing and sorting linen.\n\t\tReport, turn in and log all lost and found items.\n\t\tClean upholstered furniture.\n\t\tPerform detailed deep cleans when required.\n\t\n\t\n\n\nRequirements\n\n\n\tCandidates should possess an OND / NCE / HND / B.Sc Degree with a minimum of 3 years of work experience.\n\n\nSalary\nN60,000 Monthly. \n\nMethod of Application \nInterested and qualified candidates should send their CV to: hospitalityjobopening1@gmail.com using the Job Position as the subject of the mail..\n\nNote: You can also WhatsApp: 08058043665\n\n \n\n \n\n4.) General Maintenance Officer\n\nJob Location: Lekki Phase 1, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tGeneral Maintenance Officer typically include a variety of tasks aimed at ensuring that the hotel buildings and equipment are well-maintained and functioning properly.\n\tThe General Maintenance officer is responsible for performing routine and extensive preventative maintenance and repair procedures on buildings, mechanical equipment, and utility systems; however, experience in plumbing jobs is a great added advantage.\n\n\nKey Responsibilities\n\n\n\tPerform minor electrical maintenance, including but not limited to, replacement or repair of fixtures (e.g., wall switches and outlets, incandescent and fluorescent bulbs and tubes, ballast, sockets, fuses, minor appliances, cords, etc.) using appropriate hand, power, and specialty tools.\n\tPerform minor plumbing maintenance (e.g., replacement or repair of leaks in drains and faucets, unclogging of drains, trenching and laying new lines, replacing drain hoses on washers and similar devices, etc.).\n\tPerform minor painting, carpentry, and masonry work (e.g., preparing surfaces and using brush, sprayer, or roller to apply paints, stains, and varnishes, hanging doors, fitting locks and handles, etc.).\n\tAssist in the procurement of supplies and materials to complete all tasks.\n\tMaintain a schedule of when maintenance has been performed and when the next service is due.\n\tWork in a safe manner and recognize unsafe situations. Take appropriate action to ensure the safety of themselves and others in the building.\n\n\nSalary\nN100,000 - N110,000 per month. \n\nMethod of Application\nInterested and qualified candidates should send their CV to: hospitalityjobopening1@gmail.com using the Job Position as the subject of the mail..\n\nNote: You can also WhatsApp: 08058043665 (Please send a message    \n\n    \n\n        Click here to Apply",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Openings at Tetra Maritime",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-tetra-maritime",
    "pubDate": "Thu, 06 Nov 2025 13:28:18 GMT",
    "source": "JobGurus",
    "keyword": "tetra maritime",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Tetra Maritime is a leading Nigerian ship owner and operator, providing comprehensive and tailor-made solutions across the oil and gas supply chain, including upstream, midstream, and downstream.\n\nWe are recruiting to fill the following positions below:\n\n1.) Corporate Affairs Manager\n\nJob Location: Apapa, Lagos\nEmployment Type: Full-time\n\nJob Description\n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Communications Lead is a seasoned professional who will lead a comprehensive communications strategy that supports our continuing growth.\n\tThis individual will be the primary point of contact for and manager of all internal communications and will coordinate with external service providers to manage and elevate our external communications.\n\tThe role demands exceptional verbal and written communication skills, strategic thinking, and a deep understanding of brand development and stakeholder engagement.\n\n\nKey Responsibilities\n\n\n\tInternal Communications Strategy & Execution: Design and deliver a cohesive internal communications framework that fosters transparency, alignment, and engagement across all departments and geographies.\n\tExternal Communications Coordination: Act as the liaison between Union Maritime and external agencies, and directly with media and others as necessary, ensuring consistency, quality, and strategic alignment in all external messaging.\n\tBrand Development & Stewardship: Lead initiatives to refine and deploy Union Maritime’s brand identity. Ensure brand consistency in tone, visuals, and messaging.\n\tExecutive & Leadership Communications: Support the executive team with high-impact presentations, speeches, and strategic messaging. Translate complex ideas into compelling narratives.\n\tCrisis & Change Communications: Develop and implement communication plans for major organizational changes, crises, or strategic shifts. Ensure clarity, empathy, and control in sensitive situations.\n\tStakeholder Engagement: Build and maintain relationships with key industry contacts, media outlets, and communication partners to enhance Union Maritime’s visibility and reputation.\n\tTop-Class Communication: Excellent written and verbal communication. Ability to craft clear and persuasive messages for diverse audiences.\n\tStrategic Thinking: Ability to align communication initiatives with business goals and anticipate communication needs in a dynamic environment.\n\tBrand & Narrative Development: Experience in shaping and evolving brand identity and corporate storytelling.\n\tStakeholder Management: Skilled in managing relationships across internal teams and external partners, with diplomacy and influence.\n\tPresentation Excellence: Strong design and delivery skills for executive-level presentations and public speaking engagements.\n\n\nApplication Closing Date: 10th November, 2025.\n\nMethod of Application \nInterested and qualified candidates should send their Application and CV to: D.yunusa@tetramaritime.com using the Job Position as the subject of the email.\n\n \n\n \n\n2.) Senior Associate\n\nJob Location: Lagos\nEmployment Type: Full-time (On-site)\n\nThe Position \n\n\n\tWe are seeking a dynamic professional to help lead the charity's activities in Nigeria. \n\tThis role requires exceptional organisation, process-management, and written and verbal communication skills, as well as the strategic and inter-personal capacity to promote the charity's mission and build and manage relationships across the charity's network.\n\tCandidates are likely to have a background in corporate-backed foundations, or other charities where there is sharp exposure to business and government (rather than reliance on public funding), but the role could also suit someone seeking to transfer from a high-quality corporate environment.  \n\n\nKey Responsibilities \n\n\n\tThe core function is the provision of high-class leadership of the charity's activities in Nigeria, working with executive management in London to craft and deliver the charity's mission.\n\tIn practical terms, that means engaging with and managing local stakeholders, including donors, network supporters, government, and training institutions.\n\tThe role holder will also manage a growing team of operational and admin staff.    \n\tThe role will require the preparation and presentation of high-quality reports and other communications for internal and external stakeholders. There will also be a focus on managing and improving business processes to enhance efficiency and effectiveness.\n\tThe role holder will be required to engage and represent the charity at a senior level, internally and externally. \n\n\nRequirements\nExperience:\n\n\n\tThe ideal candidate will have 8+ years of experience across fast-paced, professional environments in the corporate sphere (e.g., consulting, finance, legal) and/or from the charity sector. \n\n\nSkills and Competencies:\n\n\n\tExceptional organizational and process management skills.  \n\tStrong problem-solving abilities and analytical thinking.  \n\tExcellent written and verbal communication skills.  \n\tHigh attention to detail and ability to manage multiple priorities. \n\n\nApplication Closing Date: 7th December,2025.\n\nClick here to apply online\n\n \n\n \n\n3.) Admin Associate\n\nJob Location: Apapa, Lagos\nEmployment Type: Full-time (On-site)\n\nThe Position \n\n\n\tThe Global Admin person will ensure seamless office operations, compliance with company standards, and support for executive and departmental needs.\n\tThis role is pivotal in maintaining operational continuity across Union Maritime’s Lagos office and collaborating with all Global Admin verticals to uphold global processes. \n\n\nKey Responsibilities \nProcurement & Vendor Management: \n\n\n\tExecute procurement processes following company SOPs, including vendor onboarding, KYC, and conflict-of-interest declarations. \n\tPrepare and submit procurement forms for COO approval before initiating purchases. \n\tMaintain vendor databases and ensure timely payment processing through Tetra Accounts. \n\n\nTravel & Logistics Coordination:\n\n\n\tArrange travel logistics for staff and visitors, including visa processing, and accommodation. \n\tManage local transportation and vehicle servicing schedules for company fleet. \n\n\nCompliance & Regulatory Liaison:\n\n\n\tEnsure adherence to Lagos State regulations (LAWMA, LASIMRA) for waste disposal and telecommunication utilities. \n\tHandle immigration quota renewals and maintain expatriate workforce records. \n\tCoordinate with police and fire services for statutory compliance. \n\n\nFinancial & Administrative Support: \n\n\n\tManage petty cash, expense claims, and invoice processing. \n\tMaintain trackers for inventory, procurement, and administrative tasks. \n\tSupport budgeting and cost optimization initiatives for office operations. \n\n\nEvent & Meeting Coordination: \n\n\n\tPlan and execute office-specific and corporate events, ensuring adherence to Global Admin event protocols. \n\tMaintain event sheets and provide updates to stakeholders and COO. \n\n\nOffice Operations:\n\n\n\tOversee daily office operations, including reception, access control, and workspace readiness. \n\tManage cleaning schedules, gardening services, and ensure compliance with hygiene standards. \n\tCoordinate repairs and maintenance for plumbing, electrical, and other infrastructure needs. \n\tMonitor diesel supply for generators and liaise with approved vendors for replenishment. \n\n\nCommunication & Documentation:\n\n\n\tMonitor shared mailboxes for timely response and task delegation. \n\tEnsure proper filing and documentation on SharePoint for all administrative processes. \n\n\nRequirements\nExperience:\n\n\n\t4–5 years in administrative operations, facilities management, or corporate services within a structured organization. \n\n\nSkills and Competencies:\n\n\n\tStrong organizational and multitasking abilities. \n\tProficiency in Microsoft Office Suite and SharePoint. \n\tExcellent communication and stakeholder management skills. \n\tKnowledge of procurement processes and vendor management. \n\tAbility to work independently and under pressure. \n\n\nApplication Closing Date: 7th December,2025.\n\nClick here to apply online\n\n     \n\n    \n\n        Click here to Apply",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Social Media Manager Job at FumQuench",
    "link": "https://www.jobgurus.com.ng/jobs/view/social-media-manager-job-at-fumquench",
    "pubDate": "Thu, 06 Nov 2025 13:28:18 GMT",
    "source": "JobGurus",
    "keyword": "fumquench",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance"
    ],
    "content": "(function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){\n        (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),\n        m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)\n    })(window,document,'script','//www.google-analytics.com/analytics.js','ga');\n\n    ga('create', 'UA-43112273-1', 'jobgurus.com.ng');\n    ga('send', 'pageview');\n\n\n\n\n    \n        \n    Home\n    Jobs\n    Free Aptitude Test Practice\n    Employer? Post a Job\n            Register\n        Sign in\n        Contact us\n    \n\n    \n\n        \n    \n        \n\n            \n\n                \n\n                    \n                        Toggle navigation\n                        \n                        \n                        \n                    \n\n                    \n                \n            \n\n            \n                \n\n\tJobs\n\tJob Seekers\n\tAptitude Test\n\tScholarships\n\n            \n\n            \n                \n\n                                            Register\n                        Sign in\n                    \n                    Employer? Post a Job\n                \n            \n\n        \n\n    \n\n        \n        \n            \n            \n                 \n    \n                    \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n        \n     \n\n\n                            \n                    \n        \n                        CLICK HERE TO JOIN OUR WHATSAPP CHANNEL \n                    \n    \n\n    \n                                \n                    \n\n                        \n                            \n                        \n\n                        \n                            \n                                Any Specialization\n                                                                    Accounting / Audit / Finance\n                                                                    Administration/ Office/ Operations\n                                                                    Advertising/ Social Media/ Marketing/ PR\n                                                                    Agriculture / Agro Allied\n                                                                    Analyst/ Quality Control\n                                                                    Automotive/ Car Services\n                                                                    Aviation / Airline\n                                                                    Banking / Insurance\n                                                                    Building Design / Architecture\n                                                                    Construction / Mining\n                                                                    Consulting / Business Strategy/ Planning\n                                                                    Craftsmen / Artisans\n                                                                    Creatives (Arts, Design, Fashion)\n                                                                    Customer Service\n                                                                    Domestic / Janitorial Services\n                                                                    Driving / Haulage\n                                                                    Education / Teaching / Training\n                                                                    Engineering / Technical\n                                                                    Executive / Management\n                                                                    Freelance / Data Entry\n                                                                    Government Agencies / Public Sector\n                                                                    Graduates / Freshers\n                                                                    Grants /  Scholarships\n                                                                    Hospitality / Food Services\n                                                                    HSE / Safety Management\n                                                                    Human Resources / Recruitment\n                                                                    Information Technology / ICT\n                                                                    Internship/ Industrial Training\n                                                                    Legal / Law\n                                                                    Logistics / Transportation/ Supply\n                                                                    Manufacturing / Production\n                                                                    Maritime Services / Shipping\n                                                                    Media / Art / Entertainment\n                                                                    Medical/ Healthcare / Pharmaceutical\n                                                                    Military / Para-Military\n                                                                    NGO / Community Services\n                                                                    Oil & Gas / Energy\n                                                                    Procurement/ Purchasing\n                                                                    Project Management\n                                                                    Real Estate / Property / Surveying\n                                                                    Research / Survey\n                                                                    Risk Management / Compliance\n                                                                    Sales / Business Development\n                                                                    Secretarial / PA\n                                                                    Security / Intelligence\n                                                                    Software/ Programming / Web development\n                                                                    Sports / Fitness\n                                                                    Supply Chain/ Store\n                                                                    Technicians\n                                                                    Telecommunications\n                                                                    Tourism / Travels\n                                                                    Vocational Trade and Services\n                                                            \n                        \n\n                        \n                            \n                                Any Work Level\n                                                                    Entry Level (Trainee)\n                                                                    Executive (Director, Head of Dept)\n                                                                    Experienced (Non-Manager)\n                                                                    Internship\n                                                                    Manager (Staff Supervisor)\n                                                                    Senior Executive (MD, CEO, COO)\n                                                                    Vocational (Skilled/Unskilled Labour)\n                                                            \n                        \n\n                        \n                            \n                                 Search\n                            \n                        \n                    \n                \n                            \n            \n\n\n\n\n\n\n            \n\n                \n                                        \n                    \n                                        \n                    \n                    \n\n                    \n                        \n                        \n\n{\n  \"@context\": \"https://schema.org\",\n  \"@type\": \"JobPosting\",\n  \"title\": \"Social Media Manager\",\n  \"description\": \"FumQuench is a premium parfait brand based in Lagos, Nigeria, dedicated to creating rich, creamy, and nutritious parfaits made with fresh fruits, crunchy granola, and smooth yogurt. Our goal is to redefine healthy indulgence by offering our customers a luxurious experience in every cup.\n\nWe are recruiting to fill the position below:\n\nJob Position: Social Media Manager\nJob Location:&amp;nbsp;Gbagada, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tThe Social Media Manager will manage all social media pages, create engaging content, plan marketing campaigns, and build brand awareness.\n\tYou will work closely with the management team to create and execute strategies that align with our brand tone and goals.\n\n\nKey Responsibilities\n\n\n\tPlan, create, and publish engaging daily content (photos, videos, captions, and stories) across all social media platforms.\n\tDevelop and implement social media strategies to increase brand visibility and drive sales.\n\tManage the social media calendar to ensure consistent posting and alignment with campaigns and promotions.\n\tMonitor trends, comments, and messages to engage with followers.\n\tCollaborate with the team to organize product shoots and video content ideas.\n\tTrack performance metrics (reach, engagement, followers, conversions) and prepare weekly reports.\n\tStay up-to-date with social media trends, algorithm changes, and best practices.\n\n\nRequirements\n\n\n\tProven experience managing business or brand social media pages (Instagram, TikTok, Facebook, etc.).\n\tExcellent understanding of social media trends, hashtags, and content creation strategies.\n\tGood photography and video-editing skills (mobile or professional).\n\tStrong writing and storytelling ability for captions and campaigns.\n\tCreative mindset and ability to work with minimal supervision.\n\tBasic graphic design knowledge using Canva or similar tools is a plus.\n\tMust reside within Gbagada, Yaba, or nearby areas in Lagos.\n\n\nSalary\nN80,000 - N150,000 per month.&amp;nbsp;\n\nMethod of Application&amp;nbsp;\nInterested and qualified candidate should send their CV, social media handles, and sample content they&amp;rsquo;ve created to:&amp;nbsp;recruitment@fumquenchng.com&amp;nbsp;using the Job Position as the subject of the email.\",\n  \"datePosted\": \"2025-11-06\",\n  \"validThrough\": \"2025-11-16\",\n  \"employmentType\": \"Full-Time\",\n  \"hiringOrganization\": {\n    \"@type\": \"Organization\",\n    \"name\": \"Fumquench\"\n    \n  },\n  \"jobLocation\": {\n    \"@type\": \"Place\",\n    \"address\": {\n      \"@type\": \"PostalAddress\",\n       \"postalCode\": \". \",\n       \"addressRegion\": \". \",\n       \"streetAddress\": \". \",\n      \"addressLocality\": \"Lagos\",\n      \"addressCountry\": \"NG\"\n     \n      \n    }\n  },\n  \"identifier\": {\n    \"@type\": \"PropertyValue\",\n    \"name\": \"\",\n    \"value\": \"189986\"\n  },\n  \"baseSalary\": {\n    \"@type\": \"MonetaryAmount\",\n    \"currency\": \"NGN\",\n    \"value\": {\n      \"@type\": \"QuantitativeValue\",\n      \"minValue\": 75000,\n      \"maxValue\": 150000,\n      \"unitText\": \"MONTH\"\n    }\n  }\n}\n\n\n\nSocial Media Manager Job at FumQuench\n\n\n\n\n        \n    \n\n        \n        FumQuench is a premium parfait brand based in Lagos, Nigeria, dedicated to creating rich, creamy, and nutritious parfaits made with fresh fruits, crunchy granola, and smooth yogurt. Our goal is to redefine healthy indulgence by offering our customers a luxurious experience in every cup.\n\nWe are recruiting to fill the position below:\n\nJob Position: Social Media Manager\nJob Location: Gbagada, Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Social Media Manager will manage all social media pages, create engaging content, plan marketing campaigns, and build brand awareness.\n\tYou will work closely with the management team to create and execute strategies that align with our brand tone and goals.\n\n\nKey Responsibilities\n\n\n\tPlan, create, and publish engaging daily content (photos, videos, captions, and stories) across all social media platforms.\n\tDevelop and implement social media strategies to increase brand visibility and drive sales.\n\tManage the social media calendar to ensure consistent posting and alignment with campaigns and promotions.\n\tMonitor trends, comments, and messages to engage with followers.\n\tCollaborate with the team to organize product shoots and video content ideas.\n\tTrack performance metrics (reach, engagement, followers, conversions) and prepare weekly reports.\n\tStay up-to-date with social media trends, algorithm changes, and best practices.\n\n\nRequirements\n\n\n\tProven experience managing business or brand social media pages (Instagram, TikTok, Facebook, etc.).\n\tExcellent understanding of social media trends, hashtags, and content creation strategies.\n\tGood photography and video-editing skills (mobile or professional).\n\tStrong writing and storytelling ability for captions and campaigns.\n\tCreative mindset and ability to work with minimal supervision.\n\tBasic graphic design knowledge using Canva or similar tools is a plus.\n\tMust reside within Gbagada, Yaba, or nearby areas in Lagos.\n\n\nSalary\nN80,000 - N150,000 per month. \n\nMethod of Application \nInterested and qualified candidate should send their CV, social media handles, and sample content they’ve created to: recruitment@fumquenchng.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n\n\n\n        \n        \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n   \n\n\n    \n        Similar Jobs\n    \n\n    \n        \n                        Admin / Social Media Manager Job at Wiz Consults\n                        Job Vacancies at Catilas Resources Limited\n                        Content Creator / Social Media Manager Job at HRLeverage Africa Consulting Limited\n                        Business Development / Marketing Manager Job at SortOut Consult\n                        Social Media Marketing Executive Job at SortOut Consult\n                        Email Marketer Job at Dekina Beauty\n                        Growth Marketing Manager Job at PE Lifts\n                        Copy & Content Writer Job at Global Air U\n                        Content Creator / Social Media Manager Job at Kuddy Cosmetics\n                        Social Media Content Creator Manager Job at Onyx Beauty Hub\n                    \n    \n\n\n\n                        \n                    \n\n                    \n                        \n\n\n\n    \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n\n\n\n\n\n          \n\n\n    \n\n        Hottest Jobs\n\n        \n        \n            \n\n                Job Vacancies at Wells Accounting and Tax Services\n\n               \n            \n        \n            \n\n                Customer Support Representative Job at Chowdeck\n\n               \n            \n        \n            \n\n                Job Openings at Sproxil\n\n               \n            \n        \n            \n\n                Ad hoc Administrative Assistant Job at African Field Epidemiology Network (AFENET)\n\n               \n            \n        \n            \n\n                Job Vacancies at Lington & Bernie Consulting Limited\n\n               \n            \n        \n            \n\n                Job Vacancies at Royal Power and Energy Limited\n\n               \n            \n        \n            \n\n                Miva Open University Recruitment for Graduate Assistant (MPA Programme)\n\n               \n            \n        \n            \n\n                Customer Care Executive Job at 5thWall Consulting\n\n               \n            \n        \n            \n\n                Administrative Secretary\n\n               \n            \n        \n            \n\n                Call Center Officer\n\n               \n            \n        \n        \n\n    \n\n\n\n\n        \n        \n   \n\n\n                    \n                            \n            \n        \n        \n        \n\n        \n\n    \n\n        \n\n            \n\n                \n\n                    Job Seekers\n\n                    \n\n                        Search for Jobs\n                         Featured Jobs\n                         Jobs by Specialization\n                         Jobs by Industry\n                         Jobs by Location\n                         \n                        Companies Currently Hiring\n\n                        Upload CV\n\n                        Free Aptitude Test Practice\n                        \n                        Scholarships and Financial Aid\n\n                        Testimonies\n                    \n\n                \n\n                \n\n                    Employers\n\n                    \n\n                        Post A Job\n\n                        Search Resumes/Profiles\n\n                        Create Employer Account\n\n                        Advertise\n\n                        Pricing\n\n                    \n\n                \n\n                \n\n                    Tools & Resources\n\n                    \n\n                        Contact us\n                        \n                        Our Blog\n\n                        Job XML/RSS Feeds\n \n                        Free Aptitude Test Practice\n\n                        Bank Details\n\n                        FAQ & Support\n\n                    \n\n                \n\n                \n\n                    Connect with us\n\n                    \n\n                        \n\n                            \n\n                            \n\n                        \n\n                        \n\n                            \n\n                            \n\n                        \n\n                \n\n                        \n\n                            \n\n                            \n\n                        \n\n                    \n\n\n\n                    \n\n                        Customer Care\n\n                        09134259221 \n\n                        (9am - 5pm) weekdays\n\n                         info [at] jobgurus.com.ng\n\n                    \n\n\n\n                \n\n            \n\n        \n\n    \n\n\n\n    \n\n        \n\n\n\n            \n\n                Privacy Policy\n\n                Terms & Conditions\n\n                Sitemap\n                \n                About us\n\n            \n\n\n\n            Copyright © 2025 Jobgurus.com.ng - Latest Jobs in Nigeria 2025. All right reserved.",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]