[
  {
    "title": "Digital Sales Executive Job at Speedaf Express",
    "link": "https://www.jobgurus.com.ng/jobs/view/digital-sales-executive-job-at-speedaf-express",
    "pubDate": "Wed, 11 Jun 2025 09:41:58 GMT",
    "source": "JobGurus",
    "keyword": "speedaf express",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance"
    ],
    "content": "Speedaf, established in 2019, is a joint-venture company invested by Chinese leading express enterprises. Since founded, we continuously expanded global network, developed and optimized products, improved customer experience, and introduce IT technologies and equipment to realize automatic operations. Currently, we are building a local and cross-border service network to support air, sea and road transportation with the aim to be the leading diversified integrated logistics solution provider between China and emerging markets. By doing so, it will reduce end-to-end logistics costs between China and emerging markets while providing a stable and recognized logistics services to our customers.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nSpeedaf is localization-oriented, and we believe in creating both opportunities and possibilities of every region we operate in. We work with local teams and understand needs of customers. We offer a variety of products and value added service to cover different commercial or personal scenarios for our customers.\n\nWe are recruiting to fill the position below:\n\nJob Position: Digital Sales Executive\nJob Location: Berger, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe're seeking a creative and results-driven Sales Executive to leverage TikTok and other Social Media platforms to make sales and drive business growth for Speedaf Express.\n\tThe ideal candidate is expected to efficiently expand B2C potential customers such as social media platforms, e-commerce, trading companies, etc. or have other existing resources to meet Speedaf Express’ business needs.\n\n\nKey Responsibilities\n\n\n\tMust be able to perform field sales and cold calling to meet expected sales target having insights in the E-commerce and social media sales industries.\n\tMust be able to carry out surveys and research in order to understand customers’ needs and expectations.\n\tDevelop and execute sales strategies that leverage TikTok and other social media platforms.\n\tMust be familiar with the industry’s clientele such as e-commerce merchants, social media platforms and other companies that need the type of delivery services we offer.\n\tScreen out the target customers and understand the customers’ business model based on the types of delivery services we offer such as direct operation, distribution, e-commerce, warehousing, and so on.\n\tMust understand each customers’ needs and expectations in order to communicate the queries/ enquiries of the customers and increase customers satisfaction through a signed agreed SLA which will be pertinent to the kind of business the customer(s) operate in.\n\tIdentify potential clients and market segments that align with our logistics services and generate new leads through research, networking, and cold calling.\n\tAnalyze sales performance and metrics by identifying changes in market trends to inform future sales strategies with the end goal of enhancing sales process and revenue.\n\tCollaborate with the operations team to create tailored logistics solutions for customers.\n\tCollect, analyze, and interpret sales records including client interactions and sales forecast to obtain information useful in preparing reports.\n\n\nSkills and Requirements\n\n\n\tBachelor's Degree in Business Administration, Sales and Marketing, or a related field of study.\n\tProven track record in sales, with a minimum of 2 years of experience in a similar role with proven track records in E-commerce, B2C and social media platforms (e.g. Tik-Tok, Instagram, etc.).\n\tMust be proficient in social media platform software.\n\tMust be proficient in Microsoft office tools.\n\tMust have a strong online presence.\n\tMust be able to customize logistics solutions and design according to customer needs.\n\tMust be able to transmit prospective customers to paying customers.\n\tMust have customer retention and relationship skills.\n\tMust be able to identify prospects, identify prospects' challenges and proffer solutions and build rapport and maintain client relationships and Retention.\n\tProficiency in CRM software and other sales tools.\n\tMust be a good negotiator.\n\tProven experience making sales on various social media platforms.\n\tExcellent verbal and written communication skills.\n\tAbility to analyze sales data and metrics.\n\n\nMethod of Aplication\nInterested and qualified candidates should send their CV to: recruitment@speedaf.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Logistics Manager Job at UJT Logistics Services Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/logistics-manager-job-at-ujt-logistics-services-limited",
    "pubDate": "Wed, 11 Jun 2025 09:41:58 GMT",
    "source": "JobGurus",
    "keyword": "ujt logistics services limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "UJT Logistics Services Limited is a travel and Logistics Company of repute, establish to provide organized, value-driven and professional Travel and Logistic arrangements for corporate bodies, Government Agencies and Individuals.\n\nWe are recruiting to fill the position below:\n\nJob Position: Logistics Manager\n\nJob Location: Jibowu, Lagos\nEmployment Type: Full-time\n\nJob Brief\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are looking for a reliable logistics manager to be responsible for the overall supply chain management.\n\tLogistics manager responsibilities include organizing and monitoring the storage and distribution of goods.\n\tThe goal is to manage the entire order cycle so as to enhance business development and ensure sustainability and customer satisfaction.\n\n\nJob Schedule:\n\n\n\tOrganising shipments.\n\tCoordinating drivers, vehicles, loads and journeys.\n\tOperating IT systems to manage timings, costs and stock levels.\n\tAnalysing data to assess performance, discover logistical problems and devise plans for improvements.\n\tLiaising with and managing staff and shifts.\n\tMonitoring stock and managing waste.\n\tNegotiating and agreeing contracts.\n\tPlanning for and negotiating technical difficulties.\n\tPreparing paperwork for regulatory bodies.\n\tEnsuring health and safety standards are met.\n\n\nResponsibilities\n\n\n\tStrategically plan and manage logistics, warehousing, transportation, and customer services.\n\tDirect, optimize, and coordinate full order cycle.\n\tLiaise and negotiate with suppliers, manufacturers, retailers, and consumers.\n\tKeep track of quality, quantity, stock levels, delivery times, transport costs, and efficiency.\n\tArrange warehouse, catalog goods, plan routes, and process shipments.\n\tResolve any arising problems or complaints.\n\tSupervise, coach, and train warehouse workforce.\n\tMeet cost, productivity, accuracy, and timeliness targets.\n\tMaintain metrics and analyze data to assess performance and implement improvements.\n\tComply with laws and regulations requirements.\n\n\nRequirements\n\n\n\tBachelor's Degree in Business Administration, Logistics, or Supply Chain.\n\tProven working experience as a Logistics Manager.\n\tRecord of successful distribution and logistics management.\n\tDemonstrable ability to lead and manage staff.\n\tProficient in standard logistics software.\n\tExcellent analytical, problem-solving, and organisational skills.\n\tAbility to work independently and handle multiple projects.\n\n\nMethod of Application\nInterested and qualified candidates should send their detailed CV to: ujt.logistics77@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "HR Factory Support Job at Helean Global Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/hr-factory-support-job-at-helean-global-limited",
    "pubDate": "Wed, 11 Jun 2025 09:41:58 GMT",
    "source": "JobGurus",
    "keyword": "helean global limited",
    "duplicate": false,
    "classifications": [],
    "content": "Helean Global Limited is a full-fledged Human Resource Solution Provider incorporated in Nigeria with its Head Office in Lagos, Nigeria. We are committed to forging long-term partnerships with our clients by creating and delivering robust and flexible services that address the changing needs of their businesses through our core services.\n\nWe are recruiting to fill the position below:\n\nJob Position: HR Factory Support\n\nJob Location: Mowe, Ogun \nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tManage the day-to-day HR activities in the factory\n\tManage the sourcing process of factory workers and onboarding\n\tCreate and manage salary files using Microsoft excel\n\tPerformance management of all the Factory Employees\n\tHandle HR documentation and reporting\n\tFoster a positive workplace culture and lead workers engagement initiatives\n\tHandle employee relations issues and resolve conflicts effectively\n\tPerform other HR duties as required.\n\n\nRequirements\n\n\n\tBachelor’s Degree in Human Resources, Business Administration, or related fields\n\t3 years of factory HR experience\n\tStrong communication and interpersonal skills\n\tProficient in Microsoft Office Suite\n\tCandidate must reside within Berger, Mowe-Ibafo and its environs.\n\n\nSalary\nN170,000 - N200,000 monthly (Net).\n\nMethod of Application\nInterested and qualified candidates should send their CV to: careers@heleanglobal.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Engagement Manager Job at Maisha Meds",
    "link": "https://www.jobgurus.com.ng/jobs/view/engagement-manager-job-at-maisha-meds",
    "pubDate": "Wed, 11 Jun 2025 09:41:58 GMT",
    "source": "JobGurus",
    "keyword": "maisha meds",
    "duplicate": false,
    "classifications": [
      "Software Engineering"
    ],
    "content": "Maisha Meds is an organisation dedicated to improving health care in Africa. We began full-time operations in 2017 and over the past few years have grown to support over 1.5 million patient encounters annually across Kenya, Tanzania, Uganda, Nigeria, and Zambia with our suite of software products. We are building the financial and technology infrastructure to enable global health funders to pay for health outcomes at the last mile, with a focus on malaria case management (and results from a RCT with UC Berkeley due out later this year), injectable contraceptives, prenatal care, HIV pre-exposure prophylaxis, and COVID testing and vaccination.\n\nWe are recruiting to fill the position below:\n\nJob Position: Engagement Manager\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Location: Remote\nEmployment Type: Contract\nDepartment: Strategy + BD\n\nAbout the Role\n\n\n\tMaisha Meds has ongoing engagements to support the data needs for several new contracts that are closing shortly with UNITAID, USTDA, and the World Bank to provide data back to them on private sector consumption habits of over 25 million patient encounters yearly. \n\tThe organization is looking for an enthusiastic engagement manager who can independently deliver on and oversee projects in partnership with our excellent data consulting team.\n\tThe role would include identifying the right types of analyses to be done, building the analyses and dashboards, developing reports and other deliverables for our clients, and engaging with the data team to support building a streamlined data product from these individual sets of analysis.\n\tThis role is a good growth opportunity for a senior researcher, management consultant, or data scientist seeking to move into the global health field, or someone with a pharmaceutical or healthcare background looking to hone their analytics skills. \n\n\nResponsibilities\n\nLead data analysis and dashboard development:\n\n\n\tIndependently deliver on creating visualizations in BI tool (Looker) using best practice tools and quality code to provide ongoing visibility of health and commodity consumption trends\n\tOversee analysis of trends and come up with interesting findings in our data\n\tBegin to understand how stakeholders interact with and use our data to refine the dashboards to meet their needs\n\n\nDevelop externally-facing reports and presentations:\n\n\n\tWrite interim and final reports summarizing trends and insights from data analysis activities outlined above\n\tPrepare presentations, policy memos, and blog posts to share these data insights with an external audience\n\tSupport business development activities as needed and perform desk research and literature reviews of public health topics\n\n\nSupport business development strategy and lead engagements:\n\n\n\tWork with external stakeholders and clients to understand their ongoing data insight needs and scope out comprehensive approaches to building dashboards\n\tDevelop a pipeline of potential customers and work with others on the team to begin to engage manufacturers, policymakers, and other key stakeholders to build our data systems into their regular workflows\n\tCapture feedback and provide product specs and overviews of analyses needed to data team to productise our data offering\n\n\nSkills & Qualifications\n\n\n\tMasters preferred in field of Statistics, Economics, Engineering, Computer Science, Biomedical Science and Public Health.\n\t5+ years of experience in quantitative analysis and project management.\n\tStrong Excel / spreadsheet skills: lookup, logical, and text formulas, pivot tables, data functions etc.\n\tPrior experience leading development of deliverables and reports for global health funders or other external stakeholders\n\tExcellent attention to detail.\n\tExperience working with messy data sets and joining data from different sources.\n\tProduct management to understand data usability and applicability of data analyses and adapt the presentation to the needs of users.\n\tRequire experience with common data analysis tools including SQL and/or Python is preferred; or experience with similar tools and enthusiasm to develop these skills.\n\tIndependent initiative and problem solving skills – figuring out what people are interested in seeing in our data and how to meet these needs.\n\tKnowledge around pharmaceutical or health care products is a strong asset.\n\tGood cross-cultural communication skills and enjoy working with a diverse team.\n\tExcited about the potential to improve healthcare access using data!\n\n\nWhy You Should Join Us\n\n\n\tOn a roll: We are doubling year-over-year with new funding partnerships that are boosting expansion in multiple countries\n\tGreat team: We are founded, managed, and backed by successful veterans of Stanford School of Medicine, IQVIA, Google, Safe Boda, and BCG, and Helium Health. We have technologists, doctors, and economists working side by side to solve difficult problems.\n\tGreat funders: We’re supported by the Bill & Melinda Gates Foundation, Development Innovation Ventures, CIFF, WHO, and Pfizer to pay for healthcare on behalf of patients, with others to be announced soon.\n\tHuge market: We are disrupting a massive, growing $50+ billion market for healthcare payments for low-income patients, with a focus on paying for health outcomes to ensure patients get the best quality care.\n\tGreat customers: We create financial incentives that ensure our health care providers deliver excellent care.\n\tImpact: We have cultivated a fun and exciting start-up culture that empowers its talented staff to make a huge impact.\n\n\nNote: This role would be hired contingent on signing of two or more of the contracts listed above, and would be time-limited to the duration of the consulting engagement.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]