[
  {
    "title": "Project Manager Job at Ziba Consulting",
    "link": "https://www.jobgurus.com.ng/jobs/view/project-manager-job-at-ziba-consulting",
    "pubDate": "Tue, 03 Jun 2025 09:41:49 GMT",
    "source": "JobGurus",
    "keyword": "ziba consulting",
    "duplicate": false,
    "classifications": [],
    "content": "Ziba Consulting - Our client, a leading Oil and Gas company, is recruiting to fill the position below:\n\nJob Position: Project Manager\n\nJob Location: Victoria Island, Lagos\nDepartment: Projects and Technology\nReports To: Operations Director\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are looking to hire a highly skilled and results-oriented Project Manager to lead multiple engineering projects and supervise project engineering teams.\n\tThe ideal candidate will bring over 10 years of solid experience in the oil and gas sector, demonstrating strong leadership, in-depth technical expertise in well intervention, coiled tubing operations, wellhead maintenance, exploration, or drilling activities, and a proven ability to deliver projects successfully on time, within budget, and according to scope.\n\tThis role is critical to ensuring that all project goals are achieved in full compliance with industry regulations and company standards \n\n\nKey Responsibilities\n\n\n\tLead the planning, execution, and delivery of multiple projects simultaneously.\n\tDevelop project strategies, set goals, and define key performance indicators (KPIs) for project success.\n\tSupervise and mentor a team of Project Engineers, ensuring effective resource allocation and performance management.\n\tFoster a culture of collaboration, continuous improvement, and accountability within the project team.\n\tDevelop comprehensive project plans, including timelines, budgets, resource allocation, and risk management strategies.\n\tOversee project budgets, manage financial risks, and ensure cost-effective resource utilization.\n\tIdentify project risks early and develop mitigation strategies.\n\tManage project issues effectively, facilitating timely resolutions to maintain project momentum.\n\tEnsure adherence to project schedules, budgets, and quality standards.\n\tBuild and maintain strong relationships with clients, understanding their needs and ensuring project alignment with expectations.\n\tRepresent the Company at client meetings, industry events, and stakeholder briefings.\n\tEnsure projects comply with applicable codes, industry best practices, and company policies.\n\tImplement quality control procedures to maintain high standards of project deliverables.\n\tProvide required technical leadership on all engineering and field operations\n\tOversee technical reviews and ensure engineering solutions meet project and client requirements.\n\tManage relationships with vendors, contractors, and third-party consultants.\n\tReview contracts, ensure compliance with terms, and oversee procurement processes.\n\tDevelop project performance frameworks, track key metrics, and report regularly to senior management.\n\tConduct post-project evaluations to capture lessons learned and improve future project execution.\n\tPerform other responsibilities as assigned by senior management to support the organization’s strategic goals.\n\n\nQualifications & Skills\n\n\n\tBachelor’s Degree in engineering (Petroleum, Mechanical, Electrical, or other related field)\n\tMinimum of 10 years of relevant experience in the oil and gas industry, with at least 5 years in a project management role.\n\tProven track record of successfully managing multiple complex projects in the oil and gas sector.\n\tStrong leadership, team management, and mentoring skills.\n\tIn-depth knowledge of project management methodologies, budgeting, and scheduling.\n\tStrong knowledge of seismic data acquisition and processing techniques\n\tProficient in design and project management software (e.g. MS Project, Primavera, AutoCAD).\n\tExcellent communication, negotiation, and stakeholder management skills.\n\tStrong problem-solving abilities and decision-making skills.\n\tAbility to thrive in a fast-paced environment with tight deadlines.\n\tWillingness to travel to project sites as needed.\n\tProfessional certification in project management (PMP, PRINCE2) is highly desirable.\n\tAn advanced degree (MBA or Master's in Engineering) is an advantage.\n\tStrong understanding of HSE regulations and industry best practices.\n\n\nWork Location / Conditions:\n\n\n\tOffice environment with frequent field/site visits.\n\tMay require extended working hours to meet project deadlines.\n\tAbility to work under pressure in dynamic project environments.\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Procurement Specialist Job at Castville Solutions",
    "link": "https://www.jobgurus.com.ng/jobs/view/procurement-specialist-job-at-castville-solutions",
    "pubDate": "Tue, 03 Jun 2025 09:41:49 GMT",
    "source": "JobGurus",
    "keyword": "castville solutions",
    "duplicate": false,
    "classifications": [
      "Software Engineering",
      "Finance"
    ],
    "content": "Castville Solutions is a recruitment and business solutions provider specializing in the healthcare sector. We focus on connecting healthcare facilities with highly skilled professionals, enabling efficient operations, and driving business growth. Our services extend to recruitment, Templates for process and operations management, SOP development, and healthcare-specific training, with a clear mission to transform the healthcare workforce and operations.\n\nWe are recruiting to fill the position below:\n\nJob Position: Procurement Specialist\n\nJob Location: Agodi, Ibadan - Oyo\nEmployment Type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are hiring a Procurement Specialist to manage the sourcing and purchasing ofmedications and medical equipment.\n\tThis role is crucial in ensuring cost-effective and timely procurement while maintaining high-quality standardof medications.\n\n\nKey Responsibilities\nDevelop and Implement Procurement:\n\n\n\tDesign and execute short- and long-term procurementplanthat support cost-efficiency, service quality, and timely deliveryof products.\n\tMonitor market conditions and supply chain trends to adjust procurement strategies accordingly.\n\tDrive initiatives that support ethical procurement in line with organizational values and compliance needs.\n\tContribute to budgeting and cost-containment strategies through effective sourcing and vendor management.\n\n\nSource Suppliers, Negotiate Contracts, and Manage Vendor Relationships:\n\n\n\tIdentify and evaluate potential suppliers based on capacity, reliability, price, lead time, and compliance.\n\tConduct vendor prequalification and due diligence checks.\n\tLead contract negotiations to ensure favorable pricing, payment terms, service-level agreements (SLAs), and risk mitigation clauses.\n\tFoster strong relationships with key suppliers through regular engagement, performance discussions, and issue resolution.\n\n\nEvaluate Supplier Performance and Ensure Compliance with Terms and Quality Standards:\n\n\n\tEstablish and monitor vendor KPIs such as on-time delivery, order accuracy, defect rates, and responsiveness.\n\tConduct periodic supplier audits and reviews to ensure continued compliance with regulatory, quality, and ethical standards.\n\tAddress supplier non-conformance or performance issues.\n\tMaintain a preferred supplier list based on consistent performance and value contribution.\n\n\nMaintain Accurate Records of Purchases and Pricing:\n\n\n\tTrack and document all procurement transactions using digital procurement tools, ERP systems, or spreadsheets.\n\tMaintain up-to-date price lists, purchase orders, contracts, supplier agreements, and invoices for audit and reporting purposes.\n\tAnalyze historical purchasing data to support forecasting, budgeting, and decision-making.\n\tEnsure accurate coding and classification of all procurement activities for internal and financial reporting.\n\n\nCollaborate with Internal Departments to Forecast Demand and Manage Procurement Plans:\n\n\n\tWork closely with departments such as Inventory, Supply Chain, Production, and Finance to understand material requirements and consumption patterns.\n\tTranslate demand forecasts into procurement plans that align with budget constraints and storage capacities.\n\tAnticipate procurement needs for new projects, seasonal demand shifts, or emergency response.\n\n\nMonitor Procurement Budgets and Drive Cost Reduction Initiatives:\n\n\n\tTrack spending against approved budgets, identify cost-saving opportunities, and implement value-for-money sourcing strategies.\n\tBenchmark procurement costs against market trends and industry standards to ensure competitiveness.\n\tEvaluate alternative materials, brands, or logistics methods to reduce total procurement costs.\n\n\nEnsure Compliance with Legal, Regulatory, and Organizational Policies:\n\n\n\tEnsure all procurement documentation is complete, transparent, and available for audits or regulatory inspections.\n\tImplement anti-fraud and conflict-of-interest controls across procurement processes.\n\n\nCrisis Management and Risk Mitigation:\n\n\n\tDevelop contingency plans for supply chain disruptions such as vendor failure, price volatility, or geopolitical instability.\n\tMaintain alternative supplier lists and identify backup sourcing options for critical goods or services.\n\tMonitor contract risk exposure and renegotiate unfavorable terms when necessary.\n\n\nQualifications\n\n\n\tBachelor's degree in Procurement, Business Administration, or a related field.\n\t5+ years of experience in procurement, preferably in the healthcare industry.\n\tStrong negotiation, vendorand contract management skills.\n\tExcellent analytical and communication skills.\n\n\nNote: For more information or enquiries, call or send a WhatsApp message to: 09010634633.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Graphics Designer and Content Writer Job at Lacare Staffing Solutions",
    "link": "https://www.jobgurus.com.ng/jobs/view/graphics-designer-and-content-writer-job-at-lacare-staffing-solutions",
    "pubDate": "Tue, 03 Jun 2025 09:41:49 GMT",
    "source": "JobGurus",
    "keyword": "lacare staffing solutions",
    "duplicate": false,
    "classifications": [],
    "content": "Lacare Staffing Solutions - Our client, a reputable company, is recruiting to fill the position below:\n\nJob Position: Graphics Designer and Content Writer\nJob Location: Lagos \nEmployment Type: Full-time\n\nRequirements\n\n\n\tInterested candidates should relevant qualifications with 1 - 2 years of work experience.\n\n\nSalary\nN120,000 - N150,000 Monthly.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: lacare247@gmail.com using the Job Position as the subject of the email.\n\nNote: For further inquiries, send a Direct Message to: 09090643323.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Internal Auditor Job at Wandel International",
    "link": "https://www.jobgurus.com.ng/jobs/view/internal-auditor-job-at-wandel-international",
    "pubDate": "Tue, 03 Jun 2025 09:41:49 GMT",
    "source": "JobGurus",
    "keyword": "wandel international",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "Wandel International is the flagship company of the Simba Group, operating in Nigeria since 1988. The company is home to some of Nigeria’s best loved brands, and leaders in their respective industries. We are a diversified business entity with interest in distribution, marketing and services in transportation, alternate energy, internet connectivity and call center solutions.\n\nWe are recruiting to fill the position below:\n\nJob Position: Internal Auditor\n\nJob Location: Surulere, Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Internal Audit role is responsible for the execution and overseeing compliance audits across all Wandel international.\n\tThis role leads the full lifecycle of audit engagements—from risk assessment and planning to execution, reporting, and follow-up—ensuring audits are delivered to a high standard and in alignment with the Group Internal Audit Methodology and the International Standards for the Professional Practice of Internal Auditing (IIA Standards).\n\tThe incumbent plays a key role in providing assurance over the effectiveness of compliance frameworks, policy adherence, and regulatory obligations across Wandel Group.\n\tThis includes assessing internal policies and control systems, identifying systemic weaknesses, and recommending actionable improvements to strengthen governance and enhance risk management.\n\n\nOther Responsibilities:\n\n\n\tSupportin audit planning and conduct risks-based audit process.\n\tLead and perform fieldwork activities, including process walkthroughs, control testing, policy evaluation, and gathering sufficient audit evidence.\n\tAssess compliance with internal policies, applicable laws/procedures and contractual obligations.\n\tLeverage data analytics to enhance audit coverage and identify anomalies or red flags.\n\tAssist with the development and defining the scope of review, propose tailored audit work program and audit time schedules.\n\tStay abreast of industry regulations and standards to ensure compliance and best practices are integrated into our audit processes.\n\tPrepare high-quality audit reports with well-documented findings, root cause analysis, risk implications, and actionable recommendations\n\tPerform walkthrough interviews with key stakeholders and testing of complex / non-routine audit areas including the development and completion of work programs.\n\tEvaluate internal controls' design and operating effectiveness over financial reporting, including identifying control gaps and recommending improvements.\n\tCollaborate with cross-functional teams to identify control gaps and facilitate the implementation of corrective actions.\n\tTrack implementation of audit recommendations, validate remedial actions and escalate overdue or ineffective responses\n\tCarry out other responsibility as require by management.\n\n\nQualifications\n\n\n\tBachelor’s degree in Accounting, Finance, Business, or a related disciplinewith a minimum of Second Class upper/Upper credit.\n\tAt least 6 years of working experience in internal audit, risk or advisory.\n\tACA, ACCA, CIA, CISA or equivalent certification (or actively pursuing) is an advantage.\n\tHave a minimum of five credits in WASSCE Ordinary Level/NECO subjects or acceptable equivalent examination, including Mathematics and English Language in one sitting only.\n\tConsiderable knowledge of accounting principles, practices, procedures, and generally accepted auditing standards.\n\tResults-oriented with strong analytical, problem-solving, and decision-making skills.\n\tExcellent communication, interpersonal and reporting skills, with the ability to communicate complex technical information to non-technical stakeholders.\n\n\nBenefits\n\n\n\tCompetitive salary\n\tOpportunities for Professional Growth and Career Advancement\n\tCollaborative and supportive work environment.\n\n\nMethod of Application\nInterested and qualified candidates should send their Resume to: careers@simba.com.ng using the Job Position as subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "HR Outsourcing Lead Job at Airtel Nigeria",
    "link": "https://www.jobgurus.com.ng/jobs/view/hr-outsourcing-lead-job-at-airtel-nigeria",
    "pubDate": "Tue, 03 Jun 2025 09:41:49 GMT",
    "source": "JobGurus",
    "keyword": "airtel nigeria",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Airtel Nigeria (Airtel Networks Limited) is a leading telecommunications services provider in Nigeria headquartered in Lagos, the commercial nerve-centre of Nigeria. The telco ranks amongst the top four mobile service providers in terms of subscribers with a customer base of more than 39.8 million. The company's product offerings include 2G, 3G and 4G wireless services, mobile commerce and enterprise services.\n\nWe are recruiting to fill the position below:\n\nJob Position: HR Outsourcing Lead\n\nJob Identification: 493\nJob Location: Lagos\nJob Type: Full-time\n\nJob Description\nThe HR Outsourcing Lead will:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tTake full ownership of vendor governance, cost validation, SLA performance, and compliance assurance.\n\tAct as a liaison between vendors and internal stakeholders to drive timely support and issue resolution.\n\tCarry out weekly reporting of headcount and payroll insights, ensuring transparency and fiscal discipline.\n\tProvide an oversight of statutory requirements (e.g., pensions, HMO, taxes) to avoid regulatory risk.\n\tProcess digitization and workforce data integrity improvements.\n\tManage one HR Outsourcing Executive to ensure executional efficiency\n\n\nResponsibilities\nVendor & Workforce Management:\n\n\n\tManage end-to-end HR operations for outsourced staff across 8 vendors.\n\tMonitor and review vendor headcount and validate monthly payroll submissions for accuracy and compliance.\n\tLead weekly headcount and cost reporting, working closely with internal Payroll and Finance team to validate data integrity and provide business-aligned insights.\n\tEnsure timely initiation and processing of vendor payments by promptly raising Purchase Requisitions related to both Fixed and Variable Pay for all vendors. Proactively track the issuance of Purchase Orders to vendors ahead of time and validate that all contractual obligations and performance criteria are met before endorsing Invoices and Job Completion certificates.\n\tConduct quarterly operational reviews with all vendors, measuring performance against agreed SLAs and KPIs, and recommending improvements where necessary.\n\tEnsure consistent adherence to contract terms and raise flags on deviations or risks.\n\tMaintain visibility into vendor resource planning and execution, anticipating issues and proactively proposingnsolutions to support workforce stability and cost efficiency.\n\n\nStakeholder Engagement:\n\n\n\tServe as the primary liaison between vendors and internal stakeholders (line managers and functional heads), fostering a collaborative and accountable working relationship.\n\tProactively manage vendor issues and provide prompt resolutions in collaboration with internal teams.\n\n\nCompliance and Employee Welfare:\n\n\n\tEnsure vendors maintain compliance with all statutory requirements including pension remittance, national insurance, and other employment-related obligations.\n\tMonitor the timely provision of health insurance and other mandatory benefits to outsourced staff.\n\tSupervise the administration and distribution of airtime and mobile data to outsourced employees, ensuring timely provisioning and monthly reconciliation\n\n\nData and Process Management:\n\n\n\tMaintain accurate records of outsourced workforce data and ensure timely updates across all systems.\n\tReview and streamline processes to improve efficiency in outsourcing administration.\n\tEnsure data privacy and confidentiality standards are upheld in managing outsourced personnel data.\n\n\nPolicy Implementation and Continuous Improvement:\n\n\n\tProvide expert advice on HR outsourcing trends, regulatory changes, and contemporary best practices.\n\tParticipate in policy formulation and ensure consistent implementation across all vendors.\n\tDrive continuous process improvement and digitization initiatives within the outsourced employee management framework.\n\n\nDimensions\nFinancial Dimensions:\n\n\n\tBudget\n\tManpower\n\tStrategic Vendors\n\n\nOther Dimensions \n\n\n\tDirect Report: HR Outsourcing Officer\n\n\nQualifications\nEducational Qualifications:\n\n\n\tFirst Degree in Accounting, Engineering or related fields\n\tRelevant certifications in Accounting (e.g., ICAN, ACCA), Business Analytics, Data Analytics (e.g., Power BI, Tableau, SQL), Engineering, HR (e.g., CIPM, SHRM), or Project Management (e.g., PMP, PRINCE2) will be an added advantage.\n\n\nRelevant Experience & Functional / Technical Skills:\n\n\n\tMinimum of 5 years of experience in HR outsourcing, vendor operations, or large-scale workforce administration.\n\tExperience managing a large outsourced workforce and multiple vendors.\n\tStrong hands-on analytical and numerical skills with proficiency in interpreting headcount and cost data.  \n\tSolid understanding of HR compliance, outsourcing regulations, and labor laws.\n\tAbility to manage and coordinate a team to drive performance and timely delivery.\n\tHigh level of attention to detail and organizational discipline. \n\tExcellent interpersonal, negotiation, and vendor relationship management skills.\n\tProficiency in MS Excel, HRIS platforms, and data reporting tools\n\n\nOther Requirements:\n\n\n\tAn ever-present mind with situational awareness and sharp responsiveness.\n\tThe willingness to go above and beyond the call of duty in a dynamic, fast-paced environment.\n\tPositive internal drive, with a passion for excellence and continuous improvement.\n\tRespectful boldness and courage to speak up and escalate issues appropriately.\n\tProven team leadership abilities, with the capacity to guide and inspire team members toward performance and accountability.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]