[
  {
    "title": "Restaurant Manager Job at Ziba Consulting",
    "link": "https://www.jobgurus.com.ng/jobs/view/restaurant-manager-job-at-ziba-consulting",
    "pubDate": "Tue, 03 Jun 2025 13:52:09 GMT",
    "source": "JobGurus",
    "keyword": "ziba consulting",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "Ziba Consulting is a dynamic recruitment and consulting firm committed to connecting top talent with the right opportunities. Our mission is to help businesses streamline their hiring processes while supporting job seekers in achieving their career goals.\n\nWe are recruiting to fill the position below:\n\nJob Position: Restaurant Manager\nJob Location: Victoria Island, Lagos\nWork Schedule: 6 days per week, 8-hour shift\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a dynamic and experienced Restaurant Manager to oversee daily operations and ensure the smooth running of our establishment.\n\tAs a key member of our team, you will supervise staff, manage inventory, maintain hygiene standards, and ensure the highest levels of customer service.\n\tThe Restaurant Manager will also play an integral role in ensuring the profitability of the business while upholding food quality and operational excellence.\n\n\nKey Responsibilities\n\n\n\tManage daily restaurant operations, ensuring efficiency and smooth workflow.\n\tSupervise, train, and evaluate restaurant staff, including front-of-house and back-of-house teams.\n\tMaintain high standards of food quality, service, and hygiene, ensuring compliance with health and safety regulations.\n\tImplement marketing and promotional strategies to attract and retain customers.\n\tEnsure a positive and safe work environment for all employees.\n\tRegularly inspect the restaurant premises to ensure cleanliness and maintenance of equipment.\n\tHandle customer inquiries, complaints, and special requests to provide an exceptional dining experience.\n\tOversee inventory management, ordering supplies, and coordinating with vendors to ensure optimal stock levels.\n\tControl costs and monitor budget to maintain profitability while meeting business objectives.\n\tCollaborate with senior management to develop new policies, procedures, and improvements to restaurant operations.\n\n\nRequirements\n\n\n\tMinimum of 2 years of experience as a Restaurant Manager or in a similar role in the hospitality industry.\n\tStrong leadership skills with the ability to manage and motivate a team.\n\tExceptional customer service and communication skills.\n\tSolid understanding of restaurant operations, food quality, inventory control, and vendor management.\n\tAbility to handle stressful situations and resolve issues effectively.\n\tKnowledge of health and safety regulations, including food handling standards.\n\tStrong organizational skills and attention to detail.\n\tAbility to work flexible hours, including evenings and weekends.\n\n\nCompensation\n\n\n\tCompetitive salary of N250,000 per month.\n\tOpportunities for performance-based bonuses.\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Accountant Job at Ascentech Services Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/accountant-job-at-ascentech-services-limited-17",
    "pubDate": "Tue, 03 Jun 2025 13:52:09 GMT",
    "source": "JobGurus",
    "keyword": "ascentech services limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Ascentech Services Limited is a full-fledged Human Resource Solution Provider incorporated in 2013 with its Head Office in Lagos, Nigeria. We are committed to forging long-term partnerships with our clients by creating and delivering robust and flexible services that address the changing needs of their business.\n\nWe are recruiting to fill the position below:\n\nJob Position: Accountant\n\nJob Location: Benin, Edo\n\nJob Objective\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tResponsible for preparing, examining and analyzing accounting records, financial statements, and other financial reports to ensure accuracy, completeness and conformance to reporting and procedural standards and meet business needs.\n\n\nResponsibilities\n\n\n\tPrepare accounting reports and other necessary information for audit purposes\n\tMaintain updated electronic records of the company’s financial transactions and fixed assets register via the company’s ERP.\n\tPrepare general ledger entries by maintaining records and files;\n\tReconcile bank statement with accounts (cash, receivables and various payables etc) on a weekly basis\n\tAnalyze business operations, trends, costs revenues, financial commitment, and obligations to project future revenues and expenses or to provide advice.\n\tSupport month-end and year-end stock count and valuation process\n\tAssist with local and federal required filings as appropriate i.e Taxes and related filings\n\tUpdate and maintain accounting procedures\n\tManage supplier and staff payments in accordance with set procedures\n\tPrepare reports for management and shareholders, providing financial insights and interpreting data\n\tManage weekly/monthly/annual operating budget preparation and cash forecasting analysis\n\tPrepare monthly internal financial statements and management accounts\n\tManage the company’s relationship with the banks and other external financial stakeholders, credit and facility provider.\n\tPerform other duties as assigned from time to time.\n\n\nQualifications\n\n\n\tBachelor’s degree in Accounting, Finance, or a related field.\n\t3-5 years of experience in an accounting or finance role\n\tKnowledge of accounting principles and financial reporting.\n\tFamiliarity with accounting software (e.g., QuickBooks, Sage, or similar).\n\tProficiency in Microsoft Excel and other office applications.\n\tStrong attention to detail and accuracy.\n\tAbility to work independently and as part of a team.\n\tGood organizational and time management skills.\n\tExcellent verbal and written communication skills.\n\tKnowledge of Nigerian tax laws and financial regulations is a plus.\n\tICAN certification is an added advantage.\n\n\n Salary\nN250,000 - N300,000 Monthly.\n\nMethod Application\nInterested and qualified candidate should send their CV to: cv@ascentech.com.ng using the Job Position and Location as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]