[
  {
    "title": "Female Sales Officer Job at Supply Chain Global Services",
    "link": "https://www.jobgurus.com.ng/jobs/view/female-sales-officer-job-at-supply-chain-global-services-1",
    "pubDate": "Mon, 09 Jun 2025 13:29:00 GMT",
    "source": "JobGurus",
    "keyword": "supply chain global services",
    "duplicate": false,
    "classifications": [],
    "content": "Supply Chain Global Services is an end-to-end bespoke safety and security services company focused on the supply, installation and maintenance of safety and security solutions such as biometric access control, school ERP, hospital ERP, attendance management, and ID verification solutions.\n\nWe are recruiting to fill the position below:\n\nJob Position: Female Sales Officer\nJob Location: Lagos Mainland, Lagos\nEmployment Type: Full-time\n\nRequirements\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe incumbent sales officer must be experienced in:\n\t\n\t\tSegmenting the market\n\t\tProspect for customers\n\t\tWoo them to patronise its services, and retain them through personalised and effective services.\n\t\n\t\n\tCandidates should possess an OND / HND / B.Sc Degree with 2 years of relevant work experience.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: megashoppers@yahoo.com using \"Sales Officer\" as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Social Media Manager Job at Loopify",
    "link": "https://www.jobgurus.com.ng/jobs/view/social-media-manager-job-at-loopify",
    "pubDate": "Mon, 09 Jun 2025 13:29:00 GMT",
    "source": "JobGurus",
    "keyword": "loopify",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Loopify is a smart engagement platform helping brands build meaningful relationships with customers through automated, data-driven solutions. We’re simplifying customer journeys and driving business growth, one loop at a time. Business owners are often swamped with numerous responsibilities, making it challenging to dedicate time and focus to ad campaigns. Our expert-assisted model, blending human expertise with advanced AI, offers a strategic solution. By entrusting your advertising to our dedicated network of professionals, you leverage their deep knowledge and precision for maximum ad budget efficiency. This partnership allows you to focus on running your business while we ensure your ads achieve their fullest potential\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Social Media Manager\nJob Location: Nigeria\nEmployment Type: Full-time\n\nWhat You’ll Do\n\n\n\tManage and grow our presence on LinkedIn, X (Twitter), IG, TikTok & co.\n\tCreate/curate compelling content, graphics, copy, videos.\n\tStay on trend, monitor performance, and evolve strategy.\n\tEngage community, respond to DMs/comments, and build vibes.\n\tCollaborate with the marketing squad on campaigns and product drops.\n\tDevelop social media strategy\n\tProvide data analysis and metric reporting for clients\n\n\nYou Fit If You\n\n\n\tExperience, at least you have ran and handled social media platforms for a brand for 2–4 years.\n\tVast copywriting skills and very creative.\n\tUnderstand what metrics matter (engagement, reach, clicks, etc).\n\tCan switch tone and style depending on platform.\n\tBonus: You’ve built brand voice or scaled a following from scratch.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "HR Outsourcing Manager Job at ICL Support Services Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/hr-outsourcing-manager-job-at-icl-support-services-limited",
    "pubDate": "Mon, 09 Jun 2025 13:29:00 GMT",
    "source": "JobGurus",
    "keyword": "icl support services limited",
    "duplicate": false,
    "classifications": [],
    "content": "ICL Support Services Limited (Rc:679920) is an organization established with the primary objective of providing fast, efficient, reliable and cost-effective corporate support service solutions to a wide range of clients. Primary amongst these classes of services is Recruitment, Outsourcing and Personnel Support Services to our corporate clients. The company also provides telecommunications support services.\n\nWe are recruiting to fill the position below:\n\nJob Position: HR Outsourcing Manager\n\nJob Location: Anthony, Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe're seeking an experienced Outsourcing Manager to lead our outsourcing initiatives and drive business growth.\n\tAs an Outsourcing Manager, you'll be responsible for developing and implementing outsourcing strategies, managing vendor relationships, and ensuring high-quality service delivery.\n\n\nKey Responsibilities\n\n\n\tStrategic Development: Develop and implement outsourcing strategies to drive business growth and improve efficiency.\n\tVendor Management: Manage vendor relationships, negotiate contracts, and ensure compliance with service level agreements.\n\tPerformance Monitoring: Monitor and report on outsourcing performance, identifying areas for improvement.\n\tRisk Management: Identify and mitigate risks associated with outsourcing, ensuring business continuity.\n\tStakeholder Management: Collaborate with internal stakeholders to ensure outsourcing initiatives meet business needs.\n\n\nRequirements\n\n\n\tEducation: Bachelor's Degree in Business, Management, or related field.\n\tExperience: Proven experience in outsourcing management, preferably in a similar industry.\n\n\nSkills:\n\n\n\tStrong strategic thinking and problem-solving skills.\n\tExcellent communication and negotiation skills.\n\tAbility to manage complex projects and vendor relationships.\n\tStrong analytical and reporting skills.\n\n\nWhat We Offer\n\n\n\tCompetitive Salary: A competitive salary package, commensurate with experience.\n\tBenefits: A range of benefits, including health insurance, retirement plan, and paid leave.\n\tCareer Development: Opportunities for career growth and professional development.\n\n\nMethod of Application\nInterested and qualified candidates should submit their Resume and Cover Letter to: recruitments@iclgroupng.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Front Desk Officer Job at ICL Support Services Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/front-desk-officer-job-at-icl-support-services-limited",
    "pubDate": "Mon, 09 Jun 2025 13:29:00 GMT",
    "source": "JobGurus",
    "keyword": "icl support services limited",
    "duplicate": false,
    "classifications": [],
    "content": "ICL Support Services Limited (Rc:679920) is an organization established with the primary objective of providing fast, efficient, reliable and cost-effective corporate support service solutions to a wide range of clients. Primary amongst these classes of services is Recruitment, Outsourcing and Personnel Support Services to our corporate clients. The company also provides telecommunications support services.\n\nWe are recruiting to fill the position below:\n\nJob Position: Front Desk Officer\n\nJob Location: Anthony, Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe're seeking a friendly and professional Front Desk Officer to join our team. As a Front Desk Officer, you'll be the first point of contact for visitors and clients, providing excellent customer service and ensuring a positive experience.\n\n\nKey Responsibilities\n\n\n\tReception Duties: Manage the front desk, answer phone calls, and respond to emails.\n\tCustomer Service: Provide excellent customer service, greeting visitors, and responding to inquiries.\n\tData Entry: Accurately enter data into our system, maintaining up-to-date records.\n\tAdministrative Support: Provide administrative support to other departments as needed.\n\tSecurity and Protocol: Follow security protocols and maintain a safe and welcoming environment.\n\n\nRequirements\n\n\n\tEducation: High School Diploma or equivalent; degree in hospitality or customer service preferred.\n\tExperience: Previous experience in customer service or front desk role.\n\n\nSkills:\n\n\n\tExcellent communication and interpersonal skills.\n\tFriendly and professional demeanor.\n\tAbility to multitask and work under pressure.\n\tBasic knowledge of office software and equipment.\n\n\nWhat We Offer\n\n\n\tCompetitive Salary: A competitive salary package.\n\tOpportunities for Growth: Opportunities for career development and professional growth.\n\tSupportive Team: A supportive and dynamic team environment.\n\n\nMethod of Application\nInterested and qualified candidates should submit their Resume and Cover Letter to: recruitments@iclgroupng.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]