[
  {
    "title": "Sales Representative Job at Tybitx Services International Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/sales-representative-job-at-tybitx-services-international-limited",
    "pubDate": "Fri, 04 Jul 2025 21:37:58 GMT",
    "source": "JobGurus",
    "keyword": "tybitx services international limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Tybitx Services International Limited - Our client, an integrated agro-allied processing company, is recruiting results-driven candidates to drive product sales, expand market share, and build strong relationships with distributors, retailers, and customers in the capacity below:\n\nJob Position: Sales Representative\nJob Location: Lekki, Lagos\nEmployment Type: Full-time\n\nSummary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe role involves ensuring product visibility and availability, identifying and recruiting distributors, monitoring sales performance and market trends, managing inventory and debtors, and resolving customer complaints promptly while meeting and exceeding sales targets.\n\n\nKey Responsibilities\n\n\n\tPromote and sell products to existing and prospective customers.\n\tIdentify, recruit, and maintain relationships with distributors and retailers.\n\tHandle collections and manage debtor accounts.\n\tPrepare and submit regular sales and inventory reports.\n\tMonitor sales performance, competitor activities, and market trends.\n\tEnsure timely deliveries, stock rotation, and inventory accuracy.\n\tResolve customer complaints and report feedback to management.\n\n\nRequirements\n\n\n\tMinimum of OND / HND / B.Sc in a relevant field.\n\tProven sales experience in FMCG or related industry.\n\tStrong negotiation, presentation, and communication skills.\n\tTarget-driven with strong relationship-building abilities.\n\tKnowledge of inventory and sales reporting.\n\tProactive with good market analysis skills.\n\n\nSalary\nN100,000 / Month.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Ticketing and Sales Officer Job at Tybitx Services International Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/ticketing-and-sales-officer-job-at-tybitx-services-international-limited",
    "pubDate": "Fri, 04 Jul 2025 21:37:58 GMT",
    "source": "JobGurus",
    "keyword": "tybitx services international limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Tybitx Services International Limited is Nigeria’s Leading HR and Management Consulting Firm. At Tybitx, we provide HR professional services rooted in Transition Management, empowering companies to achieve their goals through innovative strategies that bring incomparable results.\n\nWe are recruiting to fill the position below:\n\nJob Position: Ticketing and Sales Officer\n\nJob Location: Lagos Island, Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe’re hiring a Ticketing and Sales Officer for a growing travel agency based on Lagos Island.\n\tThis role involves booking flights, promoting travel deals, and providing excellent customer support.\n\tIf you’re confident, organized, and enjoy helping people with their travel plans, we’d love to hear from you.\n\n\nResponsibilities\n\n\n\tBook local and international flights for customers\n\tRespond to inquiries via phone, WhatsApp, and email\n\tPromote travel packages and convert leads into bookings\n\tFollow up with clients and build strong relationships\n\tSupport the agency’s sales and marketing efforts.\n\n\nRequirements\n\n\n\tOND or higher in any discipline\n\tStrong communication and customer service skills\n\tConfidence in handling sales conversations\n\tOrganized, reliable, and comfortable using digital tools\n\tExperience in sales, ticketing, or customer support is a plus.\n\n\nSalary\nN100,000 Monthly.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Inventory Officer Job at Firewood Rice Nigeria",
    "link": "https://www.jobgurus.com.ng/jobs/view/inventory-officer-job-at-firewood-rice-nigeria-1",
    "pubDate": "Fri, 04 Jul 2025 21:37:58 GMT",
    "source": "JobGurus",
    "keyword": "firewood rice nigeria",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "At Firewood Rice Nigeria, we don’t just serve meals - we serve memories. With a deep-rooted love for authentic Nigerian dishes, we’ve built a brand that delivers comfort, flavor, and joy to our customers across Lagos. Our energetic team is the secret sauce behind our success, and we’re growing fast! If you love food, innovation, and working in a vibrant, forward-thinking environment, we want you with us.\n\nWe are recruiting to fill the position below:\n\nJob Position: Inventory Officer\n\nJob Location: Surulere, Lagos \nEmployment Type: Full-time\n\nResponsibilties\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tMonitor daily stock levels of raw materials, packaging items, and finished food products.\n\tRecord and update all inventory transactions in the system (manual or digital).\n\tEnsure First-In-First-Out (FIFO) method is strictly adhered to for perishables.\n\tConduct daily, weekly and monthly routine stock counts and reconcile with records.\n\tIssue items to kitchen staff based on approved requisitions and document usage.\n\tEnsure timely and accurate documentation of all stock movements.\n\tMaintain accurate inventory records including stock cards, bin cards, and system entries.\n\tReport discrepancies or unusual stock variations to the Inventory Supervisor or Operations Manager.\n\tReceive incoming supplies from vendors and verify quantity and quality against invoices/delivery notes.\n\tLabel and store materials in designated storage areas, ensuring proper stock rotation.\n\tPrepare and submit daily, weekly, and monthly inventory reports.\n\tAssist in preparing inventory valuation reports and audits.\n\tEnsure storage areas are clean, organized, and pest-free.\n\tMonitor expiry dates of consumables and escalate issues for prompt action.\n\tEnsure cold room and dry store items are stored at appropriate temperatures and conditions.\n\tLiaise with procurement, kitchen staff, and other departments to ensure adequate stock planning.\n\tAlert management in advance about low stock or potential shortages.\n\tSupport in periodic audits and compliance reviews as required.\n\n\nRequirements\n\n\n\tCandidates should possess a Bachelor's Degree with 2 - 4 years of experience.\n\n\nSalary\nN90,000 - N100,000 monthly.\n\nMethod of Application\nInterested and qualified candidates should forward their CV to: firewoodjollofcareers@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Business Development Lead Job at Eden Solution and Resources Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/business-development-lead-job-at-eden-solution-and-resources-limited",
    "pubDate": "Fri, 04 Jul 2025 21:37:58 GMT",
    "source": "JobGurus",
    "keyword": "eden solution and resources limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Eden Solution and Resources Limited, Formed in 2002 has rapidly become one of Nigeria’s leading providers of staffing services. We endeavour to supply quality and innovative staffing services to all of our clients. Eden Solutions & Resources is managed by a team of competent professionals. Eden Solutions and Resources was conceived by the founders with the express purpose of helping Start-up’s, SME’s and established businesses to accomplish their growth objective and remain relevant in their industries for long. To achieve this vision, Eden Solutions and Resources has evolved from an organization offering only recruitment services to small businesses to a major regional player.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nOur industry-specific focus allows us to develop a depth of experience, expertise, and connections many Other Similar Firms Cannot Match. We are a conscientious Human Resource Management Firm that delivers exceptional, tailor-made, and cost-efficient Workforce and Organizational Management Solutions to our esteemed clientele worldwide. Our unwavering commitment to industry-specific specialization empowers us to cultivate a profound reservoir of experience, expertise, and connections, setting us apart from numerous comparable firms operating in our area.\n\nWe are recruiting to fill the position below:\n\nJob Position: Business Development Lead\n\nJob Location: Abuja (FCT)\n\nJob Summary\n\n\n\tWe are seeking an experienced and strategic Business Development Lead to drive market growth, lead client engagement initiatives, and build a high-performing business support team.\n\tThis is a senior leadership opportunity for a results-driven professional who thrives in dynamic environments and is passionate about building scalable systems that drive business success.\n\n\nKey Responsibilities\n\n\n\tDevelop and execute strategies to acquire and retain high-value clients\n\tOversee branding, proposal development, and digital visibility efforts\n\tLead and mentor a business support team (proposals, marketing, and client services)\n\tIdentify and formalize strategic partnerships to expand market influence\n\tCollaborate with leadership to align growth strategies with the firm's vision\n\n\nIdeal Candidate Profile\n\n\n\t5–10 years of proven experience in business development, strategic sales, or client acquisition\n\tStrong leadership skills with experience managing a business development or marketing team\n\tExcellent communication, presentation, and negotiation abilities\n\tDigitally savvy—comfortable turning digital engagement into measurable growth\n\tEntrepreneurial mindset with a proactive and goal-oriented approach.\n\n\nWhat’s on Offer\n\n\n\tN250,000 Monthly Gross Salary, plus performance-based commissions\n\tLeadership exposure and opportunity for executive growth\n\tA collaborative, high-impact, and values-driven work environment\n\tThe opportunity to directly shape the growth strategy of a forward-thinking consulting firm.\n\n\nApplication Closing Date\n31st August, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV and a 1-page Cover Letter to: recruitment@edensrpeople.com using “Business Development Lead – Abuja” as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Accountant Job at Eden Solution and Resources Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/accountant-job-at-eden-solution-and-resources-limited",
    "pubDate": "Fri, 04 Jul 2025 21:37:58 GMT",
    "source": "JobGurus",
    "keyword": "eden solution and resources limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "(adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\nFormed in 2002, Eden Solution and Resources Limited, has rapidly become one of Nigeria’s leading providers of staffing services. We endeavour to supply quality and innovative staffing services to all of our clients. Eden Solutions & Resources is managed by a team of competent professionals. Eden Solutions and Resources was conceived by the founders with the express purpose of helping Start-up’s, SME’s and established businesses to accomplish their growth objective and remain relevant in their industries for long. To achieve this vision, Eden Solutions and Resources has evolved from an organization offering only recruitment services to small businesses to a major regional player. Our industry-specific focus allows us to develop a depth of experience, expertise, and connections many Other Similar Firms Cannot Match. We are a conscientious Human Resource Management Firm that delivers exceptional, tailor-made, and cost-efficient Workforce and Organizational Management Solutions to our esteemed clientele worldwide. Our unwavering commitment to industry-specific specialization empowers us to cultivate a profound reservoir of experience, expertise, and connections, setting us apart from numerous comparable firms operating in our area.\n\nWe are recruiting to fill the position below:\n\nJob Position: Accountant\n\nJob Location: Abuja (FCT) \n\nKey Responsibilities\n\n\n\tPrepare and process monthly payroll, PAYE, and pension schedules\n\tFile and remit statutory deductions (ITF, NSITF, PAYE, Pension) accurately and on time\n\tMaintained accurate accounting records and ledgers using Excel or accounting software\n\tPerform monthly bank and petty cash reconciliations\n\tSupport internal financial reporting and analysis\n\tLiaise with tax authorities (FIRS/FCT-IRS) for compliance and queries\n\tEnsure data integrity and confidentiality in all financial processes\n\n\nKey Requirements\n\n\n\tHND / B.Sc. in Accounting, Finance, or related discipline\n\tATS certification or ACA/ACCA (in progress) is an advantage\n\tExperience with QuickBooks, Sage, Wave, or similar tools is a plus\n\tSolid knowledge of Nigerian tax laws and payroll procedures\n\tStrong attention to detail, accuracy, and integrity.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: patrickpatrick1001@gmail.com using “Accountant – Abuja” as the subject of the    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]