[
  {
    "title": "Job Openings at Havana Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-havana-group",
    "pubDate": "Wed, 16 Jul 2025 18:23:35 GMT",
    "source": "JobGurus",
    "keyword": "havana group",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Software Engineering"
    ],
    "content": "Havana Group has a number of companies under its porfolio. We're into real estate, media, technology and hospitality. You will enjoy working with us if you're a talented young, vibrant, energetic, creativeand ambitious individual who wants to work with a team of other champions, in an environment that sponsors growth and development. If you're not intimidated with greatness, you're welcome to join our team.\n\nWe are recruiting to fill the following positions below:\n\n1.) Corporate Sales Marketer\n\nJob Location: Lagos \nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tHavana Group of Companies is expanding, and we are seeking strategic, professional Sales Marketers to join our team in Lagos.\n\tYou will be responsible for identifying potential corporate and institutional clients, creating relationships, and actively generating leads that convert into service subscriptions.\n\n\nKey Responsibilities\n\n\n\tIdentify, visit, and engage decision-makers in targeted organizations across Lagos.\n\tPitch our services professionally and persuasively, tailoring solutions to each client’s operational needs.\n\tGenerate qualified leads and follow through with the sales team for conversion.\n\tMaintain accurate records of outreach, leads, and feedback using provided tools.\n\tRepresent Havana Group with integrity and professionalism in all business interactions.\n\tCollaborate with the internal team to refine sales strategy based on feedback from the field.\n\n\nRequirements\n\n\n\tMinimum of 2 years of experience in sales, B2B marketing, or field business development.\n\tProven ability to engage and close business with structured organizations.\n\tStrong presentation and communication skills.\n\tSelf-motivated, persuasive, and results-driven.\n\tMust reside in Lagos and be familiar with key commercial areas.\n\tExperience in facility services, property management, or corporate sales is a plus.\n\n\nSalary\nN70,000 - N100,000 Monthly.\n\nApplication Closing Date: 31st August, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hr.9figuremedia@gmail.com using the Job Position as the subject of the mail.\n\n \n\n \n\n2.) Graphic Designer\n\nJob Location: Enugu \nEmployment Type: Full-time\n\nResponsibilities\n\n\n\tCreating visual concepts for marketing materials, social media, websites, and other digital/print platforms.\n\tWork closely with other team members to develop design solutions that align with project objectives.\n\tDesign engaging graphics, illustrations, and layouts for advertisements, brochures, flyers, banners, and other promotional materials.\n\tUpdate and maintain brand guidelines to ensure consistency across all creative outputs.\n\tPrepare design files for print and digital use, ensuring accurate formatting and resolution.\n\tStay updated on industry trends and design techniques to keep the company's visual assets fresh and current.\n\tCollaborate with the marketing and content teams to produce visually appealing content for campaigns.\n\tStay updated on industry trends and design techniques to keep the company's visual assets fresh and current.\n\tHandle multiple design projects simultaneously and meet tight deadlines.\n\tTake feedback from supervisors to refine and improve designs.\n\tSupport the development of creative concepts for client presentations and internal projects.\n\n\nPreferred Qualifications\n\n\n\tDegree or Diploma in Graphic Design, Visual Arts, or a related field.\n\tBasic knowledge of web design (HTML/CSS) is a plus.\n\tExperience in video editing or animation tools is a bonus.\n\n\nRequirements:\n\n\n\t2 - 3 years of proven experience as a graphic designer or relevant role (internships and freelance projects count).\n\tProficiency in design software such as Adobe Creative Suite (Photoshop, Illustrator, InDesign).\n\tBasic knowledge of typography, color theory, and layout design principles.\n\tStrong portfolio showcasing a variety of design projects (submit link with application).\n\tAbility to work collaboratively in a fast-paced environment and manage multiple tasks effectively.\n\tGood communication skills and a willingness to learn and take direction.\n\tAttention to detail and commitment to high-quality work.\n\tTime-management skills with the ability to meet deadlines.\n\n\nSalary\nN75,000 - N150,000 monthly.\n\nApplication Closing Date: 16th August, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hr.9figuremedia@gmail.com using the Job Position as the subject of the mail.\n\nNote\n\n\n\tEnsure your resume includes relevant work experience and educational background.\n\tPortfolio: Attach a link to your portfolio showcasing your design work.\n\tApplications without portfolios will not be considered.\n\tCover Letter: Include a brief cover letter detailing your experience, why you're interested in this role, and how your skills align with the job requirements.\n\n\n \n\n3.) Content Developer\n\nJob Location: Enugu\nEmployment Type: Full-time\n\nJob Description\n\n\n\tWe are seeking a skilled Content Developer to lead website content production, SEO optimization, social media management, link building, and community building.\n\n\nResponsibilities\n\n\n\tCreate and manage engaging content for our website, including landing pages, blog posts, and lead magnets.\n\tOptimize content for SEO to improve search rankings and increase organic traffic.\n\tCollaborate closely with the head of content, SEO experts, designers, and front-end developers.\n\tMonitor content performance and adapt strategies to improve engagement and conversions.\n\tContribute to social media management and community-building efforts.\n\n\nRequirements\n\n\n\tInterested candidates should possess a Bachelor’s Degree in Marketing, Communications, English, or a related field with proven experience as a content developer or similar role.\n\tProficiency in content management systems (CMS) like WordPress.\n\tExcellent writing, editing, and proofreading skills.\n\tAbility to conduct thorough research and create compelling, engaging content.\n\tStrong organizational skills with the ability to manage multiple projects and deadlines.\n\tStrong content writing skills with a knack for storytelling and engaging narratives.\n\tBasic knowledge of SEO best practices and content marketing strategies.\n\tA keen eye for analytics to measure and enhance content performance.\n\tProficiency in content management software and tools.\n\tA curious, research-driven mindset with a strong sense of ownership and autonomy.\n\tThe ability to thrive in a collaborative environment that values mutual respect and equality.\n\n\nSalary\nN75,000 - N150,000 per month. \n\nBenefits:\n\n\n\tCompetitive salary.\n\tProfessional development opportunities.\n\tCollaborative and innovative work environment.\n\tExperience with HTML, CSS, and basic web development.\n\tKnowledge of graphic design tools like Adobe Creative Suite.\n\tUnderstanding of social media marketing and how it integrates with content strategy\n\n\nApplication Closing Date: 16th August, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hr.9figuremedia@gmail.com using the Job Position as the subject of the mail.\n\nNote: Ensure your resume includes relevant work experience and educational background.\n\n \n\n4.) WordPress Expert\n\nJob Location: Enugu \nEmployment Type: Full-time\n\nResponsibilities\n\n\n\tBuild and customize advanced WordPress websites, including bespoke themes, plugins, and functionalities tailored to client needs.\n\tOptimize websites for SEO, speed, and responsiveness across all devices and platforms.\n\tIntegrate advanced third-party tools and APIs (e.g., CRM, analytics, or marketing automation platforms).\n\tTroubleshoot complex technical issues, including performance bottlenecks, security vulnerabilities, and compatibility challenges.\n\tCollaborate with designers to implement pixel-perfect designs and ensure brand consistency.\n\tMaintain and update client websites, ensuring compliance with the latest WordPress standards and security protocols.\n\tProvide technical guidance and recommendations to enhance website functionality and user experience.\n\n\nRequirements\n\n\n\t3+ years of advanced WordPress development experience.\n\tExpert-level proficiency in PHP, HTML, CSS, JavaScript, and MySQL.\n\tExtensive experience in custom theme and plugin development, including REST API integrations.\n\tStrong knowledge of SEO, web accessibility (WCAG), and performance optimization techniques.\n\tProven ability to troubleshoot and resolve complex WordPress issues.\n\tExcellent collaboration and communication skills to work in a fast-paced agency environment.\n\n\nPreferred Qualifications:\n\n\n\tExpertise with popular page builders and frameworks like Gutenberg.\n\tFamiliarity with hosting environments and server-side management.\n\tExperience with design tools for seamless collaboration with creative teams.\n\tKnowledge of digital marketing tools and strategies (e.g., Google Analytics, marketing automation).\n\n\nSalary\nN100,000 - N150,000 / month. \n\nApplication Closing Date: 16th August, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hr.9figuremedia@gmail.com using the Job Position as the subject of the mail.\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Chief Technology Officer Job at the Concept Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/chief-technology-officer-job-at-the-concept-group",
    "pubDate": "Wed, 16 Jul 2025 18:23:35 GMT",
    "source": "JobGurus",
    "keyword": "the concept group",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Software Engineering",
      "Marketing"
    ],
    "content": "(function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){\n        (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),\n        m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)\n    })(window,document,'script','//www.google-analytics.com/analytics.js','ga');\n\n    ga('create', 'UA-43112273-1', 'jobgurus.com.ng');\n    ga('send', 'pageview');\n\n\n\n\n    \n        \n    Home\n    Jobs\n    Free Aptitude Test Practice\n    Employer? Post a Job\n            Register\n        Sign in\n        Contact us\n    \n\n    \n\n        \n    \n        \n\n            \n\n                \n\n                    \n                        Toggle navigation\n                        \n                        \n                        \n                    \n\n                    \n                \n            \n\n            \n                \n\n\tJobs\n\tJob Seekers\n\tAptitude Test\n\tScholarships\n\n            \n\n            \n                \n\n                                            Register\n                        Sign in\n                    \n                    Employer? Post a Job\n                \n            \n\n        \n\n    \n\n        \n        \n            \n            \n                 \n    \n        \n     \n\n\n                            \n                    \n        \n                        CLICK HERE TO JOIN OUR WHATSAPP CHANNEL \n                    \n    \n\n    \n                                \n                    \n\n                        \n                            \n                        \n\n                        \n                            \n                                Any Specialization\n                                                                    Accounting / Audit / Finance\n                                                                    Administration/ Office/ Operations\n                                                                    Advertising/ Social Media/ Marketing/ PR\n                                                                    Agriculture / Agro Allied\n                                                                    Analyst/ Quality Control\n                                                                    Automotive/ Car Services\n                                                                    Aviation / Airline\n                                                                    Banking / Insurance\n                                                                    Building Design / Architecture\n                                                                    Construction / Mining\n                                                                    Consulting / Business Strategy/ Planning\n                                                                    Craftsmen / Artisans\n                                                                    Creatives (Arts, Design, Fashion)\n                                                                    Customer Service\n                                                                    Domestic / Janitorial Services\n                                                                    Driving / Haulage\n                                                                    Education / Teaching / Training\n                                                                    Engineering / Technical\n                                                                    Executive / Management\n                                                                    Freelance / Data Entry\n                                                                    Government Agencies / Public Sector\n                                                                    Graduates / Freshers\n                                                                    Grants /  Scholarships\n                                                                    Hospitality / Food Services\n                                                                    HSE / Safety Management\n                                                                    Human Resources / Recruitment\n                                                                    Information Technology / ICT\n                                                                    Internship/ Industrial Training\n                                                                    Legal / Law\n                                                                    Logistics / Transportation/ Supply\n                                                                    Manufacturing / Production\n                                                                    Maritime Services / Shipping\n                                                                    Media / Art / Entertainment\n                                                                    Medical/ Healthcare / Pharmaceutical\n                                                                    Military / Para-Military\n                                                                    NGO / Community Services\n                                                                    Oil & Gas / Energy\n                                                                    Procurement/ Purchasing\n                                                                    Project Management\n                                                                    Real Estate / Property / Surveying\n                                                                    Research / Survey\n                                                                    Risk Management / Compliance\n                                                                    Sales / Business Development\n                                                                    Secretarial / PA\n                                                                    Security / Intelligence\n                                                                    Software/ Programming / Web development\n                                                                    Sports / Fitness\n                                                                    Supply Chain/ Store\n                                                                    Technicians\n                                                                    Telecommunications\n                                                                    Tourism / Travels\n                                                                    Vocational Trade and Services\n                                                            \n                        \n\n                        \n                            \n                                Any Work Level\n                                                                    Entry Level (Trainee)\n                                                                    Executive (Director, Head of Dept)\n                                                                    Experienced (Non-Manager)\n                                                                    Internship\n                                                                    Manager (Staff Supervisor)\n                                                                    Senior Executive (MD, CEO, COO)\n                                                                    Vocational (Skilled/Unskilled Labour)\n                                                            \n                        \n\n                        \n                            \n                                 Search\n                            \n                        \n                    \n                \n                            \n            \n\n\n\n\n\n\n            \n\n                \n                                        \n                    \n                                        \n                    \n                    \n\n                    \n                        \n                        \n\n{\n  \"@context\": \"https://schema.org\",\n  \"@type\": \"JobPosting\",\n  \"title\": \"Chief Technology Officer\",\n  \"description\": \"The Concept Group is a holding company for companies established in 1992. Subsidiaries under the Group include: Rosabon Financial Services - Nigeria&amp;rsquo;s Leading Financial Intermediary and Equipment Leasing Company, Concept Nova - Bespoke Enterprise IT Solutions Company, Percy Aitkins - Bureau De Change.\n\nWe are recruiting to fill the position below:\n\nJob Position: \n\nJob Summary\n\n\n\tThe CTO is responsible for providing strategic and technical leadership across all aspects of technology development and implementation.\n\tYou will oversee the software development process, from project initiation to delivery, ensuring adherence to best practices, quality standards, and timelines.\n\tAdditionally, you will lead the recruitment, training, and development of technical talent, foster a culture of innovation, and drive continuous improvement initiatives.\n\n\nScope and Impact\n\n\n\tAs the Chief Technology Officer (CTO), the incumbent will play a pivotal role in shaping the technological direction of the company, driving innovation, and ensuring the successful delivery of software solutions.\n\tThey will lead a team of software developers and engineers, oversee projects, and collaborate with stakeholders to deliver high-quality software products that meet business objectives.\n\n\nDuties &amp;amp; Responsibilities\n\n\n\tStrategic Technology Leadership: Develop and execute the company&amp;#39;s technology strategy in alignment with business goals and industry trends. Identify opportunities for technological innovation and drive initiatives to enhance competitive advantage.\n\tTeam Management: Lead and mentor a team of technology professionals, including software developers, engineers, and IT specialists. Foster a culture of collaboration, innovation, and continuous learning within the technology team.\n\tProduct Development and Innovation: Oversee the development and enhancement of software products and solutions tailored to the finance industry&amp;#39;s specific needs. Drive innovation initiatives to explore new technologies, improve existing products, and create new revenue streams.\n\tArchitecture and Infrastructure: Define and maintain the company&amp;#39;s technology architecture and infrastructure, ensuring scalability, reliability, and security. Evaluate and recommend appropriate technologies, platforms, and tools to support business objectives.\n\tCode Review and Quality Assurance: Conduct regular code reviews to ensure adherence to coding standards, maintain code quality, and identify areas for improvement. Implement and oversee quality assurance processes.\n\tTechnical Documentation: Create and maintain technical documentation, including system architecture, design documents, and user guides. Ensure that documentation is accurate, up to date, and easily accessible.\n\tRegulatory Compliance: Ensure compliance with relevant regulations and industry standards governing financial technology, data privacy, and cybersecurity. Implement robust security measures and risk management practices to safeguard sensitive information and mitigate potential threats.\n\tStakeholder Collaboration: Collaborate with internal stakeholders, including executive leadership, product management, sales, and operations, to align technology initiatives with business priorities. Communicate effectively with external stakeholders, including clients, partners, regulators, and industry associations.\n\tProject Management: Oversee the planning, execution, and delivery of technology projects, ensuring adherence to timelines, budgets, and quality standards. Provide regular updates to senior management on project progress, risks, and issues.\n\tVendor Management: Manage relationships with technology vendors, service providers, and third-party partners. Evaluate vendor proposals, negotiate contracts, and ensure compliance with service level agreements.\n\tEmerging Technologies: Stay abreast of emerging technologies, trends, and best practices in the finance and technology industries. Assess the potential impact of new technologies on business operations and recommend strategic investments.\n\tTalent Acquisition and Development: Lead recruitment efforts to attract top talent to the technology team. Develop and implement training programs to enhance technical skills, leadership capabilities, and industry knowledge among team members.\n\tBudgeting and Financial Management: Develop and manage the technology budget, ensuring optimal allocation of resources and cost-effective solutions. Monitor expenses, identify opportunities for cost savings, and justify technology investments to senior management.\n\tRisk Management: Identify potential risks and challenges during the software development life cycle. Develop mitigation strategies and contingency plans to minimize project risks.\n\tContinuous Improvement: Drive continuous improvement initiatives within the development team. Encourage learning, skills enhancement, and the adoption of new technologies to enhance team performance.\n\tAny other tasks as assigned by the line manager.\n\n\nRequirements\n\n\n\tA Bachelor&amp;#39;s or Master&amp;#39;s Degree in Computer Science, Information Technology, Finance, or a related field is typically required.\n\t10+ years of experience in technology leadership roles, with a good background in the finance industry and/or technology solutions.\n\tStrong leadership, communication, and interpersonal skills. Proven ability to inspire and motivate cross-functional teams, build consensus, and drive results in a dynamic environment.\n\tProficiency in programming languages such as Java, C++, Python, or others. Knowledge of software development frameworks and tools, database systems, and web technologies is also important. Additionally, expertise in specific domains or technologies relevant to the organization&amp;#39;s industry may be required.\n\n\nSalary\nN30,000,000 - N40,000,000 annually.&amp;nbsp;\n\nMethod of Application\nInterested and qualified candidates should send their Applications to:careers@conceptgroup-ng.comusing the Job Position as the subject of the email.\",\n  \"datePosted\": \"2025-07-16\",\n  \"validThrough\": \"5200-07-16\",\n  \"employmentType\": \"Full-Time\",\n  \"hiringOrganization\": {\n    \"@type\": \"Organization\",\n    \"name\": \"The Concept Group\"\n    \n  },\n  \"jobLocation\": {\n    \"@type\": \"Place\",\n    \"address\": {\n      \"@type\": \"PostalAddress\",\n       \"postalCode\": \". \",\n       \"addressRegion\": \". \",\n       \"streetAddress\": \". \",\n      \"addressLocality\": \"Lagos\",\n      \"addressCountry\": \"NG\"\n     \n      \n    }\n  },\n  \"identifier\": {\n    \"@type\": \"PropertyValue\",\n    \"name\": \"\",\n    \"value\": \"184406\"\n  },\n  \"baseSalary\": {\n    \"@type\": \"MonetaryAmount\",\n    \"currency\": \"NGN\",\n    \"value\": {\n      \"@type\": \"QuantitativeValue\",\n      \"minValue\": 0,\n      \"maxValue\": 0,\n      \"unitText\": \"MONTH\"\n    }\n  }\n}\n\n\nChief Technology Officer Job at the Concept Group\n\n\n\n\n        \n    \n\n        \n        The Concept Group is a holding company for companies established in 1992. Subsidiaries under the Group include: Rosabon Financial Services - Nigeria’s Leading Financial Intermediary and Equipment Leasing Company, Concept Nova - Bespoke Enterprise IT Solutions Company, Percy Aitkins - Bureau De Change.\n\nWe are recruiting to fill the position below:\n\nJob Position: \n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe CTO is responsible for providing strategic and technical leadership across all aspects of technology development and implementation.\n\tYou will oversee the software development process, from project initiation to delivery, ensuring adherence to best practices, quality standards, and timelines.\n\tAdditionally, you will lead the recruitment, training, and development of technical talent, foster a culture of innovation, and drive continuous improvement initiatives.\n\n\nScope and Impact\n\n\n\tAs the Chief Technology Officer (CTO), the incumbent will play a pivotal role in shaping the technological direction of the company, driving innovation, and ensuring the successful delivery of software solutions.\n\tThey will lead a team of software developers and engineers, oversee projects, and collaborate with stakeholders to deliver high-quality software products that meet business objectives.\n\n\nDuties & Responsibilities\n\n\n\tStrategic Technology Leadership: Develop and execute the company's technology strategy in alignment with business goals and industry trends. Identify opportunities for technological innovation and drive initiatives to enhance competitive advantage.\n\tTeam Management: Lead and mentor a team of technology professionals, including software developers, engineers, and IT specialists. Foster a culture of collaboration, innovation, and continuous learning within the technology team.\n\tProduct Development and Innovation: Oversee the development and enhancement of software products and solutions tailored to the finance industry's specific needs. Drive innovation initiatives to explore new technologies, improve existing products, and create new revenue streams.\n\tArchitecture and Infrastructure: Define and maintain the company's technology architecture and infrastructure, ensuring scalability, reliability, and security. Evaluate and recommend appropriate technologies, platforms, and tools to support business objectives.\n\tCode Review and Quality Assurance: Conduct regular code reviews to ensure adherence to coding standards, maintain code quality, and identify areas for improvement. Implement and oversee quality assurance processes.\n\tTechnical Documentation: Create and maintain technical documentation, including system architecture, design documents, and user guides. Ensure that documentation is accurate, up to date, and easily accessible.\n\tRegulatory Compliance: Ensure compliance with relevant regulations and industry standards governing financial technology, data privacy, and cybersecurity. Implement robust security measures and risk management practices to safeguard sensitive information and mitigate potential threats.\n\tStakeholder Collaboration: Collaborate with internal stakeholders, including executive leadership, product management, sales, and operations, to align technology initiatives with business priorities. Communicate effectively with external stakeholders, including clients, partners, regulators, and industry associations.\n\tProject Management: Oversee the planning, execution, and delivery of technology projects, ensuring adherence to timelines, budgets, and quality standards. Provide regular updates to senior management on project progress, risks, and issues.\n\tVendor Management: Manage relationships with technology vendors, service providers, and third-party partners. Evaluate vendor proposals, negotiate contracts, and ensure compliance with service level agreements.\n\tEmerging Technologies: Stay abreast of emerging technologies, trends, and best practices in the finance and technology industries. Assess the potential impact of new technologies on business operations and recommend strategic investments.\n\tTalent Acquisition and Development: Lead recruitment efforts to attract top talent to the technology team. Develop and implement training programs to enhance technical skills, leadership capabilities, and industry knowledge among team members.\n\tBudgeting and Financial Management: Develop and manage the technology budget, ensuring optimal allocation of resources and cost-effective solutions. Monitor expenses, identify opportunities for cost savings, and justify technology investments to senior management.\n\tRisk Management: Identify potential risks and challenges during the software development life cycle. Develop mitigation strategies and contingency plans to minimize project risks.\n\tContinuous Improvement: Drive continuous improvement initiatives within the development team. Encourage learning, skills enhancement, and the adoption of new technologies to enhance team performance.\n\tAny other tasks as assigned by the line manager.\n\n\nRequirements\n\n\n\tA Bachelor's or Master's Degree in Computer Science, Information Technology, Finance, or a related field is typically required.\n\t10+ years of experience in technology leadership roles, with a good background in the finance industry and/or technology solutions.\n\tStrong leadership, communication, and interpersonal skills. Proven ability to inspire and motivate cross-functional teams, build consensus, and drive results in a dynamic environment.\n\tProficiency in programming languages such as Java, C++, Python, or others. Knowledge of software development frameworks and tools, database systems, and web technologies is also important. Additionally, expertise in specific domains or technologies relevant to the organization's industry may be required.\n\n\nSalary\nN30,000,000 - N40,000,000 annually. \n\nMethod of Application\nInterested and qualified candidates should send their Applications to:careers@conceptgroup-ng.comusing the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n\n    \n    \n\n\n\n\n        \n        \n\n\n\n\n   \n\n\n    \n        Similar Jobs\n    \n\n    \n        \n                        IT Manager Job at Dwight Patterson Consultants\n                        Job Vacancies at TalentVol Recruitment Consulting Agency\n                        Senior IT Officer Job at Sayed Farms Limited\n                        ADMINISTRATIVE/HSE OFFICER\n                        IT Personnel Job at Trucrete Solutions Limited\n                        Reporter / Editor (IT-Savvy) Job at May Publishing Limited\n                        IT Manager Job at Emel Hospital\n                        Information Technology Officer Job at Lagos Chamber of Commerce and Industry\n                        Database Administrator (Oracle, MongoDB, Cassandra, MySQL) Job at BlueChip Technologies\n                        Job Vacancies at Carbon Nigeria\n                    \n    \n\n\n\n                        \n                    \n\n                    \n                        \n\n\n\n          \n\n\n    \n\n        Hottest Jobs\n\n        \n        \n            \n\n                Customer Experience Oficer\n\n               \n            \n        \n            \n\n                Job Vacancies at Transsion Holdings\n\n               \n            \n        \n            \n\n                Job Vacancies at Youverify\n\n               \n            \n        \n            \n\n                Job Openings at SPIE Oil & Gas Services\n\n               \n            \n        \n            \n\n                Job Openings at Viju Industries Nigeria Limited\n\n               \n            \n        \n            \n\n                Sales & Customer Service Officer (Online)\n\n               \n            \n        \n            \n\n                Quality Control Officer Job at Dangote Group\n\n               \n            \n        \n            \n\n                Accounts Payable Officer Job at Airtel Nigeria\n\n               \n            \n        \n            \n\n                Customer Care Representative Job at Recore Limited\n\n               \n            \n        \n            \n\n                Job Vacancies at PPC Limited\n\n               \n            \n        \n        \n\n    \n\n\n\n\n        \n        \n   \n\n\n                    \n                            \n            \n        \n        \n        \n\n        \n\n    \n\n        \n\n            \n\n                \n\n                    Job Seekers\n\n                    \n\n                        Search for Jobs\n                         Featured Jobs\n                         Jobs by Specialization\n                         Jobs by Industry\n                         Jobs by Location\n                         \n                        Companies Currently Hiring\n\n                        Upload CV\n\n                        Free Aptitude Test Practice\n                        \n                        Scholarships and Financial Aid\n\n                        Testimonies\n                    \n\n                \n\n                \n\n                    Employers\n\n                    \n\n                        Post A Job\n\n                        Search Resumes/Profiles\n\n                        Create Employer Account\n\n                        Advertise\n\n                        Pricing\n\n                    \n\n                \n\n                \n\n                    Tools & Resources\n\n                    \n\n                        Contact us\n                        \n                        Our Blog\n  \n                        \n\n                        Job XML/RSS Feeds\n \n                        Free Aptitude Test Practice\n\n                        Bank Details\n\n                        FAQ & Support\n\n                    \n\n                \n\n                \n\n                    Connect with us\n\n                    \n\n                        \n\n                            \n\n                            \n\n                        \n\n                        \n\n                            \n\n                            \n\n                        \n\n                \n\n                        \n\n                            \n\n                            \n\n                        \n\n                    \n\n\n\n                    \n\n                        Customer Care\n\n                        09134259221 \n\n                        (9am - 5pm) weekdays\n\n                         info [at] jobgurus.com.ng\n\n                    \n\n\n\n                \n\n            \n\n        \n\n    \n\n\n\n    \n\n        \n\n\n\n            \n\n                Privacy Policy\n\n                Terms & Conditions\n\n                Sitemap\n                \n                About us\n\n            \n\n\n\n            Copyright © 2025 Jobgurus.com.ng - Latest Jobs in Nigeria 2025. All right reserved.",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]