[
  {
    "title": "Job Openings at Salpha Energy Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-salpha-energy-limited",
    "pubDate": "Mon, 30 Jun 2025 20:16:50 GMT",
    "source": "JobGurus",
    "keyword": "salpha energy limited",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "Salpha Energy is a social, for-profit business that designs, distributes, solar-powered home energy products, with an underserved population in mind: the 1.3 billion global consumers for whom the old-fashioned electrical grid is either unavailable or too expensive.\n\nWe are recruiting to fill the following positions below:\n\n1.) Partnership Inventory Dispatch Officer (PIDO)\n\nJob Location: Abakaliki, Ebonyi\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Partnership Inventory Dispatcher Officer will be responsible for the End-to-End management of inventory/products distributed to partners and ensuring seamless disbursement and delivery to partnership branches within the state.\n\tThis role requires excellent communication, organizational, and logistical skills to ensure that all inventory-related operations align with company objectives on partnership sales targets and partner expectations.\n\n\nKey Responsibilities\nDispatch/Distribution Operations:\n\n\n\tEffectively plan product disbursement strategies across assigned branches based on route mapping to achieve distribution cost effectiveness and prompt product availability\n\tCoordinate and ensure that products dispatched across various branches are in good condition.\n\tOptimize delivery schedules to reduce lead times and improve efficiency.\n\tTrack deliveries and provide regular status updates to relevant parties.\n\n\nPartnership Coordination:\n\n\n\tServe as the primary point of contact for branches assigned and other partners concerning product deliveries and inventory queries.\n\tEnsure all partners receive timely updates on product availability, delivery schedules, and stock levels.\n\tAttend union meetings regularly to sensitise partners and customers on product offerings\n\tInterface regularly with Branch Managers (BMs) and CSOs to ensure speedy sales and remittance of funds to the company’s account.\n\tMaintain good rapport with branch executives and excos to maximize result.\n\n\nInventory Management:\n\n\n\tMaintain accurate records of products disbursed to partnership branches.\n\tRegularly update inventory databases to reflect stock movements, deliveries, and returns (Defectives) across assigned branches.\n\tConduct routine stock audits and reconciliations with branches to ensure accountability and minimise discrepancies.\n\n\nDocumentation and Reporting:\n\n\n\tPrepare and manage all necessary documentation for inventory dispatch, including delivery notes, receipts, and branch confirmations.\n\tMaintain an accurate record of products disbursed to branches and regularly confirm inventory balances.\n\tGenerate periodic reports on stock levels, dispatch activities, and partner performance metrics.\n\n\nProblem Resolution:\n\n\n\tInvestigate and resolve any issues related to stock discrepancies, delayed deliveries, or partner complaints.\n\tProactively identify and address potential bottlenecks in the inventory and dispatch process across branches.\n\tWork closely with the engineering department to ensure faulty products are speedily repaired and returned to the branch.\n\n\nCompliance and Standards:\n\n\n\tEnsure that all inventory and dispatch activities comply with company policies, standards and directives.\n\n\nRequirements and Qualifications\n\n\n\tEducation: Minimum of a Bachelor's degree in Marketing, Logistics, Supply Chain Management, Economics, Business Administration, or other related field.\n\tExperience: At least 4 years of relevant experience in partnership/Retail sales and management, inventory management, logistics planning, or a similar role, preferably in the FMCG sector.\n\n\nSkills:\n\n\n\tMust have a high integrity Level and honesty in the discharge of duties.\n\tMust know how to drive with a valid driver’s license\n\tStrong organizational and multitasking abilities.\n\tExcellent knowledge of location landscape and route mapping.\n\tExcellent Reporting skills\n\tProficiency in the Microsoft Office Suite for accurate reporting.\n\tExcellent communication and negotiation skills.\n\tWillingness to travel within the state as required.\n\n\nSalary\nN100,000 / month. \n\nMethod of Application\nInterested and qualified candidates should forward their CV to: careers@salphaenergy.com using the Job Position as the subject of the email.\n\n \n\n\n3.) 3D Product Designer - Consumer Electronics & Enclosure Design\n\nJob Location: Lagos \nEmployment Type: Contract\n\nJob Description\n\n\n\tSalpha Energy is hiring a talented 3D Product Designer to support the development of consumer electronics enclosures.\n\tYou’ll design functional, manufacturable, and visually compelling plastic housings for a variety of compact, performance-focused products.\n\n\nResponsibilities\n\n\n\tCreate detailed 3D CAD models for housings and small device enclosures.\n\tDevelop technical drawings and documentation suitable for manufacturing and tooling vendors.\n\tGenerate realistic product renderings for marketing, investor decks, and internal review.\n\tSupport product integration by ensuring proper fit of internal components (PCBs, batteries, ports).\n\tIterate on designs based on performance, assembly, and material feedback.\n\tCommunicate effectively with cross-functional teams across design, manufacturing, and quality.\n\n\nRequirements\n\n\n\tCandidates should possess an HND, B.Eng, or MSc with 5 - 9 years of experience. \n\tCreative problem solver with technical rigor\n\tDetail-oriented and precise communicator.\n\tComfortable working across design, engineering, and manufacturing teams.\n\tExcited about building innovative energy products for African markets\n\n\nRequired Skills & Tools:\n\n\n\tProficiency in 3D design tools: SolidWorks, Fusion 360, AutoCAD, or similar.\n\tExperience with rendering software: KeyShot, Blender, V-Ray, or equivalent.\n\tAbility to prepare STL/STEP files, exploded views, and mold-ready component drawings.\n\tStrong understanding of plastic component design, DFM/DFA, and consumer product housings.\n\tBonus: Experience working on electronics or plastic manufacturing.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and application to: salpha@salphaenergy.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Personal Assistant (Male) Job at Roxbury Leisure Homes",
    "link": "https://www.jobgurus.com.ng/jobs/view/personal-assistant-male-job-at-roxbury-leisure-homes-1",
    "pubDate": "Mon, 30 Jun 2025 20:16:50 GMT",
    "source": "JobGurus",
    "keyword": "roxbury leisure homes",
    "duplicate": false,
    "classifications": [],
    "content": "Roxbury Leisure Homes is an experienced real estate/property development company that offers luxurious homes across top notch locations in Lagos State.\n\nWe are recruiting to fill the position below:\n\nJob Position: Personal Assistant (Male)\nJob Location: Lekki, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tRoxbury Leisure Homes is hiring a Personal Assistant to support our CEO.\n\tWe’re looking for a smart, proactive, and organized individual who can handle personal and administrative tasks efficiently.\n\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tRunning errands and handling logistics\n\tAssisting with scheduling and daily tasks\n\tProviding personal and administrative support\n\tDriving the CEO to appointments and meetings.\n\n\nRequirements\n\n\n\tCandidates should possess a B.Sc Degree with 2 - 5 years of work experience.\n\tMust be male\n\tMust be able to drive confidently (valid driver’s license required)\n\tMust be smart, detail-oriented, and proactive\n\tGood communication and time management skills\n\tTech-savvy and presentable.\n\n\nSalary\nN100,000 - N160,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: roxburyhomesjobs@gmail.com using \"Personal Assistant Application\" as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]