[
  {
    "title": "General Manager Job at Trinity Financial",
    "link": "https://www.jobgurus.com.ng/jobs/view/general-manager-job-at-trinity-financial-1",
    "pubDate": "Fri, 04 Jul 2025 23:15:01 GMT",
    "source": "JobGurus",
    "keyword": "trinity financial",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "Trinity Financial is a limited liability company duly incorporated in Nigeria under the 2002 Companies and Allied Matters Act. licensed and supervised by the Central Bank of Nigeria as a full-fledged Financial Service Firm.\n\nWe are recruiting to fill the position below:\n\nJob Position: General Manager\n\nJob Location: Victoria Island, Lagos\n\nSummary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tA banking and finance company based in Victoria Island is in need of a general managerwho is focused on innovation, customer satisfaction, and operational efficiency.\n\tWe are looking for a passionate and experienced general manager to lead our team and drive business success.\n\n\nJob Overview\n\n\n\tYou will be responsible for overseeing the day-to-day operations of the business, ensuring strategic goals are met, and fostering a positive and productive work environment.\n\tAs the general manager, you will collaborate with department heads, manage budgets, streamline processes, and contribute to the overall growth of the organization.\n\n\nKey Responsibilities\n\n\n\tLead, manage, and oversee daily business operations across all departments\n\tDevelop and execute strategic plans to achieve company objectives and growth targets\n\tMonitor performance metrics and implement improvements to maximize efficiency and profitability.\n\tManage budgets, forecasts, and financial reporting in collaboration with the finance team\n\tBuild and maintain strong relationships with customers, partners, and vendors\n\tEnsure compliance with company policies and all applicable regulations\n\tRecruit, train, and mentor key team members and department leaders\n\tFoster a positive workplace culture that promotes accountability, innovation, and teamwork\n\n\nQualifications\n\n\n\tA Master's Degree in Business Administration, Management, or related field (MBA preferred)\n\tProven experience as a General Manager, Operations Manager, and relevant experience in credit and marketing role\n\tMust have ACA qualification\n\tStrong leadership skills with a track record of building high-performing teams\n\tExcellent communication, organizational, and decision-making abilities\n\tIn-depth knowledge of business operations, finance, and performance management principles\n\tProficiency with business management software and tools.\n\n\nWhat We Offer\n\n\n\tCompetitive salary and performance-based bonuses\n\thealth insurance\n\tProfessional development opportunities\n\tCollaborative and supportive company culture\n\tOpportunity to make a significant impact on a growing business, etc.\n\n\nMethod of Application\nInterested and qualified candidates should send their CVs to: info@trinityfinancialng.com and Trinityfinancialng01@gmail.com using the Job Position as the subject of the mail.\n\nNote: Only qualified applicants will be contacted for an interview.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Maintenance Facility Supervisor Job at De Talents",
    "link": "https://www.jobgurus.com.ng/jobs/view/maintenance-facility-supervisor-job-at-de-talents",
    "pubDate": "Fri, 04 Jul 2025 23:15:01 GMT",
    "source": "JobGurus",
    "keyword": "de talents",
    "duplicate": false,
    "classifications": [],
    "content": "De Talents is currently recruiting suitably qualified candidates to fill the position below:\n\nJob Position: Maintenance Facility Supervisor\nJob Location: Lagos\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDaily inspection of all service equipment’s/utilities in the building (with checklist). Act on all ensuing issues.\n\tDevelop checklists for the assigned facility and monitor same.\n\tReport back to the Maintenance Manager on regular basis.\n\tMonitor of all service equipment’s to minimize down time.\n\tImplementation of all maintenance schedules preplanned for routine maintenance activities.\n\tAvailable primary contact to company clients on their facilities issues.\n\tAssessment of facility maintenance requirements and material estimates for procurements.\n\tSupervision of all maintenance works and facilities renovations by company contractors to ensure works are done to company defined standards and scopes.\n\tSolve building maintenance problems should they occur.\n\tEffective utilization and supervision of the maintenance team consisting of plumbers, electricians, cleaners etc. to achieve good service delivery to the company customers.\n\tLogging of maintenance activities/breakdowns.\n\tAttend periodic maintenance department meetings.\n\tIntermediary between the maintenance team and other departments in the company.\n\tFollow up with Accounts on maintenance requests, reporting status on a regular basis to (FMM).\n\tRecord keeping of job cards for each flat.\n\tRecord keeping of expenditure for each flat.\n\tRecord keeping and updating of service history of all company plant & equipment.\n\tInventory control.\n\tProvide HSE admin support to the department staff and assist with producing reports on HSE.\n\tPerform all other maintenance, mechanical and administrative duties as assigned by Line Manager.\n\tAssist in sourcing for contractors and materials for procurement.\n\tAssist in monitoring of staff attendance and collation of attendance registers for HR.\n\tRegular checks on building HSE and security related measures to ensure compliance with standards.\n\tAssist in monitoring of diesel levels in facilities and all other duties as assigned or required by Line Manager.\n\n\nRequirements\nEducation and Qualifications:\n\n\n\tBachelor’s Degree in Electrical, Mechanical Enineering, or any related field.\n\tEngineering and Health & Safety Certifications will be an added advantage. E.g. COREN, HSE 1, 2, 3. First Aid, Fire-fighting, Work a height, COSHH, HVAC, IOSH working safely or managing safely etc.\n\n\nExperience:\n\n\n\tMinimum of 5 years of experience as a maintenance supervisor.\n\tStrong knowledge of building trades and maintenance.\n\tSolid understanding of health and safety regulations and practices.\n\n\nMethod of Application\nInterested and qualified candidates should send their detailed CV to: hrdetalents@gmail.com using the Job Position as the subject of the email.\n\nNote\n\n\n\tYour work experience should reflect start and end months and year (Example: July 2013 – May 2018).\n\tOnly selected candidates will be contacted.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Internal Auditor Job at UHY Professional Services",
    "link": "https://www.jobgurus.com.ng/jobs/view/internal-auditor-job-at-uhy-professional-services",
    "pubDate": "Fri, 04 Jul 2025 23:15:01 GMT",
    "source": "JobGurus",
    "keyword": "uhy professional services",
    "duplicate": false,
    "classifications": [],
    "content": "UHY Professional Services is a firm of professionals ranging from chartered accountants, professional corporate secretaries, financial advisory services, recruitment and HR services, etc.\n\nWe are recruiting to fill the position below:\n\nJob Position: Internal Auditor\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\n\nRequirements\n\n\n\tCandidates should possess relevant qualifications in a related field.\n\tExperience in internal audit is greatly required.\n\n\nSalary\nN200,000 / Month.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: tampap22@gmail.com using \"Internal Auditor\" as the subject of the email.\n\nNote\n\n\n\tPlease if you do not have the required experience, don't apply.\n\tApplicants living around Ikeja are at advantage.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Pharmacist Job at Stratom Concept Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/pharmacist-job-at-stratom-concept-limited",
    "pubDate": "Fri, 04 Jul 2025 23:15:01 GMT",
    "source": "JobGurus",
    "keyword": "stratom concept limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Stratom Concept Limited is a fast-growing multi-sector company with operations across the retail, pharmaceutical, beauty, and wellness industries. We are committed to delivering premium products and services through our network of salons, pharmacies, supermarkets in Nigeria.\n\nWe are recruiting to fill the position below:\n\nJob Position: Pharmacist\n\nJob Location: Port Harcourt, Rivers\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tOur reputable and fast-growing retail pharmacy in Port Harcourt, is seeking a qualified Pharmacist to join our team. The ideal candidate must be professional, customer-focused, and committed to delivering excellent healthcare services while actively contributing to the growth of the business through product recommendations and upselling.\n\n\nKey Responsibilities\n\n\n\tDispense prescription and over-the-counter medications accurately\n\tProvide professional advice on medication use, dosage, and potential side effects\n\tEnsure all prescriptions comply with regulatory and legal standards\n\tCross-sell complementary health products and drive daily sales targets\n\tOffer personalized recommendations to customers based on their health needs\n\tMonitor stock levels and ensure proper storage of pharmaceuticals\n\tSupervise and support pharmacy assistants in daily operations\n\tEnsure compliance with pharmacy laws, guidelines, and ethical practices\n\tMaintain excellent customer service standards and promote health awareness\n\n\nRequirements\n\n\n\tB.Pharm or Pharm.D from a recognized institution\n\tMinimum of 2 years of experience in a retail or community pharmacy preferred\n\tValid license from the Pharmacists Council of Nigeria (PCN)\n\tFemale preferably for gender balance\n\tStrong communication, sales, and interpersonal skills\n\tGoal-oriented and proactive in achieving branch sales targets\n\tFamiliarity with pharmacy software and inventory systems is an advantage.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and Cover letter to: hrstratomconcept@gmail.com using the Job Position and Location as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]