[
  {
    "title": "Customer Success - Email Support Job at Moniepoint",
    "link": "https://www.jobgurus.com.ng/jobs/view/customer-success-email-support-job-at-moniepoint",
    "pubDate": "Tue, 17 Jun 2025 14:44:41 GMT",
    "source": "JobGurus",
    "keyword": "moniepoint",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Moniepoint Incorporated is a global business payments and banking platform and recently became QED Investors’ first investment in Africa. We are the partner of choice for over 600,000 businesses of all sizes, powering the dreams of SMBs and providing them with equal access to the tools they need to grow and scale.\n\nWe are recruiting to fill the position below:\n\nJob Position: Customer Success - Email Support\n\nJob Location: Lagos\nWork mode: Hybrid\n\nJob Purpose\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAs Customer Success - Email Support, you will assist Moniepoint customers via email. Some of the key responsibilities for this role include developing customer relationships, solving customer issues, and promoting products and services.\n\n\nResponsibilities \n\n\n\tTo assist customers with queries related to Moniepoint products via Emails and deal with multiple customers at the same time. \n\tMaintaining a positive, empathetic and professional attitude toward customers at all times. \n\tAcknowledging and resolving customer complaints. \n\tFamiliar with Moniepoint products so that you can answer questions effectively. \n\tRespond timely both verbally and in writing to all customer inquiries.\n\tCommunicating and coordinating with your manager as necessary. \n\tTo manage all daily tasks and duties related to the process with strict compliance to guidelines. \n\tHelp in creating customer surveys, segmentation & getting feedback to improve our processes, products and customer experience \n\n\nRequirements \n\n\n\tCandidates should possess a Degree in a relevant field \n\t1-3 years of professional work experience, preferably in banking or a fast-paced fintech or digital banking environment.\n\tExperience and knowledge of customer support requirements particularly in the correspondent banking space.\n\tClient Service experience or Front Office experience \n\tCompliance knowledge is an added advantage\n\tAttention to detail\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Full Stack Developer Job at Davethan Technologies Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/full-stack-developer-job-at-davethan-technologies-limited",
    "pubDate": "Tue, 17 Jun 2025 14:44:41 GMT",
    "source": "JobGurus",
    "keyword": "davethan technologies limited",
    "duplicate": false,
    "classifications": [
      "Software Engineering"
    ],
    "content": "Davethan Technologies Limited is a cutting-edge tech solutions provider, dedicated to delivering innovative, secure, and scalable digital products and services across industries. We pride ourselves on our collaborative culture, technical excellence, and commitment to empowering businesses through technology.\n\nWe are recruiting to fill the position below:\n\nJob Position: Full Stack Developer\n\nJob Location: Abuja, Nigeria\nWork type: Hybrid\nCompany: Davethan Technologies Limited\n\nRole Overview\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a talented and motivated Full Stack Developer to join our growing team in Nigeria.\n\tIn this role, you will design, develop, and maintain robust web applications and services, working across both the front-end and back-end to deliver seamless user experiences and reliable systems.\n\n\nKey Responsibilities\n\n\n\tDesign, develop, test, and deploy responsive web applications and APIs.\n\tCollaborate with cross-functional teams to define, design, and ship new features.\n\tWrite clean, scalable, and maintainable code following best practices.\n\tEnsure the performance, quality, and responsiveness of applications.\n\tTroubleshoot, debug, and upgrade existing software.\n\tImplement security and data protection solutions.\n\tStay up to date with emerging technologies and propose improvements.\n\n\nRequirements\n\n\n\tBachelor’s Degree in Computer Science, Information Technology, or a related field (or equivalent experience).\n\tProven experience as a Full Stack Developer or similar role.\n\tStrong proficiency in front-end technologies: HTML5, CSS3, JavaScript, and frameworks like\n\tReact, Angular, or Vue.js.\n\tSolid back-end development experience with languages such as Node.js, Python, Java, or PHP.\n\tExperience with databases (SQL and NoSQL).\n\tFamiliarity with version control tools (e.g., Git).\n\tExperience with RESTful APIs and third-party integrations.\n\tUnderstanding of cloud services (AWS, Azure, or similar) is a plus.\n\tStrong problem-solving skills and attention to detail.\n\tExcellent communication and teamwork abilities.\n\n\nWhat We Offer\n\n\n\tOpportunity to work with a dynamic and collaborative global team.\n\tProfessional growth and learning opportunities.\n\tFlexible working environment.\n\tCompetitive salary and benefits package.\n\n\nMethod of Application\nInterested and qualified candidates should submit their CV and a brief cover letter highlighting their relevant experience to: hr@davethan.tech using the Job Position as the subject of the mail.\n\nNote: Ready to build the future with us? Please apply.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Data Analyst Job at Kadick Integrated Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/data-analyst-job-at-kadick-integrated-limited",
    "pubDate": "Tue, 17 Jun 2025 14:44:41 GMT",
    "source": "JobGurus",
    "keyword": "kadick integrated limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Kadick Integrated Limited is a dynamic and forward-thinking company operating in the fintech and telecom sectors. We provide innovative digital solutions, agency banking services, and retail distribution across Nigeria. At Kadick, we are committed to driving financial inclusion, empowering communities, and delivering exceptional value to our partners and customers.\n\nWe are recruiting to fill the position below:\n\nJob Position: Data Analyst\n\nJob Location: Ajah, Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tTo lead the process of collating, analyzing and reporting of data\n\tTrack receivables, credit checks and health checks.\n\n\nQualifications\n\n\n\tBachelor's Degree in Mathematics, Statistics, Finance or Computer Science or a related field.\n\tProven experience with a minimum of 3 years of relevant experience.\n\tStrong analytical skills with the ability to interpret complex data, identify patterns, and draw actionable insights.\n\tProficiency in spreadsheet software (e.g., Microsoft Excel, Google Sheets) and other analytical tools.\n\tAbility to thrive in a fast-paced environment and adapt quickly to changing priorities.\n\n\nLocation:\n\n\n\tThe candidate should reside within the Ajah / Sangotedo Environment.\n\n\nSalary\nN200,000 - N250,000 / Month.\n\nMethod of Application\nInterested candidates should send their CV / Applications to: recruitment@kadickintegrated.com using the Job Position as the subject of the email.\n\nNote: Only shortlisted candidates will be contacted.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Web Developer Job at Outsource Nigeria",
    "link": "https://www.jobgurus.com.ng/jobs/view/web-developer-job-at-outsource-nigeria",
    "pubDate": "Tue, 17 Jun 2025 14:44:41 GMT",
    "source": "JobGurus",
    "keyword": "outsource nigeria",
    "duplicate": false,
    "classifications": [
      "Software Engineering",
      "Marketing"
    ],
    "content": "Outsource Nigeria is a full-service Human Resources agency, specializing in providing outsourced turnkey manpower solutions to growing companies. Our solution include HR Services, Recruiting, Accounting, IT Support, Business Intelligence, Developers, and Operations including management and field / phone / automated based resources. The core of Outsource Nigeria’s success is its people.\n\nWe are recruiting to fill the position below:\n\nJob Position: Web Developer\nJob Location: Surulere, Lagos\nEmployment Type: Full-time\n\nJob Description:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a skilled Web Developer to join our dynamic team. In this role, you will be responsible for developing and maintaining high-quality websites and business applications that align with our company's vision and meet our clients' needs.\n\tYou will collaborate closely with our design and IT teams to ensure seamless integration of front-end and back-end functionalities.\n\n\nResponsibilities\n\n\n\tDevelop responsive websites and web applications using modern technologies.\n\tProve experience as a web developer,\n\tCollaborate with designers to create intuitive user interfaces and ensure seamless navigation.\n\tImplement security measures to protect websites and data.\n\tTest and debug applications for performance, usability, and functionality.\n\tOptimize applications for maximum speed and scalability.\n\tEnsure compliance with web standards and best practices.\n\n\nRequirements\n\n\n\tBachelor's degree in Computer Science, Web Development, or a related field\n\tProven experience as a Web Developer, Mobile App Developer, Full-Stack Developer, or similar role.\n\tProficiency in HTML, CSS, JavaScript, JS framework, and other front-end technologies.\n\tExperience with PHP, MySQL, CodeIgniter, Laravel, Flutterflow, and for back-end development.\n\tFamiliarity with CMS platforms (e.g., WordPress, Joomla) and eCommerce solutions.\n\tStrong understanding of responsive design principles and mobile-first approach.\n\tKnowledge of SEO principles and optimization techniques.\n\tExcellent problem-solving skills and attention to detail.\n\tAbility to work independently and collaborate effectively in a team environment.\n\n\nSalary\nN150,000 per month. \n\nMethod of Application\nInterested and qualified candidates should send their Cv to: jobs@outsourcenigeria.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Vacancies at TradeDepot",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancies-at-tradedepot-1",
    "pubDate": "Tue, 17 Jun 2025 14:44:41 GMT",
    "source": "JobGurus",
    "keyword": "tradedepot",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "TradeDepot is a B2B eCommerce and embedded finance company building the largest digital network of retail outlets in Africa and changing the way FMCG brands distribute products to over 5 million retailers on the continent.\n\nWe are recruiting to fill the following positions below:\n\n1.) Trade / Sales Executive (FMCG) \n\nJob Locations: Abuja (FCT), Abeokuta - Ogun and Yaba (and its evirons), Lagos\nEmployment Type: Full-time\n\nResponsibilties\nYou will be responsible for:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tEnsure sales target achievement as per company objectives.\n\tManage retail accounts in his assigned territory for business growth.\n\tNegotiate and influence value proposition to retailer for mutual business growth.\n\tEnsure process compliance as per company guidelines and standards\n\tManage task management for each outlet as per the process and timelines.\n\tConduct effective sales call at each outlet as per the coverage and outlet specific plan.\n\tBuild and managing customer relationships through proactive inputs on market insights.\n\tEnsure achievement of key performance indicators KPIs.\n\tManaging superior in-store execution excellence - Availability and visibility.\n\tNegotiating shelf space and other visibility locations with retailers to drive sell-throug.\n\tEnsure best in-store merchandising to maximize share of shelf for each brand and SKU.\n\tManage displays as per the planogram and other guidelines provided time to time.\n\tManaging SKU level stock ordering with aim to increase availability and visibility.\n\tEnsure minimum stock levels at each outlet and proactively manage customers.\n\tProactively coordinating with various functions to ensure excellent service delivery.\n\n\nIdeal Profile\n\n\n\tInterested candidates should possess a Bachelor`s Degree, HND, OND, SSCE / GCE / NECO qualification\n\tYou have at least 1 - 3 years of experience in trade sales.\n\tMerchandising or sales promotion experience is important.\n\tHas strong understanding of retail business dynamics for driving business growth.\n\tStrong analytics to identify and plan sku level stock and display management.\n\tExcellent communication skills with good listening and problem solving.\n\tDisciplined and proactive in managing assigned tasks.\n\tTech savvy - mobile technology (Android phone and Mobile Apps).\n\n\nWho we want?\n\n\n\tWe are looking for goal-oriented and proactive individuals with great Influencing skills who have the right attitude and persona as well as the ability to drive sustainable retail business growth.\n\tThey should be able to manage business operations seamlessly with demonstration of strong business ethics.\n\tThe individual must be passionate and demonstrate ownership to assess and translate in-store stock management and visibility opportunities into execution excellence in turn brand and SKU level growth at each outlet.\n\n\nWhy Join Us?\n\n\n\tCompetitive salary\n\tCareer growth opportunities in a dynamic sales environment.\n\tBe part of a fast-growing and customer-focused team.\n\n\nApplication Closing Date: 30th June, 2025.\n\nClick here to apply online\n\n \n\n2.) Key Account Manager (Modern Trade) \n\nJob Location: Lagos\n\nJob Summary\n\n\n\tAs the Key Account Manager for Tier 1 - Tier 3 Supermarkets, you will be directly responsible for acquiring new accounts, managing and enhancing relationships with existing supermarket chains, and ensuring the successful listing and sales of our products.\n\tYour focus will be on operational excellence, delivering on joint business plans, and overseeing in-store execution to maintain high standards and achieve sales targets.\n\n\nKey Responsibilities\nAccount Acquisition and Management:\n\n\n\tIdentify potential supermarket chains for partnership and effectively secure new accounts.\n\tMaintain and grow relationships with existing accounts, understanding their business needs and operational processes.\n\tDevelop and implement joint business plans that align with the supermarkets' goals and our company's objectives.\n\n\nSales Execution:\n\n\n\tDrive the listing process for new products in supermarket chains, ensuring wide visibility and availability.\n\tCoordinate with supermarkets to launch promotional campaigns that drive sales and enhance customer engagement.\n\tMonitor sales performance across various stores and chains, adjusting tactics in real-time to meet sales targets.\n\n\nIn-store Execution Oversight:\n\n\n\tWork closely with merchandising teams to ensure that our products are displayed prominently and according to agreed standards.\n\tOversee the implementation of in-store promotions and ensure that they are executed as planned, maximizing impact and visibility.\n\tRegularly visit supermarket chains to audit execution, address any issues, and ensure compliance with 'perfect store' standards.\n\n\nCross-functional Team Collaboration:\n\n\n\tCollaborate with brand heads and marketing to tailor promotions and marketing materials that suit each supermarket's customer base and sales strategy.\n\tLiaise with logistics to ensure timely delivery of products and resolve any supply chain issues swiftly.\n\tCommunicate effectively with all internal stakeholders to keep them informed of account statuses, challenges, and opportunities.\n\n\nPreferred Qualifications\n\n\n\tBachelor’s Degree in Business Administration, Marketing, or a related field.\n\tAt least 5 years of experience in sales or account management, preferably in the FMCG sector.\n\tStrong operational and execution skills, with a proven ability to manage and grow key accounts.\n\tExcellent communication and interpersonal skills, adept at building relationships with diverse stakeholders.\n\tDemonstrated ability to manage projects and priorities effectively, with meticulous attention to detail.\n\n\nWhat We Offer\n\n\n\tCompetitive salary and benefits package.\n\tOpportunities for professional growth and advancement.\n\tA challenging and dynamic work environment where your efforts have a visible impact on the company’s success.\n\n\nApplication Closing Date: 20th June, 2025.\n\nClick here to apply online\n\n \n\n \n\n3.) Area Sales Manager\n\nJob Location: Lagos\n\nOverview\n\n\n\tThe Area Sales Manager (ASM) is responsible for driving the growth, visibility, and depletion of TradeDepot’s product portfolio within a defined territory through effective distributor management and multichannel sales execution.\n\tThis role oversees the commercial performance of appointed distributors and the activities of field personnel (merchandisers and promoters), ensuring TradeDepot products achieve strong in-market presence, availability, and turnover.\n\n\nObjectives\n\n\n\tEnsure consistent sell-in and sell-out of TradeDepot products through aligned distributor engagement.\n\tMonitor distributor profitability and optimize their working capital usage.\n\tDevelop localized go-to-market strategies to drive product reach across Wholesale, Supermarkets, Hypermarkets, HoReCa, Retail, and Open Markets.\n\tIdentify and close distribution gaps within the assigned territory.\n\tPropose and implement localized, management-approved marketing activities that increase consumer awareness and store-level conversions.\n\tDeploy promoters, sampling, and in-store incentives aligned with brand strategy.\n\tManage field teams to ensure planogram compliance, shelf availability, and promotional material deployment.\n\tDrive in-store visibility and force replenishment initiatives to boost sales.\n\tTrack sales, product movement, and distributor KPIs regularly.\n\tProvide timely reports and actionable market insights to internal stakeholders.\n\tProvide leadership, coaching, and training to field teams.\n\tCollaborate with distributors to build execution capability and ensure target achievement.\n\n\nQualifications & Experience\n\n\n\tBachelor’s Degree in Business Administration, Marketing, or related field.\n\tMinimum of 5 years of sales or distribution experience in FMCG, retail, or trade development roles.\n\tProven experience managing distributors and leading field sales teams.\n\tProficiency in CRM tools and Microsoft Office Suite (especially Excel and PowerPoint).\n\tDemonstrated ability to deliver sales growth and achieve territory KPIs.\n\tStrong knowledge of channel development and market penetration strategies.\n\tExcellent leadership, negotiation, and communication skills.\n\tAnalytical thinker with a problem-solving mindset and attention to detail.\n\n\nWhat We Offer\n\n\n\tCompetitive salary and benefits package.\n\tOpportunities for professional growth and advancement.\n\tA challenging and dynamic work environment where your efforts have a visible impact on the company’s success.\n\n\nApplication Closing Date: 21st June, 2025.\n\nClick here to apply online\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]