[
  {
    "title": "Executive Assistant Job at TeamAce Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/executive-assistant-job-at-teamace-limited-1",
    "pubDate": "Tue, 03 Jun 2025 14:47:18 GMT",
    "source": "JobGurus",
    "keyword": "teamace limited",
    "duplicate": false,
    "classifications": [],
    "content": "TeamAce Limited - Our client, a distinguished, reliable partner in the corporate sector, is recruiting to fill the position below:\n\nWe are recruiting to fill the position below:\n\nJob Position: Executive Assistant\nJob Location: Victoria Island, Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAs our Executive Assistant, you'll provide high-level administrative support to the Executive Vice Chairman.\n\tThis role is essential in ensuring effective schedule management, seamless communication, and operational efficiency.\n\tThe ideal candidate is highly organized, proactive, and able to work in a fast-paced environment while maintaining a high level of professionalism and discretion.\n\n\nResponsibilities\n\n\n\tSchedule and coordinate meetings, appointments, and travel arrangements, ensuring optimal time management and resolving conflicts efficiently.\n\tAct as the primary point of contact for internal and external stakeholders, screening and prioritizing emails, calls, and inquiries.\n\tPrepare agendas, take minutes, and distribute materials for meetings; ensure follow-up on action items and arrange domestic and international travel, including flights, accommodations, and itineraries, with attention to cost and convenience.\n\tDraft, edit, and organize correspondence, presentations, reports, and other documents as needed and support special projects by conducting research, compiling data, and coordinating with team members.\n\n\nRequirements\n\n\n\tBachelor's degree in Business Administration, Communications, or a related field.\n\t5+ Proven Years of experience as an Executive Assistant or in a similar administrative role, preferably supporting C-level executives.\n\tProficiency in Microsoft Office Suite (Word, Excel, PowerPoint, Outlook, Teams) and familiarity with tools like Google Workspace or project management software.\n\tComfortable working under pressure and handling multiple tasks simultaneously.\n\tDiscreet and trustworthy with confidential information.\n\n\nSalary\nN500,000 - N600,000 per month. \n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Project Administration Officer Job at Food Concepts Plc",
    "link": "https://www.jobgurus.com.ng/jobs/view/project-administration-officer-job-at-food-concepts-plc-2",
    "pubDate": "Tue, 03 Jun 2025 14:47:18 GMT",
    "source": "JobGurus",
    "keyword": "food concepts plc",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Food Concepts commenced operations in 2001. From inception, our aim has been clear-cut and focused: to revolutionise the food sector in West Africa and to deliver extraordinary satisfaction to our stakeholders.\n\nSince launching in 2004, Chicken Republic (a Subsidiary of Food Concepts) has already opened 55 stores in Nigeria and Ghana. On this basis, we are proud of the brand’s hard-earned reputation as the fastest-growing chicken QSR in West Africa and the number 1 chicken QSR in Nigeria (both in revenues and number of outlets). In addition, Chicken Republic was ranked as one of Nigeria’s top 20 brands across all categories (Financial Standards Awards 2009).\n\nWe are recruiting to fill the position below:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Position: Project Administration Officer\n\nJob Location: Mushin, Lagos\nEmployment Type: Full Time\nDepartment: Business Development Department\nReports to: Project Manager\n\nJob Purpose\n\n\n\tTo oversee and perform administrative functions concerned with a project.\n\n\nCore Responsibilities and Key Result Areas\nProject Administration:\n\n\n\tEnsure project’s administrative and financial activities comply with rules and regulations\n\tSupport development and preparation of result – oriented work plans, critical paths and other project management tools\n\tProvide support to the implementation of the internal standard operating procedures\n\tArrange travel and hotel reservations, obtain necessary travel authorizations as required\n\tCoordinate the arrangement of appointments and meetings, including compilation of briefing and presentation materials, speeches, ground information and documentation\n\tProvide translation of simple correspondence and act as an interpreter and take meeting minutes if required\n\tSupport preparation of budgets and provide information for audit needs\n\tProvide administrative support to organization on conferences, workshops and retreats as required;\n\tMaintain an up-to-date list of inventory of the project and support annual physical verification by checking the accuracy of records and location of property;\n\tAct as a custodian for the management of project stationary supplies including maintenance of stock list of stationary, distribution of stationary as required and keeping the log of distribution\n\tMaintain filing system ensuring safekeeping of confidential materials and documents.\n\n\nKey Performance Indicators:\n\n\n\tEstimate of project completion\n\tDeviation of planned budget\n\tPercentage of milestone missed\n\tCost variance\n\n\nJob Specifications\n\n\n\tEducational Requirements:  A minimum of a Bachelor’s degree in Business administration, Public administration or related field is required.\n\tExperience Requirements: Minimum of 2 years of experience in similar role.\n\tProfessional Requirements: Possession of any relevant certification is an added advantage\n\n\nKnowledge Requirements:\n\n\n\tGood knowledge of administrative rules and regulations\n\tKnowledge of Project Management\n\tKnowledge of Time Management\n\tDemonstrates Supervisory skills\n\n\nWorking Conditions:\n\n\n\tJobholder typically works 40 hours per week, Monday to Friday, although this role may involve working overtime, if there is workload.\n\tThis role may include calling contractors, making appointments, ordering supplies, doing site visits and preparing reports.\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Receptionist Job at Divine Infinity College",
    "link": "https://www.jobgurus.com.ng/jobs/view/receptionist-job-at-divine-infinity-college-1",
    "pubDate": "Tue, 03 Jun 2025 14:47:18 GMT",
    "source": "JobGurus",
    "keyword": "divine infinity college",
    "duplicate": false,
    "classifications": [],
    "content": "At Divine Infinity College, we deliver a broad and balanced curriculum to explore knowledge, nourish creativity, and encourage independence. Our focus is to bring out the best in every child. We run both Nigerian and British Curriculum, and our learners are coached for WAEC, JAMB, and IGCSE.\n\nWe are recruiting to fill the position below:\n\nJob Position: Receptionist\n\nJob Location: Okota / Isolo, Lagos\nEmployment Type: Full-time\n\nAbout the Role\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are looking for a welcoming and organised Receptionist to be the first point of contact for our office.\n\tThis role involves greeting visitors, managing calls, and creating a professional and friendly atmosphere.\n\n\nKey Responsibilities\nReception Duties:\n\n\n\tGreet and assist visitors in a courteous and professional manner\n\tManage incoming calls and direct them appropriately\n\tHandle mail and deliveries\n\tKeep the reception area tidy and well-presented\n\tAssist with booking meeting rooms and basic admin tasks\n\tProvide information to visitors and staff when needed.\n\n\nWhat We’re Looking For\n\n\n\tCandidates should possess an HND qualification\n\tPrevious experience in a similar role is a plus.\n\tAbility to multitask and manage a busy front desk\n\tFriendly and approachable personality\n\tExcellent verbal and written communication skills\n\tProficiency in basic computer skills (MS Office).\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: amosandreww@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]