[
  {
    "title": "Project Manager Job at Excel and Grace Consulting",
    "link": "https://www.jobgurus.com.ng/jobs/view/project-manager-job-at-excel-and-grace-consulting-1",
    "pubDate": "Mon, 09 Jun 2025 10:17:38 GMT",
    "source": "JobGurus",
    "keyword": "excel and grace consulting",
    "duplicate": [
      {
        "site": "Example Site",
        "id": "f1167244121b741022b43c1a62c1b5b7",
        "timestamp": 1748869291184
      },
      {
        "site": "JobGurus",
        "id": "f1167244121b741022b43c1a62c1b5b7",
        "timestamp": 1748900381675
      },
      {
        "site": "JobGurus",
        "id": "887d4531103baa2671ea09fc3ee66bd3",
        "timestamp": 1748953945393
      },
      {
        "site": "JobGurus",
        "id": "720d2fb84c3b8151e420063a6e24fa6c",
        "timestamp": 1749464257931
      }
    ],
    "classifications": [],
    "content": "Excel and Grace Consulting is a fast-paced business consulting organization with a track record of delivering exceptional business solutions to small and medium-scale enterprises in Nigeria, Ghana, Germany, Switzerland, Canada, etc. We are certified management consultants with the International Council of Management Consulting Institutes (CMC-Global) with over 18 years of experience. Our team of experts and consultants have authored over 20 books on business management, business structure, business operations, human resources, organizational structure, employee development, money management, and so on.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Project Manager\nJob Location: Lekki, Lagos\nEmployment Type: Full-time-Onsite\n\nJob Summary\n\n\n\tWe are seeking a highly organized and results-driven Project Manager to oversee the planning, execution, and completion of construction projects.\n\tThe ideal candidate will be responsible for ensuring that projects are delivered on time, within scope, and within budget. This role involves budget management, cost control, risk mitigation, and effective coordination of multidisciplinary teams.\n\tThe Project Manager will also serve as the primary liaison between clients, contractors, and stakeholders to ensure project success and client satisfaction.\n\n\nKey Responsibilities\n\n\n\tDevelop and manage detailed project plans, including scope, timelines, budgets, and resource allocation.\n\tConduct risk assessments and implement mitigation strategies to minimize project disruptions.\n\tPrepare and oversee project budgets, ensuring cost-effective use of resources and tracking expenditures.\n\tMaintain up-to-date project documentation, including contracts, change orders, and inspection reports.\n\tServe as the primary liaison between the company, clients, and stakeholders, ensuring clear communication.\n\tNegotiate and manage contracts with subcontractors, suppliers, and vendors to ensure timely delivery and quality.\n\tLead cross-functional project teams, assigning tasks and monitoring progress to meet project goals.\n\tEnsure compliance with safety regulations, building codes, and quality standards through regular site inspections.\n\tProvide regular updates and reports on project progress, budget status, and potential risks.\n\tOversee final project delivery, ensuring all work meets specifications and managing project close-out processes.\n\n\nRequirements\n\n\n\tBachelor’s degree in Building, Civil Engineering, Construction Management, Architecture, or a related field.\n\tMinimum of 5 years of proven experience managing construction projects from inception to completion.\n\tStrong knowledge of construction processes, budgeting, scheduling and demonstrated ability to manage project budgets and control costs effectively.\n\tExcellent communication, negotiation, interpersonal skills and excellent leadership and team management skills with experience coordinating diverse project teams.\n\tProficient in project management tools, software, PMP, PRINCE2, or equivalent project management certification is an added advantage.\n\tSolid understanding of safety regulations, building codes, quality standards, strong risk management skills with a track record of identifying and mitigating project risks.\n\tPMP, PRINCE2, or equivalent project management certification is an added advantage.\n\n\nSalary\nN300,000 - N400,000 per month.\n\nMethod of Application\nInterested and qualified candidates should send their CVs to: dangeloconstruction.ng@gmail.com using \"Project Manager - Lekki \" as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Vacancies at Unilever Nigeria Plc",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancies-at-unilever-nigeria-plc-1",
    "pubDate": "Mon, 09 Jun 2025 10:17:38 GMT",
    "source": "JobGurus",
    "keyword": "unilever nigeria plc",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "Unilever Nigeria Plc - Welcome to Unilever, a global multinational and fast-moving consumer goods (FMCG) company with products sold in over 190 countries and more than 2 billion consumers across the world who use our amazing products everyday!\n\nWe are recruiting to fill the following positions below:\n\n1.) Territory Manager, Oshogbo-Ekiti\n\nJob ID:  R-89467\nJob Location: Oshogbo - Osun / Ekiti\nJob type: Full-time\n\nJob Purpose\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tUnilever is the place where you can bring your purpose to life with the work that you do – creating a better business and a better world. If you CAN: Drive secondary sales by making Unilever’s products available and visible to the consumer for the assigned territory.\n\tManage distributors and distributor’s sales force and ensure optimal implementation of company’s trade activities and merchandising plans across all relevant channels to execute joint business plans aligned with business goals, this is the role just for you!\n\n\nResponsibilities\n\n\n\tDrive 100% achievement of all KPIs within the assigned territories using the Joint Business Plan toolkit within the assigned territories and all relevant channels. Ensure that effective coverage is as close to 100% as possible. Constantly be on the lookout for new store openings. Improve controlled coverage through Sub-Distribution and Mainstream routes to market. Ensure use of HHTs to meet all store specific tasks Ensure right merchandizing tasks are executed by merchandisers supported by Sales Representatives. Maximise the number of perfect stores under your territory coverage. Ensuring orders are fulfilled in full on time and improve suggested sell in quantity and right assortment for expansion in store. Providing the right frequency of service and category level or common DSR to book orders Ensure Optimization of Distributors’ TTS (Trade Term Spend) through effective management of working capital by constantly monitoring stocks, debtors and cash positions to meet the right norms. Set up the distributor team by recruiting the right skills, right numbers and training through field coaching to deliver assigned targets. Cascade and drive targets for distributors’ team and review performance constantly through market floor meetings to ensure target achievement.\n\n\nRequirements\nBuilding Distribution Network by Leveraging Brands:\n\n\n\tDriving core of the core/distribution drives/new launches/promotion packs/improve shelf availability for key promoted SKUs / the right assortments into relevant stores\n\tBuild excellent relationships at KD and at POP level Ensure weekly submission of KD extracts used in raising orders for the KDs\n\tPrepare beat plans for KD sales team to ensure effective & efficient coverage of assigned territory with all product categories\n\tProspects, negotiates and initiates local actions in line with company policies\n\n\nLaunch/Re-launch:\n\n\n\tDrive numeric and weighted distribution (More stores, on shelf availability and Share of Shelf)\n\tDriving success of channel programs with relevant stores and ensuring desired objectives are achieved.\n\tPropose relevant territory-specific channel activities to area, regional and channel managers.\n\n\nInstore Execution:\n\n\n\tExecution of perfect stores programmes to win at point of sales\n\n\nExperiences & Qualifications\n\n\n\t3-5 years of field sales experience (FMCG experience is desirable)\n\tMust be a university graduate\n\tStrong knowledge of Route-to-Market value chain\n\n\nSkills:\n\n\n\tCommunication skills\n\tStrong Negotiation Skills\n\tRelationship and stakeholder management skills\n\tProblem solving skills\n\tCoaching and People management skills\n\tStrong CD customer/operational experience\n\tActivation planning and implementation skills\n\tAbility to interpret sales trends & analysis (data analytics)\n\n\nLeadership:\n\n\n\tYou are energized by delivering fantastic results. You are an example to others – both your results and your resilience. You are constantly on the lookout for better ways to do things, engaging and collaborating with others along the way.\n\tAs an individual you are the one responsible for your own wellbeing and delivering high standards of work. You must also focus on the Consumer and what they need. You are humble and have your head up, looking around to interpret evidence and data smartly, spot issues and opportunities to make things better.\n\n\nClick here to apply online\n\n \n\n \n\n2.) Executive Assistant to General Manager, EWA\n\nJob ID:  R-89389\nJob Location: Lagos\nJob type: Full-time\n\nJob Purpose\n\n\n\tUnilever is the place where you can bring your purpose to life with the work that you do – creating a better business and a better world. If you are passionate about project management, execution of ideas, and delivering high impact results from the background then this role is just for you!\n\n\nResponsibilities\nDocumentation Management:\n\n\n\tDevelop and maintain an effective and efficient documentation and filing of relevant process, correspondences and files, which are channeled to the offices of the General Managers.\n\n\nDiary Management:\n\n\n\tEfficiently organize bookings/ diaries, plan itineraries for the General Managers.\n\tIn addition, same will be done for guests to be received by the office of the GM.\n\n\nTravel Arrangements:\n\n\n\tWork closely with relevant stakeholders to close out travel bookings, hotel, on-ground transportation, visas, among others for the office of the GMs and other associates where required.\n\n\nOperations Management:\n\n\n\tProvide wide range of administration and support to the Director and other functional leadership team members.\n\tLead the development and implementation of standards and processes to ensure smooth operations of the office.\n\n\nProject Management and Strategic Initiatives:\nOverheads:\n\n\n\tEffective management of the GM’s budget, ensuring regular updates, and putting plans in place to optimize spend and improve savings.\n\n\nProject Management:\n\n\n\tDrive and lead cross-functional teams on Company-wide initiatives and events, in line with Company’s strategic objectives.\n\n\nLeadership And Other Strategic Meetings:\n\n\n\tWould be responsible for working with the relevant stakeholders to put together pre-reads and other documentation, relevant for the GM for meetings.\n\tConsequently, follow up with the relevant parties to ensure completion/ closure of all actions.\n\n\nConfidentiality:\n\n\n\tHandle sensitive information with discretion and always maintain confidentiality.\n\n\nExperiences & Qualifications\n\n\n\tMust be a University graduate\n\t5+ years experience working in Corporate or similar organization\n\tExperience working with senior executives, and ideally navigating a complex matrix organization\n\tDelivery in a fast-paced environment\n\tExcellent written skills and attention to detail and diversity\n\tCreative thinking and proven ability to spot opportunities across the company and translate into internal initiatives\n\tDiscretion when dealing with confidential matters\n\n\nSkills:\n\n\n\tGood communication skills – verbal and written\n\tProject management skills – planning and organization\n\tStrong bias for action\n\tProficiency in Microsoft Office Suite – Word, PowerPoint, Excel\n\tStakeholder management and good interpersonal skills\n\tInfluencing and decision-making abilities\n\tStrong organisational and prioritisation skills\n\tExcellent engagement, presentation and communication skills\n\tAbility to present complex information in a simplified manner\n\tHigh editorial skills with super attention to detail\n\n\nClick here to apply online\n\n \n\n \n\n3.)   People Partner Officer\n\nJob Location: Lagos\nJob type: Full-time\n\nJob Description\n\n\n\tA People Partner is a crucial role within HR in markets where line managers and employees are supported in critical employee moments.\n\tThey work with various teams within the HR network, leading and maintaining Employee Excellence and delivering relevant care for Tier 2 of our service delivery model.\n\tIn this capacity, a successful People Partner will lead two broad areas. The first is end-to-end leadership on all matters related to employee relations and conflict resolution, with the goal of maintaining a positive work environment and minimizing reputational and compliance risks.\n\tThe second area involves driving ‘Tier 2 Care’ within our Service Delivery model, where you will advise on and resolve complex local policy, regulatory or legal escalations and handle complex cases requiring market intervention or decisions.\n\n\nResponsibilities\nEmployee Relations:\n\n\n\tServe as the first point of contact for employees and line managers on employee relations matters.\n\tLead all employee relations activities with line managers, ensuring compliance and correct interpretation of all relevant employment legislation, HR policies and HR practices.\n\tProvide leadership and expert guidance on performance improvement, disciplinary actions, grievance handling, collective and individual consultation and redundancy processes.\n\tOffer hands-on support, including writing scripts, collating investigation reports, and drafting outcome letters to support cases through to completion.\n\tAssist with the resolution of conflicts or disputes, instilling confidence in managers and employees by being unbiased and neutral in facilitating resolutions. You will also play a key role in upholding Unilever’s standards of behaviour and the company’s code of business principles.\n\n\nProactive Employee Relations and Manager Support:\n\n\n\tIdentify ER trends and coach line managers, recommending solutions to address root causes of issues. This will include building leader and organisation capability where required, to reduce employee relations incidents/issues.\n\tTake proactive steps to tackle problems early.\n\tCoach and support line managers on an individual basis, advising on individual employee relation cases (e.g., performance, grievance, disciplinary, conflict).\n\tStay up to date with changes in employment legislation and HR practices.\n\n\nEnabling Tier 2 Care in our Service Delivery Model:\nComplex HR Case Management:\n\n\n\tEnsure consistent application of HR policies and practices on all matters and decisions across the business. This is enabled by an end-to-end understanding of HR processes.\n\tWork side-by-side with relevant experts and decision makers in HR (HRBPs, Payroll, Reward, Talent etc), providing support and subject matter expertise to recommend appropriate decisions/actions to address complex HR queries or problems.\n\tProvide hire-to-retire support where there is a legal, fiscal, or regulatory requirement.\n\tBe accountable for resolving complex policy cases, including areas such as absence management, family leave and flexible working cases.\n\tLead restructuring efforts at the employee level, including conducting severance conversations (as per consultation and process requirements).\n\n\nLiaison & Country Contact:\n\n\n\t\n\tRelevant input and support on knowledge management requirements to enable our Service Delivery Model.\n\t\n\n\nRequirements\n\n\n\tMinimum of a Bachelor’s Degree or equivalent. \n\tMinimum 4 years of experience in HR (e.g. HR Advisor, HR Generalist, HRBP)\n\tExcellent negotiation Skills with Employee/Industrial Relations is preferred.  \n\tHas a genuine passion for People Needs/Partnership, Problem Solving, that drives people & business performance  \n\tStrong organization skills, as well as attention to detail and diligence\n\tAbility to work independently and in a matrix teamwork environment.\n\n\nSkills:\n\n\n\tStakeholder Management\n\tCollaboration\n\tProblem Solving\n\n\nUnilever Behaviours:\n\n\n\tCare deeply\n\tFocus on what counts\n\tStay three steps ahead\n\tDeliver with excellence.\n\n\nClick here to apply online    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Openings at DP Education Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-dp-education-limited",
    "pubDate": "Mon, 09 Jun 2025 10:17:38 GMT",
    "source": "JobGurus",
    "keyword": "dp education limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "DP Education Limited is the world's largest international student placement provider. We help international students study in Canada, Australia, New Zealand, Ireland, UK, and USA. Our success comes from connecting students with the right course in the right university or institution and in the right country.\n\nWe are recruiting to fill the following positions below:\n\n1.)  Call Centre Agent \n\nJob Location: Lagos\nJob Type: Full-time\n\nRole Purpose\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe position forms an important part of the Digital Experience Support Team strategy which provides IDP with a complete customer engagement experience through its omnichannel contact centre (outbound calls, online chat, social, inbound and others).\n\tThe key focus of the role is to engage with potential and existing customers through telephone calls, online chat, and social channels in order to identify genuine sales leads for delivery to, and conversion by, our local Student Placement Counsellors.\n\tIn addition to this there is a strong focus on providing a high-quality customer experience while proactively offering and selling additional Value-Added Services.\n\tThis position must provide excellent sales and customer service to prospective customers via all channels operated within the contact centre, whilst building and maintaining the leads management database.\n\n\nKey Responsibilities\nCustomer Service:\n\n\n\tConfidently, politely, and professionally make warm and “cold calls” to customers\n\tUse open and outcome drive questioning to accurately define customer needs.\n\tRespond to all customer enquiries in a highly professional, efficient, and friendly manner\n\tBe prompt at identifying customers’ problem for which a solution can be offered by IDP’s services and products\n\tGo above and beyond to resolve customers’ enquiries where required to create positive IDP customer experiences\n\n\nStakeholder Relations:\n\n\n\tProvide prompt support to internal stakeholders (value added services fulfilment team, counsellors, and office managers) in managing telephone, online chat and social media enquiries and filtering/nurturing pipeline of potential customers.\n\tKeep relevant stakeholders informed of work agenda, progress, and issues.\n\tFollow through with potential customers and internal stakeholders on enquiries where required Communicate with internal and external stakeholders in an efficient and professional manner\n\tBuild relationships with internal and external stakeholders as the basis for trust and cooperation.\n\n\nPeople:\n\n\n\tDemonstrate commitment to IDP’s values and quality and compliance standards in everyday workplace operations.\n\tEncourage a team environment which facilitates cooperation and knowledge sharing and enables high performance.\n\tUse awareness of individual strengths and needs to drive personal growth and development.\n\tGive honest and constructive feedback in dealings with colleagues and external stakeholders.\n\n\nPreferred Work Experience\n\n\n\tMust be fluent in English.\n\tStrong communication skills / local language (verbal and written) is essential.Minimum 2 years of sales or customer service experience\n\tExperience in managing enquiries from online chat and social media platform.\n\tAbility to make warm and “cold calls” confidently and professionally to customer.\n\tAbility to build rapport quickly with customers over the phone.\n\tExcellent listening skills to actively listen to customers and interpret their needs.\n\tEffectively deal with objections\n\tDemonstrated ability to work effectively in a team environment.\n\tDemonstrated organizational and time management skills, with the ability to prioritize.\n\tAn ability to service and work with people from different cultural backgrounds.\n\tResults driven with a ‘can do’ attitude.\n\tIntermediate level of computer literacy - MS Office - Word, Excel, and email.\n\n\nClick here to apply online\n\n \n\n \n\n2.) Motion Graphic and Video Editor Specialist \n\nJob Location: Lagos\nJob Type: Full-time\n\nRole purpose\n\n\n\tYou will be responsible for producing dynamic motion graphics and high-quality video content that aligns with our brand's visual identity across all digital platforms.\n\tThis role requires a blend of creativity, storytelling, and technical expertise in video editing and animation.\n\n\nKey Accountabilities\n\n\n\tDesign and create engaging motion graphics for video content, including intros, lower-thirds, transitions, and animated infographics.\n\tEdit high-quality videos using tools like Adobe Premiere Pro, After Effects, and DaVinci Resolve.\n\tAdapt content for different platforms: YouTube, Instagram, TikTok, LinkedIn, and internal comms.\n\tCollaborate with creative, marketing, and cross-functional teams to understand brand tone, messaging, and campaign objectives.\n\tIntegrate AI-assisted tools such as Runway ML, Pictory, Lumen5, etc., to streamline workflows and speed up delivery.\n\tApply color grading, sound design, audio balancing, and motion transitions for polished final outputs.\n\tStay updated with visual trends, editing techniques, and social media content styles.\n\n\nRequired Experience\n\n\n\tBachelor’s degree in media production, Graphic Design, Animation, Film, or related field.\n\t5+ years of professional experience in video editing, motion graphics and graphics design.\n\tStrong portfolio demonstrates storytelling skills, creativity, and technical ability.\n\tFamiliarity with AI-powered editing platforms and willingness to learn emerging tools.\n\tSolid understanding of color theory, composition, typography, and storyboarding.\n\tAbility to design from scratch and work with pre-made templates or toolkits.\n\tExperience working with corporate brands, marketing agencies, or global content teams is a plus.\n\tProven experience in motion graphics, video editing, and post-production.\n\tProficiency in industry-standard software: Adobe After Effects, Premiere Pro, Illustrator, Photoshop.\n\tStrong organizational and time-management skills with attention to detail.\n\tComfortable working in a fast-paced, deadline-driven, and collaborative environment. Solid understanding of performance marketing, conversion, and online customer acquisition.\n\n\nClick here to apply online\n\n \n\n \n\n3.) Destination Manager (US & Canada)\n\nJob Location: Lagos\nJob Type: Full-time\n\nJob Summary\n\n\n\tThe Student Recruitment Manager is a key driver towards building long term, sustainable client partnerships through ongoing client engagement and delivering exceptional customer experience to IDP Partner institutions across the USA and Canada Destinations\n\tThis role is pivotal in achieving IDP’s targeted growth in student placement volumes, reinforcing IDP’s position as a global leader in international education by providing unparalleled service and support to our partners, network offices, and students.\n\n\nKey Responsibilities\nClient Relations / Operations:\n\n\n\tEffectively engage and manage individual client expectations by establishing strong and trusted relationships with key client contacts.\n\tCommunicate regularly with key client contacts and proactively share key data relating to local market intelligence, country performance and trends.\n\n\nCounsellor Training and Certification:\n\n\n\tCreate and deliver / communicate regular updates to country/regional counseling teams on clients. Ensure that in areas that impact operations (visa policies etc) the counselors always have access to current and accurate information.\n\tCreate and deliver comprehensive destination country training to counselors to ensure that they are certified and appropriately skilled to counsel and convert students.\n\tPay particular attention to developing counselor skills in managing leads to convert them to committed stage, destination application management and visa application processes for the relevant destination country.\n\tCreate and deliver relevant training solutions to ensure counselors are well versed in these business-critical processes.\n\n\nApplication Management:\n\n\n\tAct as Application Quality Assurance Lead for the destination country to ensure that all prepared applications meet the institution’s requirements.\n\tCreate and establish a process to review applications and make any adjustments that are needed prior to submission to the institution.\n\tSupport offices wherever required in the process, including follow up with institutions.\n\n\nEvents:\n\n\n\tWork in parallel to destination teams to drive and enable high levels of client participation at events to support successful event outcomes for students, clients and IDP. The events could be of varied formats (road shows, virtual, in office seminars etc)\n\tWork with local teams to plan, organize and execute events, with particular focus on being the conduit between IDP and key client contacts.\n\tEnsure event proposals reach clients within appropriate timeframes\n\tPreparing & distribution of “Post Event Reports” to be shared with onshore destination teams & clients.\n\n\nSharing Best Practice:\n\n\n\tConduct ongoing calls / review session within country office teams to highlight achievements, opportunities, learning and updates.\n\tUndertake follow up activities are required if further information / sharing is required on a particular topic.\n\tIdentify and leverage opportunities to increase cooperation, efficiency, and operational effectiveness between IDP’s student placement and IELTS operations.\n\n\nAnalytics and Reporting:\n\n\n\tUse the C4C and OBI CRM system to track and report on destination country pipeline, hot and warm leads, applied student finalized applications.\n\tReports showing client performance and trends to be shared with Offices and used to enhance performance and make any required adjustment to counseling operations.\n\n\nMarketing and Business Development:\n\n\n\tWork with onshore destination team towards building client support for the country/region and also engage with IDP onshore teams to plan and execute student placement events\n\tWork with Regional Digital Team to plan and implement marketing activities to generate and convert leads for assigned destination and key client contacts.\n\tIncludes working with destination teams to generate application benefits, improvements in turnaround\n\n\nRequirements\n\n\n\t5-7 years of experience within the USA & Canada International education sector.\n\tBachelor’s degree or equivalent qualification.\n\tDemonstrated high-level expertise in marketing and client management, with a proven track record of success demonstrating strong business acumen and an entrepreneurial approach.\n\tHighly effective relationship building and management abilities.\n\tProven experience in developing and delivering training materials.\n\tExcellent communication skills across all mediums, including oral (presentations), written, and non-verbal.\n\tPractical experience in managing diverse stakeholders with varying interests, ensuring their satisfaction while maintaining organizational goals.\n\tSound judgment and decision-making abilities, acting in the best interests of IDP.\n\tDemonstrated experience in business development.\n\tStrong analytical and reporting skills, with the ability to interpret and present data effectively.\n\tHighly effective planning and organizational skills, with the ability to manage multiple competing priorities.\n\tStrategic thinking and the ability to comprehend the broader organizational perspective.\n\tA proactive approach to learning and acquiring new skills and knowledge.\n\tProficiency in IT skills, including Microsoft Office Suite and CRM systems.\n\n\nDesirable Requirements:\n\n\n\tExisting network of relevant key contacts.\n\tExperience working with a CRM system.\n\n\nClick here to apply online    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Operations Coordinator Job at FoliXx Hospitality",
    "link": "https://www.jobgurus.com.ng/jobs/view/operations-coordinator-job-at-folixx-hospitality",
    "pubDate": "Mon, 09 Jun 2025 10:17:38 GMT",
    "source": "JobGurus",
    "keyword": "folixx hospitality",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "FoliXx Hospitality, a company incorporated under the laws of the Federal Republic of Nigeria with RC Number, RC1518225 and its registered address at 142, Lekki Epe Expressway Elegushi, Ikate Lekki, Lagos State. Established in 2018, FoLiXx Hospitality provides a sophisticated and contemporary entertainment experience. From renowned themed nightlife events and live performances to exceptional restaurants and special occasions.\n\nWe are recruiting to fill the position below:\n\nJob Position: Operations Coordinator\nJob Location: Ikate - Lekki, Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAre you smart, driven, and passionate about hospitality? Do you thrive in fast-paced environments where every decision impacts customer satisfaction and sales performance?\n\tWe’re on the lookout for an Operations Coordinator to join our dynamic team at one of the city’s fastest-growing Quick Service Restaurants and lifestyle Hotspots. This role is perfect for someone who can juggle people management, customer satisfaction, and backend coordination — all while driving sales and solving real-time challenges.\n\n\nResponsibilities\n\n\n\tDaily Operations Management: Coordinate and oversee smooth day-to-day operations of both the restaurant and hotspot, ensuring excellence in food service, cleanliness, and ambiance.\n\tSales Monitoring & Target Execution: Actively track daily sales performance, upsell strategies, and team targets — ensuring revenue goals are consistently met or exceeded.\n\tTeam Supervision: Lead and manage floor staff, cashiers, kitchen assistants, and cleaners — scheduling shifts, resolving conflicts, and boosting team morale to keep service efficient and energetic.\n\tCustomer Service Excellence: Monitor service delivery during peak hours, address customer issues swiftly, and ensure every guest leaves satisfied and eager to return.\n\tProblem Solving on the Go: Be the first responder to issues as they arise — from supply delays to staff gaps or customer concerns — and implement quick, smart solutions.\n\tStock & Supply Coordination: Work closely with the inventory and kitchen team to ensure timely replenishment of supplies and minimal waste.\n\tProcess Improvement: Identify operational gaps and suggest improvements to enhance speed, service quality, and profit margins.\n\n\nWho We’re Looking For\n\n\n\tSmart, proactive, and commercially minded.\n\tExperienced (minimum 2 years) in QSR, lounge, hospitality, or F&B environments.\n\tSales-driven with a strong understanding of customer behavior and upselling tactics.\n\tA natural people manager with leadership instincts and emotional intelligence.\n\tGreat at thinking on your feet and resolving challenges without drama.\n\tStrong communication and multitasking skills.\n\tComfortable working weekends, evenings, and under pressure.\n\n\nSalary\nN200,000 - N250,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hr@folixxhospitality.com usingthe Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Operations Manager Job at HTT Football Academy",
    "link": "https://www.jobgurus.com.ng/jobs/view/operations-manager-job-at-htt-football-academy",
    "pubDate": "Mon, 09 Jun 2025 10:17:38 GMT",
    "source": "JobGurus",
    "keyword": "htt football academy",
    "duplicate": false,
    "classifications": [],
    "content": "HTT Football Academy, Welcome to Help the Talent Academy! We are dedicated to discovering and nurturing children with passion, drive, and a love for football. Our mission is to break barriers, unlock potential, and create opportunities for young athletes to succeed both on and off the field. Join us in making a lasting impact on their lives.\n\nWe are recruiting to fill the position below:\n\nJob Position: Operations Manager\nJob Location: Ikorodu, Lagos\nEmployment Type: Full-time\n\nKey Responsibilities\n\n\n\tMatchday Operations:\n\n\nEnsure the stadium is ready, manage player logistics, and coordinate all matchday activities.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tFinancial Oversight:\n\n\nOversee team budgets, manage payroll, negotiate contracts, and ensure financial compliance.\n\n\n\tPlayer Support:\n\n\nCoordinate support for players and off-field staff, ensuring they have everything they need to perform at their best.\n\n\n\tLogistical Management:\n\n\nManage travel arrangements, equipment, and facilities, ensuring everything runs smoothly.\n\n\n\tCommunication:\n\n\nFacilitate communication between players, coaches, management, and other stakeholders.\n\n\n\tContract Management:\n\n\nManage player and coach contracts, including negotiations and execution.\n\n\n\tStaffing:\n\n\nAssist in appointing and managing team support staff like team managers, trainers, and runners.\n\n\n\tPre-Season Planning:\n\n\nCoordinate the formulation of the Football Operational Plan, including pre-season preparations.\n\n\n\tEquipment Management:\n\n\nOversee the maintenance and management of all training and match equipment.\n\nResponsibilities\n\n\n\tEnsure all operations are carried on in an appropriate, cost-effective way\n\tImprove operational management systems, processes and best practices\n\tPurchase materials, plan inventory and oversee warehouse efficiency\n\tManage budgets and forecasts\n\tHelp the organisation’s processes remain legally compliant\n\tFormulate strategic and operational objectives\n\tExamine financial data and use it to improve profitability\n\tPerform quality controls and monitor production KPIs\n\tFind ways to increase the quality of customer service\n\n\nRequirements and skills\n\n\n\tDegree in Business, Operations Management or related field\n\tWe are looking for a professional Operations Manager to coordinate and oversee our organisation’s operations.\n\tProven work experience as Operations Manager or similar role\n\tKnowledge of organisational effectiveness and operations management\n\tExperience budgeting and forecasting\n\tFamiliarity with business and financial principles\n\tExcellent communication skills\n\tLeadership ability\n\tOutstanding organisational skills.\n\n\nMethod of Application\nInterested and qualified candidates should send their Applications and CV to: hrhttacademy@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]