[
  {
    "title": "Operations Officer Job at Domeo Resources International",
    "link": "https://www.jobgurus.com.ng/jobs/view/operations-officer-job-at-domeo-resources-international",
    "pubDate": "Wed, 09 Jul 2025 10:46:02 GMT",
    "source": "JobGurus",
    "keyword": "domeo resources international",
    "duplicate": false,
    "classifications": [],
    "content": "Domeo Resources International (DRI) is a prolific organisation which proffers HR and Management Consultancy solutions premised on excellence and innovation. DRI analyses various organisational problems, develops improvement plans, deploys those plans and monitors the plans to ensure improved organisational performance.\n\nWe are recruiting to fill the position below:\n\nJob Posiiton: Operations Officer\n\nJob Location: Abuja (FCT)\nReports to: General Manager\nDirect Reports: Department Heads (e.g., Front Office Manager, Housekeeping Manager, Food and Beverage Manager, Maintenance Manager, Security Manager)\n\nMain Function\n     \n\n            \n    \n\n\n\n\n\tThe Operations Manager at the Hotel is responsible for ensuring smooth day-to-day operations of all departments, maintaining high standards of service delivery, and driving efficiency across the hotel.\n\tThis role involves supervising staff, managing budgets, improving operational processes, and ensuring guest satisfaction.\n\tThe Operations Manager plays a key role in supporting the General Manager in achieving the hotel’s overall goals and objectives.\n\n\nRole Responsibilities\nOperational Leadership:\n\n\n\tOversee the daily operations of all departments to ensure efficiency and service excellence.\n\tImplement, and monitor the hotel’s standard operating procedures (SOPs) for all operational departments.\n\tCollaborate with department heads to ensure departmental goals align with overall hotel objectives.\n\tMonitor and evaluate staff performance, providing guidance and support to improve productivity.\n\tEnsure compliance with health, safety, and hygiene standards across all areas of the hotel.\n\n\nGuest Experience Management:\n\n\n\tEnsure the delivery of exceptional guest experiences by maintaining high standards of customer service.\n\tHandle escalated guest complaints and resolve issues promptly to ensure guest satisfaction.\n\tReview guest feedback from surveys, online reviews, and other sources to identify areas for improvement.\n\tImplement initiatives to enhance guest loyalty and retention.\n\n\nFinancial and Budget Management:\n\n\n\tAssist the General Manager in preparing and managing operational budgets.\n\tMonitor departmental expenses to ensure cost efficiency and adherence to budgets.\n\tAnalyze financial performance and identify areas to improve profitability.\n\tNegotiate contracts with vendors and suppliers to secure cost-effective agreements.\n\n\nStaff Management and Training:\n\n\n\tSupervise, mentor, and motivate department heads and staff to achieve their performance targets.\n\tCoordinate recruitment, onboarding, and training programs for operational staff.\n\tEnsure all employees comply with company policies, standards, and regulatory requirements.\n\tPromote a culture of teamwork, innovation, and continuous improvement among staff.\n\n\nProcess Improvement and Efficiency:\n\n\n\tIdentify inefficiencies in hotel operations and implement strategies for improvement.\n\tConduct regular inspections of all areas of the hotel to ensure compliance with quality and safety standards.\n\tLeverage technology and automation to enhance operational efficiency and service delivery.\n\n\nReporting and Communication:\n\n\n\tPrepare and present operational reports, including revenue, occupancy, and service metrics, to the General Manager.\n\tAct as a liaison between staff and senior management to ensure smooth communication.\n\tMaintain strong relationships with external partners, vendors, and stakeholders.\n\n\nQualifications\nEducation and Certifications:\n\n\n\tBachelor’s Degree in Hospitality Management, Business Administration or a related field\n\tProfessional certifications in hotel management or operations are an advantage\n\n\nExperience\n\n\n\tMinimum of 7 years of experience in hotel operations, with at least 3 years in a management role\n\tProven track record of managing diverse teams and delivering operational excellence in a luxury or boutique hotel\n\n\nCompetences/Skills\nSkills:\n\n\n\tLeadership and People Management: Ability to lead, motivate and develop a team to achieve high performance\n\tOperational Expertise: Strong understanding of hotel operations, including front office, housekeeping, food and beverage, and maintenance\n\tCustomer Service: Exceptional problem-solving and conflict resolution skills to handle guest concerns\n\tFinancial Acumen: Proficiency in budgeting, financial analysis and cost control\n\tAnalytical and Strategic Thinking: Ability to analyze data, identify trends and make data-driven decisions\n\tCommunication Skills: Strong verbal and written communication skills, with the ability to interact effectively with guests, staff and stakeholders\n\tTechnical Proficiency: Familiarity with property management systems (PMS), point-of-sale (POS) systems and other hotel management software.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and Cover Letter to: recruitment@domeoresources.org using \"Operations Officer\" as the subject of email.\n\nNote: Only shortlisted candidates will be contacted.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]