[
  {
    "title": "Technical Operator Support Job at MacTay Consulting",
    "link": "https://www.jobgurus.com.ng/jobs/view/technical-operator-support-job-at-mactay-consulting",
    "pubDate": "Sat, 14 Jun 2025 17:12:18 GMT",
    "source": "JobGurus",
    "keyword": "mactay consulting",
    "duplicate": false,
    "classifications": [],
    "content": "MacTay Consulting is one of the first and leading management consulting firms in Nigeria, providing HR services to our clients in Africa since 1982. We focus on adding value to organisations through customized solutions that meet our clients’ needs. We have a proven track record of providing excellent services that impact our clients’ businesses.\n\nWe are recruiting to fill the position below:\n\nJob Position: Technical Operator Support\n\nJob Location: Mushin, Lagos\nEmployment Type: Full-time\n\nSummary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tTechnical Operator Support will be responsible for operation of the equipment and optimal production process for filling and packaging of cosmetic products according to safety, quality and production order.\n\n\nResponsibilities\n\n\n\tInitiate standard operating procedures to run equipment and ensure compliance.\n\tRelate firsthand information to superior in a precise and timely manner.\n\tHe ensures he works with production plan as communicated by the production team lead.\n\tIn his area of responsibility, he ensures the compliance of the defined quality of the products in line with standards.\n\tSupport on implementation of quality systems in close contact with the quality team.\n\tTrouble shoot and fix equipment related fault, call for technical intervention when deemed necessary.\n\tPerform regular cleaning of the equipment when out of base condition.\n\tResponsible for safety compliance in his area\n\n\nRequirements\n\n\n\tND / HND in Mechanical / Mechatronics / Electrical / Automation Engineering is required\n\t1 – 3 years of Experience in Cosmetic industries.\n\tKnowledge in MS Office\n\tAttention to detail with good troubleshooting skills.\n\n\nRemuneration\n\n\n\tSalary: N165,000 monthly net\n\tBenefits: HMO, 13th month, Pension and Lunch.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: samson.omoyeni@mactay.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Team Lead, Credit Advisory & Consulting Job at Tybtitx Services International Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/team-lead-credit-advisory-consulting-job-at-tybtitx-services-international-limited",
    "pubDate": "Sat, 14 Jun 2025 17:12:18 GMT",
    "source": "JobGurus",
    "keyword": "tybtitx services international limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Tybtitx Services International Limited - Our client, a leading credit bureau company, is setting up a new Credit Consulting & Advisory division to provide expert services in credit, data, and information management.\n\nThey are recruiting to fill the position below:\n\nJob Position: Team Lead, Credit Advisory & Consulting\nJob Location: Lagos\nEmployment Type: Full-time\n\nDescription\n\n\n\tThey are looking to hire a strategic and experienced professional to lead the department, drive growth, and develop innovative solutions for individuals, businesses, and government clients.\n\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tLead the Credit Consulting & Advisory department and drive execution of its business objectives.\n\tDevelop and manage services including credit counselling, collections, fraud management, and consumer support.\n\tIdentify client needs and develop tailored credit management solutions.\n\tBuild and grow internal capacity across people, processes, and systems.\n\tGenerate new business and position the department as a revenue-generating unit.\n\tSupervise and develop a high-performance team aligned with the company’s values.\n\tEnsure professional, timely delivery of services and achievement of revenue targets.\n\n\nJob Requirements\n\n\n\tBachelor’s Degree in a relevant discipline.\n\tMinimum of 7 years of work experience, with at least 4 years in a similar role.\n\tStrong background in banking or consulting with specialization in credit risk management.\n\tExperience leading new business initiatives or departments.\n\tExcellent communication, leadership, and problem-solving skills.\n\tHigh proficiency in Microsoft Office, especially Excel.\n\tMBA or M.Sc. is an added advantage.\n\n\nSalary\nN12,000,000 / Annum.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]