[
  {
    "title": "Job Vacancies at Cen Global Services Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancies-at-cen-global-services-limited-1",
    "pubDate": "Tue, 29 Jul 2025 15:19:47 GMT",
    "source": "JobGurus",
    "keyword": "cen global services limited",
    "duplicate": false,
    "classifications": [],
    "content": "Cen Global Services Limited (“Cen Global”) is proudly a Nigerian registered company with broad specialization in Shipping & Marine, Recruitment & Manpower Supply, Procurement & Engineering Services, and Consultancy Services. Cen Global was incorporated in March, 2010.\n\nOur business sustainable approach is to understand the needs of our clients and subsequently create a uniquely structured service process tailored towards meeting or exceeding expectations.\nOur Corporate Head office is located in Port Harcourt, Rivers State, Nigeria but we have developed a robust network around the country to effectively deliver products and services across Nigeria at a very short notice\n\nWe are recruiting to fill the following positions below:\n     \n\n            \n    \n\n\n\n1.) Accountant\n\nJob Location: Port Harcourt, Rivers\nEmployment Type: Full-time\n\nJob Description\n\n\n\tThey are seeking a detail-oriented and experienced Accountant to join their team.\n\tThe ideal candidate will have a strong background in accounting and financial management.\n\n\nKey Responsibilities\n\n\n\tManage all accounting operations\n\tPrepare financial statements, budgets, and ensure compliance with relevant regulations and accounting standards\n\tEnsure timely and accurate tax computations and remittances (VAT, PAYE, WHT, etc.)\n\tCoordinate audits and liaise with internal and external auditors\n\tEnsure compliance with all financial policies, procedures, and reporting requirements\n\tMaintain and update financial records and documentation\n\n\nRequirements\n\n\n\tCandidates should possess a Bachelor's Degree.\n\tMinimum of 3 years of work experience in accounting\n\tMust be a Chartered Accountant (ACA)\n\tStrong knowledge of Nigerian tax laws and financial regulations\n\tExcellent organizational and communication skills\n\n\nApplication Closing Date: 25th August, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: careers@cenglobalservices.com using the Job Position as the subject of the email.\n\n \n\n \n\n2.) Health Safety Environment Officer\n\nJob Location: Port Harcourt, Rivers\nEmployment Type: Full-time\n\nSummary\n\n\n\tWe are seeking a suitable candidate for the role of a HSE Officer to join our team.\n\tThe ideal candidate will be responsible for implementing HSE policies and procedures, training employees on safety practices, and ensuring full compliance with regulatory requirements.\n\n\nKey Responsibilities\n\n\n\tDevelop and implement health, safety, and environmental policies and procedures.\n\tEnsure the use of proper personal protective equipment (PPE) and enforce safety rules.\n\tTrain employees and contractors on HSE awareness, emergency response, and safe work practices.\n\tPromote a safety culture throughout the organization through engagement and communication.\n\tMaintain HSE records.\n\n\nRequirements\n\n\n\tB. Sc. or HND in Environmental Science, Engineering, or a related field.\n\t0 - 2 years of experience in a similar role.\n\tGood knowledge of relevant HSE laws and regulations.\n\n\nApplication Closing Date: 11th August, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their resumes to: careers@cenglobalservices.com using the Job Position as the subject of the email.\n\n \n\n \n\n3.) Air Conditioning Technician\n\nJob Location: Port Harcourt, Rivers\nEmployment Type: Full-time\n\nJob Description\n\n\n\tWe are seeking a skilled and versatile HVAC Technician to join our team.\n\tThe ideal candidate will possess a high level of expertise in both residential and industrial HVAC systems, be able to troubleshoot complex issues, and ensure efficient system performance.\n\tA strong work ethic, customer-oriented attitude, and the ability to work independently or as part of a team are essential.\n\n\nResponsibilities\n\n\n\tInstall, inspect, and maintain HVAC systems.\n\tDiagnose and repair HVAC systems, ensuring minimal downtime and optimal performance.\n\tFabricate, install, and repair ductwork and piping\n\tPerform routine inspections and maintenance\n\n\nRequirements\n\n\n\tMinimum of SSCE or its equivalence\n\tMinimum of 2 years’ experience as an HVAC Technician\n\tStrong knowledge of HVAC systems including duct systems, and refrigeration.\n\tAbility to read and interpret blueprints, schematics, and technical manuals.\n\tExcellent problem-solving and communication skills.\n\tPhysical ability to lift heavy equipment, work in confined spaces, and work at heights.\n\n\nApplication Closing Date: 31st July, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their resumes to: careers@cenglobalservices.com using the Job Position as the subject of the email.\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Vacancies at Cavista",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancies-at-cavista-6",
    "pubDate": "Tue, 29 Jul 2025 15:19:47 GMT",
    "source": "JobGurus",
    "keyword": "cavista",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Software Engineering"
    ],
    "content": "Cavista is a global technology company creating cloud-based software solutions for clients. With operations around the world, we globalize, standardize and localize our processes, while at the same time remaining sensitive to specific needs in different regions. Our mission is to empower organizations with the world’s best technology solutions.\n\nWe are recruiting to fill the following positions below:\n\n1.) Creative Manager\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Description\n     \n\n            \n    \n\n\n\n\n\tWe are seeking a visionary and highly skilled Creative Manager to lead our creative team and drive the development of compelling digital and visual content across all platforms.\n\tThe ideal candidate will have a strong background in web design, graphic design, video and brand strategy, as well as demonstrated experience managing creative professionals and overseeing multi-disciplinary projects from concept to execution.\n\n\nWhat you will do\n\n\n\tLead and manage the creative team, including web designers, UI/UX designers, graphic designers, and other creative professionals.\n\tOversee the creative direction and execution of all digital and visual content, ensuring alignment with brand guidelines and business goals.\n\tDesign and optimize engaging, user-friendly websites, landing pages, and digital interfaces that support marketing and product strategies.\n\tDevelop innovative and cohesive graphic design assets for use across web, social media, email marketing, print, and presentations.\n\tCollaborate with cross-functional teams to deliver high-impact creative solutions.\n\tManage project timelines, resources, and workflows to ensure timely delivery and high-quality results.\n\tContinuously improve design systems and processes to enhance creative output, team productivity and development.\n\tStay up to date with the latest design trends, tools, technologies, and industry best practices.\n\n\nQualifications\n\n\n\tBachelor’s degree is mandatory but a degree in Graphic Design, Web Design, Visual Communications, or related field will be an added advantage.\n\t15+ years of experience in a creative/design role, with at least 5 years in a managerial or leadership position.\n\tExperience in UI/UX design and user-centered design principles.\n\tExperience with web design, graphic design or branding.\n\tBackground in motion graphics or video editing is a plus.\n\tProficiency in design tools such as Adobe Creative Suite (Photoshop, Illustrator, InDesign), Figma, Sketch, or similar.\n\tWorking knowledge of HTML/CSS and experience collaborating with front-end developers.\n\tProven ability to lead and inspire a remote team, manage multiple projects, and deliver exceptional creative work on deadline.\n\tExcellent communication, presentation, and project management skills.\n\n\nAdditional preferred skills:\n\n\n\tCompetitive Compensation \n\t5 - day workweek\n\tFlextime\n\tCompetitive Health Insurance (Employee + Spouse + 4 children)\n\tWellness Programs\n\tEmployee Training Programs\n\tGrowth and Development.\n\n\nClick here to apply online\n\n \n\n \n\n2.) PHP Engineer (Senior and Intermediate)\n\nJob Location: Remote\nEmployment Type: Full-time\n\nJob Description\n\n\n\tA PHP Engineer seeking an opportunity to develop and create cutting-edge solutions for our products and services, while being part of something extraordinary.\n\n\nWhat you will do\n\n\n\tDevelop new web applications using customized, open-source, and off-the-shelf applications and components.\n\tMaintain and enhance existing web applications and all internal integrated systems.\n\tDeliver new functionality and change requests for existing applications.\n\tParticipate in the ongoing development of applications that meet the needs of our customers.\n\tDesign and implement user-driven templates, databases and interfaces (for ease of use).\n\tDevelop database-driven web interfaces for rapid, real-time information sharing.\n\tDevelop external web portals allowing users to input and retrieve accurate information.\n\n\nQualifications\nWhat you bring?:\n\n\n\tBachelor's Degree in Computer Science, MIS, or a related discipline.\n\t3+ years of PHP development experience\n\tRecent versions of PHP (7.x preferred)\n\tRelational database setup and use (MySQL 5.6 or later)\n\tHands-on front-end development utilizing HTML, CSS (or SCSS/SASS/LESS), client-side JavaScript and jQuery\n\tGit version control knowledge and experience\n\tExperience with RESTful API usage and implementation; experience creating/documenting an API is a plus\n\tExperience with Redis (or other NoSQL key-value store) is a plus\n\tServer and site performance optimization experience is a plus\n\tPreferred full-stack developer, but willing to mentor on needed areas\n\n\nAdditional preferred skills:\n\n\n\tLaravel 5.x framework (or other similar MVC)\n\tKnowledge and use of Single Page Application design and implementation, including use of front-end tools such as CanJS, Vue, Aurelia, or Angular JS\n\tExperience with queues/workers in a distributed workload system (e.g. Beanstalkd, RabbitMQ, Iron.io, Amazon SQS) is a plus\n\tExperience with Composer, NPM, Gulp, Grunt, or other tools in the build pipeline\n\tExperience with WordPress, Hooks, Theming and Plugins\n\tTroubleshoot issues with web server, database, security, network, and web technologies\n\tCustomize, compile, install, configure, monitor and debug server instances, especially on NGINX\n\tReporting, maintenance, and test automation tools in PHP (e.g. PHPUnit)\n\tCreate and enhance in-house tools for website operations, support hardware & software issues\n\tExperience with customer & end-user support of online products; web, graphic and usability design.\n\n\nWhat will you experience?\n\n\n\tCasual Friday, Everyday\n\tCompetitive Compensation Package \n\tProfessional Development for Career Growth\n\t20 PTO (Paid-Time-Off) Days + Holidays + Birthdays off\n\tMonthly Happy Hours\n\tHoliday and Employee Celebrations\n\tGame On! Xbox, Pool, Chess and more\n\tGenuine respect for work-life balance\n\tRespect and Collaborative team environment\n\tAnd so much more.\n\n\nClick here to apply online\n\n \n\n \n\n3.) Quality Assurance (QA) Engineer\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Description \n\n\n\tCollaborate with Product Owners to review and analyze business and functional requirements and design documents for sound testing strategies. \n\tResponsible for testing of a product, including writing the test plans and test cases, writing automation scripts, and testing the complete application from the UI through to the backend. \n\tPerform detailed cross-browser/cross-device testing, browser-based testing, mobile testing. \n\tMaintain requirements traceability with test case coverage. \n\tProvide expertise in understanding what to test, as well as how it should be tested. \n\tImplement test methodology best practices as defined by departmental standards. \n\tAdvocate for testing standards \n\tMust maintain strong relationships with internal customers. \n\tFacilitate testing meetings, summarize results, issue/defect reporting, maintain metrics and provide go/no go recommendation. \n\tReview software and production issues as they occur for a holistic analysis of the impacts and possible causes. \n\tCreate, execute, and document test plans and test cases (UAT, Integration, End-to-End, Regression, Beta), ensuring functional coverage and application performance. \n\n\nQualifications\n\n\n\t5+ years as a professional Quality Assurance Analyst testing (8+ years if no University degree) applications with high volume and high-reliability requirements \n\t5-year of experience in functional, integration or system testing web-based applications desired \n\tAbility to work effectively with little supervision and strong attention to detail in a team environment. \n\tAptitude for learning new technologies; supported by solid problem solving and troubleshooting skills. \n\tAbility to work well with a variety of people with varying technical skill sets. \n\tAbility to leverage experience to deliver reliable and repeatable tests. \n\tBroad understanding of quality engineering principles and test methodologies \n\tAbility to contribute to a vision of future state of testing by troubleshooting hardware and software issues. \n\tBasic SQL, Unix/Linux skills \n\tExperience in manual testing, automation testing experience is a plus. \n\tExcellent communication skills (written, verbal and listening) \n\tExperience executing test plans and scripts and verifying expected results. \n\tStrong understanding of common software development life cycles (waterfall, iterative, agile) and contemporary software quality assurance processes and automated tools.\n\n\nCavista offers even more\n\n\n\tCompetitive Compensation.\n\t5-day workweek.\n\tFlextime.\n\tCompetitive Health Insurance (Employee + Spouse + 4 children).\n\tWellness Programs\n\tEmployee Training Programs\n\tGrowth and Development\n\tRemote working and IT Assets provided for Remote employees\n\tMentoring and Counseling\n\tReferral Bonus\n\tWork from Anywhere - Flexibility that allows you to work where you are most comfortable, whether at home, at work, or a combination of both.\n\n\nClick here to apply online\n\n \n\n \n\n4.) Marketing and Communications Manager\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Description\n\n\n\tDevelop and execute a comprehensive brand strategy that enhances Cavista Technologies’ global reputation.\n\tEnsure consistent messaging and visual identity across all internal and external communication channels.\n\tLead data-driven, integrated marketing campaigns across digital, social, email, and events to showcase our services and thought leadership.\n\tOversee SEO/SEM, social media, content marketing, and performance analytics to maximize reach and ROI.\n\tCreate compelling content including press releases, speeches, newsletters,leadership announcements, and internal/executive communications.\n\tManage PR efforts, media relations, and reputation management, including crisis communications planning.\n\tDrive internal communications to align and engage employees across multiple regions.\n\tSupport employer branding to attract top-tier talent aligned with our culture and vision.\n\tCollaborate closely with executive leadership to communicate strategic initiatives,company milestones, and financial performance.\n\tDevelop high-quality presentations, reports, and marketing collateral for key external stakeholders.\n\tTrack and analyze KPIs such as brand awareness, engagement, and lead generation—then optimize accordingly.\n\n\nQualifications\n\n\n\tBachelor's or Master’s degree in Marketing, Communications, Business, or a related field.\n\t10+ years of relevant experience, preferably within global tech, consulting, or diversified holdings.\n\tExpertise in digital marketing platforms such as Google Analytics, HubSpot,Hootsuite, and Adobe Creative Suite.\n\tExceptional storytelling, writing, and editing skills\n\tDemonstrated experience with PR agencies, media engagements, and crisis communications.\n\tStrong project management skills with the ability to lead cross-functional collaboration.\n\tA strategic and creative mindset with cultural sensitivity and adaptability\n\n\nCavista Offers Even More\n\n\n\tCompetitive Compensation\n\t5-day workweek\n\tCasual Friday, Everyday\n\t20 PTO (Paid-Time-Off) Days + Holidays + Birthdays Off\n\tFlextime\n\tCompetitive Health Insurance (Employee + Spouse + 4 children)\n\tAccidental and Disability Benefit\n\tRetirement Benefit – Pensions\n\tWellness Programs\n\tGame On! PS, Pool, Chess and more\n\tGenuine respect for work-life balance\n\tEmployee Training Programs\n\tProfessional Development for Career Growth\n\tRemote working and IT Assets provided for remote employees\n\tMentoring and Counseling\n\tReferral Bonus\n\tRespect and Collaborative team environment\n\tAnd so much more.\n\n\nClick here to apply online    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Content Creator Job at FirstExcelsia Professional Services",
    "link": "https://www.jobgurus.com.ng/jobs/view/content-creator-job-at-firstexcelsia-professional-services",
    "pubDate": "Tue, 29 Jul 2025 15:19:47 GMT",
    "source": "JobGurus",
    "keyword": "firstexcelsia professional services",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance",
      "Software Engineering"
    ],
    "content": "(function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){\n        (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),\n        m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)\n    })(window,document,'script','//www.google-analytics.com/analytics.js','ga');\n\n    ga('create', 'UA-43112273-1', 'jobgurus.com.ng');\n    ga('send', 'pageview');\n\n\n\n\n    \n        \n    Home\n    Jobs\n    Free Aptitude Test Practice\n    Employer? Post a Job\n            Register\n        Sign in\n        Contact us\n    \n\n    \n\n        \n    \n        \n\n            \n\n                \n\n                    \n                        Toggle navigation\n                        \n                        \n                        \n                    \n\n                    \n                \n            \n\n            \n                \n\n\tJobs\n\tJob Seekers\n\tAptitude Test\n\tScholarships\n\n            \n\n            \n                \n\n                                            Register\n                        Sign in\n                    \n                    Employer? Post a Job\n                \n            \n\n        \n\n    \n\n        \n        \n            \n            \n                 \n    \n                    \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n        \n     \n\n\n                            \n                    \n        \n                        CLICK HERE TO JOIN OUR WHATSAPP CHANNEL \n                    \n    \n\n    \n                                \n                    \n\n                        \n                            \n                        \n\n                        \n                            \n                                Any Specialization\n                                                                    Accounting / Audit / Finance\n                                                                    Administration/ Office/ Operations\n                                                                    Advertising/ Social Media/ Marketing/ PR\n                                                                    Agriculture / Agro Allied\n                                                                    Analyst/ Quality Control\n                                                                    Automotive/ Car Services\n                                                                    Aviation / Airline\n                                                                    Banking / Insurance\n                                                                    Building Design / Architecture\n                                                                    Construction / Mining\n                                                                    Consulting / Business Strategy/ Planning\n                                                                    Craftsmen / Artisans\n                                                                    Creatives (Arts, Design, Fashion)\n                                                                    Customer Service\n                                                                    Domestic / Janitorial Services\n                                                                    Driving / Haulage\n                                                                    Education / Teaching / Training\n                                                                    Engineering / Technical\n                                                                    Executive / Management\n                                                                    Freelance / Data Entry\n                                                                    Government Agencies / Public Sector\n                                                                    Graduates / Freshers\n                                                                    Grants /  Scholarships\n                                                                    Hospitality / Food Services\n                                                                    HSE / Safety Management\n                                                                    Human Resources / Recruitment\n                                                                    Information Technology / ICT\n                                                                    Internship/ Industrial Training\n                                                                    Legal / Law\n                                                                    Logistics / Transportation/ Supply\n                                                                    Manufacturing / Production\n                                                                    Maritime Services / Shipping\n                                                                    Media / Art / Entertainment\n                                                                    Medical/ Healthcare / Pharmaceutical\n                                                                    Military / Para-Military\n                                                                    NGO / Community Services\n                                                                    Oil & Gas / Energy\n                                                                    Procurement/ Purchasing\n                                                                    Project Management\n                                                                    Real Estate / Property / Surveying\n                                                                    Research / Survey\n                                                                    Risk Management / Compliance\n                                                                    Sales / Business Development\n                                                                    Secretarial / PA\n                                                                    Security / Intelligence\n                                                                    Software/ Programming / Web development\n                                                                    Sports / Fitness\n                                                                    Supply Chain/ Store\n                                                                    Technicians\n                                                                    Telecommunications\n                                                                    Tourism / Travels\n                                                                    Vocational Trade and Services\n                                                            \n                        \n\n                        \n                            \n                                Any Work Level\n                                                                    Entry Level (Trainee)\n                                                                    Executive (Director, Head of Dept)\n                                                                    Experienced (Non-Manager)\n                                                                    Internship\n                                                                    Manager (Staff Supervisor)\n                                                                    Senior Executive (MD, CEO, COO)\n                                                                    Vocational (Skilled/Unskilled Labour)\n                                                            \n                        \n\n                        \n                            \n                                 Search\n                            \n                        \n                    \n                \n                            \n            \n\n\n\n\n\n\n            \n\n                \n                                        \n                    \n                                        \n                    \n                    \n\n                    \n                        \n                        \n\n{\n  \"@context\": \"https://schema.org\",\n  \"@type\": \"JobPosting\",\n  \"title\": \"Content Creator\",\n  \"description\": \"FirstExcelsia is a firm of highly versatile and renowned Human Resources, Organisational Development and Management consultants with operations across several states in Nigeria. We have an in-depth understanding of the Nigerian business terrain and we are very passionate about partnering with indigenous organisations to develop glocalised HR solutions, processes and structures required to develop and effectively drive our clients&amp;#39; corporate strategies. The firm commenced operations in 2016 and currently has a team of consultants that have successfully managed numerous Organisational Development, Human Resources and Management Consulting projects in varying leadership capacities across all sectors of the Nigerian Economy.\n\nWe are recruiting to fill the position below:\n\nJob Position: Content Creator\n\nJob Location:&amp;nbsp;Lagos\nEmployment Type: Full-time\nIndustry: Fashion\n\nJob Summary\n\n\n\tOur client, is seeking to hire a creative and detail-oriented Content Creator to join their team.\n\tThe ideal role holder will be responsible for producing compelling digital content, managing social media platforms, and supporting marketing initiatives\n\n\nJob Responsibilities\n\n\n\tCreate high-quality content, including photos, videos, and reels, that highlight products and display setups\n\tManage and grow the company&amp;rsquo;s social media presence, particularly on Instagram and TikTok\n\tMonitor analytics across social platforms to measure performance and optimize content strategy\n\tStay up to date with current trends and best practices in digital content and social media marketing\n\tDevelop and maintain a consistent content calendar aligned with marketing campaigns and promotions\n\tCollaborate with team members to brainstorm, plan, and produce creative marketing content\n\tAssist with visual merchandising content and behind-the-scenes storytelling when required.\n\n\nPerson Specification\n\n\n\tMinimum of 2 years of experience in content creation or social media management.\n\tStrong creative, visual, and storytelling skills.\n\tProficiency in editing tools such as Canva, CapCut, InShot, or similar platforms.\n\tExperience in retail or visual merchandising is an added advantage.\n\tAbility to work independently, meet deadlines, and adapt quickly to content trends.\n\n\nMethod of Application\nInterested and qualified candidates should mail their CV to:&amp;nbsp;talentsearch@firstexcelsia.com&amp;nbsp;using &amp;ldquo;Content Creator&amp;rdquo; as the subject.\",\n  \"datePosted\": \"2025-07-29\",\n  \"validThrough\": \"2025-08-06\",\n  \"employmentType\": \"Full-Time\",\n  \"hiringOrganization\": {\n    \"@type\": \"Organization\",\n    \"name\": \"FirstExcelsia Professional Services\"\n    \n  },\n  \"jobLocation\": {\n    \"@type\": \"Place\",\n    \"address\": {\n      \"@type\": \"PostalAddress\",\n       \"postalCode\": \". \",\n       \"addressRegion\": \". \",\n       \"streetAddress\": \". \",\n      \"addressLocality\": \"Lagos\",\n      \"addressCountry\": \"NG\"\n     \n      \n    }\n  },\n  \"identifier\": {\n    \"@type\": \"PropertyValue\",\n    \"name\": \"\",\n    \"value\": \"185038\"\n  },\n  \"baseSalary\": {\n    \"@type\": \"MonetaryAmount\",\n    \"currency\": \"NGN\",\n    \"value\": {\n      \"@type\": \"QuantitativeValue\",\n      \"minValue\": 0,\n      \"maxValue\": 0,\n      \"unitText\": \"MONTH\"\n    }\n  }\n}\n\n\n\nContent Creator Job at FirstExcelsia Professional Services\n\n\n\n\n        \n    \n\n        \n        FirstExcelsia is a firm of highly versatile and renowned Human Resources, Organisational Development and Management consultants with operations across several states in Nigeria. We have an in-depth understanding of the Nigerian business terrain and we are very passionate about partnering with indigenous organisations to develop glocalised HR solutions, processes and structures required to develop and effectively drive our clients' corporate strategies. The firm commenced operations in 2016 and currently has a team of consultants that have successfully managed numerous Organisational Development, Human Resources and Management Consulting projects in varying leadership capacities across all sectors of the Nigerian Economy.\n\nWe are recruiting to fill the position below:\n     \n\n            \n    \n\n\n\nJob Position: Content Creator\n\nJob Location: Lagos\nEmployment Type: Full-time\nIndustry: Fashion\n\nJob Summary\n\n\n\tOur client, is seeking to hire a creative and detail-oriented Content Creator to join their team.\n\tThe ideal role holder will be responsible for producing compelling digital content, managing social media platforms, and supporting marketing initiatives\n\n\nJob Responsibilities\n\n\n\tCreate high-quality content, including photos, videos, and reels, that highlight products and display setups\n\tManage and grow the company’s social media presence, particularly on Instagram and TikTok\n\tMonitor analytics across social platforms to measure performance and optimize content strategy\n\tStay up to date with current trends and best practices in digital content and social media marketing\n\tDevelop and maintain a consistent content calendar aligned with marketing campaigns and promotions\n\tCollaborate with team members to brainstorm, plan, and produce creative marketing content\n\tAssist with visual merchandising content and behind-the-scenes storytelling when required.\n\n\nPerson Specification\n\n\n\tMinimum of 2 years of experience in content creation or social media management.\n\tStrong creative, visual, and storytelling skills.\n\tProficiency in editing tools such as Canva, CapCut, InShot, or similar platforms.\n\tExperience in retail or visual merchandising is an added advantage.\n\tAbility to work independently, meet deadlines, and adapt quickly to content trends.\n\n\nMethod of Application\nInterested and qualified candidates should mail their CV to: talentsearch@firstexcelsia.com using “Content Creator” as the subject.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n\n    \n    \n\n\n\n\n        \n        \n\n\n\n\n   \n\n\n    \n        Similar Jobs\n    \n\n    \n        \n                        Job Vacancies at Cavista\n                        Digital Creative Executive Job at Tune Afrique\n                        Junior Graphics Designer Job at Alliance Française\n                        Graphics Designer Job at Walls and Gates Limited\n                        Graphics Design Officer Job at Titan Trust Bank\n                        Video Content Creator Job at Carbon Nigeria\n                        Graphic Designer Job at Cee Consult\n                        Content Creator Job at Owens and Xley Consults\n                        Graphics Designer Job at 5thWall Consulting\n                        Content Writer Job at Mactay Consulting\n                    \n    \n\n\n\n                        \n                    \n\n                    \n                        \n\n\n\n    \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n\n\n\n\n\n          \n\n\n    \n\n        Hottest Jobs\n\n        \n        \n            \n\n                4 Steps to Become a Remarkable Software Developer\n\n               \n            \n        \n            \n\n                Job Vacancies at Schneider Electric\n\n               \n            \n        \n            \n\n                Admin Assistant Job at Sahei Gender Development Initiative\n\n               \n            \n        \n            \n\n                KYC Support Officer Job at Moniepoint\n\n               \n            \n        \n            \n\n                Officer - Customer Operations West I, Customer Relations and Experience Job at MTN Nigeria\n\n               \n            \n        \n            \n\n                Job Openings at Transsion Holdings\n\n               \n            \n        \n            \n\n                Recruitment Officers Ikeja and Victoria Island\n\n               \n            \n        \n            \n\n                Front Desk Administrator Job at Desicon Engineering Limited\n\n               \n            \n        \n            \n\n                ONLINE TELEMARKETERS [REMOTE]\n\n               \n            \n        \n            \n\n                Warehouse & Logistics Manager Job at Feed Avenue Limited\n\n               \n            \n        \n        \n\n    \n\n\n\n\n        \n        \n   \n\n\n                    \n                            \n            \n        \n        \n        \n\n        \n\n    \n\n        \n\n            \n\n                \n\n                    Job Seekers\n\n                    \n\n                        Search for Jobs\n                         Featured Jobs\n                         Jobs by Specialization\n                         Jobs by Industry\n                         Jobs by Location\n                         \n                        Companies Currently Hiring\n\n                        Upload CV\n\n                        Free Aptitude Test Practice\n                        \n                        Scholarships and Financial Aid\n\n                        Testimonies\n                    \n\n                \n\n                \n\n                    Employers\n\n                    \n\n                        Post A Job\n\n                        Search Resumes/Profiles\n\n                        Create Employer Account\n\n                        Advertise\n\n                        Pricing\n\n                    \n\n                \n\n                \n\n                    Tools & Resources\n\n                    \n\n                        Contact us\n                        \n                        Our Blog\n\n                        Job XML/RSS Feeds\n \n                        Free Aptitude Test Practice\n\n                        Bank Details\n\n                        FAQ & Support\n\n                    \n\n                \n\n                \n\n                    Connect with us\n\n                    \n\n                        \n\n                            \n\n                            \n\n                        \n\n                        \n\n                            \n\n                            \n\n                        \n\n                \n\n                        \n\n                            \n\n                            \n\n                        \n\n                    \n\n\n\n                    \n\n                        Customer Care\n\n                        09134259221 \n\n                        (9am - 5pm) weekdays\n\n                         info [at] jobgurus.com.ng\n\n                    \n\n\n\n                \n\n            \n\n        \n\n    \n\n\n\n    \n\n        \n\n\n\n            \n\n                Privacy Policy\n\n                Terms & Conditions\n\n                Sitemap\n                \n                About us\n\n            \n\n\n\n            Copyright © 2025 Jobgurus.com.ng - Latest Jobs in Nigeria 2025. All right reserved.",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Recruitment Oficer Job at Pem Security Services",
    "link": "https://www.jobgurus.com.ng/jobs/view/recruitment-oficer-job-at-pem-security-services",
    "pubDate": "Tue, 29 Jul 2025 15:19:47 GMT",
    "source": "JobGurus",
    "keyword": "pem security services",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Pem Security Services, is recruiting suitably qualified candidates to fill the position below:\n\nJob Position: Recruitment Oficer\n\nJob Location: Owerri, Imo\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n            \n    \n\n\n\n\n\tUtilizing various channels, including job boards, social media, and professional networks, Recruitment Officers actively seek out potential candidates. They may also attend job fairs and networking events to connect with talent in person.\n\tAfter collecting applications, Recruitment Officers review resumes and cover letters to identify candidates who meet the job criteria. They conduct initial screenings, which may include phone interviews, to further narrow down the pool of applicants.\n\tTo verify the qualifications and experiences of candidates, Recruitment Officers conduct reference checks. This step is crucial in ensuring that the selected candidates have a solid background and are a good fit for the organization.\n\tMaintaining clear communication with candidates is essential.\n\tRecruitment Officers often dedicate time to networking, whether through social media platforms like LinkedIn or attending industry events. Building relationships with potential candidates and industry professionals is key to successful recruitment.\n\n\nSalary\nN80,000 - N90,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: pemsec2@gmail.com using the Job Position as subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Logistics & Inventory Manager Job at FirstExcelsia Professional Services",
    "link": "https://www.jobgurus.com.ng/jobs/view/logistics-inventory-manager-job-at-firstexcelsia-professional-services",
    "pubDate": "Tue, 29 Jul 2025 15:19:47 GMT",
    "source": "JobGurus",
    "keyword": "firstexcelsia professional services",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing",
      "Software Engineering"
    ],
    "content": "(function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){\n        (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),\n        m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)\n    })(window,document,'script','//www.google-analytics.com/analytics.js','ga');\n\n    ga('create', 'UA-43112273-1', 'jobgurus.com.ng');\n    ga('send', 'pageview');\n\n\n\n\n    \n        \n    Home\n    Jobs\n    Free Aptitude Test Practice\n    Employer? Post a Job\n            Register\n        Sign in\n        Contact us\n    \n\n    \n\n        \n    \n        \n\n            \n\n                \n\n                    \n                        Toggle navigation\n                        \n                        \n                        \n                    \n\n                    \n                \n            \n\n            \n                \n\n\tJobs\n\tJob Seekers\n\tAptitude Test\n\tScholarships\n\n            \n\n            \n                \n\n                                            Register\n                        Sign in\n                    \n                    Employer? Post a Job\n                \n            \n\n        \n\n    \n\n        \n        \n            \n            \n                 \n    \n                    \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n        \n     \n\n\n                            \n                    \n        \n                        CLICK HERE TO JOIN OUR WHATSAPP CHANNEL \n                    \n    \n\n    \n                                \n                    \n\n                        \n                            \n                        \n\n                        \n                            \n                                Any Specialization\n                                                                    Accounting / Audit / Finance\n                                                                    Administration/ Office/ Operations\n                                                                    Advertising/ Social Media/ Marketing/ PR\n                                                                    Agriculture / Agro Allied\n                                                                    Analyst/ Quality Control\n                                                                    Automotive/ Car Services\n                                                                    Aviation / Airline\n                                                                    Banking / Insurance\n                                                                    Building Design / Architecture\n                                                                    Construction / Mining\n                                                                    Consulting / Business Strategy/ Planning\n                                                                    Craftsmen / Artisans\n                                                                    Creatives (Arts, Design, Fashion)\n                                                                    Customer Service\n                                                                    Domestic / Janitorial Services\n                                                                    Driving / Haulage\n                                                                    Education / Teaching / Training\n                                                                    Engineering / Technical\n                                                                    Executive / Management\n                                                                    Freelance / Data Entry\n                                                                    Government Agencies / Public Sector\n                                                                    Graduates / Freshers\n                                                                    Grants /  Scholarships\n                                                                    Hospitality / Food Services\n                                                                    HSE / Safety Management\n                                                                    Human Resources / Recruitment\n                                                                    Information Technology / ICT\n                                                                    Internship/ Industrial Training\n                                                                    Legal / Law\n                                                                    Logistics / Transportation/ Supply\n                                                                    Manufacturing / Production\n                                                                    Maritime Services / Shipping\n                                                                    Media / Art / Entertainment\n                                                                    Medical/ Healthcare / Pharmaceutical\n                                                                    Military / Para-Military\n                                                                    NGO / Community Services\n                                                                    Oil & Gas / Energy\n                                                                    Procurement/ Purchasing\n                                                                    Project Management\n                                                                    Real Estate / Property / Surveying\n                                                                    Research / Survey\n                                                                    Risk Management / Compliance\n                                                                    Sales / Business Development\n                                                                    Secretarial / PA\n                                                                    Security / Intelligence\n                                                                    Software/ Programming / Web development\n                                                                    Sports / Fitness\n                                                                    Supply Chain/ Store\n                                                                    Technicians\n                                                                    Telecommunications\n                                                                    Tourism / Travels\n                                                                    Vocational Trade and Services\n                                                            \n                        \n\n                        \n                            \n                                Any Work Level\n                                                                    Entry Level (Trainee)\n                                                                    Executive (Director, Head of Dept)\n                                                                    Experienced (Non-Manager)\n                                                                    Internship\n                                                                    Manager (Staff Supervisor)\n                                                                    Senior Executive (MD, CEO, COO)\n                                                                    Vocational (Skilled/Unskilled Labour)\n                                                            \n                        \n\n                        \n                            \n                                 Search\n                            \n                        \n                    \n                \n                            \n            \n\n\n\n\n\n\n            \n\n                \n                                        \n                    \n                                        \n                    \n                    \n\n                    \n                        \n                        \n\n{\n  \"@context\": \"https://schema.org\",\n  \"@type\": \"JobPosting\",\n  \"title\": \"Logistics &amp; Inventory Manager\",\n  \"description\": \"FirstExcelsia is a firm of highly versatile and renowned Human Resources, Organisational Development and Management consultants with operations across several states in Nigeria. We have an in-depth understanding of the Nigerian business terrain and we are very passionate about partnering with indigenous organisations to develop glocalised HR solutions, processes and structures required to develop and effectively drive our clients&amp;#39; corporate strategies. The firm commenced operations in 2016 and currently has a team of consultants that have successfully managed numerous Organisational Development, Human Resources and Management Consulting projects in varying leadership capacities across all sectors of the Nigerian Economy.\n\nWe are recruiting to fill the position below:\n\nJob Position: Logistics &amp;amp; Inventory Manager\n\nJob Location:&amp;nbsp;Lagos,\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tOur client, is seeking to hire an experienced Logistics &amp;amp; Inventory Manager to oversee their stock and logistics operations.\n\tThe role holder will be responsible for maintaining accurate inventory records, managing warehouse efficiency, and ensuring timely delivery of goods to customers and internal departments.\n\n\nJob Responsibilities\n\n\n\tOversee all incoming and outgoing inventory shipments.\n\tManage and monitor stock levels, initiate restocking when necessary.\n\tOrganize and maintain the warehouse layout for optimal space utilization.\n\tCoordinate logistics for product deliveries, installations, and client pickups.\n\tMaintain inventory tracking systems and generate regular stock reports.\n\tConduct regular inventory audits and reconcile discrepancies.\n\tEnsure proper documentation of stock movement and delivery records.\n\tLiaise with suppliers, transport companies, and other departments to ensure timely deliveries.\n\tMonitor and report on inventory turnover, shelf life, and obsolete stock.\n\tImplement inventory control procedures and improve operational efficiency.\n\tTrain and supervise warehouse staff to ensure compliance with safety and quality standards.\n\n\nPerson Specification\n\n\n\tCandidates should possess a Bachelor&amp;#39;s Degree\n\tMinimum of 2&amp;ndash;3 years of experience in logistics, inventory, or store management.\n\tStrong organizational, analytical, and problem-solving skills.\n\tProficiency with inventory management software and Microsoft Excel.\n\tAbility to manage time effectively and work under pressure.\n\tStrong communication and team leadership skills.\n\n\nMethod of Application\nInterested and qualified candidates should mail their CV to:&amp;nbsp;talentsearch@firstexcelsia.com&amp;nbsp;using&amp;nbsp;&amp;ldquo;Logistics &amp;amp; Inventory Manager&amp;rdquo; as the subject.\",\n  \"datePosted\": \"2025-07-29\",\n  \"validThrough\": \"2025-08-06\",\n  \"employmentType\": \"Full-Time\",\n  \"hiringOrganization\": {\n    \"@type\": \"Organization\",\n    \"name\": \"FirstExcelsia Professional Services\"\n    \n  },\n  \"jobLocation\": {\n    \"@type\": \"Place\",\n    \"address\": {\n      \"@type\": \"PostalAddress\",\n       \"postalCode\": \". \",\n       \"addressRegion\": \". \",\n       \"streetAddress\": \". \",\n      \"addressLocality\": \"Lagos\",\n      \"addressCountry\": \"NG\"\n     \n      \n    }\n  },\n  \"identifier\": {\n    \"@type\": \"PropertyValue\",\n    \"name\": \"\",\n    \"value\": \"185036\"\n  },\n  \"baseSalary\": {\n    \"@type\": \"MonetaryAmount\",\n    \"currency\": \"NGN\",\n    \"value\": {\n      \"@type\": \"QuantitativeValue\",\n      \"minValue\": 0,\n      \"maxValue\": 0,\n      \"unitText\": \"MONTH\"\n    }\n  }\n}\n\n\n\nLogistics & Inventory Manager Job at FirstExcelsia Professional Services\n\n\n\n\n        \n    \n\n        \n        FirstExcelsia is a firm of highly versatile and renowned Human Resources, Organisational Development and Management consultants with operations across several states in Nigeria. We have an in-depth understanding of the Nigerian business terrain and we are very passionate about partnering with indigenous organisations to develop glocalised HR solutions, processes and structures required to develop and effectively drive our clients' corporate strategies. The firm commenced operations in 2016 and currently has a team of consultants that have successfully managed numerous Organisational Development, Human Resources and Management Consulting projects in varying leadership capacities across all sectors of the Nigerian Economy.\n     \n\n            \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Logistics & Inventory Manager\n\nJob Location: Lagos,\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tOur client, is seeking to hire an experienced Logistics & Inventory Manager to oversee their stock and logistics operations.\n\tThe role holder will be responsible for maintaining accurate inventory records, managing warehouse efficiency, and ensuring timely delivery of goods to customers and internal departments.\n\n\nJob Responsibilities\n\n\n\tOversee all incoming and outgoing inventory shipments.\n\tManage and monitor stock levels, initiate restocking when necessary.\n\tOrganize and maintain the warehouse layout for optimal space utilization.\n\tCoordinate logistics for product deliveries, installations, and client pickups.\n\tMaintain inventory tracking systems and generate regular stock reports.\n\tConduct regular inventory audits and reconcile discrepancies.\n\tEnsure proper documentation of stock movement and delivery records.\n\tLiaise with suppliers, transport companies, and other departments to ensure timely deliveries.\n\tMonitor and report on inventory turnover, shelf life, and obsolete stock.\n\tImplement inventory control procedures and improve operational efficiency.\n\tTrain and supervise warehouse staff to ensure compliance with safety and quality standards.\n\n\nPerson Specification\n\n\n\tCandidates should possess a Bachelor's Degree\n\tMinimum of 2–3 years of experience in logistics, inventory, or store management.\n\tStrong organizational, analytical, and problem-solving skills.\n\tProficiency with inventory management software and Microsoft Excel.\n\tAbility to manage time effectively and work under pressure.\n\tStrong communication and team leadership skills.\n\n\nMethod of Application\nInterested and qualified candidates should mail their CV to: talentsearch@firstexcelsia.com using “Logistics & Inventory Manager” as the subject.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n\n    \n    \n\n\n\n\n        \n        \n\n\n\n\n   \n\n\n    \n        Similar Jobs\n    \n\n    \n        \n                        Procurement & Logistics Assistant Job at Karsto Global Resources Limited\n                        Logistics Assistant Job at Salpha Energy Limited\n                        Material / Logistics Coordinator Job at Geoplex Drillteq Limited\n                        Job Openings at Fembol Group\n                        Admin & Logistics Manager Job at Kaplo Africa\n                        Visa Assistance & Travel Operations Job at R-Pro Group\n                        Job Vacancies at Schneider Electric\n                        Admin / Fleet Officer Job at Paras Energy\n                        Transport Manager Job at Lafarge Africa Plc\n                        Warehouse & Logistics Officer Job at Austine & Partners International Limited\n                    \n    \n\n\n\n                        \n                    \n\n                    \n                        \n\n\n\n    \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n\n\n\n\n\n          \n\n\n    \n\n        Hottest Jobs\n\n        \n        \n            \n\n                4 Steps to Become a Remarkable Software Developer\n\n               \n            \n        \n            \n\n                Job Vacancies at Schneider Electric\n\n               \n            \n        \n            \n\n                Admin Assistant Job at Sahei Gender Development Initiative\n\n               \n            \n        \n            \n\n                KYC Support Officer Job at Moniepoint\n\n               \n            \n        \n            \n\n                Officer - Customer Operations West I, Customer Relations and Experience Job at MTN Nigeria\n\n               \n            \n        \n            \n\n                Job Openings at Transsion Holdings\n\n               \n            \n        \n            \n\n                Recruitment Officers Ikeja and Victoria Island\n\n               \n            \n        \n            \n\n                Front Desk Administrator Job at Desicon Engineering Limited\n\n               \n            \n        \n            \n\n                ONLINE TELEMARKETERS [REMOTE]\n\n               \n            \n        \n            \n\n                Warehouse & Logistics Manager Job at Feed Avenue Limited\n\n               \n            \n        \n        \n\n    \n\n\n\n\n        \n        \n   \n\n\n                    \n                            \n            \n        \n        \n        \n\n        \n\n    \n\n        \n\n            \n\n                \n\n                    Job Seekers\n\n                    \n\n                        Search for Jobs\n                         Featured Jobs\n                         Jobs by Specialization\n                         Jobs by Industry\n                         Jobs by Location\n                         \n                        Companies Currently Hiring\n\n                        Upload CV\n\n                        Free Aptitude Test Practice\n                        \n                        Scholarships and Financial Aid\n\n                        Testimonies\n                    \n\n                \n\n                \n\n                    Employers\n\n                    \n\n                        Post A Job\n\n                        Search Resumes/Profiles\n\n                        Create Employer Account\n\n                        Advertise\n\n                        Pricing\n\n                    \n\n                \n\n                \n\n                    Tools & Resources\n\n                    \n\n                        Contact us\n                        \n                        Our Blog\n\n                        Job XML/RSS Feeds\n \n                        Free Aptitude Test Practice\n\n                        Bank Details\n\n                        FAQ & Support\n\n                    \n\n                \n\n                \n\n                    Connect with us\n\n                    \n\n                        \n\n                            \n\n                            \n\n                        \n\n                        \n\n                            \n\n                            \n\n                        \n\n                \n\n                        \n\n                            \n\n                            \n\n                        \n\n                    \n\n\n\n                    \n\n                        Customer Care\n\n                        09134259221 \n\n                        (9am - 5pm) weekdays\n\n                         info [at] jobgurus.com.ng\n\n                    \n\n\n\n                \n\n            \n\n        \n\n    \n\n\n\n    \n\n        \n\n\n\n            \n\n                Privacy Policy\n\n                Terms & Conditions\n\n                Sitemap\n                \n                About us\n\n            \n\n\n\n            Copyright © 2025 Jobgurus.com.ng - Latest Jobs in Nigeria 2025. All right reserved.",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]