[
  {
    "title": "Account Officer Job at Darlington Hall",
    "link": "https://www.jobgurus.com.ng/jobs/view/account-officer-job-at-darlington-hall",
    "pubDate": "Fri, 06 Jun 2025 11:13:34 GMT",
    "source": "JobGurus",
    "keyword": "darlington hall",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "The Darlington Hall was established in 2009 as one arm of The Events Warehouse Limited to provide an event centre of high standard, with excellent support services required to successfully host various Corporate, Social and other Special events. At The Darlington Hall, our clients are assured a satisfactory event in a serene and secure environment. Darlington Hall is easily accessible from all parts of the Lagos metropolis.\n\nWe are recruiting to fill the position below:\n\nJob Position: Account Officer\nJob Location: Ilupeju, Lagos (Head office)\nEmployment Type: Full-time\nReport to: Head, Accountant\nIndustry: The Events Warehouse\nDepartment: Finanace\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAs an Account Officer at the Events Ware House, you will play a key role in the finance and accounting functions of the company.\n\tYou will be maintaining financial records, processing transactions, preparing reports, and providing general administrative support.\n\tThis position requires attention to detail, strong organizational skills, and a basic understanding of accounting principles.\n\n\nResponsibilities\nSupport to Finance Team:\n\n\n\tAssist in budget preparation and monitoring.\n\tCollaborate with other departments to gather financial data and information.\n\tProvide general administrative support to the finance department.\n\n\nCommunication and Coordination:\n\n\n\tCommunicate effectively with vendors, clients, and internal stakeholders regarding financial matters.\n\tLiaise with the procurement team to ensure accurate recording of purchases and payments.\n\tSupport the finance team in resolving any discrepancies or issues.\n\n\nFinancial Transactions:\n\n\n\tProcess accounts payable and receivable transactions accurately and in a timely manner.\n\tPrepare and issue invoices, receipts, and bank deposits.\n\tReconcile financial statements and reports to ensure accuracy.\n\tMonitor and follow up on outstanding payments to ensure timely collection.\n\tMaintain petty cash records and reconcile petty cash transactions.\n\n\nRecord Keeping and Data Entry:\n\n\n\tMaintain accurate and up-to-date financial records in the accounting system.\n\tEnter financial data into the accounting software with a high level of accuracy.\n\tOrganize and maintain filing systems for invoices, receipts, and other financial documents.\n\tAssist in preparing financial reports and statements as needed.\n\n\nCompliance and Audit Support:\n\n\n\tEnsure compliance with company policies, procedures, and accounting standards.\n\tAssist in preparing documents and records for internal and external audits.\n\tHelp implement and maintain internal controls to safeguard company assets.\n\n\nKPI\n\n\n\tAccuracy of Financial records: percentage of reconciliation completed with no discrepancies, and number of errors in financial reports, aiming for zero errors.\n\tCompliance and Audit Preparedness: completion of all audit preparation tasks by set deadline and number of audit findings related to financial record-keeping, aiming for zero findings.\n\tEfficiency in data entry: Average time taken to enter financial data into accounting system, and number of data entry errors, aiming for minimal errors per month.\n\tCommunication Effectiveness: Feedback from finance team members on clarity and completeness of communication, and number of vendor/client disputes resolved, aiming for high resolution rate.\n\n\nRequirements\n\n\n\tBachelor’s degree in Accounting, Finance, or related field.\n\t2 -3 years of experience as an account officer.\n\tKnowledge of basic accounting principles and practices.\n\tProficient in MS Office, especially Excel, and accounting software\n\tStrong attention to detail and accuracy in data entry.\n\tExcellent organizational and time-management skills.\n\tGood communication and Interpersonal abilities\n\tAbility to work independently and as part of a team\n\tPrior experience in a rental or equipment leasing company is a plus.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Inventory Officer Job at Agric & Culture Company",
    "link": "https://www.jobgurus.com.ng/jobs/view/inventory-officer-job-at-agric-culture-company",
    "pubDate": "Fri, 06 Jun 2025 11:13:34 GMT",
    "source": "JobGurus",
    "keyword": "agric & culture company",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "The Agric & Culture Company is a fast growing Food Condiments Manufacturing Company specializing in high-quality mayonnaise and seasoning products.\n\nWe are recruiting to fill the position below:\n\nJob Position: Inventory Officer\nJob Locations: Jakande & Isolo - Lagos\nEmployment Type: Full-time\n\nJob Summary \n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAs we expand our footprint across new markets, we’re looking to fill the position of an inventory officer to help improve how to track and manage raw materials, packaging items and finished goods. \n\tThis person will work closely with production, warehouse and procurement to ensure that stock is well recorded, organized and accurate at all times.\n\n\nResponsibilities \n\n\n\tMonitor and manage stock levels to prevent overstocking or stock outs\n\tKeep daily records of stock in and out\n\tConduct regular stock counts and reconcile physical stock with records\n\tHelp ensure proper labelling and storage of items.\n\tGenerate daily, weekly, and monthly inventory reports\n\n\nRequirements & Qualifications\n\n\n\tMinimum of OND / HND / BSc in Accounting, Business Administration, Economics or any related field\n\t1–2 years of experience in inventory or warehouse management (preferred)\n\tProficiency in Microsoft Excel or inventory software\n\tStrong numerical and record-keeping skills\n\tAbility to work under pressure and with minimal supervision\n\tAttention to detail and good organizational skills\n\tPhysical stamina to lift or move inventory items (if required).\n\n\nBenefits\n\n\n\tCompetitive Salary: N200,000 Monthly.\n\tHMO\n\tOpportunities for growth and development\n\n\nMethod of Application\nInterested and qualified candidates should send their Resume and Cover Letter to: recruitment@agricandculture.com using the Job Position as the subject of the mail.\n\nNote: If you’re organized, reliable, and ready to help us keep our inventory under control - we want to hear from you!    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Account Officer Job at Rainoil Logistics Services Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/account-officer-job-at-rainoil-logistics-services-limited",
    "pubDate": "Fri, 06 Jun 2025 11:13:34 GMT",
    "source": "JobGurus",
    "keyword": "rainoil logistics services limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Rainoil Logistics, a subsidiary of Rainoil Group, is an integrated downstream oil and gas company. A prominent player in the Nigerian industry, the company’s operations span across the downstream value chain i.e. Petroleum Product Storage, Haulage / Distribution and Retail Sales\n\nWe are recruiting to fill the position below:\n\nJob Position: Account Officer\nJob Location: Ijegun-Egba - Satellite town, Lagos\nEmployment Type: Full-time\n\nJob Overview\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a young Chartered Accountant with appreciable experience in Account Payable, Finance Analytics and Data Analytics, to work with our team. \n\tThe ideal candidate should possess 2-3 years in-depth knowledge of accounting practices and principles\n\n\nKey Responsibilities\n\n\n\tPrepare and review Bank Reconciliation Statements to ensure accuracy and resolve discrepancies.\n\tManage journal entries and postings to maintain accurate financial records\n\tMonitor and analyse accounts receivable and payable balances to optimize cash flow and minimize risks\n\tConduct intercompany reconciliations to ensure consistency and accuracy across accounts\n\tContribute to the preparation of management reports, providing valuable insights to support businessdecisions\n\n\nEducational Qualification and Experience\n\n\n\tFirst Degree (First class or Second-Class Upper Division) in accounting from any recognized University in Nigeria or outside Nigeria.\n\tMust be an Associate Member of the Institute of Chartered Accountants of Nigeria (ICAN).\n\tMust posses the NYSC discharge certificate.\n\n\nRequired Skills:\n\n\n\tAccounting Software: Proven expertise in utilizing accounting software and packages to manage financial transactions and reports\n\tAccounting Practices and Principles: Knowledge of sound accounting practices and principles\n\tTax Laws and Regulations: Appreciable knowledge of tax laws and regulations\n\tERP Systems: In-depth knowledge and understanding of Enterprise Resource Planning (ERP) systems to streamline business operations and financial management\n\tMicrosoft Office: Proficient in Microsoft Office Suite particularly MS Word, MS Excel, Power Point Presentation\n\tFinancial Statement: Skills in data analysis, financial statement and preparation\n\tAttention to details, analytical thinking and good time management.\n\n\nWhat We Offer\n\n\n\tCompetitive salary and benefits package.\n\tOpportunities for professional growth and development.\n\tA supportive and dynamic work environment.\n\tOther benefits such as HMO and Pension benefit etc\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hrlogistics@rainoil.com using “Account Officer, Lagos State” as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Executive Assistant Job at Cynosure Professional Services",
    "link": "https://www.jobgurus.com.ng/jobs/view/executive-assistant-job-at-cynosure-professional-services",
    "pubDate": "Fri, 06 Jun 2025 11:13:34 GMT",
    "source": "JobGurus",
    "keyword": "cynosure professional services",
    "duplicate": false,
    "classifications": [],
    "content": "Cynosure Professional Services is renowned for excellent Human resources management and training programs delivered by an enviable team of qualified and highly experienced professionals who are passionate and dedicated with a commitment to delivering real business benefits. We provide holistic Human Resources Recruitment & Outsourcing Services that cover end to end HR services.\n\nWe are recruiting to fill the position below:\n\nJob Position: Executive Assistant\nJob Location: Victoria Island, Lagos (Hybrid)\nEmployment Type: Full-time\n\nJob Summary \n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe're looking for a smart, proactive, and organized Executive Assistant to support senior leadership.\n\n\nRequirements\n\n\n\tInterested candidates should possess a Degree with 1 - 2 years of experience.\n\tExcellent communication and organizational skills.\n\tMust be professional, trustworthy, and responsive.\n\tTech-savvy and detail-oriented\n\tAbility to manage calendars, meetings, and follow-ups.\n\tPrior experience in admin or executive support is a plus.\n\n\nSalary\nN70,000 monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: cynosureprofessionalservices@gmail.com using \"Executive Assistant\" as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]