[
  {
    "title": "Frontend Software Engineer Job at PayInvert",
    "link": "https://www.jobgurus.com.ng/jobs/view/frontend-software-engineer-job-at-payinvert",
    "pubDate": "Tue, 08 Jul 2025 16:20:17 GMT",
    "source": "JobGurus",
    "keyword": "payinvert",
    "duplicate": false,
    "classifications": [
      "Software Engineering"
    ],
    "content": "PayInvert was founded by innovators who want a better payment system that is fast, easy, convenient and with no hidden charges. The aim has always been to eradicate long queues and time taken to make payments physically. We are providing a secure way to receive payments electronically from anyone anywhere in the world with a robust reporting system to help companies plan their growth significantly.\n\nWe are recruiting to fill the position below:\n\nJob Position: Frontend Software Engineer\nJob Location: Abuja (FCT)\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a talented and innovative Frontend Engineer to join our agile fintech team. In this role, you’ll be responsible for crafting responsive, intuitive, and visually engaging interfaces for our payment gateway platform.\n\tLeveraging your expertise in React and TypeScript, you’ll help us build exceptional user experiences that facilitate secure, efficient, and seamless payments for our growing customer base.\n\n\nKey Responsibilities\n\n\n\tDevelop, optimize, and maintain user-facing features using React.js and TypeScript, ensuring responsiveness and performance across multiple devices.\n\tWork closely with product managers, UI/UX designers, and backend engineers to transform design concepts into elegant and functional web applications.\n\tCreate reusable components and frontend libraries to streamline future development and enhance platform consistency.\n\tEnsure frontend implementations adhere to best practices, accessibility standards, and cross-browser compatibility.\n\tCollaborate with backend teams (.NET engineers) to integrate robust APIs, ensuring a cohesive end-to-end user experience.\n\tConduct thorough testing and debugging, optimizing frontend applications for maximum speed, scalability, and user satisfaction.\n\tContribute actively to code reviews, advocating clean code practices and maintaining high-quality documentation.\n\n\nRequired Qualifications\n\n\n\t3-5 years of frontend development experience, specifically using React.js and TypeScript.\n\tStrong proficiency in JavaScript/TypeScript, ES6+, and modern frontend build tools (Webpack, Babel, npm/yarn).\n\tDemonstrable experience with state management tools such as Redux, React Context API, or similar.\n\tSolid understanding of RESTful APIs and integration techniques with backend services.\n\tProven ability to deliver pixel-perfect implementations from UI/UX designs, ensuring high fidelity to design systems.\n\tFamiliarity with responsive and adaptive web design principles, CSS preprocessors (SASS, LESS), and modern CSS frameworks.\n\n\nPreferred Qualifications:\n\n\n\tExperience in fintech, payment processing applications, or e-commerce platforms.\n\tFamiliarity with automated testing frameworks (Jest, React Testing Library, Cypress).\n\tExposure to CI/CD tools, version control systems (Git), and modern software development practices.\n\tKnowledge of frontend security best practices (XSS prevention, CSP, authentication management).\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Procurement Specialist Job at Lily Hospitals",
    "link": "https://www.jobgurus.com.ng/jobs/view/procurement-specialist-job-at-lily-hospitals",
    "pubDate": "Tue, 08 Jul 2025 16:20:17 GMT",
    "source": "JobGurus",
    "keyword": "lily hospitals",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Lily Hospitals is one of Nigeria’s growing networks of private healthcare institutions with an outstanding reputation for delivering excellent clinical services. Since our inception under the current management (1998), we have remained at the forefront of providing and delivering quality patient-centered, responsive, and technology-driven care across various locations in Nigeria to both citizens and foreign nationals.\n\nWe are recruiting to fill the position below:\n\nJob Position: Procurement Specialist\nJob Location: Warri, Delta\nEmployment Type: Full-time\n\nJob Overview\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a highly skilled and proactive Procurement Specialist to join our dynamic team at Lily Hospitals. In a fast-paced, quality-driven healthcare environment like ours, procurement is more than just buying—it’s about ensuring the right materials, at the right cost, at the right time, without compromise on quality.\n\tThis role requires more than transactional purchasing. We’re looking for someone with a deep understanding of procurement strategy, inventory control, compliance, and supplier relationship management—someone who understands healthcare-grade procurement and can deliver value across the supply chain.\n\n\nKey Responsibilities\nStrategic Procurement:\n\n\n\tDevelop and execute procurement strategies that support clinical and operational excellence.\n\tEnsure cost-effective purchasing without compromising on quality, timelines, or regulatory requirements.\n\tAnalyze usage patterns to forecast demand and plan procurement cycles effectively.\n\n\nVendor & Supplier Management:\n\n\n\tIdentify, evaluate, and manage relationships with vendors, suppliers, and service providers.\n\tConduct supplier audits and negotiations to ensure best-in-class value, pricing, and reliability.\n\tMaintain a responsive and ethical supplier engagement process.\n\n\nInventory & Warehouse Coordination:\n\n\n\tCollaborate with inventory and warehouse teams to ensure stock accuracy, reorder levels, and supply continuity.\n\tImplement systems that reduce waste, manage expiries, and streamline material movement.\n\n\nCompliance & Documentation;\n\n\n\tEnsure procurement processes align with internal policies, industry standards, and external regulations such as ISO, SON, or COHSASA guidelines.\n\tMaintain accurate procurement records, contracts, and documentation for audits and internal controls.\n\n\nCross-Functional Collaboration:\n\n\n\tPartner with clinical, finance, biomedical, and operations teams to ensure procurement supports patient care and cost efficiency.\n\tProvide regular reports and insights to leadership for informed decision-making.\n\n\nIdeal Profile\nEducation & Certifications:\n\n\n\tDegree in Procurement, Supply Chain Management, Business Administration, or related field.\n\tProfessional certifications (e.g., CIPS, CIPSMN, or equivalent) are highly desirable.\n\tKnowledge of ISO or healthcare procurement standards is a plus.\n\n\nExperience & Skills:\n\n\n\tMinimum of 5 years of experience in procurement\n\tProven experience in strategic sourcing, tendering, and cost optimization.\n\tExcellent negotiation, vendor management, and documentation skills.\n\tStrong analytical skills and proficiency with procurement and ERP tools.\n\tFamiliarity with lean systems (e.g., Kaizen, 5S) is an added advantage.\n\n\nWhat We Offer\n\n\n\tCompetitive Remuneration Package\n\tCareer Advancement & Leadership Pathways\n\tTraining & Professional Certification Support\n\tCollaborative and Structured Work Environment\n\tAccommodation Support (for Relocating Staff)\n\tHealth Insurance & Pension Benefits.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: recruitment@lilyhospitals.net using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Social Media Associate Job at PayInvert",
    "link": "https://www.jobgurus.com.ng/jobs/view/social-media-associate-job-at-payinvert",
    "pubDate": "Tue, 08 Jul 2025 16:20:17 GMT",
    "source": "JobGurus",
    "keyword": "payinvert",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "PayInvert was founded by innovators who want a better payment system that is fast, easy, convenient and with no hidden charges. The aim has always been to eradicate long queues and time taken to make payments physically. We are providing a secure way to receive payments electronically from anyone anywhere in the world with a robust reporting system to help companies plan their growth significantly.\n\nWe are recruiting to fill the position below:\n\nJob Position: Social Media Associate\nJob Location: Abuja (FCT)\nJob Type: Full-time (Entry Level)\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe’re looking for a creative and enthusiastic Social Media Associate to help us build and grow our digital presence. If you're passionate about content, trends, and storytelling and you're ready to roll up your sleeves and grow with a forward-thinking brand, this role is for you.\n\tYou’ll support the execution of our social media strategy across multiple platforms, engage with our audience, and help position us as a brand worth following.\n\n\nKey Responsibilities\n\n\n\tAssist in creating and scheduling engaging content across Instagram, LinkedIn, Facebook, Twitter, and TikTok.\n\tMonitor trends and suggest creative ways to increase brand awareness and engagement.\n\tCollaborate with the graphics team to develop social media assets.\n\tEngage with our online community — reply to comments, messages, and mentions.\n\tTrack basic performance metrics (likes, reach, comments) and provide simple weekly reports.\n\tResearch competitors, industry trends, and audience preferences.\n\tSupport content planning, idea generation, and campaign execution.\n\n\nIdeal Candidate\n\n\n\tYou’re active on social media and understand what good content looks like.\n\tYou have some experience running a page (personal brand, business, or volunteer gig).\n\tYou have a basic understanding of Canva or other content creation tools.\n\tYou write clearly and know how to grab attention in a few words.\n\tYou’re eager to learn, take feedback, and grow your skills fast.\n\tA degree is not required — we care more about what you can do.\n\n\nWhy Join Us?\n\n\n\tOpportunity to build your portfolio and grow your influence in the digital marketing space.\n\tSupportive team and room to experiment and lead.\n\tClear growth pathway for performance-driven individuals.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Restaurant Manager Job at Alan & Grant",
    "link": "https://www.jobgurus.com.ng/jobs/view/restaurant-manager-job-at-alan-grant",
    "pubDate": "Tue, 08 Jul 2025 16:20:17 GMT",
    "source": "JobGurus",
    "keyword": "alan & grant",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Software Engineering",
      "Finance"
    ],
    "content": "Alan & Grant - Our client, a growing restaurant renowned for its exceptional service, is recruiting to fill the position below:\n\nJob Position: Restaurant Manager\n\nJob Location: Victoria Island, Lagos\nEmployment Type: Full Time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Restaurant Manager has the primary responsibility of managing and overseeing all Food and Beverage operations of the entire Restaurant, the Bar, the Kitchen and the entire business.\n\tHe also has the primary responsibility to manage all the human and material resources.\n\tHe has the overall responsibility to ensure the business is profitable based on management goals, and that all operations run smoothly in adherence to established Standard Operating Procedures.\n\tHe reports directly to the Managing Consultant and Management.\n\n\nKey Responsibilities\n\n\n\tCoordinating daily restaurant management operations.\n\tMaintaining hygiene, safety and food quality standards as per the Established Standard Operating Procedures.\n\tOversee all departments by working closely with all staff to provide direct supervision in carrying out their duties.\n\tHold regular briefings and meetings with all staff to execute management programs.\n\tEnsure full compliance with the Restaurant’s operating controls, S.O.P.s, policies, procedures, and service standards.\n\tAssigning tasks and coordinating work shifts.\n\tPersonally handle complaints, and overseeing the service recovery procedures.\n\tMaximizing the Restaurants’ revenue drive through innovative traditional and digital marketing strategies and sales practices.\n\tPersonally create and drive strategies and contents for all marketing campaigns.\n\tResponsible for the preparation, presentation, and subsequent achievement of the Restaurant’s annual Operating Budget, Marketing and Sales Plan.\n\tDelivering superior food and beverage service and maximizing customer satisfaction.\n\tOrganization and facilitation of training for members of staff being managed.\n\tEnsure full compliance with the Restaurant’s operating controls, SOPs, policies, procedures, and service standards.\n\tPersonally handle guests' complaints, and oversee the service recovery procedures.\n\tManage the profitability drive of the Restaurant, ensuring revenue and guest satisfaction targets are met and exceeded.\n\tEnsure all decisions are made in the best interest of the Restaurant and management.\n\tDeveloping improvement actions, and carrying out cost savings strategies.\n\tDemonstrate a strong understanding of P OR L statements, and the ability to react with impactful strategies.\n\tHelping in the procurement of restaurant supplies and equipment, and contracting with third-party vendors for essential equipment and services.\n\tProvide effective leadership to the Restaurant team members.\n\tLead in all aspects of business planning.\n\tRespond to audits to ensure transparency and continual improvement are achieved.\n\tLead all restaurant business initiative promotions and marketing campaigns.\n\tPersonally oversee all stock levels and ordering supplies.\n\n\nRequirements\n\n\n\tB.Sc or HND qualification in Hospitality Management, Business Administration or related field.\n\tMinimum of 3 years of proven experience in restaurant or hospitality management.\n\tStrong knowledge of restaurant operations, including food and beverage service, bar and kitchen coordination and customer experience.\n\tProven ability to supervise and manage staff, assign tasks, and lead daily operations.\n\tExcellent understanding of Standard Operating Procedures (SOPs), hygiene and food safety standards.\n\tStrong knowledge of budgeting, profit and loss analysis, cost saving strategies.\n\tExperience in marketing, promotion and sales strategies.\n\tStrong problem solving skills and ability to handle customer complaints personally and service recovery.\n\tSkilled in procurement, inventory control, and dealing with 3rdparty vendors.\n\tExpereinec in training mentoring and appraising staff.\n\tAbility to lead audit and implement continuous improvement strategies.\n\tHigh level of integrity, professionalism and ability to work under pressure.\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Graphics Designer Job at PayInvert",
    "link": "https://www.jobgurus.com.ng/jobs/view/graphics-designer-job-at-payinvert",
    "pubDate": "Tue, 08 Jul 2025 16:20:17 GMT",
    "source": "JobGurus",
    "keyword": "payinvert",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "PayInvert was founded by innovators who want a better payment system that is fast, easy, convenient and with no hidden charges. The aim has always been to eradicate long queues and time taken to make payments physically. We are providing a secure way to receive payments electronically from anyone anywhere in the world with a robust reporting system to help companies plan their growth significantly.\n\nWe are recruiting to fill the position below:\n\nJob Position: Graphics Designer\nJob Location: Abuja (FCT)\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe’re looking for a creative and motivated Graphics Designer to support our branding, campaigns, and online content.\n\tIf you have design skills, an eye for aesthetics, and you're looking to grow with an organization that values creativity, this is your chance to shine.\n\tYou’ll work closely with the content and marketing teams to bring ideas to life visually.\n\n\nKey Responsibilities\n\n\n\tDesign social media graphics, flyers, banners, and marketing materials.\n\tHelp develop visual assets for product launches, events, or campaigns.\n\tCollaborate with the team to understand design needs and deliver quickly.\n\tEnsure visual consistency across platforms and touchpoints.\n\tTake feedback constructively and revise designs as needed.\n\tStay updated with design trends, tools, and creative best practices.\n\n\nIdeal Candidate\n\n\n\tYou have a basic-to-intermediate command of Canva, Photoshop, Illustrator, or similar tools.\n\tYou can follow a brand style guide and still bring your creative flair.\n\tYou’ve designed visuals before — even if for school, side projects, or friends.\n\tYou’re open to feedback and ready to keep learning.\n\tYou’re organized and can deliver quality work under tight timelines.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]