[
  {
    "title": "Logistics Assistant Job at Malaria Consortium",
    "link": "https://www.jobgurus.com.ng/jobs/view/logistics-assistant-job-at-malaria-consortium-2",
    "pubDate": "Tue, 17 Jun 2025 10:44:58 GMT",
    "source": "JobGurus",
    "keyword": "malaria consortium",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Malaria Consortium is one of the world's leading non-profit organizations dedicated to the comprehensive control of malaria and other communicable diseases in Africa and Southeast Asia. Malaria Consortium works with communities, government and non-government agencies, academic institutions, and local and international organisations, to ensure good evidence supports delivery of effective services, providing technical support for monitoring and evaluation of programmes and activities for evidence-based decision-making and strategic planning. The Head Office is in London, at Development House, 56-64, Leonard Street, London EC2A 4LT, UK, with the Africa Regional Office in Kampala, the Asia Regional Office in Bangkok and the Nigeria Regional Office in Abuja.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nMalaria Consortium, through funding from Philanthropic Fund, GF and KOICA supported NMEP and SMEP in Bauchi, Jigawa, Sokoto, Kano, Kogi, Plateau, Nasarawa, Oyo, Niger, Kaduna, Kano, FCT, and Kebbi States to implement Seasonal Malaria Chemoprevention (SMC). SMC involves the administration of monthly treatment courses of a combination of antimalarial drugs with the objective of maintaining therapeutic antimalarial drug concentrations in the blood throughout the period of transmission (rainy season) to prevent malaria.\n\nWe are recruiting to fill the position below:\n\nJob Position: Logistics Assistant\nJob Location: Kebbi\nEmployment Type: Temporary\n\nJob purpose\n\n\n\tTo assist the Supply Chain Officer and the state LMCU in the management of malaria commodities at the project offices and SMC Medicines and tools at the Central Medical Stores in Kebbi State.\n\n\nScope of Work:\n\n\n\tThe Logistics Assistant will be actively responsible for supporting an effective and efficient logistic management and inventory control system for SMC drugs and commodities at the state level.\n\tS/he will work under the supervision of the Supply Chain Officer with the Admin Officer as dotted line Manager.\n\n\nKey Working Relationships:\n\n\n\tThe Logistics Assistant will be a member of the programme implementation team and report to the Supply Chain Officer in delivering the supply chain distribution work plan and deliverables for the SMC programme.\n\n\nKey Accountabilities\n\n\n\tProvide support to the Supply Chain Officer and State Central Medical Stores (SCMS) and LMCU on program implementation.\n\tCarry out pick and pack of implementation medicines (SPAQ), implementation tools, training materials, visibility materials and PPEs for each cycle of the SMC round.\n\tCarry out the sorting, counting and documentation of SPAQ reversed to the CMS at the end of each SMC cycle.\n\tSupport physical verification of commodities with vendors during receipt into the stores and before dispatch during LMD.\n\tEnsure delivery notes/waybills are signed and issued to vendors at the CMS during LMD\n\tAssist in monitoring delivery of SMC commodities and escalate any discrepancies in the quantity of commodities delivered and any quality issues.\n\tSupport the monthly stock status assessment of all SMC commodities at the state central medical store.\n\tSeparates damaged blisters from useable ones and ensure they are clearly labelled.\n\tSupport the conduct of post last mile distribution POD reconciliation.\n\tAssist in the coordination of reverse logistics for SMC drugs from health facilities to the state central medical store.\n\tAny other duty as may be assigned by the supervisor.\n\n\nExpected Deliverables:\n\n\n\tCompletes the pick and pack of SMC commodities latest 4 days to the commencement of LMD • Collate and file CMS/duplicate copies of PoDs and all SMC transaction documents\n\tReconciled post distribution stock report for non-medicine SMC commodities.\n\tPresents and updated report of reverse logistics to the supply chain officer 2 days after each cycle’s reverse logistics at the state central medical store.\n\tPresents a filled timesheet that is approved by the line manager (supply chain officer) confirming the number of days worked.\n\n\nRequirements\n\n\n\tA minimum of Senior Secondary Certificate Examination.\n\tAt least one year of working experience in Commodity Logistics and supply management.\n\tMust be computer literate\n\tAbility to work under pressure both in a team and independently with minimal supervision.\n\tAbility to work beyond normal working hours to meet urgent project deliverables.\n\tA collaborative and flexible style, with a strong service mentality.\n\tExperience in pick and pack of public health commodity is an added advantage.\n\n\nNote\n\n\n\tFor this position, previous working experience with MC and in SMC are added advantages.\n\tKindly note that applicants who do not follow this specification will be disqualified.\n\tOnly Shortlisted candidates will be contacted.\n\tKindly note that applications will be reviewed on a rolling basis, and as a result, the process may conclude before the advertised deadline. Therefore, early applications are highly encouraged.\n\tMalaria Consortium does not accept or ask for payment during recruitment. We also would not accept hardcopy CVs; all applications should be sent through the above link.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Control Officer, Monitoring and Standards Job at First Bank of Nigeria Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/control-officer-monitoring-and-standards-job-at-first-bank-of-nigeria-limited",
    "pubDate": "Tue, 17 Jun 2025 10:44:58 GMT",
    "source": "JobGurus",
    "keyword": "first bank of nigeria limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "First Bank of Nigeria Limited (FirstBank) is Nigeria's largest financial services institution by total assets and gross earnings. With more than 10 million customer accounts, FirstBank has over 750 branches providing a comprehensive range of retail and corporate financial services. The Bank has international presence through its subsidiaries, FBN Bank (UK) Limited in London and Paris, FBNBank DRC, FBNBank Ghana, FBNBank Gambia, FBNBank Guinea, FBNBank Sierra-Leone and FBNBank Senegal, as well as its Representative Offices in Johannesburg, Beijing and Abu Dhabi.\n\nWe are recruiting to fill the position below:\n\nJob Position: Control Officer, Monitoring and Standards\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Identification: 1443\nJob Location: Nigeria\n\nDuties and Responsibilities\n\n\n\tResearch and Standardization of Controls Bank-wide. \n\tRisk and Control Document review with Operational Risk Management\n\tAssist in the implementation of the Internal Control Framework and Fraud Risk Management Framework in the bank\n\tDevelopment, Review and Update of the Control Review Templates, Work Programs and Test Procedures \n\tAssist in the review the Risk Rating of branches, Head Office and Subsidiaries to determine frequency of reviews and areas of focus for Control Officers  \n\tAssist to ensure uniform standard on controls and control documentation across subsidiaries, branches and Head Office.\n\tOrganizing Control Awareness Campaigns\n\tPrepare e-flyers content for control training and awareness on topical issues and engage M&CC department for design and deployment Bankwide\n\tProvide practical initiatives on control improvements in related area.\n\tParticipate in monthly quality assurance review of control officers’ uploads from review visitations and validate quality and timeliness scores  \n\tMaintaining the Internal Control Document Repository on FBN Portal and portal access management\n\tTrack initiatives, process improvements and other engagement action points as required\n\tArrange Stakeholder Meetings for Process Changes to Ensure Proper Documentation and Approval of Changes.\n\tFraud Documentation and Analysis\n\tComply with the principles and policies in the Information Security Handbook\n\tMaintain the Security of all Information entrusted to the staff\n\tAssist in the recruitment and assessment of candidates\n\tAssist in the drafting of recruitment documents – case study, assessment questions – for assessment sessions\n\tCarry out other functions as prescribed by the TL, Monitoring and Standards and the Head, Control Techniques & Standard\n\n\nJob Requirements\nEducation:\n\n\n\tMinimum Education: BSC / HND in any relevant discipline (Accounting, Economics and any other related field)\n\t ICAN/ACCA/CISA qualification will be an added advantage\n\n\nExperience:\n\n\n\tMinimum experience – 5 years in general banking with exposures to banking operations, procurement and supplies, internal control, market risk management, financial control and internal audit.\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Telesales / Call Center Agent Job at Daytona Peoples Pharmacy And Supermarket",
    "link": "https://www.jobgurus.com.ng/jobs/view/telesales-call-center-agent-job-at-daytona-peoples-pharmacy-and-supermarket",
    "pubDate": "Tue, 17 Jun 2025 10:44:58 GMT",
    "source": "JobGurus",
    "keyword": "daytona peoples pharmacy and supermarket",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Daytona 247 People's Pharmacy and Supermarket is a leading name in the retail industry. We are the first 24/7 supermarket and pharmacy in Lekki Phase 1. We are Africa’s most customer focused neighborhood retail store and pharmacy. We exist for homes in need of quality and convenient retail service by providing 24/7 customer-centric retail experience both offline and online.\n\nDaytona 247 People's Pharmacy and Supermarket provides a serene environment that encourages growth, innovation and personal development of our employee. We are a firm believer in adequate work-life balance.\n\nWe are recruiting to fill the position below:\n\nJob Position: Telesales / Call Center Agent\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Location: Lekki Phase 1, Lagos\nEmployment Type: Full-time\n\nResponsibilities\n\n\n\tManage large amounts of inbound and outbound calls in a timely manner.\n\tAnswering customers’ phone calls professionally and responding to customer inquiries and complaints.\n\tUse our CRM system (Zoho) to update records and monitor sales pipelines.\n\tFollow communication scripts when handling different topics.\n\tRaise tickets for all issue-related calls and messages (WhatsApp, Slack and our other social media platforms)\n\tIdentify customers’ needs, clarify information, research every issue and provide solutions and/or alternatives.\n\tSeize opportunities to upsell and cross-sell products when they arise.\n\tMeet and exceed personal / team qualitative and quantitative targets.\n\tMaking sales or recommendations for products or services that may better suit client needs.\n\tClose sales expeditiously via phone calls and other platforms.\n\tDevelop long-term relationships and ensure high customer satisfaction.\n\n\nRequirements\n\n\n\tHND / B.Sc Degree in any field.\n\tAt least 2 years proven Telesales or Call Center experience (retail experience is an added advantage)\n\tMust be computer savvy and proficient in the use of CRM software like Zoho, etc.\n\tAbility to work well in a team and independently.\n\tExcellent verbal & listening communication.\n\tStrong sales skills and a clear customer focus.\n\tData-driven mindset for decision-making.\n\n\nRemuneration\n\n\n\tSalary: N100,000 - N140,000 Monthly\n\tOther Benefits: HMO + Feeding + Pension + 13th Month + Sales Commission etc.\n\n\nMethod of Application\nInterested and qualified candidates should send their Applications to: daytona247hr@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Senior Accountant Job at Ama-Zuma Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/senior-accountant-job-at-ama-zuma-group",
    "pubDate": "Tue, 17 Jun 2025 10:44:58 GMT",
    "source": "JobGurus",
    "keyword": "ama-zuma group",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Ama-Zuma Group is on the mandate to restructure the oil and gas arm of the business and to take full advantage of all available opportunities in the downstream sector. The company was founded on the basis of integrity and commitment to excellence.\n\nWe are recruiting to fill the position below:\n\nJob Position: Senior Accountant\nJob Location: Abule-Egba, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tHe is saddled with tracking cash flow and financial planning as well as analyzing the company’s financial strength and weaknesses and proposing corrective actions.\n\n\nJob Duities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tPreparation of monthly management accounts.\n\tPreparation of monthly bank reconciliation statements.\n\tPrepare final accounts and periodic management accounts.\n\tMaintain financial security by following internal control.\n\tReconciliation of bank statements with cash book.\n\tPrepares an operating expenses schedule, such as trailer expenses, loading, clearing, trip allowance, etc., for the Head of Finance to check.\n\tPosting of transactions into Sage.\n\tCustodian of cash relating to trailer expenses, loading, clearing and trip allowance.\n\tReconcile inter-company balances on a monthly basis.\n\tMaintain financial transactions by auditing documents.\n\tReconciliation of sales and purchase of AGO, PMS, and DPK.\n\tMonitoring daily movement of cash-in-hand and cash.\n\tIdentify and follow up on Receivables and Payables.\n\tPrepares payments by verifying documentation and requesting disbursements.Prepares asset liability and capital account entries by compiling and analyzing account information.\n\tEnsure that all financial transactions are handled and processed in line with the approved policies and procedures.\n\tMaintaining fixed asset register and schedule.\n\n\nQualifications\n\n\n\tHND / B.Sc Degree.\n\t12 - 15 years of relevant Experience.\n\tExcellent communication and presentation skills.\n\tProficiency in Microsoft Office skills Sage, Microsoft Office, Word, Excel, PowerPoint, Peachtree Accounting software, Outlook.\n\tAbility to work without supervision.\n\tAbility to multi-task and work under pressure.\n\tStrong organizational skills.\n\tProfessional qualification (ICAN).\n\tOil & Gas downstream Experience is an added advantage\n\tMust be a Chartered Accountant.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hradvertizer@yahoo.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Restaurant Manager Job at CVM Career Company",
    "link": "https://www.jobgurus.com.ng/jobs/view/restaurant-manager-job-at-cvm-career-company",
    "pubDate": "Tue, 17 Jun 2025 10:44:58 GMT",
    "source": "JobGurus",
    "keyword": "cvm career company",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "The CVM Career Company (A career consulting company) - We help professionals like you use their career stories to land job interviews by writing functional CV and Resumes, and we also provide them with tools to navigate the world of work through our various coaching services.\n\nWe are recruiting to fill the position below:\n\nJob Position: Restaurant Manager\nJob Location: Warri, Delta\nEmployment Type: Full-time\nIndustry: Quick Service Restaurant (QSR) / Fast Food\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAre you passionate about food, customer service, and leading high-performing teams?\n\tWe’re hiring a Restaurant Manager to oversee the daily operations of our fast-food restaurant in Warri.\n\tIf you’re goal-driven, energetic, and thrive in a fast-paced environment, we’d love to meet you!\n\n\nKey Responsibilities\n\n\n\tLead and supervise daily restaurant operations to ensure smooth service\n\tDrive customer satisfaction through excellent service delivery\n\tManage staff scheduling, training, and performance\n\tHandle customer complaints promptly and professionally\n\tMaintain high standards of food quality, hygiene, and safety\n\tMonitor inventory and manage stock levels efficiently\n\tAchieve sales targets and manage budgetary controls\n\n\nRequirements\n\n\n\tMinimum of OND / HND / BSc in Hospitality, Business, or related field\n\tAt least 2 years of experience in a supervisory/managerial role in a fast-food or hospitality setting\n\tStrong leadership and people management skills\n\tSound knowledge of food safety and quality standards\n\tExcellent communication and problem-solving skills\n\tAbility to multitask and work under pressure.\n\n\nMethod of Application\nInterested and qualified candidates should send a copy of their CV to: jobs@thecvmcareercompany.com using \"Restaurant Manager - Warri\" as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]