[
  {
    "title": "Warehouse Manager Job at Tybitx Services International Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/warehouse-manager-job-at-tybitx-services-international-limited-1",
    "pubDate": "Thu, 19 Jun 2025 10:16:52 GMT",
    "source": "JobGurus",
    "keyword": "tybitx services international limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Tybitx Services International Limited is duly registered with the Nigerian Corporate Affairs Commission, possesses Department of Petroleum Resources (DPR) permits in the provision of Recruitment services/manpower supply & management and Training/manpower development for the oil and gas industries. Our aim is to support our clients to focus on their core business by taking on the search for employees that meet their strategic goals and aspirations.\n\nWe are recruiting to fill the position below:\n\nJob Position: Warehouse Manager\n\nJob Location: Kirikiri, Lagos\nEmployment Type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Warehouse Manager is responsible for the day-to-day operations of a warehouse.\n\tHe/She oversees the receiving, storing, and shipping of goods and materials.\n\tThe Warehouse Manager ensures that all warehouse activities are carried out in a safe, efficient, and accurate manner.\n\n\nDuties & Responsibilities\n\n\n\tOversee the physical storage and retrieval, and distribution of products in the warehouse.\n\tOversee the maintenance and repair of equipment and ensure that all systems, equipment and vehicles are functioning properly.\n\tWorks with the Operations Manager to develop strategies for improving distribution and customer service.\n\tSetting up layout and ensuring efficient space utilisation.\n\tProduce reports and statistics regularly (IN/OUT status report, dead stock report etc).\n\tReceive feedback and monitor the quality of services provided.\n\tImplementing and overseeing security operations.\n\tMaintain standards of health and safety, hygiene and security.\n\tManage stock control and reconcile with data storage systems.\n\tPlan work rotas, assign tasks appropriately and appraise results.\n\tMaintaining documentation and keeping accurate records of warehouse activities.\n\tRecruit, select, orient, coach and motivate employees in conjunction with the Operations Officer and the HR Business Partner.\n\n\nRequirements\n\n\n\tMinimum of First degree in relevant discipline.\n\tMinimum experience of 2-3 years of experience in warehouse management.\n\tStrong knowledge of warehousing Key Performance Indicators (KPIs).\n\tHands-on experience with warehouse management software and databases.\n\tProficient knowledge of inventory and inventory controls.\n\tMust reside within Kirikiri and its environ.\n\n\nSalary\nN95,000 Monthly.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Customer Care Representative Job at DOAH Enterprise",
    "link": "https://www.jobgurus.com.ng/jobs/view/customer-care-representative-job-at-doah-enterprise",
    "pubDate": "Thu, 19 Jun 2025 10:16:52 GMT",
    "source": "JobGurus",
    "keyword": "doah enterprise",
    "duplicate": false,
    "classifications": [],
    "content": "DOAH Enterprise - Our client is recruiting suitably qualified candidates to fill the position below:\n\nJob Position: Customer Care Representative\nJob Location: Ilupeju, Lagos\nWork Hours: 6:00 PM – 6:00 AM\n\nRequirements\n\n\n\tCandidates should possess relevant qualifications in a related field.\n\tCustomer service experience.\n\tFluency in Spanish (spoken).\n\tStrong Communication skills.\n\n\nSalary & Benefits\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tN500,000 / Month plus bonuses (can earn up to N600,000 / Month depending on skill).\n\tAccommodation provided.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: jobs@doahenterprise.com using “Customer Care Rep” as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Vacancies at Solution Impact Global Resources",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancies-at-solution-impact-global-resources",
    "pubDate": "Thu, 19 Jun 2025 10:16:52 GMT",
    "source": "JobGurus",
    "keyword": "solution impact global resources",
    "duplicate": false,
    "classifications": [],
    "content": "Solution Impact Global Resources - Our client, a renowned multi-specialty one-stop healthcare provider is recruiting to fill the following positions below:\n\n1.) Medical Laboratory Technician\n\nJob Location: Ibadan, Oyo\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tThe successful candidate will assist in laboratory procedures, conduct diagnostic tests, and ensure the accuracy of medical results to support patient care.\n\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tCollect and prepare samples for laboratory testing.\n\tPerform routine medical tests under the supervision of a Medical Laboratory Scientist.\n\tEnsure proper handling and storage of laboratory specimens.\n\tMaintain laboratory equipment and follow safety protocols.\n\tAssist in record-keeping and documentation of test results.\n\n\nRequirements\n\n\n\tDiploma or certification in Medical Laboratory Technology.\n\tValid practicing license from the Medical Laboratory Science Council of Nigeria (MLSCN).\n\tMinimum of [Insert required years] years of experience in a clinical or hospital laboratory.\n\tStrong attention to detail and ability to follow laboratory protocols.\n\tGood communication and teamwork skills.\n\n\nApplication Closing Date: 10th July, 2025.\n\nMethod of Application\nInterested and qualified candidates should forward their CV to: solutionimpactglobalresources@gmail.com using the Job Position as the subject of the email.\n\n \n\n \n\n2.) Medical Officer \n\nJob Location: Ibadan, Oyo\nEmployment Type: Full-time\nSlot: 7 Openings\n\nResponsibilities\n\n\n\tConduct routine check-ups to patients to assess their health condition and discover possible issues.\n\tMaintain accurate and detailed patient records.\n\tProvide health and wellness advice to patients, including diet, physical activity, and hygiene.\n\tDiagnose and treat illnesses, medical conditions, and injuries.\n\tPrescribe medications and provide detailed instructions for administration.\n\tPerform minor surgical procedures.\n\tCollaborate with other healthcare professionals to ensure comprehensive patient care.\n\tStay updated with medical advancements and attend professional development sessions.\n\tEnsure compliance with healthcare regulations and safety standards.\n\n\nRequirements\n\n\n\tMBBS and MDCN Certificates.\n\tAt least 1 year of post NYSC experience in a hospital.\n\tCurrent practising license.\n\n\nBenefits\n\n\n\tCompetitive Salary (N450,000 - N600,000/ month).\n\tFree Accommodation\n\tAdditional Bonuses.\n\n\nApplication Closing Date: 2nd July, 2025.\n\nMethod of Application\nInterested and qualified candidates should forward their CV to: solutionimpactglobalresources@gmail.com using the Job Position as the subject of the email.\n\n \n\n3.) Staff Nurse / Midwife\n\nJob Location: Ibadan, Oyo\nEmployment Type: Full-time\nSlot: 7 Openings\n\nResponsibilities\n\n\n\tGeneral patient care and management.\n\tMaternal and neonatal care.\n\n\nRequirements\n\n\n\tNursing and Midwifery Qualifications.\n\tAt least 2 years of post-midwifery qualification experience in a hospital.\n\tCurrent Practicing license.\n\n\nApplication Closing Date: 3rd July, 2025.\n\nMethod of Application\nInterested and qualified candidates should forward their CV to: solutionimpactglobalresources@gmail.com using the Job Position as the subject of the email.\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Openings at Fastizers Food and Confectionery Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-fastizers-food-and-confectionery-limited",
    "pubDate": "Thu, 19 Jun 2025 10:16:52 GMT",
    "source": "JobGurus",
    "keyword": "fastizers food and confectionery limited",
    "duplicate": false,
    "classifications": [],
    "content": "Fastizers Food and Confectionery Limited started with its first production of cookies in the year 2010, desiring to cater to its immediate community. This first batch of home-made Fastizers Cookies, produced with less than N1,000, got so much positive feedback it inspired the production of subsequent batches, however still on a small scale from a home-kitchen.\n\nWe are recruiting to fill the following positions below:\n\n1.) Payable Accountant\n\nJob Location: Agbara, Ogun\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tTo provide financial and administrative support by ensuring the company makes payment for goods and services received and properly record transactions by posting receipts.\n\n\nQualifications\n\n\n\tShould be willing to work from Agbara.\n\tKnowledge of basic accounting principles.\n\tWorking knowledge of financial software and MS Office.\n\tPerform day-to-day financial transactions, including verifying, classifying, and recording accounts payable data\n\tReconcile the accounts payable ledger to ensure that all bills and payments are accounted for and properly posted\n\tVerify and investigate discrepancies, if any, by reconciling vendor accounts and monthly vendor statements\n\tReconciliation of GRNI, Trade Account Payable GL Balances and Vendors advance payment and submission of a weekly/monthly report on these activities.\n\tGenerate reports detailing accounts payables status\n\tUnderstand expense accounts and cost centers\n\tPosting of Month-end Closing Journals for - Accruals, Prepayments, Amortization etc\n\tProvide supporting documentation for audits\n\tProficient in Microsoft office tools.\n\n\nSalary\nN150,000 - N180,000 Monthly. \n\nApplication Closing Date: 20th June, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV and Cover Letter to: Careers@fastizers.com using the Job Position as the subject of the email.\n\n \n\n \n\n2.) Flow Wrap Machine Operator\n\nJob Location:  Ogun\nEmployment Type: Full-time\n\nKey Responsibilities\n\n\n\tOperate and monitor food processing or packaging machinery.\n\tEnsure machines are properly set up for production runs.\n\tCarry out regular cleaning and maintenance of equipment.\n\tAccurately complete production logs and reports.\n\tCollaborate with other team members to meet daily production targets.\n\tDetect and report mechanical faults or malfunctions.\n\tEnsure compliance with company safety, hygiene, and quality standards.\n\tSet up machine/equipment for operation.\n\tStart machine/equipment and make adjustments to machine when necessary to improve performance.\n\tEnsure all processes are done under strictGood Manufacturing Practices (GMP).\n\n\nRequirements\n\n\n\tMinimum of SSCE/OND/Technical Certificate or its equivalent.\n\tAt least 1–2 years of relevant experience in a manufacturing/FMCG environment.\n\tBasic understanding of mechanical operations and machine maintenance.\n\tGood attention to detail and strong problem-solving skills.\n\tWillingness to work shifts, or extended hours if required.\n\tGood Communication Skill, Attention to details, Analytical and numerical skills i.e. ability to perform basic mathematical calculations.\n\n\nApplication Closing Date: 24th June, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV and Cover Letter to: Careers@fastizers.com using “Flow Wrap Machine Operator” as the subject of the email.\n\n \n\n \n\n3.) Production Supervisor\n\nJob Location: Agbara, Ogun\nEmployment Type: Full-time\n\nResponsibilities\n\n\n\tEffectively manage resources required for production to meet targets and timelines.\n\tEnsure adequate numbers of factory hands are available and confirmed for production.\n\tCoordinate maintenance activities for production equipment and machinery.\n\tSupervise production processes, allocating resources as needed to meet targets.\n\tProvide accurate production data to management to develop performance targets.\n\tDevelop and manage production checklists to cover all key resources and SOPs.\n\tEnsure production starts on time unless unavoidable delays arise.\n\tPropose continuous improvement strategies for production processes.\n\tReport on work plans, resourcing, challenges, maintenance, and downtimes to the Production Manager.\n\tEnsure smooth handovers of assignments or supervisory duties when necessary.\n\tEnsure punctuality and commitment to scheduled production activities.\n\tOversee effective cleaning and orderliness in all production areas, maintaining proper segregation.\n\tAdhere strictly to health and safety guidelines at workstations.\n\tEnsure timely and accurate filing of records, maintaining organized and accessible documentation for analysis and reference.\n\tInterpret and enforce company policies and procedures, consulting superiors or relevant departments where necessary.\n\n\nRequirements\n\n\n\tBachelor’s Degree / HND in Food Science or related fields.\n\tAt least 2 years of professional or industry experience in production supervision.\n\tProficiency in Microsoft Office applications.\n\tStrong communication and leadership abilities.\n\tExperience with production equipment and capacity planning.\n\tExcellent planning, analytical, and organizational skills.\n\tAbility to work based on the factory's production schedule.\n\tProximity to Agbara,Ogun State will be an added advantage.\n\n\nSalary\nN120,000 - N150,000 / month.\n\nApplication Closing Date: 20th June, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their recent CV to: careers@fastizers.com using the Job Position as the subject of the mail.\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Project Manager - Interior Design Job at People Capacity Management",
    "link": "https://www.jobgurus.com.ng/jobs/view/project-manager-interior-design-job-at-people-capacity-management",
    "pubDate": "Thu, 19 Jun 2025 10:16:52 GMT",
    "source": "JobGurus",
    "keyword": "people capacity management",
    "duplicate": false,
    "classifications": [],
    "content": "People Capacity Management is a human resources and management consulting firm in Lagos, Nigeria. We provide services, expertise, and resources to bothprivate and public sectorthrough our deep knowledge of issues specific to industries and sectors. We are committed to meeting the needs of our clients in a timely and cost-effective manner. Our goal is to offer our clients the option that best suits their needs, be it a short or long-term assignment or on a project or ad hoc basis. We take the time to develop strong working relationships with our clients by understanding their business, their needs, and the company culture.\n\nWe are recruiting to fill the position below:\n\nJob Position: Project Manager - Interior Design\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Location: Lagos\n\nJob Summary\n\n\n\tWe are looking for a highly organized Project Manager to join our interior design firm.\n\tThe ideal candidate is a graduate, preferably an architect, with experience in interior spaces.\n\tYou must be skilled at managing vendors, coordinating timelines, and juggling multiple projects at once.\n\n\nKey Requirements\n\n\n\tGraduate (Architecture preferred)\n\tExperience in interior design project coordination\n\tStrong vendor and team management skills\n\tExcellent multitasking and communication abilities.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]