[
  {
    "title": "Internal Control and Audit Officer Job at Worknigeria",
    "link": "https://www.jobgurus.com.ng/jobs/view/internal-control-and-audit-officer-job-at-worknigeria",
    "pubDate": "Tue, 01 Jul 2025 11:14:08 GMT",
    "source": "JobGurus",
    "keyword": "worknigeria",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Worknigeria was established with a Singular Vision. To help the vast Nigerian workforce find meaningful jobs. We are also on a mission to upskill them in the best ways possible and help them grow with and within their careers.\n\nWe are recruiting to fill the position below:\n\nJob Position: Internal Control and Audit Officer\n\nJob Location: Victoria Island, Lagos\nEmployment Type: Full-time (Hybrid)\nReports to: Management\n\nKey Responsibilities\nInternal Controls:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDevelop, implement, and continuously improve internal control systems across all subsidiaries.\n\tConduct risk assessments and establish preventive measures to safeguard the company’s assets and processes.\n\tEnsure compliance with internal policies, regulatory requirements, and industry best practices.\n\tMonitor key operational and financial processes and identify areas for strengthening controls.\n\n\nInternal Audit:\n\n\n\tLead and execute periodic audit plans covering operational, financial, IT, and compliance areas.\n\tPrepare audit programs, conduct audit fieldwork, and issue timely audit reports with actionable recommendations.\n\tFollow up on the implementation of audit recommendations and report status updates to the Board.\n\tCoordinate external audits and support annual statutory audit processes.\n\n\nGovernance & Reporting:\n\n\n\tMaintain a high level of communication and transparency with the Board of Directors.\n\tPresent internal audit findings and risk assessment reports to the Board regularly.\n\tRecommend improvements in policies, procedures, and workflows to enhance efficiency and accountability.\n\tCollaborate with the leadership of each subsidiary to promote a culture of ethical compliance and risk awareness.\n\n\nSpecial Projects:\n\n\n\tConduct investigations of fraud, misconduct, or control failures as directed by the Board.\n\tSupport business units in implementing control-based automation where appropriate.\n\tOversee internal whistleblower programs and manage any associated investigations with confidentiality.\n\n\nKey Qualifications\n\n\n\tBachelor’s Degree in Accounting, Finance, or a related field. MBA or relevant master's degree is a plus.\n\tMinimum of 7–10 years of experience in internal control, auditing, or risk management, with at least 3 years in a leadership role.\n\tProfessional certifications such as ACA, ACCA, CPA, or CIA are required.\n\tPrior experience in financial services, telecom, IT, or group-level audit functions is highly preferred.\n\n\nSkills and Competencies:\n\n\n\tStrong knowledge of internal control frameworks (e.g., COSO), risk management, and auditing standards.\n\tProficient in using audit and reporting tools; familiarity with data analytics tools is an advantage.\n\tHigh integrity, objectivity, and professional skepticism.\n\tExcellent communication and reporting skills, with the ability to engage senior stakeholders.\n\tAbility to work independently and manage multiple subsidiaries with diverse operational models.\n\n\nWhat We Offer / Benefits\n\n\n\tSalary: N400,000 - N550,000 Monthly.\n\tAn innovative and flexible work culture.\n\tCompetitive compensation and performance bonuses.\n\tTraining and development to ensure continuous professional development.\n\tPrivate health insurance.\n\tEmployer pension contribution.\n\n\nMethod of Application\nInterested and qualified candidates should send their CVs to: careers@worknigeria.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Senior Personal Assistant to the Chairman / Managing Director Job at Global HR Always",
    "link": "https://www.jobgurus.com.ng/jobs/view/senior-personal-assistant-to-the-chairman-managing-director-job-at-global-hr-always",
    "pubDate": "Tue, 01 Jul 2025 11:14:08 GMT",
    "source": "JobGurus",
    "keyword": "global hr always",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Globalhralways is recruiting suitably qualified candidates to fill the position the position below:\n\nJob Positon: Senior Personal Assistant to the Chairman / Managing Director\n\nJob Location: Benin, Edo\nEmployment Type: Full-time\n\nJob Roles\nThe Senior Personal Assistant will be responsible for:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tSupervising other PAs.\n\tInterfacing with vendors, contractors, and staff.\n\tRecord keeping of fueling and servicing of principal’s vehicles.\n\tFiling of documents (hard and soft copies)\n\tRecording of cash expenses.\n\tTravel planning.\n\tReceiving and sending the Chairman/Managing Director’s emails and texts\n\tObtaining the Chairman/Managing Director’s approval on sent requests.\n\tReceiving the Chairman/Managing Director’s personal and official guests.\n\tMaking hotel and flight reservations on behalf of the Chairman/Managing Director and guests.\n\tRecording and keeping track of the Chairman/Managing Director’s out-of-pocket expenses.\n\tKeeping a record of all the Chairman/Managing Director’s correspondence.\n\tFiling records for receipts, PR, traveling allowance for staff, weekly and monthly police allowance, party expenses, delivery of parcels, etc.\n\tAttending and taking minutes of the Chairman/Managing Director’s meetings.\n\tHandle the fueling of the Chairman/Managing Director’s vehicles.\n\tAccompanying the Chairman/Managing Director at social functions and official meetings.\n\tThe preferred candidate is expected to be a female and have the flexibility to travel.\n\tAny other job as assigned by the Chairman / Managing Director.\n\n\nRequirements\n\n\n\tMinimum Educational Qualification: Minimum of a Second-Class Upper Degree in any relevant discipline.\n\tExperience: Minimum of 7 years of previous experience in a similar role.\n\n\nSkills and Competencies:\n\n\n\tAbility to travel when required.\n\tAbility to use aniPhone.\n\tVery proficient in the use of electronic gadgets and social media.\n\tProficient computer skills, including the ability to prepare spreadsheets.\n\tGood oral and written communication.\n\tConversant with visa processing.\n\n\nSalary\nN300,000 / Month.\n\nMethod of Application\nInterested and qualified candidates should send their Resumes to: globalhralways@gmail.com using \"SPA\" as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Guest Service Agent (GSA) Job at OIC Partners",
    "link": "https://www.jobgurus.com.ng/jobs/view/guest-service-agent-gsa-job-at-oic-partners",
    "pubDate": "Tue, 01 Jul 2025 11:14:08 GMT",
    "source": "JobGurus",
    "keyword": "oic partners",
    "duplicate": false,
    "classifications": [],
    "content": "OIC Partners - Our client in Ota, Ogun State is recruiting to fill the position below:\n\nJob Position: Guest Service Agent (GSA)\n\nJob Location: Ota, Ogun\nEmployment Type: Full-time\n\nRequirements\n\n\n\tInterested candidates should possess relevant qualifications with at least 2 years of work experience.\n\n\nWork Condition\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\t5 days a week, 2 days off\n\tSalary: N100,000 Monthly.\n\tService charge after 3 months.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: unlimitedico@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Customer Service Representative Job at Eric Kayser",
    "link": "https://www.jobgurus.com.ng/jobs/view/customer-service-representative-job-at-eric-kayser",
    "pubDate": "Tue, 01 Jul 2025 11:14:08 GMT",
    "source": "JobGurus",
    "keyword": "eric kayser",
    "duplicate": false,
    "classifications": [],
    "content": "Eric Kayser is a restaurant in Ikoyi, Lagos State. Through its research, expertise and innovation, Eric Kayser has been able to retain its signature of excellence in Bakery, Pastry, Viennoiserie and Traiteur, etc.\n\nWe are recruiting to fill the position below:\n\nJob Position: Customer Service Representative\nJob Location: Victoria Island, Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe're seeking a friendly, attentive, and customer-focused Customer Service Representative to join our team! Our restaurant offers a dynamic and supportive work environment, serving high-quality cuisine to our valued customer\n\tAs a Customer Service Representative, you'll provide exceptional service, address customer concerns, and ensure a memorable dining experience.\n\n\nResponsibilities\n\n\n\tRespond to customer inquiries via phone, email, and in-person\n\tResolve customer complaints and feedback\n\tProcess reservations, takeout orders, and delivery requests\n\tMaintain accurate records of customer interactions\n\tCollaborate with staff to ensure seamless service\n\n\nRequirements\n\n\n\tInterested candidates should possess an HND qualification / BSC with 3 - 5  previous years as a customer service officer.\n\tExcellent communication, interpersonal, and problem-solving skills\n\tAbility to multitask, work under pressure, and maintain patience\n\n\nDesirable:\n\n\n\tHospitality certification or training\n\tExperience with customer relationship management (CRM) software\n\tKnowledge of restaurant operations and food safety protocols\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: careers@erickayserng.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Content Creator Job at Future Moves Recruitment Agency",
    "link": "https://www.jobgurus.com.ng/jobs/view/content-creator-job-at-future-moves-recruitment-agency",
    "pubDate": "Tue, 01 Jul 2025 11:14:08 GMT",
    "source": "JobGurus",
    "keyword": "future moves recruitment agency",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance"
    ],
    "content": "Future Moves Recruitment Agency is a licensed full-fledged Human Resource firm with extensive expertise and experience in human Capital development and staffing. Future Moves has exceptional expertise in Talent Sourcing, learning & development, talent management, HR Outsourcing & Payrolling, HR planning & Consulting, Policy Drafting, Culture Change and Organisation Effectiveness by designing and implementing interventions which identify the core areas of development to enhance the overall growth and competitiveness of your organization.\n\nWe are recruiting to fill the position below:\n\nJob Position: Content Creator\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Location: Alagomeji, Yaba - Lagos\nEmployment Type: Full Time ( Monday to Saturday)\nWorking Hours: Flexible\n\nJob Description\n\n\n\tWe are looking for a creative Content Creator to develop engaging digital content across various platforms.\n\tYou will generate compelling stories and multimedia content that reflect our client brand’s voice and resonate with our audience.\n\n\nResponsibilities\n\n\n\tDevelop and produce high-quality content (articles, social media posts, images, videos) tailored to our target audience.\n\tCollaborate with marketing and design teams to align content with brand strategy.\n\tOptimize content for SEO and user engagement across digital channels.\n\tMonitor content performance and adjust strategies based on audience insights.\n\n\nRequirements\n\n\n\tCandidates should possess a Bachelor's Degree with 2 - 3 years of experience. \n\tStrong writing, editing, and visual storytelling skills.\n\tProficiency with content management systems and social media platforms.\n\tBasic knowledge of SEO and digital marketing best practices.\n\tCreative, detail-oriented, and capable of managing multiple projects.\n\n\nSalary\nN150,000 - N200,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: L.recruiter@fmragency.com using the Job Position as the subject of the mail    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]