[
  {
    "title": "Technical Manager Job at FGS Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/technical-manager-job-at-fgs-limited",
    "pubDate": "Wed, 11 Jun 2025 18:49:13 GMT",
    "source": "JobGurus",
    "keyword": "fgs limited",
    "duplicate": false,
    "classifications": [],
    "content": "FGS Limited, an Oil and Gas company, is recruiting suitably qualified candidates to fill the position below:\n\nJob Position: Technical Manager\nJob Location: Port Harcourt, Rivers\nEmployment Type: Full-time\nIndustry: Oil & Gas and Energy\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tTo collaborate as a support to the MD in designing and implementing a 1–5-year growth strategies for EPCIM services.\n\tTo support end-to-end EPCIM project execution; alignment between engineering design, procurement, construction, installation, and maintenance phases in compliance with ISO 9001/14001/45001 standards.\n\tDevelop integrated project execution plans (PEPs) using Primavera/MS Project, emphasizing phase gate reviews and risk mitigation.\n\tCollaborate with engineering teams to validate designs against client specifications (e.g., ASME, ANSI) and operational feasibility. To support procurement by reviewing technical datasheets, material specifications, and vendor qualifications for mechanical- rotating equipment (pumps, compressors).\n\tEnsure procurement aligns with EPCIM timelines, minimizing lead times and cost overruns while complying with QA/QC protocols.\n\tManage on-site construction/installation, ensuring adherence to IFC drawings, P&IDs, and HSE protocols (NEBOSH/ISO 45001).\n\tResolve technical clashes during commissioning and startup phases.\n\tImplement predictive maintenance programs (vibration analysis, thermography) for mechanical-rotating assets to reduce downtime.\n\tDevelop SOPs for maintenance workflows at the workshop and running projects, while integrating lessons learned from any EPC phases into lifecycle management as maybe applicable\n\tLead tender processes, including risk assessments, cost estimation, and proposal development, ensuring EPCIM scope clarity and competitive pricing for a 95% success rate.\n\tDrive OEM product sales by presenting the company technical capabilities to prospective clients.\n\tContinuous vetting of all bid/tendering documents to ensure they meet technical, commercial and documentation expectations that must pass all metrics for measuring a successful bid/tender\n\tAchieve a minimum 50% bid win rate through competitive pricing and technical differentiation\n\tProcurement & Supply Chain Integration\n\tConstruction & Installation Management\n\tMaintenance & Reliability Optimization\n\tTendering & Business Development\n\n\nQualifications & Experience\n\n\n\tBachelor’s degree in Mechanical Engineering,\n\t(Masters degree in Project Management or Engineering Management is a plus.)\n\tMinimum of 15 - 20 years’ experience as Maintenance Manager, Engineering Manager or Technical Manager in the oil and gas or energy sector.\n\tMust be NSE or COREN certified\n\n\nKey Competencies:\n\n\n\tStrategic thinking and commercial awareness\n\tStrong industry network and client engagement skills\n\tTechnical understanding of energy products and services\n\tGoal-oriented and highly motivated\n\tStrong Leadership and interpersonal relationship\n\tStrong project management skill\n\tStrong negotiation skill\n\tStrong analytical and problem-solving abilities.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV in PDF to: robertituboala@gmail.com or: info@fleesglobal.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Executive Assistant (with Legal Background) Job at Limeswood International Company Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/executive-assistant-with-legal-background-job-at-limeswood-international-company-limited",
    "pubDate": "Wed, 11 Jun 2025 18:49:13 GMT",
    "source": "JobGurus",
    "keyword": "limeswood international company limited",
    "duplicate": false,
    "classifications": [],
    "content": "Limeswood International Company Limited, situated in Nigeria, stands as a respected entity specializing in Mechanical, Electrical, and Instrumentation services. As dedicated partners, we cater to a wide array of industries, particularly focusing on oil and gas, power, energy, petrochemicals, and manufacturing.\n\nWe are recruiting to fill the position below:\n\nJob Position: Executive Assistant (with Legal Background)\nJob Location: Victoria Island, Lagos\nEmployment Type: Full-time (Monday - Friday)\n\nPosition Overview\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking an organized, professional, and proactive Executive Assistant with a legal background to support our senior leadership team.\n\tThis position involves a mix of administrative duties and legal support, assisting in the smooth operation of the executive office while ensuring that all legal matters are handled appropriately.\n\n\nKey Responsibilities\nExecutive Support:\n\n\n\tManage the daily schedule, appointments, and meetings for senior leadership, ensuring efficient time management.\n\tServe as the primary point of contact between executives and both internal and external stakeholders.\n\tOrganize and prioritize incoming correspondence, emails, and phone calls, responding on behalf of executives when necessary.\n\tPrepare reports, presentations, and other business materials for meetings and conferences.\n\tMake travel arrangements, including flight bookings, accommodations, and itineraries for the executive team.\n\tHandle personal tasks and errands for executives as needed.\n\n\nLegal Support and Administration:\n\n\n\tAssist in drafting, reviewing, and editing legal documents (contracts, agreements, non-disclosure agreements, etc.).\n\tConduct legal research and provide summaries of relevant laws, regulations, and precedents.\n\tMaintain and organize legal files and documentation in compliance with confidentiality and privacy standards.\n\tEnsure the timely submission of legal documents and correspondence, tracking important deadlines.\n\tCoordinate with external legal counsel as required, keeping executives informed of progress and developments.\n\n\nOffice Management:\n\n\n\tManage administrative functions for the executive office, including file management, office supplies, and office logistics.\n\tOrganize and schedule meetings, ensuring all necessary documents and information are available.\n\tMonitor the progress of ongoing legal and administrative projects, providing regular updates to senior leadership.\n\tAssist with the coordination of company events, conferences, and internal meetings, ensuring all details are managed effectively.\n\tMaintain confidentiality and handle sensitive company and legal information with discretion.\n\n\nQualifications\n\n\n\tA Bachelor’s degree in Law\n\tProven experience as an Executive Assistant, Personal Assistant, or similar role, preferably in a legal or corporate environment.\n\tIn-depth knowledge of legal terminology, legal documents, and processes.\n\tStrong organizational and time management skills, with the ability to prioritize tasks and meet deadlines.\n\tProficiency in Microsoft Office Suite (Word, Excel, PowerPoint), legal software, and project management tools.\n\tAbility to handle sensitive information with discretion and maintain confidentiality.\n\tFlexible to travel\n\tExcellent written and verbal communication skills, with the ability to communicate professionally with stakeholders at all levels.\n\tHigh attention to detail and accuracy in document management and preparation.\n\tProximity to the Island is a plus\n\tFlexible, adaptable, and able to handle a variety of tasks in a fast-paced environment.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]