[
  {
    "title": "Supervisor Job at Kiyix Recruitment Hub",
    "link": "https://www.jobgurus.com.ng/jobs/view/supervisor-job-at-kiyix-recruitment-hub",
    "pubDate": "Sat, 05 Jul 2025 17:38:49 GMT",
    "source": "JobGurus",
    "keyword": "kiyix recruitment hub",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "KIYIX is a recruitment/Hr Consulting firmand our goal is to help create one million jobs in Nigeria by 2030. At Kiyix recruitment hub, we help make recruitment a stress-free experience for both the employer and the potential job seekers.\n\nWe are recruiting to fill the position below:\n\nJob Position: Supervisor\n\nJob Location: Oyingbo, Lagos\nEmployment Type: Full-time\nIndustry: FMCG\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe're seeking an experienced Supervisor to oversee our FMCG operations in Lagos.\n\tAs a Supervisor, you'll be responsible for managing a team of sales representatives, ensuring effective customer service, and driving sales growth¹.\n\n\nKey Responsibilities\n\n\n\tTeam Management: Supervise a team of sales representatives, providing guidance and support to ensure sales targets are met.\n\tCustomer Service: Ensure excellent customer service, resolving customer complaints and addressing their needs.\n\tSales Growth: Develop and implement strategies to drive sales growth, expand customer base, and increase market share.\n\tInventory Management: Manage inventory levels, track sales, and report on customer feedback.\n\n\nRequirements\n\n\n\tBachelor's Degree in Business Administration, Marketing, or a related field\n\tMinimum of 2 years of experience in sales or a related field in the FMCG sector\n\tProven leadership and team management skills\n\tExcellent communication and interpersonal skills\n\tAbility to work in a fast-paced environment.\n\n\nSalary\nN120,000 - N150,000 / month.\n\nMethod of Application\nInterested and qualified candidates should forward their application, including their Resume to: kicvacancy@gmail.com using the Job Position as the subject of the mail.\n\nNote: For more inquiries, contact via WhatsApp 09063916949.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Customer Service Representative - FMCG Job at Kiyix Recruitment Hub",
    "link": "https://www.jobgurus.com.ng/jobs/view/customer-service-representative-fmcg-job-at-kiyix-recruitment-hub",
    "pubDate": "Sat, 05 Jul 2025 17:38:49 GMT",
    "source": "JobGurus",
    "keyword": "kiyix recruitment hub",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "KIYIX is a recruitment / HR consulting firm and our goal is to to help create one million jobs in Nigeria by 2030. At Kiyix recruitment hub, we help make recruitment a stress-free experience for both the employer and the potential job seekers.\n\nWe are recruiting to fill the position below:\n\nJob Position: Customer Service Representative - FMCG\nJob Location: Mushin, Lagos\nEmployment Type: Full-time\nIndustry: FMCG\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe're seeking a highly skilled and customer-focused Customer Service Representative to join our team in the FMCG sector. As a Customer Service Representative, you'll be responsible for providing exceptional customer service, resolving customer complaints, and promoting our products.\n\n\nKey Responsibilities\n\n\n\tCustomer Service: Provide timely and professional responses to customer inquiries and concerns via phone, email, and social media.\n\tComplaint Resolution: Resolve customer complaints in a fair and timely manner, ensuring customer satisfaction and loyalty.\n\tProduct Knowledge: Develop and maintain in-depth knowledge of our products, services, and promotions to provide accurate information to customers.\n\tSales Support: Support sales teams by providing customer insights, resolving customer issues, and promoting products.\n\n\nRequirements\n\n\n\tBachelor's degree in Business Administration, Marketing, or a related field\n\tMinimum of 1 year of experience in customer service or a related field\n\tExcellent communication and interpersonal skills\n\tAbility to work in a fast-paced environment.\n\n\nSalary\nN90,000 - N100,000 per month. \n\nMethod of Application\nInterested and qualified candidates should forward their application, including their Resume to: kicvacancy@gmail.com using the Job Position as the subject of the mail.\n\nNote \n\n\n\tIf you're a results-driven and customer-focused individual, please apply\n\tFor more inquiries, contact via WhatsApp 09063916949.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Sales / Admin Officer Job at Courier and Logistics Management Institute",
    "link": "https://www.jobgurus.com.ng/jobs/view/sales-admin-officer-job-at-courier-and-logistics-management-institute",
    "pubDate": "Sat, 05 Jul 2025 17:38:49 GMT",
    "source": "JobGurus",
    "keyword": "courier and logistics management institute",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Courier & Logistics Management Institute (CLMI) - Welcome to CLMI - Your Gateway to Premier Education and Professional Development. The Ultimate Platform to Launch and Sell Your Courses Online, Equipped with Comprehensive eCommerce Features.\n\nAt CLMI, we offer an unparalleled LMS platform where you can sell courses and gain professional insights into courier, logistics, transport, and management. As the world’s only professional body offering all four categories together, we provide knowledge from global experts and industry leaders. Elevate your educational and professional standing in society with CLMI.\n\nWe are recruiting to fill the position below:\n\nJob Position: Sales / Admin Officer\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nAbout the Role\n\n\n\tWe are seeking a dynamic, driven, and resourceful Marketing/Admin Officer to join our growing team. This role is ideal for someone passionate about sales, business growth, and efficient office administration.\n\tThe primary focus of this position is sales and customer acquisition— the successful candidate will actively generate leads, onboard new customers, and drive revenue while earning attractive commissions in addition to a basic monthly salary.\n\tYou will also handle essential administrative responsibilities to ensure smooth day-to-day office operations.\n\n\nKey Responsibilities\nMarketing & Sales:\n\n\n\tIdentify and secure new customers for CLMI programs and services.\n\tBuild and maintain strong relationships with prospects and existing clients.\n\tAchieve monthly sales targets and earn commissions on successful conversions.\n\tProactively promote CLMI’s training programs, certifications, and academic offerings.\n\tDevelop creative sales strategies to drive customer engagement and enrollment.\n\n\nAdministrative Tasks:\n\n\n\tProvide general administrative support to the office and management team.\n\tManage office records, documentation, and correspondence.\n\tCoordinate meetings, schedules, and internal communications.\n\tSupport daily operational tasks to ensure office efficiency.\n\n\nRequirements\n\n\n\tMinimum of OND / HND / Bachelor’s Degree in Marketing, Business Administration, or related fields.\n\tStrong interest in sales with proven ability (or desire) to close deals and meet targets.\n\tExcellent communication, negotiation, and interpersonal skills.\n\tBasic administrative and organizational skills.\n\tSelf-driven, goal-oriented, and able to work independently.\n\tPrior experience in marketing or administrative roles is an advantage.\n\n\nWhat We Offer\n\n\n\tBasic monthly salary\n\tCommission on every successful customer acquisition\n\tGrowth opportunities within a reputable professional institute\n\tA supportive work environment.\n\n\nMethod of Application\nInterested and qualified candidates should send their Applications to: simon_emeje@yahoo.com using the Job Position as the subejct of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Audit Officer Job at Kiyix Recruitment Hub",
    "link": "https://www.jobgurus.com.ng/jobs/view/audit-officer-job-at-kiyix-recruitment-hub-1",
    "pubDate": "Sat, 05 Jul 2025 17:38:49 GMT",
    "source": "JobGurus",
    "keyword": "kiyix recruitment hub",
    "duplicate": false,
    "classifications": [],
    "content": "Kiyix Recruitment Hub is a recruitment agency and our goal is to to help create one million jobs in Nigeria by 2030. At Kiyix recruitment hub, we help make recruitment a stress-free experience for both the employer and the potential job seekers.\n\nWe are recruiting to fill the position below:\n\nJob Position: Audit Officer\n\nJob Locations: Ikorodu, Mushin - Lagos and Sango Ota - Ogun\nEmployment Type: Full-time\nIndustry: FMCG\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking an experienced Audit officer to join our team.\n\tThe successful candidate will be responsible for conducting financial and operational audits to ensure compliance with requlatory requirements, organizational policies and industry standards\n\tThe Audit officer will identify areas for impreovement and provide recommendations to enhance the efficiency and effectiveness of our operations.\n\n\nKey Responsibilities\n\n\n\tConduct financial and operational audits to identify areas of risk and opportunities for improvement\n\tDevelop and implement audit plans, including risk assssments and audit procedures\n\tGather and anaylse data and document findings and recommendations\n\tPresent audit findings and recommendations to management and the audit committee\n\tFollow up on audit recommendations to ensure implementation\n\tStay up to date with regulatory requirements, industry standards and best practices.\n\n\nRequirements\n\n\n\tBachelor's Degree in Accounting, Finances or related field\n\t2 - 3 years of experience in internal audit or external audit\n\tProfessional certificates (e.g ACCA, ICA, IIA) preferred.\n\tStrong knowledge of auditing standards, regulatory requirments and industry best practices\n\tExcellent analytical, communication, and problem solving skills\n\tAbility to work independently an as part of a team.\n\n\nSalary\nN120,000 - N150,000 monthly.\n\nMethod of Application\nInterested and qualified candidates should forward their resume and cover letter to: kicvacancy@gmail.com using the Job Position as the subject of the mail.\n\nNote\n\n\n\tIf you are motivated and detail oriented individual with a passion for auditing, please apply\n\tFor more enquiries, WhatsApp 09063916949.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Operations Manager Job at 5thWall Consulting",
    "link": "https://www.jobgurus.com.ng/jobs/view/operations-manager-job-at-5thwall-consulting",
    "pubDate": "Sat, 05 Jul 2025 17:38:49 GMT",
    "source": "JobGurus",
    "keyword": "5thwall consulting",
    "duplicate": false,
    "classifications": [],
    "content": "At 5thWall Consulting, we are a dynamic outsourcing firm dedicated to providing end-to-end recruitment solutions for businesses across various industries. We specialize in helping organizations attract, assess, and hire top talent that aligns with their goals and culture.\n\nWe are recruiting to fill the position below:\n\nJob Position: Operations Manager\n\nJob Location: Lekki-Ajah, Lagos\nEmployment Type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking an experienced Operations Manager to oversee the day-to-day activities of our real estate company.\n\tThe successful candidate will be responsible for ensuring the smooth operation of our business, driving process improvements, and leading cross-functional teams to achieve business objectives.\n\n\nKey Responsibilities\nOperational Management:\n\n\n\tOversee daily operations, ensuring efficient execution of projects and transactions.\n\tDevelop and implement operational processes and procedures to improve productivity and quality.\n\tIdentify and mitigate operational risks, ensuring compliance with industry regulations.\n\n\nTeam Leadership:\n\n\n\tManage and lead cross-functional teams, including administrative, sales, and customer service staff.\n\tFoster a positive and productive work environment, promoting teamwork and collaboration.\n\tDevelop and implement training programs to enhance team performance and skills.\n\n\nProcess Improvement:\n\n\n\tAnalyze operational processes, identifying areas for improvement and implementing changes.\n\tDevelop and implement metrics to measure operational performance, tracking progress and make data-driven decisions.\n\tCollaborate with senior management to develop strategic plans and objectives.\n\n\nStakeholder Management:\n\n\n\tBuild and maintain relationships with internal stakeholders, including employees, management, and other departments.\n\tEnsure effective communication with external stakeholders, including clients, realtors and partners.\n\n\nPerformance Monitoring:\n\n\n\tTrack and analyze key performance indicators (KPIs) to measure operational performance.\n\tIdentify areas for improvement and implement corrective actions.\n\n\nRequirements\n\n\n\tCandidates should possess a Bachelor's Degree in Business Administration, Real Estate, or a related field with 6-8 years of experience.\n\tProven experience in operational management, preferably in real estate.\n\tStrong analytical and problem-solving skills.\n\tExcellent communication and leadership skills.\n\n\nKey Skills:\n\n\n\tStrong leadership and management skills\n\tExcellent communication and interpersonal skills\n\tAbility to analyze and improve operational processes\n\tStrategic thinking and problem-solving skills\n\tAttention to detail and organizational skills\n\tProficiency in Microsoft Office and other productivity software\n\n\nCompetences:\n\n\n\tOperational management and process improvement\n\tLeadership and team management\n\tStrategic planning and execution\n\tProblem-solving and analytical thinking\n\tCommunication and stakeholder management\n\tAdaptability and flexibility in a fast-paced environment.\n\n\nSalary\nN500,000 - N600,000 / Month.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]