[
  {
    "title": "Business Development Manager Job at Spacefinish",
    "link": "https://www.jobgurus.com.ng/jobs/view/business-development-manager-job-at-spacefinish",
    "pubDate": "Wed, 18 Jun 2025 13:30:31 GMT",
    "source": "JobGurus",
    "keyword": "spacefinish",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Spacefinish is one of Africa’s leading Design/Build company that specialises in office spaces. We have a core team of 20 professionals, and network of +40 consultant partners across multiple African countries.\n\nAt Spacefinish we do not see ourselves as just Project Managers and Designers, rather we see ourselves as influencers of work culture and brand identity for our clients. Our clients have undergone huge “internal” brand transformation as a result of the spaces we have delivered to them. We have gathered data that shows that our human centered approach to workspace design and construction has positively changed employee behavior.\n\nWe are recruiting to fill the position below:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Position: Business Development Manager\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Description\n\n\n\tThe Business Development Manager will manage and implement the sales forecasting, planning and buyer-driven sales and marketing processes, establishing a high level of quality, accuracy and process consistency for the sales and marketing department/team. Craft strategies for sales teams.  \n\n\nResponsibilities\nBusiness Development:\n\n\n\tBuild long term customer relationships and propose solution offerings thatanticipates customers’ needs and exceeds expectations\n\tFormulate strategic business development plans for target markets and ensurealignment with organization strategic direction\n\tLead negotiation process to achieve desired outcomes\n\tDrive customer adoption using strategic insight derived from detailed dataanalysis\n\tEvaluate implications of strategies and business targets to seek endorsement\n\tGuide communication to stakeholders on opportunities to gather buy-ins\n\n\nPartnership Management:\n\n\n\tEvaluate and drive inter-organizational initiatives, and negotiate strategicinformation exchange with key partners\n\tManage inter-organizational initiatives, programs and projects\n\tEvaluate potential organizations and assess the costs and benefits of a shared partnership\n\tRecommend potential organizations with shared or complementary objectives, or which allow for mutual benefits of a shared partnership\n\tNegotiate the strategic exchange of information with key partners orstakeholders\n\tCo-create a robust inter-organizational strategy to effectively address common issues faced\n\tEvaluate effectiveness of partnerships and identify room for enhancement\n\n\nBusiness Proposal Writing:\n\n\n\tIdentify necessary information and sources of information\n\tAnalyze market potential for business opportunities\n\tConduct customer needs analysis to determine market demand\n\tEvaluate business opportunities to assess viable options\n\tApprove proposals to capitalize on viable business opportunities\n\n\nBusiness Presentation Delivery:\n\n\n\tEstablish objectives of presentations and identify appropriate presentation modes to meet organizational requirements\n\tReview presentation outcomes to enhance future performance\n\n\nBusiness Negotiation:\n\n\n\tManage and direct negotiation policies and develop negotiation limits\n\tDrive the establishment of the organization’s negotiation policies and limits\n\tSet negotiation guidelines to be used during negotiation process\n\tEvaluate and refine negotiation policies and limits based on negotiation outcomes\n\n\nMarket Research:\n\n\n\tLead the assessment of the market and develop organizational market research policies and procedures\n\tAnalyze market trends and developments to forecast emerging market needs\n\tGuide market research activities to align research objectives with organizational needs\n\tIdentify competitors in accordance to evolving business objectives and emerging market needs\n\tEstablish benchmarks in which customer behaviors can be assessed based on industry best practices\n\tEstablish organization's market research policies and procedures based on industry standards\n\n\nRequirements\n\n\n\tBachelor's degree in business administration, marketing, mass communication or equivalent.\n\tMinimum of 10-12 years construction, architecting or Real Estate industry experience.\n\tMBA/ Relevant professional certification in marketing / Sales will be an added advantage.\n\tHas a vast and strong network within the commercial and residential real estate space.\n\tHas at least 7 years experience working with commercial real estate clients\n\tExperience using sales tools like LinkedIn Navigator, Close.io...etc to drive outbound activities.\n\n\nSkills:\n\n\n\tProficiency in converting Spacefinish style inbound leads. (short-term)\n\tExperience networking and nurturing long-term relationships toward conversion.\n\tA strong track record in identifying partnership deals, and managing those partnerships.\n\tProven ability to prepare RFP’s for prospective bids\n\tProven record of bringing in revenue of a minimum of N800 Million to over a Billion Naira.\n\tProven ability for technical selling and ability to prospect, commercialize and maintain accounts.\n\tHas experience building sales systems having worked within a structured environment for one.\n\tExcellent interpersonal skills and ability to clearly communicate to a variety of audiences including senior management, customers, and co-workers.\n\tStrong technical background and excellent organizational skills.\n\tSelf-motivated team player with exceptional people skills and character and adesire to thrive in a fast-paced, entrepreneurial, and lean environment.\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Data Analyst, Reconciliation & Payments Job at Moove",
    "link": "https://www.jobgurus.com.ng/jobs/view/data-analyst-reconciliation-payments-job-at-moove",
    "pubDate": "Wed, 18 Jun 2025 13:30:31 GMT",
    "source": "JobGurus",
    "keyword": "moove",
    "duplicate": false,
    "classifications": [
      "Software Engineering"
    ],
    "content": "Moove is on a mission to redefine what large-scale rideshare leasing and vehicle ownership look like in Africa. We are developing an innovative model to rapidly improve the availability of vehicles for on-demand ridesharing services across major metro cities while also creating sustainable jobs for drivers\n\nWe are recruiting to fill the position below:\n\nJob Position: Data Analyst, Reconciliation & Payments\n\nJob Location: Lagos\nDepartment: Data\n\nAbout the Role\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAs a Data Analyst for Reconciliation & Payments, you will support Moove’s operations by performing data analysis, ensuring data quality, and providing business insights. \n\tYour role will involve conducting exploratory analysis, automating recurring data requests, and supporting business and product strategies with actionable insights.\n\n\nResponsibilities\nWhat You’ll be Doing:\n\n\n\tDevelop and maintain cross browser compatible web and mobile based applications and work closely with team to enhance existing functionalities\n\tTake charge and be a decision driver for assigned web platforms\n\tAbility to explain issues, decisions and solutions to the team succinctly\n\tProduce prototypes and effectively articulate design decisions\n\tKeep up-to-date on emerging technology solutions, particularly those on JavaScript, for continuous improvements in front-end application development and end-user experience\n\tOpen to work in Low-code No-code tools and Backend\n\n\nWho You'll Be Working with:\n\n\n\tDirectly reporting to our Lead Data Analyst , and closely working with our Product, Data and Engineering Teams.\n\n\nRequirements\nWhat You will need for this position:\n\n\n\tDegree in Mathematics, Economics, Computer Science, Information Management, Statistics.\n\tAdvanced SQL proficiency (cohort analysis, complex joins, window functions, etc.).\n\tExperience with Python for exploratory data analysis and automation\n\tKnowledge of reporting tools like Looker/Holistics/Quicksight.\n\tExperience: Proven experience in data analysis, working with business users to create reports and dashboards, and delivering actionable insights. Familiarity with statistical packages (e.g., Google Sheets, Python libraries).\n\tSkills: Strong problem-solving abilities, attention to detail, critical thinking, and business acumen.\n\tAbility to communicate insights clearly & collaborate with cross-functional teams.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Medical Officer Job at Beaconhill Smile Clinic Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/medical-officer-job-at-beaconhill-smile-clinic-limited",
    "pubDate": "Wed, 18 Jun 2025 13:30:31 GMT",
    "source": "JobGurus",
    "keyword": "beaconhill smile clinic limited",
    "duplicate": false,
    "classifications": [],
    "content": "Beaconhill Smile Clinic Limited is a leading and award winning dental care provider and Aesthetic Group in Nigeria, dedicated to offering high-quality dental services in a comfortable and welcoming environment. Our clinic prides itself on combining advanced technology with compassionate care to enhance our patients' smiles and overall oral health. It is also Africa's first 7-day dental practice.\n\nWe are recruiting to fill the position below:\n\nJob Position: Medical Officer (with a Focus on Mental & Behavioral Health)\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tBeaconhill Group is expanding its mission to provide holistic healthcare by incorporating mental wellness into our clinical services.\n\tWe are seeking a dedicated and compassionate Medical Officer (MO) with a strong interest in mental health to oversee and support the coordination of both primary care and mental health services.\n\tThis role is perfect for a physician who is passionate about enhancing patient care through the integration of mental health, working alongside a team of external therapists, psychologists, and psychiatrists to ensure comprehensive, patient-centered care.\n\n\nKey Responsibilities\n\n\n\tClinical Services: Provide general outpatient care, including diagnosis, treatment, and follow-up for medical conditions, with a specific focus on integrating mental health screening during consultations.\n\tMental Health Integration: Implement mental health screenings and brief interventions in daily practice, identifying early signs of mental health conditions and referring patients to appropriate behavioral health professionals, including external therapists, psychologists, and psychiatrists.\n\tOutreach & Awareness: Contribute to the development and implementation of mental health awareness campaigns, staff training, and community outreach initiatives aimed at destigmatizing mental health and promoting emotional wellness within the clinic.\n\tRecord Keeping & Compliance: Maintain accurate, confidential, and up-to-date patient records in accordance with clinical, legal, and ethical standards, ensuring compliance with all healthcare regulations.\n\tPatient Support: Offer basic counseling and psychoeducation for patients experiencing mild to moderate emotional or psychological distress, fostering an environment that prioritizes mental well-being alongside physical health.\n\tTeam Collaboration: Lead and collaborate with external mental health professionals to ensure seamless communication and coordination of care, ensuring that patients receive comprehensive treatment plans.\n\tContinuous Education: Stay informed about the latest research, emerging trends, and best practices in mental health care within a primary healthcare setting to ensure high-quality, evidence-based patient care.\n\n\nIdeal Candidate\n\n\n\tCandidates should possess relevant qualifications in a related field with experience.\n\tExperience or interest in managing a collaborative care model, overseeing both medical and behavioral health services.\n\tA physician with a passion for integrating mental health care within a primary care setting.\n\tDemonstrated ability to work effectively within an interdisciplinary team of mental health professionals.\n\tStrong interpersonal skills, with a patient-centric approach to healthcare.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: recruitment@beaconhillsmile.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Deposit Mobilization Manager Job at EmDam Strategies Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/deposit-mobilization-manager-job-at-emdam-strategies-limited",
    "pubDate": "Wed, 18 Jun 2025 13:30:31 GMT",
    "source": "JobGurus",
    "keyword": "emdam strategies limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "EmDam Strategies Limited - Our client in the Microfinance bank business is recruiting to fill the position below:\n\nJob Position: Deposit Mobilization Manager\n\nJob Locations: Surulere & Island, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tOur client is seeking experienced and results-driven Deposit Mobilization Managers to lead our deposit mobilization efforts.\n\tThe successful candidate will be responsible for developing and implementing strategies to grow our deposit base, manage a team of deposit mobilization officers, and meet business targets.\n\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDevelop and implement deposit mobilization strategies to achieve business targets.\n\tManage and supervise a team of deposit mobilization officers.\n\tCollaborate with cross-functional teams to support business objectives.\n\tAnalyze market trends and competitor activity to inform deposit mobilization strategies.\n\tSet and achieve deposit growth targets and monitor performance metrics.\n\tIdentify new business opportunities and develop relationships with key customers.\n\tProvide training and coaching to deposit mobilization officers to enhance performance.\n\tMonitor and control deposit mobilization costs and ensure efficient use of resources.\n\n\nRequirements\n\n\n\tBSc / HND in Accounting, Banking & Finance, Economics, or a related field. Certification in Treasury Management (ACTM, CFA, CIBN) will be an added advantage.\n\tMinimum of 5 years in treasury management, asset and liability management, or financial planning.\n\tProven track record of meeting and exceeding deposit growth targets.\n\tStrong leadership, management, and team-building skills.\n\tExcellent communication, interpersonal, and negotiation skills.\n\tStrong analytical and problem-solving skills.\n\tFamiliarity with microfinance banking products and services.\n\n\nSalary\nN150,000 - N250,000 Monthly. \n\nOur offering:\n\n\n\tPaid Time off\n\tCommission upon meeting target\n\t13th Month Salary\n\tHealth Insurance\n\tGroup Life Insurance.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and Application to: emdamstrategies@gmail.com using \"Application for Deposit Mobilization Manager\" as the subject of the email.\n\nNote: Only qualified candidates will be contacted.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Internal Control Officer Job at Rainoil Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/internal-control-officer-job-at-rainoil-limited-6",
    "pubDate": "Wed, 18 Jun 2025 13:30:31 GMT",
    "source": "JobGurus",
    "keyword": "rainoil limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Rainoil Limited is an integrated downstream oil and gas company. A prominent player in the Nigerian industry, the company’s operations span across the downstream value chain i.e. Petroleum Product Storage, Haulage/Distribution and Retail Sales. Our primary products include Petrol (PMS), Diesel (AGO) and Kerosene (DPK).\n\nWe are recruiting to fill the position below:\n\nJob Position: Internal Control Officer\nJob Location: Enugu\nEmployment Type: Full-time\n\nDescription\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tTo assist the Team Lead, Internal Control in promoting continuity of the Group operations by developing and implementing business control policies and operational guidelines that help to minimize exposure to potential risks and impact on business performance.\n\n\nResponsibilities\n\n\n\tImplements the Internal Control programs to ascertain and report on degree of compliance with company-approved policies and operating procedures, laws, regulations, and code of good business practices.\n\tAssists in the implementation of internal control policies and procedures to ensure compliance and promote operational efficiency & transparency.\n\tConducts audit tests and investigations as designed by the Audit Team Lead.\n\tPrepares draft audit reports for review by the Team Leads.\n\tConducts Internal Control evaluation and risk assessments to identify loopholes and areas requiring management intervention to prevent frauds, embezzlements, misappropriations, misuse, and wastage.\n\tEvaluates information security and associated risk exposures.\n\n\nRequirements\n\n\n\tMinimum of Second Class Upper in B.Sc in Accounting or any finance related course.\n\tMinimum of Four (4) years of relevant experience working in the internal audit function of a similar organization.\n\tRelevant professional certifications e.g., Institute of Internal Auditors (IIA), Institute of Chartered Accountants of Nigeria (ICAN) or Association of Certified and Chartered Accountants (ACCA), Certified Information Systems Auditor (CISA).\n\tMBA or master’s degree in any related discipline.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]