[
  {
    "title": "Social Media Executive (Female) Job at Premier Hub Innovation Center",
    "link": "https://www.jobgurus.com.ng/jobs/view/social-media-executive-female-job-at-premier-hub-innovation-center",
    "pubDate": "Wed, 04 Jun 2025 13:31:08 GMT",
    "source": "JobGurus",
    "keyword": "premier hub innovation center",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Premier Hub Innovation Center exists to fast-track innovation and enterprise in Nigeria by creating an enabling environment and empowering youths who are leveraging technology to build ideas into sustainable solutions.\n\nWe are recruiting to fill the position below:\n\nJob Position: Social Media Executive (Female)\nJob Location: Lagos\nEmployment Type: Full-time\n\nWhat You Will Do\nInternal & external communications:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tCollaborate with management to develop and implement an effective communications strategy based on our target audience.\n\tWrite, edit, and distribute content, including publications, press releases, website content, annual reports, speeches, and other marketing material that communicates the organization's activities, products and/or services.\n\tRespond to media inquiries, arrange interviews, and act as a spokesperson for the organization.\n\tEstablish and maintain effective relationships with journalists, and maintain a media database.\n\tSeek opportunities to enhance the reputation of the brand, and coordinate publicity events as required.\n\tMaintain records of media coverage and collate analytics and metrics.\n\n\nSocial Media Management:\n\n\n\tDeveloping engaging social media strategies and managing social media platforms of the organization.\n\tScheduling social media posts and engaging followers with regular company updates.\n\tCreating brand awareness to gain audience attention and responding to the comments on social media on time.\n\tCreating paid social media campaigns for advertising, monitoring social media metrics and ROI.\n\tPreparing social media engagement and activities reports.\n\n\nWhat You Will Need\n\n\n\tBachelor's Degree in Communications, Journalism, English Language or related field.\n\tMinimum of 2 years of relevant experience in a communications role.\n\tKnowledge of desktop publishing software (InDesign/Photoshop).\n\tExcellent verbal, written, and interpersonal skills.\n\tGood time management and organizational skills.\n\tIn-depth Knowledge of SEO, Social/Digital Media\n\tProficient in Microsoft Office, content management systems, and social media platforms.\n\n\nSalary\nN180,000 - N200,000 Monthly.\n\n \n\nNote\n\n\n\tShortlisted candidates will be invited to take an Online Assessment\n\tSuccessful candidates will be invited for a Virtual Chat with HR\n\tFinal Chat\n\tOffer\n\tCandidates who live in close proximity of the job location are encouraged to apply.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]