[
  {
    "title": "Head of Marketing (Real Estate Experience) Job at UnoCasa Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/head-of-marketing-real-estate-experience-job-at-unocasa-limited",
    "pubDate": "Wed, 04 Jun 2025 15:54:47 GMT",
    "source": "JobGurus",
    "keyword": "unocasa limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "UnoCasa is a full service Human Resources Consultancy business with focus on Talent Acquisition, Learning & Development and Consultancy services. Our raison d’etre is the notion that your people are your advantage and proffer people-centric solutions to ensure your team accomplish your business goals.\n\nWe are not your run of the mill HR Company, we believe in team diversity and teamwork; we believe that the workplace should have an ambience that inspires productivity of the team; and the application of technologies to enhance efficiency. We know that every business is unique and tailor HR solutions to your organisation’s needs.\n\nWe are recruiting to fill the position below:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Position: Head of Marketing (Real Estate Experience)\n\nJob Location: Ilupeju, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tThe Head of Marketing is responsible for leading the overall marketing strategy of Heritage Homes, with a strong focus on real estate campaigns, digital visibility, and on-ground lead generation.\n\tThe role oversees both in-house and field marketing activities while coordinating content creation and brand management.\n\n\nKey Responsibilities\n\n\n\tDevelop and implement strategic marketing plans for real estate products.\n\tCoordinate the efforts of the creative and field marketing teams.\n\tCollaborate with sales to ensure marketing efforts are generating qualified leads.\n\tTrack ROI on paid campaigns and lead sources.\n\tSupervise and approve digital content for Instagram, Facebook, LinkedIn, and other platforms.\n\tAnalyze real estate market trends and consumer data to adjust marketing tactics.\n\tOversee branding, advertising, and promotional campaigns.\n\tCoordinate print production, flyers, and traditional real estate promotions.\n\tLead strategy for events, expos, open house promotions, and real estate activations.\n\n\nRequirements\n\n\n\t3 - 5 years of experience in real estate marketing.\n\tStrong leadership and strategy execution capabilities.\n\tExperience managing creatives and field marketers.\n\tProficiency in digital tools like Meta Ads Manager, Canva, Mailchimp, etc.\n\tStrong written and verbal communication skills.\n\tTeam player with real estate marketing acumen.\n\n\nSalary\nN300,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to:  jobs@unocasaltd.com using the Job Position as the subject of the mail.\n\nNote: Only qualified candidates will be contacted.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Content Creator (Fashion) Job at Elvaridah Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/content-creator-fashion-job-at-elvaridah-limited",
    "pubDate": "Wed, 04 Jun 2025 15:54:47 GMT",
    "source": "JobGurus",
    "keyword": "elvaridah limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Elvaridah Limited - Our client is a contemporary lifestyle and fashion brand rooted in Nigeria’s rich textile heritage representing a bold evolution—blending tradition with modernity to deliver premium, stylish, and culturally inspired pieces for today’s fashion-forward individuals. With a commitment to quality, creativity, and craftsmanship, they offer curated collections that speak to elegance, individuality, and innovation. The brand is dedicated to providing an exceptional customer experience, from personalized styling to a seamless retail journey, positioning itself as a leading name in Nigeria’s evolving fashion and lifestyle space.\n\nWe are recruiting to fill the position below:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Position: Content Creator (Fashion)\n\nJob Location: Lagos Island, Lagos\n\nJob Summary\n\n\n\tWe are looking for a versatile and proactive Executive Assistant / Content Creator to support executive operations while developing engaging content across digital platforms.\n\tThis hybrid role is ideal for a creative thinker with strong organizational skills who can handle administrative tasks efficiently and bring the brand to life through compelling storytelling, visuals, and content strategies.\n\n\nKey Responsibilities\nExecutive Assistant Duties:\n\n\n\tManage schedules, appointments, and meetings.\n\tPrepare reports, presentations, and documents as needed\n\tHandle correspondence, emails, and calls with professionalism\n\tSupport daily operations and liaise with internal and external stakeholders\n\tMaintain confidentiality and discretion in all matters\n\n\nContent Creation Duties:\n\n\n\tDevelop and execute content strategies aligned with brand aesthetics and goals\n\tCreate high-quality visual and written content for social media, newsletters, blog posts, and website\n\tPlan and manage content calendars, ensuring timely and consistent publishing\n\tCapture behind-the-scenes content, product features, and brand campaigns\n\tCollaborate with design, marketing, and sales teams to bring campaigns to life\n\tTrack engagement metrics and suggest improvements based on analytics\n\n\nRequirements\n\n\n\tCandidates should possess a Bachelor's Degree in Communications, Marketing, Business Administration, or a related field\n\t2+ years of experience in a similar role (admin or content creation), preferably within fashion / lifestyle\n\tStrong written and verbal communication skills\n\tProficiency in Canva, Adobe Creative Suite, or other design tools\n\tFamiliarity with social media platforms (Instagram, TikTok, YouTube, etc.)\n\tStrong organizational, multitasking, and time-management skills\n\tHigh level of discretion and professionalism.\n\n\nSalary\nN120,000 / Month.\n\nMethod of Application\nInterested and qualified candidates should send their CV and Portfolio to: careers@elvaridah.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Office Secretary Job at Razley Print Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/office-secretary-job-at-razley-print-limited",
    "pubDate": "Wed, 04 Jun 2025 15:54:47 GMT",
    "source": "JobGurus",
    "keyword": "razley print limited",
    "duplicate": false,
    "classifications": [],
    "content": "Razley Print Limited, a Print media company, is recruiting to fill the position below:\n\nJob Position: Office Secretary\n\nJob Location: Abuja (FCT) \nEmployment Type: Full-time\n\nResponsibilities\n\n\n\tPerforms administrative tasks for a company.\n\tDaily duties include handling phone calls, arranging orders through vendors, restocking office supplies, and helping with document requests and filing.\n\n\nSalary\nN100,000 Monthly.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hr@razleyprints.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Sales Deposit Manager Job at Boctrust Microfinance Bank",
    "link": "https://www.jobgurus.com.ng/jobs/view/sales-deposit-manager-job-at-boctrust-microfinance-bank",
    "pubDate": "Wed, 04 Jun 2025 15:54:47 GMT",
    "source": "JobGurus",
    "keyword": "boctrust microfinance bank",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "Boctrust Microfinance Bank is a financial institution licensed by the Central Bank of Nigeria to give social and economic Support to the lower middle class, working class and the economically active poor.\n\nWe are recruiting to fill the position below:\n\nJob Position: Sales Deposit Manager\nJob Location: Lagos\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDevelop and execute strategic plans to achieve and exceed savings deposit growth targets.\n\tConduct market research and competitor analysis to identify opportunities for new savings products and service enhancements.\n\tManage and mentor a team of savings deposit officers, providing guidance, training, and performance feedback.\n\tDevelop and implement customer retention strategies to minimise attrition.\n\tImplement and monitor effective sales and marketing campaigns to attract new savings customers.\n\tEnsure compliance with all relevant regulatory requirements and internal policies related to deposit mobilisation.\n\tMaintain strong relationships with existing customers and proactively address their needs and concerns.\n\tMonitor and analyse key performance indicators (KPIs) related to savings deposits and provide regular reports to senior management.\n\tCollaborate with other departments, such as marketing, product development, and customer service, to ensure a seamless customer experience.\n\n\nQualifications\n\n\n\tBachelor's degree in Banking and Finance, Business Administration, Economics, or a related field.\n\tMinimum of 5 years of progressive experience in retail banking, with a focus on deposit mobilisation and management.\n\tProven track record of achieving and exceeding savings deposit growth targets.\n\tStrong understanding of the Nigerian financial market, regulatory landscape, and competitive environment.\n\tExcellent leadership, communication, interpersonal, and negotiation skills.\n\tDemonstrated ability to develop and implement effective sales and marketing strategies.\n\tStrong analytical and problem-solving skills.\n\tProficiency in relevant banking software such as bankone and Microsoft Office Suite.\n\tExcellent customer service orientation.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hr@boctrustmfb.com using \"Savings Deposit Manager\" as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]