[
  {
    "title": "Content Marketer Job at Pharmarun",
    "link": "https://www.jobgurus.com.ng/jobs/view/content-marketer-job-at-pharmarun",
    "pubDate": "Wed, 25 Jun 2025 10:17:39 GMT",
    "source": "JobGurus",
    "keyword": "pharmarun",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Pharmarun is an on-demand platform providing fast and easy access to medication. We do this by finding, financing and delivering medication to users.\n\nWe are recruiting to fill the position below:\n\nJob Position: Content Marketer\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe’re looking for a creative and strategic Content Marketer to lead our content efforts across platforms.\n\tSuccessful candidate will own social media management, content planning, and creative execution (including graphics, videos, and copywriting) to grow our brand presence, engage customers, and support performance marketing goals.\n\n\nKey Responsibilities\n\n\n\tDevelop and execute Pharmarun’s social media content calendar across Instagram, Twitter/X, LinkedIn, WhatsApp, TikTok, and Facebook.\n\tWrite compelling content and copy for posts, campaigns, landing pages, email newsletters, blog articles, and product features.\n\tCreate and edit short-form videos (Reels, TikToks, etc.), working with internal teams or freelancers as needed.\n\tMonitor content performance metrics, trends, and engagement to optimize reach and relevance.\n\tCollaborate with design, product, and customer service teams to ensure cohesive messaging and storytelling.\n\tSupport campaign execution for seasonal moments (e.g. Detty December, World Health Days, IWD).\n\tMaintain brand voice and editorial consistency across all touchpoints.\n\n\nRequirements\n\n\n\tInterested candidates should possess a Bachelor's Degree\n\t3+ years in content marketing, social media, or digital communications (experience in health, tech, or consumer brands is a plus).\n\tStrong copywriting and storytelling skills.\n\tExperience creating content across formats: static, carousel, video, email.\n\tProficient with tools like Canva, CapCut, Adobe Suite, or similar.\n\tA strong grasp of platform trends, digital culture, and audience engagement strategies.\n\tHighly organized, self-motivated, and able to manage multiple content pipelines at once.\n\tBonus: Basic understanding of paid ads or SEO.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Account Officer Job at  Ekiti Agro-Allied International Cargo Airport",
    "link": "https://www.jobgurus.com.ng/jobs/view/account-officer-job-at-ekiti-agro-allied-international-cargo-airport",
    "pubDate": "Wed, 25 Jun 2025 10:17:39 GMT",
    "source": "JobGurus",
    "keyword": " ekiti agro-allied international cargo airport",
    "duplicate": false,
    "classifications": [],
    "content": "The Ekiti Agro-Allied International Cargo Airport is a new airport in Ekiti State, Nigeria, designed for both cargo and passenger flights. It received approval for non-scheduled flight operations in December 2024, with the aim of boosting the state's economy and facilitating the export of agricultural products.\n\nWe are recruiting to fill the position below:\n\nJob Position: Account Officer\n\nJob Location: Ekiti\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tMaintaining the billing system\n\tGenerating invoices and account statements\n\tPerforming account reconciliations with customers\n\tDaily reconciliation of revenue generated and remittance to the Bank as applicable\n\tProficiency in the use of Microsoft Excel, ERP accounting software Skilled in regulatory tax filings.\n\n\nQualification / Job Specifications\n\n\n\tB.Sc. Accounting\n\tMinimum of 2 years of post-qualifications.\n\tICAN, or ACCA, is an added advantage\n\n\nSkills and Competence:\n\n\n\tTeamwork\n\tTime management\n\tConflict resolution\n\tGood Leadership skills.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and a certificate of Local Government of Origin to: jobs.airport@ekitistate.gov.ng using the Job Position as the subject of the mail.\n\nNote\n\n\n\tOnly qualified candidates should apply.\n\tOnly shortlisted candidates will be contacted.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Creative Manager Job at Brands Optimal Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/creative-manager-job-at-brands-optimal-limited",
    "pubDate": "Wed, 25 Jun 2025 10:17:39 GMT",
    "source": "JobGurus",
    "keyword": "brands optimal limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Brands Optimal Limited is a leading experiential marketing agency. We are one of Africa’s leading Experiential Marketing Agency which optimizes value for client through the use of strategic, reliable and measurable method in consumer engagement, loyalty seeding and sales generation.\n\nWe are recruiting to fill the position below:\n\nJob Position: Creative Manager\n\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a talented and visionary Creative Manager to join our creative team and develop groundbreaking campaigns that captivate our audiences.\n\tThe successful candidate should have a proven track record of delivering high-quality creative work, inspiring teams and collaborating with cross-functional stakeholders.\n\n\nJob Responsibilities\n\n\n\tEnsure high-quality creative work that meets the brand’s standards and guidelines.\n\tTake jobs from concept to final execution and visualization.\n\tBrainstorm with team members to develop an aesthetic and original design that best reflects the big idea across all media. i.e., prints, websites, social media pages and other marketing materials.\n\tWork with the team members to understand project objectives and deliver high-quality visuals.\n\tPresent completed ideas to both clients and sometimes team members.\n\tStay up-to-date with industry trends, technologies and best practices.\n\n\nPreferred Qualifications\n\n\n\tBachelor’s Degree in Advertising, Marketing, Fine Arts or related fields.\n\tPossessing certification(s) in the creative field is an added advantage.\n\tThe candidate must hold a 2:1 degree or higher.\n\n\nRequirements:\n\n\n\t5+ years of experience in creative management, with a focus on event production, architecture, marketing or digital media.\n\tCognise experience in the use of 3D software tools such as Blender, Premiere Pro, Maya, etc.\n\tProven track record of delivering high-quality creative work.\n\tAbility to work in a fast-paced environment and prioritize multiple projects.\n\tStrong problem-solving and analytical skills.\n\tStrong understanding of creative principles, including art direction, copywriting and design.\n\tExcellent communication, presentation, and leadership skills.\n\tATL, BTL, and TTL backgrounds are desired.\n\n\nMethod of Application\nInterested and qualified candidates should forward their Resume and Portfolio to: jobs@brandsoptimal.com using the Job Position  as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Finance Operations Business Partner Job at Max Drive",
    "link": "https://www.jobgurus.com.ng/jobs/view/finance-operations-business-partner-job-at-max-drive",
    "pubDate": "Wed, 25 Jun 2025 10:17:39 GMT",
    "source": "JobGurus",
    "keyword": "max drive",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Max Drive - We are a team of passionate people and a leading technology-enabled company driven by a vision to solve the mobility challenges in Africa. We want to get people and goods to their destinations hitch-free. It is personal for us because we understand the frustration of epileptic transportation. We are making mobility safe, affordable, accessible, and sustainable through the deployment of high-performance technologies and operators.\n\nWe are recruiting to fill the position below:\n\nJob Position: Finance Operations Business Partner\n\nJob Location: Lagos, Nigeria\nJob type: Full time (On-site)\nCategory: Finance\n\nAbout the Role\nBusiness Partnering:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tTo act as a key interface between Finance and the Growth and Expansion team.\n\tDevelop and maintain accurate knowledge and understanding of the current growth and expansion requirements – locally and internationally. Provide key updates and follow up with the deliverables.\n\tSign off and supply correct information for internal and external publication, for which accuracy and auditability are key.\n\tOperate a Finance onboarding process for new delivery partners to ensure that adequate data provision is in place and operational records are kept.\n\n\nPlanning, Budgeting & Forecasting:\n\n\n\tAgreement of cash flow forecasts and modelling assumptions with business owners, for submission to the Financial Lead for use in production of the monthly budget.\n\tAnalyze the Budget Vs Actual for the prior month, check with the Finance lead and share with the Unit Leadership.\n\tFollow up with payment processing and approval for the unit and ensure proper upload unto the ERP.\n\n\nPerformance management:\n\n\n\tReview the unit’s Profit or Loss with finance and share with the unit’s Leadership for review.\n\tProvide advice and insight to the Financial Planning function in support of that function’s efforts to improve expansion and growth’s target.\n\tUnderstand the impact of variances on the unit’s financial position in its management accounts\n\n\nReporting:\n\n\n\tProduction of regular management information for Finance, Senior Management Team and for other units as may be required.\n\tProduction of ad hoc information and analysis on Growth and Expansion.\n\n\nRequirements\nQualification and Experience:\n\n\n\tA graduate degree from a recognised university, postgraduate degree is an added advantage\n\tA minimum of 4 years of experience in accounting, finance, bookkeeping, and budgeting\n\tA chartered accountant with ACCA/ICAN or both\n\tKnowledge of ERP is compulsory; knowledge of Odoo ERP is desirable\n\tExperienced in financial interpretation and analysis\n\tPresentation skills\n\tTeachable, willingness to learn\n\n\nBenefits\nThe MAX Work Environment:\n\n\n\tDrive: We are building a team where everyone is a leader and therefore runs on internal motivation\n\tEmpathy: We have a clear understanding of the problem we are trying to solve and its impact on Africans; we are committed to providing a lasting solution.\n\tHumility: We are committed to continuous learning and improvement. We learn, unlearn, and relearn\n\tInitiative: We welcome novel ideas and encourage creativity\n\tDiligence: We take great pride in our work.\n\tCandor: We value open and honest communication\n\tCollaboration: We are a team of passionate, innovative optimists, solving challenging problems and creating an impact.\n\tBias for Technology: We automate everything\n\n\nWhat You’ll Get:\n\n\n\tCompetitive pay & benefits\n\tFlexible work and hybrid working model\n\tUnrivaled Learning and Development\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]