[
  {
    "title": "Field / Marketing Officer Job at Extramileage Consults Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/field-marketing-officer-job-at-extramileage-consults-limited-1",
    "pubDate": "Sat, 14 Jun 2025 15:14:13 GMT",
    "source": "JobGurus",
    "keyword": "extramileage consults limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Extramileage Consults Limited is a full-service Human Resource Outsourcing company servicing different companies in different states across the nation\n\nWe are recruiting to fill the position below:\n\nJob Position: Field / Marketing Officer\nJob Locations: Ajah & Marina, Lagos\n\nRequirements\n\n\n\tMinimum of National Diploma\n\tCloseness to job location is compulsory.\n\n\nExperienced Applicants:\n\n\n\tMust have previously worked in a Microfinance organization\n\tMust have a ready pool of available prospects\n\n\nEntry-Level Applicants:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tMust have a passion for marketing\n\tMust possess an ability to drive sales & convince prospects.\n\n\nSalary\nN80,000 - N150,000 Monthly. (Entry-Level Applicants: Salary: N80,000 - N100,000 Monthly / Experienced Applicants:  Salary: N120,000 - N150,000 Monthly.)\n\nMethod of Application\nInterested and qualified applicants are to send their CVs to: extramileageconsultslimited@gmail.com using \"FIELD / MARKETING OFFICER\" as the subject of the email\n\nNote: For enquiries, WhatsApp: 08037910516.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Project Engineer Job at the Advertisers",
    "link": "https://www.jobgurus.com.ng/jobs/view/project-engineer-job-at-the-advertisers",
    "pubDate": "Sat, 14 Jun 2025 15:14:13 GMT",
    "source": "JobGurus",
    "keyword": "the advertisers",
    "duplicate": false,
    "classifications": [],
    "content": "The Advertisers is a dynamic business-driven HR arm specializing in providing tailored staffing solutions for startups and other companies in need of trusted employees. With a focus on understanding the unique needs and culture of each client, The Advertisers leverages its expertise to recruit top-tier talent that aligns seamlessly with the company's goal and values.\n\nWe are recruiting to fill the position below:\n\nJob Position: Project Engineer\nJob Location: Lagos\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tProject Planning: Developing project plans, schedules, and budgets for the installation and implementation of CCTV, Access control and Alarms systems.\n\tSystem Design: Designing CCTV, Access control and Alarms systems based on client requirements, site surveys, and technical specifications.\n\tIntegration & Testing: Integrating CCTV systems with other security solutions or building management systems and conducting testing to ensure proper functionality.\n\tTroubleshooting & Maintenance: Providing technical support for troubleshooting issues with installed CCTV, Access control and Alarms systems and conducting regular maintenance to ensure optimal performance.\n\tDocumentation & Reporting: Maintaining detailed project documentation, including as-built drawings, equipment lists, test reports, and providing regular progress reports to stakeholders.\n\tCompliance & Standards: Ensuring that all installed CCTV systems comply with relevant regulations, standards, and best practices.\n\tInstallation, servicing / maintenance, testing, commissioning of Intruder Alarm Systems – IP Surveillance Systems and Access Control Systems or related equipment, follow schematic drawings and building plans in accordance with relevant Codes of Practice/Policies.\n\tProviding a quality installation in the most methodical and efficient manner, including the ability to digest detailed scope of works and working drawings.\n\tLiaising with ARC (Alarm receiving centres)\n\tProduction of high quality commissioning and handover documentation and as fit drawings.\n\tMaintaining safe work environment at all times and have a good understanding of Health and Safety i.e. Method, Risk assessments, safe working procedures etc.\n\tClient training and demonstration of systems to explain the systems working and functionality.\n\tDemonstrate a general knowledge of Security Systems - Intruder Alarms, Access control, CCTV and Intercom\n\tDemonstrate strong communication skills.\n\tSound administration skills with an understanding of the importance of paperwork and the accuracy and timeliness of submission of same.\n\n\nRequirements\n\n\n\tCandidates should possess relevant qualifications in a related field with experience.\n\n\nTechnical Competencies:\n\n\n\tDesirable Knowledge of IP Systems / Networking is preferable.\n\tKnowledge of various manufacturers equipment i.e: Paxton, Honeywell, Texecom, Bosch, Hikvision etc.\n\n\nMethod of Application\nInterested and qualified candidates should send their Application Letter and CV to: currentadvertiser@gmail.com using the Job Position \"Example: Project Engineer - Lagos State\" as the subject of the email.\n\nNote\n\n\n\tPlease be aware that only candidates residing in Lagos State will be considered for this position, as proximity to the workplace is an essential requirement.\n\tAdditionally, any candidate who provides a false address during the application process and is subsequently hired will be subject to termination if their actual location impacts their performance or ability to meet all deliverables.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Credit Control Officer Job at the Advertisers",
    "link": "https://www.jobgurus.com.ng/jobs/view/credit-control-officer-job-at-the-advertisers",
    "pubDate": "Sat, 14 Jun 2025 15:14:13 GMT",
    "source": "JobGurus",
    "keyword": "the advertisers",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "The Advertisers is a dynamic business-driven HR arm specializing in providing tailored staffing solutions for startups and other companies in need of trusted employees. With a focus on understanding the unique needs and culture of each client, The Advertisers leverages its expertise to recruit top-tier talent that aligns seamlessly with the company's goal and values.\n\nWe are recruiting to fill the position below:\n\nJob Position: Credit Control Officer\n\nJob Location: Lagos Mainland, Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe need Credit Control Officer who will handle all clients in the Island & Mainland\n\tWe're looking for a detail-oriented Credit Control Officer to manage our credit control processes.\n\tAs a Credit Control Officer, you'll be responsible for ensuring timely payments from clients, managing client credit limits, and minimizing bad debt.\n\n\nResponsibilities\n\n\n\tManage and monitor client credit accounts\n\tSend invoices and payment reminders to clients\n\tNegotiate payment plans with clients\n\tAnalyze client creditworthiness and recommend credit limits\n\tCollaborate with teams to resolve credit-related issues\n\n\nRequirements\n\n\n\tBachelor's Degree in Finance, Accounting, or related fields\n\t4 years of proven experience in credit control or similar role in a reputable company.\n\tStrong analytical and communication skills\n\tAbility to work in a fast-paced environment\n\tProficiency in accounting software (e.g., QuickBooks, SAP).\n\n\nMethod of Application\nInterested and qualified candidates should send their Application Letter and CV to: currentadvertiser@gmail.com using the Job Position as the subject of the mail.\n\nNote\n\n\n\tPlease be aware that only candidates residing in Lagos State will be considered for this position, as proximity to the workplace is an essential requirement.\n\tAdditionally, any candidate who provides a false address during the application process and is subsequently hired will be subject to termination if their actual location impacts their performance or ability to meet all deliverables.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Warehouse Officer Job at Bogo Beverages Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/warehouse-officer-job-at-bogo-beverages-limited-1",
    "pubDate": "Sat, 14 Jun 2025 15:14:13 GMT",
    "source": "JobGurus",
    "keyword": "bogo beverages limited",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "Bogo Beverage Limited is a young and dynamic total manufacturing, distribution and marketing of quality beverage company, with a strong entrepreneurial spirit and growth mindset. We are determined to dominate the beverage sector with our quality brands, apt commercial acumen and cognate experience of the Nigerian consumers and Africa.\n\nWe are recruiting to fill the position below:\n\nJob Position: Warehouse Officer\nJob Location: Ikorodu, Lagos\nEmployment Type: Full-time\nDepartment: Logistics / Supply Chain\nReports To: Supply Director\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Warehouse Officer is responsible for overseeing the daily operations of the warehouse, ensuring accurate inventory control, safe storage of goods, and efficient dispatch and receiving processes.\n\tThe role supports the smooth functioning of the supply chain by maintaining accurate records, coordinating logistics, and ensuring compliance with safety standards.\n\n\nKey Responsibilities\n\n\n\tReceive, inspect, and verify incoming goods against delivery documents.\n\tOrganize and store items in appropriate locations for easy access and retrieval.\n\tManage and update inventory records using warehouse management systems (WMS).\n\tMaintain cleanliness and orderliness in the warehouse at all times.\n\tOperate warehouse equipment such as forklifts and pallet jacks (if certified).\n\tPrepare and dispatch outgoing shipments as per schedule and order requirements.\n\tConduct regular stock counts and reconcile physical inventory with system records.\n\tMonitor warehouse layout and ensure optimal use of space.\n\tCoordinate with procurement, logistics, and other departments for timely deliveries.\n\tEnsure all warehouse activities comply with health, safety, and quality standards.\n\tReport any discrepancies, damages, or losses to management promptly.\n\n\nRequirements\n\n\n\tEducation: High school diploma or equivalent; certification in logistics or supply chain is a plus.\n\tExperience: 2+ years in a warehouse or logistics environment.\n\n\nSkills:\n\n\n\tGood knowledge of inventory and warehouse management systems.\n\tStrong attention to detail and organizational skills.\n\tAbility to work under pressure and meet deadlines.\n\tBasic computer literacy (Excel, ERP/WMS software).\n\tPhysical stamina and ability to lift heavy items when necessary.\n\tForklift operation certification (if applicable).\n\tThe candidate must be living in Lagos.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: careers.bogo@outlook.com using \"Sales Executive – Kano\" as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Facility Manager Job at OIC Partners",
    "link": "https://www.jobgurus.com.ng/jobs/view/facility-manager-job-at-oic-partners",
    "pubDate": "Sat, 14 Jun 2025 15:14:13 GMT",
    "source": "JobGurus",
    "keyword": "oic partners",
    "duplicate": false,
    "classifications": [],
    "content": "OIC Partners is a forward-thinking hospitality consultancy dedicated to providing innovative, strategic solutions that elevate service standards and operational efficiency. Specializing in luxury and high-end hospitality management, we partner with hotels, restaurants, and resorts to drive growth, enhance guest experiences, and streamline operations. With a keen eye on industry trends and a focus on personalized service, we empower businesses to not only meet but exceed customer expectations. At OIC Partners, we combine expertise, creativity, and a passion for excellence to shape the future of hospitality.\n\nWe are recruiting to fill the position below:\n\nJob Position: Facility Manager\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Location: Ota, Ogun\nEmployment Type: Full-time\n\nRequirements\n\n\n\tCandidates should possess relevant qualifications with at least 2 years of work experience. \n\n\nRemuneration\n\n\n\tSalary: N120,000 Monthly.\n\tAccommodation and feeding provided\n\tService charge after 3 months.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: unlimitedico@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]