[
  {
    "title": "Higher Executive Officer Job at Obafemi Awolowo University (OAU)",
    "link": "https://www.jobgurus.com.ng/jobs/view/higher-executive-officer-job-at-obafemi-awolowo-university-oau",
    "pubDate": "Wed, 11 Jun 2025 13:29:51 GMT",
    "source": "JobGurus",
    "keyword": "obafemi awolowo university (oau)",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "The Obafemi Awolowo University (OAU), Ife, is a first generation comprehensive public institution established in 1961 as The University of life, by the then Western Region of Nigeria. In August 1975, the Federal Government of Nigeria took over the University and in 1987 renamed after Chief Obafemi Awolowo, a frontline Nigerian Statesman and one of the University's founding fathers. The University is situated on a vast expanse of land of 11,861 hectares in Ile-Ife, Osun State, Southwest of Nigeria. The Vision of the founders of the University was to establish an institution dedicated to the promotion of learning and culture.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nApplications are invited from suitable candidates to fill the position below:\n\nJob Position: Higher Executive Officer\nJob Location: Ile-Ife, Osun\nDepartment: Registry\n\nRequirements\n\n\n\tHolder of HND in relevant fields.\n\tCandidates must possess NYSC Discharge Certificate or evidence of exemption.\n\tDigital Literacy is a must.\n\n\nSalary\nN2,051,825 - N2,800,447 / Annum (CONTISS 07).\n\n \n\nApplication Procedures\n\n\n\tClick on the link above\n\tCreate an applicant account using the \"sign-up\" button or login using the \"sign in\" button if you already have an account\n\tSubmit your application and required documents\n\tTrack your application status online.\n\n\nApplication Instruction\nCandidates should submit, via the online application portal (Link above), soft copies of their\napplication with detailed Curriculum Vitae, photocopies of credentials and supporting\ndocuments.\n\nThe CV should be presented in the following order:\n\n\n\tA.) Personal Data\n\t\n\t\tFull Name (underline Surname)\n\t\tDate of Birth\n\t\tPlace of Birth\n\t\tNationality\n\t\tState of Origin\n\t\tSenatorial District\n\t\tLocal Government Area\n\t\tPermanent Address\n\t\tContact Address\n\t\tTelephone Number\n\t\tEmail Address\n\t\tMarital Status\n\t\tNumber and Ages of Children\n\t\tName of Next of Kin\n\t\tAddress of Next of Kin\n\t\tPost Desired\n\t\tPhysical Disability / Challenge.\n\t\n\t\n\tB.) Educational Background:\n\t\n\t\tEducational Institutions Attended with Dates\n\t\tAcademic and Professional Qualifications\n\t\n\t\n\tC.) Work Experience:\n\t\n\t\tWork Experience with Full Details of Former and Present Positions\n\t\tMembership of Professional Bodies\n\t\tDistinctions and Awards\n\t\tCurrent Position and Date of Last Promotion / Appointment / Regrading\n\t\tCurrent Salary and Status / Grade Level\n\t\tImportant Learned Conferences / Workshops / Courses Attended with details of Paper\n\t\tExtra-Curricular Activities\n\t\tNames and addresses of 3 Referees (one of whom must be in the candidate’s field of study in the case of an academic position).\n\t\tProposed date of availability for duty if selected.\n\t\n\t\n\n\nNote\n\n\n\tReferees should be requested to forward their reports in PDF, with the subject heading bearing the name of the applicant, directly to the Registrar of the University at: apply-referee@oauife.edu.ng .\n\tAll enquiries should be directed to: apply-enquiry@oauife.edu.ng\n\tOnly shortlisted candidates will be contacted.\n\tOAU is an equal-opportunity employer.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Executive Assistant Job at Unified Payment Services Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/executive-assistant-job-at-unified-payment-services-limited-2",
    "pubDate": "Wed, 11 Jun 2025 13:29:51 GMT",
    "source": "JobGurus",
    "keyword": "unified payment services limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Unified Payment Services Limited is Nigeria’s premier Payments & Financial Technology company that operates as a shared infrastructure for the banking community in Nigeria and Payments Service Provider within and outside Nigeria, with a vision to be the most preferred e-payment service provider in Africa.\n\nWe are recruiting to fill the position below:\n\nJob Position: Executive Assistant\nJob Location: Victoria Island, Lagos\nEmployment Type: Contract\n\nJob objective(s)\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tTo provide administrative and executive assistance/support to the office of the Director Corporate Services.\n\n\nDuties & Responsibilities\n\n\n\tTo provide comprehensive secretarial support and assistance to the Director Corporate Services in the discharge of her duties\n\tSchedules appointments on behalf of the Director Corporate Services and ensuring that her meetings are held and records kept accordingly and agreed decisions circulated\n\tReceives and responds to correspondences\n\tManages the calendar of the Director Corporate Services\n\tPrepare memos, letters, and miscellaneous correspondence on behalf of the Director Corporate Services.\n\tLogs and distributes incoming messages to the Director Corporate Services promptly\n\tMaintains and updates files, takes down minutes of meetings when necessary.\n\tCo-ordinates conference and travel arrangements, prepares itineraries and expense reports.\n\n\nJob Requirements\nEducation:\n\n\n\tHND / Bachelor's Degree in Social Science or any other related field.\n\n\nExperience:\n\n\n\t3 years of experience in similar job role.\n\n\nKnowledge:\n\n\n\tGood knowledge of the payment industry.\n\tBusiness Management.\n\tMicrosoft Office Suite.\n\n\nSkill / Competencies:\n\n\n\tExcellent Communication and Interpersonal Skills.\n\tGood Computer Skills and Tech Savvy.\n\tHigh drive, Initiative and Motivation.\n\tAnalytical Reasoning Abilities.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: recruitment@up-ng.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Cashier Job at Precious Palm Royal Hotel",
    "link": "https://www.jobgurus.com.ng/jobs/view/cashier-job-at-precious-palm-royal-hotel-1",
    "pubDate": "Wed, 11 Jun 2025 13:29:51 GMT",
    "source": "JobGurus",
    "keyword": "precious palm royal hotel",
    "duplicate": false,
    "classifications": [],
    "content": "Precious Palm Royal Hotel - Design and comfort are perfectly combined here, because we care about your well-being - all the materials used for room decoration are environment friendly, and your individual climate control can be adjusted accurately by degree.\n\nWe are recruiting to fill the position below:\n\nJob Position: Cashier\nJob Location: Benin, Edo\nEmployment Type: Full-time\n\nDescription \n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAnswers customers’ questions as they arise\n\tReconciling cash drawers and sales receipts\n\tFacilitate return transactions\n\tCalculating and returning change for cash transactions\n\tHandles merchandise returns and exchanges\n\tIssue receipts to customers\n\tPrepares daily statement of cash\n\tOperate cash register\n\tProcess sales transactions and takes payments\n\tCalculating the cost of products or services\n\tBalancing cash\n\tKeeping checkout areas tidy and sanitized\n\tCross selling and upselling products\n\tResponding to and resolving customer complaints and concerns\n\n\nRequirements\n\n\n\tThe candidates should possess an HND or OND qualification with 5 - 10 years of work experience. \n\n\nSalary\nN60,000 - N70,000 monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV and cover letter to: Nhrecruiters@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Human Resource Business Partner Job at the Concept Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/human-resource-business-partner-job-at-the-concept-group-3",
    "pubDate": "Wed, 11 Jun 2025 13:29:51 GMT",
    "source": "JobGurus",
    "keyword": "the concept group",
    "duplicate": false,
    "classifications": [],
    "content": "The Concept Group is a holding company for companies established in 1992. Subsidiaries under the Group include: Rosabon Financial Services - Nigeria’s Leading Financial Intermediary and Equipment Leasing Company, Concept Nova - Bespoke Enterprise IT Solutions Company,Percy Aitkins - Bureau De Change.\n\nWe are recruiting to fill the position below:\n\nJob Position: Human Resource Business Partner\nJob Location: Yaba, Lagos\nEmployment Type: Full-time\n\nScope and Impact\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Human resource Business Partner will be grossly responsible for the effective staffing of the group by assessing, planning and reviewing the structure and staffing needs of individual departments and teams, constantly optimizing them to meet the business needs of the organization.\n\tThe Human Resource Business Partner (HRBP) is responsible for ensuring that all manpower requisition, recruitment policies and procedures as well as departmental structures throughout the organization fit the needs, goals, and aims of individual departments and entire organization.\n\tHe/she will understand and interpret all operations within each department and ensure that the required structures and resources are put in place to achieve set objectives. He/she will be responsible for mapping and strategizing and evaluating the manpower of the company, planning the departmental structures and ensuring all approved structures are fully optimized and functional.\n\n\nResponsibilities\n\n\n\tConsult with hiring managers to develop and execute compelling recruitment strategies and tactics to source, screen and select a highly talented and diverse workforce in an efficient, cost effective and timely manner.\n\tCarry out periodic reviews of all department’s structures to ensure they are in line with the business trend and objective\n\tDevelop and implement a progressive sourcing strategy tailored to each individual department, to increase diverse talent acquisition and retention.\n\tCreate and drive unique, innovative recruitment plans to build a continuous pipeline of applicants per available/future needs of each department, as well as maintain a healthy talent pool for replacement needs.\n\tDesign and effect standardized and well-structured succession and replacement plans to continuously meet the manpower needs of each department\n\tAnalyze the recruitment process to identify efficient and improvement opportunities and periodically provide.unit’s activity report for management.\n\tAnalyze recruitment trends and activities per department and periodically provide reports to management based on findings and recommendations .\n\tAnalyze the recruitment process to identify efficient and improvement opportunities and periodically provide unit’s activity report for management.\n\tOverseeing recruitment efforts and teams; remaining current on trends and innovative recruitment techniques in order to compete in market and within industry.\n\tAnalyzing recruitment trends for attracting the best talent through researches and leveraging on acquired data to build and expand metrics that measure effectiveness\n\tDesign competency frameworks for all new roles co- identified with line managers\n\tEnsure all compensation structures for new/vacant roles are benchmarked\n\tOversee the Talent Acquisition unit’s procedures and team members, strategizing measures and tactical approaches to improve the organization’s employment life-cycle\n\tEnsure and take charge of brand employee awareness that enhances attracting best candidates.\n\tOversee the Talent Acquisition unit’s procedures and team members, strategizing measures and tactical approaches to improve the organization’s employment life-cycle\n\tDevelop and implement a progressive sourcing strategy to increase diverse talent acquisition and retention.\n\tCreate and drive innovative recruitment method to build a continuous pipeline to reach passive job seekers and to source difficult to fill positions.\n\n\nRequirements\n\n\n\tAt least 3-5 years of post-graduation experience with cognitive experience in full life-cycle talent acquisition.\n\tA Bachelor’s degree in Human Resources Management or any other related field. Additional years of relevant experience may be substituted in lieu of degree.\n\tExcellent knowledge of MS Office - Additional qualification and recognized professional certification (e.g. CIPD, CIPM, PHRi, SPHRi) will be a plus.\n\n\nSalary\nN500,000 - N700,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: careers@conceptgroup-ng.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]