[
  {
    "title": "Job Vacancies at New Era",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancies-at-new-era",
    "pubDate": "Tue, 30 Sep 2025 11:13:08 GMT",
    "source": "JobGurus",
    "keyword": "new era",
    "duplicate": false,
    "classifications": [
      "Software Engineering"
    ],
    "content": "New Era offers cutting-edge haulage and logisticsservicesdesigned to enhance operational efficiency, reduce costs, and provide unparalleled customer experience.\n\nWe are recruiting to fill the following positions below:\n\n1.) Peronal Assistant / Legal Counsel (Male)\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Personal Assistant to the Managing Director (PA / Legal Counsel) will provide high-level administrative, organizational, and legal support to the MD.\n\tThis dual role combines executive assistance with legal advisory functions, ensuring the MD is fully supported in decision-making, business operations, and compliance with legal and regulatory frameworks.\n\n\nKey Responsibilities\n\n\n\tManage the MD’s schedule, coordinate meetings, and arrange travel and logistics.\n\tDraft, review, and manage contracts, agreements, and other official documents.\n\tHandle confidential correspondence, reports, and presentations for the MD.\n\tProvide legal advice on corporate, commercial, employment, and compliance matters.\n\tPrepare briefs, meeting notes, and follow-up action trackers for the MD.\n\tEnsure the organization complies with statutory and regulatory requirements.\n\tLiaise with internal and external stakeholders, including legal counsel, government agencies, and business partners.\n\tSupport dispute resolution and litigation processes where required.\n\tOrganize and maintain documentation, legal records, and filing systems.\n\tConduct research (legal, business, and administrative) to support the MD’s decision-making.\n\tSupport in the planning and execution of strategic initiatives, special projects, and board-level activities.\n\tMaintain a high level of discretion, professionalism, and confidentiality at all times.\n\n\nQualifications and Skills\n\n\n\tBachelor’s Degree in Law (LLB); BL qualification is required.\n\tMinimum of 3–5 years of experience in a legal role, with additional experience as a PA/Executive Assistant preferred.\n\tStrong knowledge of corporate law, contract management, and compliance.\n\tExcellent organizational, communication, and multitasking skills.\n\tProficiency in MS Office Suite (Word, Excel, PowerPoint, Outlook).\n\tHigh level of integrity, confidentiality, and attention to detail.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hr.recruitment@neweratransports.com using the Job Position as the subject of the email.\n\n \n\n \n\n2.) ICT Instructor\n\nJob Locations: Auchi, Benin - Edo and Lekki - Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tThe ICT Instructor is responsible for delivering engaging and practical lessons in Information and Communication Technology (ICT).\n\tThe role involves teaching students or trainees computer fundamentals, software applications, internet usage, and digital skills, while fostering creativity, problem-solving, and technological competence.\n\n\nKey Responsibilities\n\n\n\tDevelop and deliver ICT curriculum and lesson plans tailored to learners’ levels and needs.\n\tTeach practical and theoretical concepts in areas such as:\n\t\n\t\tComputer hardware and software\n\t\tMicrosoft Office Suite and productivity tools\n\t\tInternet, email, and digital communication\n\t\tBasic coding/programming and digital literacy\n\t\n\t\n\tConduct hands-on sessions and guide learners in projects, assignments, and assessments.\n\tEvaluate student performance through tests, assignments, and practical exercises.\n\tProvide technical support and guidance to students in using ICT tools effectively.\n\tMaintain and manage ICT equipment, computer labs, and software updates.\n\tKeep up to date with emerging technologies and incorporate them into teaching.\n\tPrepare instructional materials, manuals, and visual aids for lessons.\n\tEncourage ethical use of technology and promote online safety awareness.\n\tCollaborate with colleagues to improve teaching methods and training materials.\n\n\nRequirements\n\n\n\tBachelor’s Degree in Computer Science, Information Technology, Education, or related field.\n\tProven experience as an ICT Instructor, Teacher, or Trainer.\n\tStrong organizational and time-management abilities.\n\tProficiency in various software (like Microsoft Office), coding languages (Scratch, HTML, JavaScript), hardware troubleshooting, and network administration.\n\tExcellent presentation and communication abilities, strong organizational and leadership skills, patience, adaptability, and a passion for fostering academic excellence.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hr.recruitment@neweratransports.com using the Job Position as the subject of the email.\n\n \n\n \n\n3.) Mechanic\n\nJob Location: Lagos\n\nJob Description\n\n\n\tWe are currently seeking an experienced and talented Mechanic to join our dynamic team. In this position, you will be responsible for maintaining and repairing all machinery and vehicles.\n\tYour duties will include monitoring inventory, inspecting vehicles, and assembling machinery.\n\tTo succeed in this role, you should be physically and mentally fit and have a solid knowledge of basic mechanics, tools, service, and diagnostic equipment.\n\tOur ideal candidate will have strong attention to detail, with excellent communication and customer service skills.\n\n\nResponsibilities\n\n\n\tConduct regular maintenance on machinery, systems, and automotive vehicles.\n\tMeet with drivers to better understand their concerns and identify the issue.\n\tAssemble mechanical components according to specifications.\n\tExamine machines and oversee diagnostic tests to determine functionality problems.\n\tDesign a plan of action for all maintenance tasks and upgrades.\n\tMaintain work logs, repairs, and maintenance records.\n\tMonitor inventory and order new parts when necessary.\n\tOffer consultation on maintenance and preventative procedures to machine and vehicle users.\n\tPerform vehicle assessments and alert drivers to issues that will prohibit their vehicles from passing inspection.\n\n\nRequirements\n\n\n\tHigh School Diploma or equivalent qualification.\n\tA minimum of 2 years of experience in a similar role.\n\tCertification from a vocational school or trade school is preferred.\n\tIn-depth knowledge of vehicle diagnostic equipment and mechanical systems.\n\tStrong attention to detail with an aptitude for problem-solving.\n\tExcellent communication and customer service skills.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hr.recruitment@neweratransports.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Finance Manager Job at Mactay Consulting",
    "link": "https://www.jobgurus.com.ng/jobs/view/finance-manager-job-at-mactay-consulting",
    "pubDate": "Tue, 30 Sep 2025 11:13:08 GMT",
    "source": "JobGurus",
    "keyword": "mactay consulting",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "(function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){\n        (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),\n        m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)\n    })(window,document,'script','//www.google-analytics.com/analytics.js','ga');\n\n    ga('create', 'UA-43112273-1', 'jobgurus.com.ng');\n    ga('send', 'pageview');\n\n\n\n\n    \n        \n    Home\n    Jobs\n    Free Aptitude Test Practice\n    Employer? Post a Job\n            Register\n        Sign in\n        Contact us\n    \n\n    \n\n        \n    \n        \n\n            \n\n                \n\n                    \n                        Toggle navigation\n                        \n                        \n                        \n                    \n\n                    \n                \n            \n\n            \n                \n\n\tJobs\n\tJob Seekers\n\tAptitude Test\n\tScholarships\n\n            \n\n            \n                \n\n                                            Register\n                        Sign in\n                    \n                    Employer? Post a Job\n                \n            \n\n        \n\n    \n\n        \n        \n            \n            \n                 \n    \n                    \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n        \n     \n\n\n                            \n                    \n        \n                        CLICK HERE TO JOIN OUR WHATSAPP CHANNEL \n                    \n    \n\n    \n                                \n                    \n\n                        \n                            \n                        \n\n                        \n                            \n                                Any Specialization\n                                                                    Accounting / Audit / Finance\n                                                                    Administration/ Office/ Operations\n                                                                    Advertising/ Social Media/ Marketing/ PR\n                                                                    Agriculture / Agro Allied\n                                                                    Analyst/ Quality Control\n                                                                    Automotive/ Car Services\n                                                                    Aviation / Airline\n                                                                    Banking / Insurance\n                                                                    Building Design / Architecture\n                                                                    Construction / Mining\n                                                                    Consulting / Business Strategy/ Planning\n                                                                    Craftsmen / Artisans\n                                                                    Creatives (Arts, Design, Fashion)\n                                                                    Customer Service\n                                                                    Domestic / Janitorial Services\n                                                                    Driving / Haulage\n                                                                    Education / Teaching / Training\n                                                                    Engineering / Technical\n                                                                    Executive / Management\n                                                                    Freelance / Data Entry\n                                                                    Government Agencies / Public Sector\n                                                                    Graduates / Freshers\n                                                                    Grants /  Scholarships\n                                                                    Hospitality / Food Services\n                                                                    HSE / Safety Management\n                                                                    Human Resources / Recruitment\n                                                                    Information Technology / ICT\n                                                                    Internship/ Industrial Training\n                                                                    Legal / Law\n                                                                    Logistics / Transportation/ Supply\n                                                                    Manufacturing / Production\n                                                                    Maritime Services / Shipping\n                                                                    Media / Art / Entertainment\n                                                                    Medical/ Healthcare / Pharmaceutical\n                                                                    Military / Para-Military\n                                                                    NGO / Community Services\n                                                                    Oil & Gas / Energy\n                                                                    Procurement/ Purchasing\n                                                                    Project Management\n                                                                    Real Estate / Property / Surveying\n                                                                    Research / Survey\n                                                                    Risk Management / Compliance\n                                                                    Sales / Business Development\n                                                                    Secretarial / PA\n                                                                    Security / Intelligence\n                                                                    Software/ Programming / Web development\n                                                                    Sports / Fitness\n                                                                    Supply Chain/ Store\n                                                                    Technicians\n                                                                    Telecommunications\n                                                                    Tourism / Travels\n                                                                    Vocational Trade and Services\n                                                            \n                        \n\n                        \n                            \n                                Any Work Level\n                                                                    Entry Level (Trainee)\n                                                                    Executive (Director, Head of Dept)\n                                                                    Experienced (Non-Manager)\n                                                                    Internship\n                                                                    Manager (Staff Supervisor)\n                                                                    Senior Executive (MD, CEO, COO)\n                                                                    Vocational (Skilled/Unskilled Labour)\n                                                            \n                        \n\n                        \n                            \n                                 Search\n                            \n                        \n                    \n                \n                            \n            \n\n\n\n\n\n\n            \n\n                \n                                        \n                    \n                                        \n                    \n                    \n\n                    \n                        \n                        \n\n{\n  \"@context\": \"https://schema.org\",\n  \"@type\": \"JobPosting\",\n  \"title\": \"Finance Manager\",\n  \"description\": \"Mactay Consulting is the leading management consulting firm in Nigeria, providing HR Consulting, Learning &amp;amp; Development Solutions, Outsourcing and Contact Centre Solutions.\n\nWe are recruiting to fill the position below:\n\nJob Position: Finance Manager\n\nJob Location:&amp;nbsp;Lagos&amp;nbsp;\nEmployment Type: Full-time\nIndustry: FMCG\n\nJob Summary\n\n\n\tThe Finance and Operations Manager is a trusted partner to the General Manager (GM), tasked with the responsibility of overseeing the organization&amp;rsquo;s financial health by managing, controlling, and planning financial processes like budgeting, financial reporting, risk management, and advising senior management on financial strategy. And ensure compliance with financial regulations and contribute to the overall financial stability and success of the company.\n\n\nResponsibilities\nFinance Control:\n\n\n\tEnsure that local Legal Entity&amp;rsquo;s business transactions are recorded in accordance with both local and international financial and tax standards &amp;ndash; as well as the organization&amp;rsquo;s policies and guidelines.\n\tEnsure timely production of local Financial Statements and Tax Returns in accordance with prevailing standards.\n\tBuild and maintain relationships with external stakeholders (banks, insurance companies, government bodies, auditors, advisers, lawyers, business services providers).\n\tEnsure timely preparation and submission of Group reporting in accordance with IFRS.\n\tCash Management &amp;ndash; Review, Processing, Payment of local accounts payables.\n\n\nRisk Management and Controls:\n\n\n\tMonitor operating procedures and controls to protect the company&amp;rsquo;s physical and financial assets, people, and reputation.\n\tProvide full transparency over control designs and effectiveness (&amp;ldquo;Erica&amp;rdquo;).\n\tTimely report issues, if any, to GM &amp;amp; MEA FD. Design and implement corrective actions.\n\tCoordinate internal and external audits / reviews.\n\tWarrant the effective and timely implementation of action plans arising from audits and internal control reviews.\n\n\nA&amp;amp;P + Funds to the Trade:\n\n\n\tPrepare monthly reporting file to analyze and control invoices received from distributors.\n\tFollow up A&amp;amp;P budgets vs Actual and organize monthly meetings to empower marketing and&amp;nbsp;market managers in building brand value and business growth.\n\tCoordinate POSM follow-up on budget side as well as supply chain.\n\tIdentify risks &amp;amp; opportunities to optimize spending and forecasting.\n\tPrepare monthly and end-of-year accruals and manage invoices in coordination with accounting department of the group.\n\n\nOverhead Costs\n\n\n\tLead OVH forecast processes (initial budget, revisions &amp;amp; landings) in coordination with HR, Market Managers and GM according the organization&amp;rsquo;s guidelines.\n\tBuild monthly analyses by nature and cost center to ensure full understanding of variances in labor cost, travel expense and other overheads.\n\tPrepare quarterly and annual OVH report by department and nature.\n\tProvide monthly follow-up of T&amp;amp;E to be shared with each employee.\n\tPrepare monthly and end-of-year accruals in coordination with the accounting department of the group.\n\tIdentify risks &amp;amp; opportunities to optimize spending and forecasting.\n\n\nAdministration:\n\n\n\tNAFDAC: Manage and Maintain Repository of all NAFDAC Certificates and work closely with external Agency for prompt renewal or registration of new certificates were required.\n\tIT Application: Manage and Maintain Repository of IT Tools working with Global, Regional and Local IT Consultants.\n\tWork With Local Distributor to ensure adequate records of POSM and FoC inventories.\n\tMaintain Repository of Contracts with all Partners and Stakeholders.\n\n\nRequirements\n\n\n\tMinimum of 5 years of experience in business controlling and/or finance, preferably in FMCG industry.\n\tStrong financial planning and analysis skills.\n\tExperience in generating process documentation and reports.\n\tFluency in French language is a plus\n\tGood business understanding and experience working in a team-oriented, collaborative environment.\n\tStrong knowledge of Excel (macro, programming), PowerPoint, multi-dimensional tools (ESSBASE, EOS, Microsoft database type) are necessary.\n\n\nSalary\nNegotiable.\n\nMethod of Application\nInterested and qualified candidates should send their CV to:&amp;nbsp;recruitment@mactay.com&amp;nbsp;using the Job Position as the subject of the email.\",\n  \"datePosted\": \"2025-09-30\",\n  \"validThrough\": \"2025-10-15\",\n  \"employmentType\": \"Full-Time\",\n  \"hiringOrganization\": {\n    \"@type\": \"Organization\",\n    \"name\": \"MacTay Consulting\"\n    \n  },\n  \"jobLocation\": {\n    \"@type\": \"Place\",\n    \"address\": {\n      \"@type\": \"PostalAddress\",\n       \"postalCode\": \". \",\n       \"addressRegion\": \". \",\n       \"streetAddress\": \". \",\n      \"addressLocality\": \"Lagos\",\n      \"addressCountry\": \"NG\"\n     \n      \n    }\n  },\n  \"identifier\": {\n    \"@type\": \"PropertyValue\",\n    \"name\": \"\",\n    \"value\": \"188102\"\n  },\n  \"baseSalary\": {\n    \"@type\": \"MonetaryAmount\",\n    \"currency\": \"NGN\",\n    \"value\": {\n      \"@type\": \"QuantitativeValue\",\n      \"minValue\": 0,\n      \"maxValue\": 0,\n      \"unitText\": \"MONTH\"\n    }\n  }\n}\n\n\n\nFinance Manager Job at Mactay Consulting\n\n\n\n\n        \n    \n\n        \n        Mactay Consulting is the leading management consulting firm in Nigeria, providing HR Consulting, Learning & Development Solutions, Outsourcing and Contact Centre Solutions.\n\nWe are recruiting to fill the position below:\n\nJob Position: Finance Manager\n\nJob Location: Lagos \nEmployment Type: Full-time\nIndustry: FMCG\n\nJob Summary\n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Finance and Operations Manager is a trusted partner to the General Manager (GM), tasked with the responsibility of overseeing the organization’s financial health by managing, controlling, and planning financial processes like budgeting, financial reporting, risk management, and advising senior management on financial strategy. And ensure compliance with financial regulations and contribute to the overall financial stability and success of the company.\n\n\nResponsibilities\nFinance Control:\n\n\n\tEnsure that local Legal Entity’s business transactions are recorded in accordance with both local and international financial and tax standards – as well as the organization’s policies and guidelines.\n\tEnsure timely production of local Financial Statements and Tax Returns in accordance with prevailing standards.\n\tBuild and maintain relationships with external stakeholders (banks, insurance companies, government bodies, auditors, advisers, lawyers, business services providers).\n\tEnsure timely preparation and submission of Group reporting in accordance with IFRS.\n\tCash Management – Review, Processing, Payment of local accounts payables.\n\n\nRisk Management and Controls:\n\n\n\tMonitor operating procedures and controls to protect the company’s physical and financial assets, people, and reputation.\n\tProvide full transparency over control designs and effectiveness (“Erica”).\n\tTimely report issues, if any, to GM & MEA FD. Design and implement corrective actions.\n\tCoordinate internal and external audits / reviews.\n\tWarrant the effective and timely implementation of action plans arising from audits and internal control reviews.\n\n\nA&P + Funds to the Trade:\n\n\n\tPrepare monthly reporting file to analyze and control invoices received from distributors.\n\tFollow up A&P budgets vs Actual and organize monthly meetings to empower marketing and market managers in building brand value and business growth.\n\tCoordinate POSM follow-up on budget side as well as supply chain.\n\tIdentify risks & opportunities to optimize spending and forecasting.\n\tPrepare monthly and end-of-year accruals and manage invoices in coordination with accounting department of the group.\n\n\nOverhead Costs\n\n\n\tLead OVH forecast processes (initial budget, revisions & landings) in coordination with HR, Market Managers and GM according the organization’s guidelines.\n\tBuild monthly analyses by nature and cost center to ensure full understanding of variances in labor cost, travel expense and other overheads.\n\tPrepare quarterly and annual OVH report by department and nature.\n\tProvide monthly follow-up of T&E to be shared with each employee.\n\tPrepare monthly and end-of-year accruals in coordination with the accounting department of the group.\n\tIdentify risks & opportunities to optimize spending and forecasting.\n\n\nAdministration:\n\n\n\tNAFDAC: Manage and Maintain Repository of all NAFDAC Certificates and work closely with external Agency for prompt renewal or registration of new certificates were required.\n\tIT Application: Manage and Maintain Repository of IT Tools working with Global, Regional and Local IT Consultants.\n\tWork With Local Distributor to ensure adequate records of POSM and FoC inventories.\n\tMaintain Repository of Contracts with all Partners and Stakeholders.\n\n\nRequirements\n\n\n\tMinimum of 5 years of experience in business controlling and/or finance, preferably in FMCG industry.\n\tStrong financial planning and analysis skills.\n\tExperience in generating process documentation and reports.\n\tFluency in French language is a plus\n\tGood business understanding and experience working in a team-oriented, collaborative environment.\n\tStrong knowledge of Excel (macro, programming), PowerPoint, multi-dimensional tools (ESSBASE, EOS, Microsoft database type) are necessary.\n\n\nSalary\nNegotiable.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: recruitment@mactay.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n\n\n\n        \n        \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n   \n\n\n    \n        Similar Jobs\n    \n\n    \n        \n                        Front Desk Officer Job at the Changeroom\n                        Accountant Job at Alaba Shonibare & Co.\n                        Finance Officer Job at Vaste Finance\n                        Risk Management and Finance Officer Job at TopHire Africa\n                        Experienced Accounts Assistant Job at Smartrecruitmentnow\n                        Job Vacancies at Trusted Choice Assets Limited\n                        Job Vacancies at Ankor Pointe Integrated Limited\n                        Accountant Job at Lington & Bernie Consulting Limited\n                        Banking and Finance Officer (Female) Job at Global HR Always\n                        Job Openings at Zhuli Recruiters\n                    \n    \n\n\n\n                        \n                    \n\n                    \n                        \n\n\n\n    \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n\n\n\n\n\n          \n\n\n    \n\n        Hottest Jobs\n\n        \n        \n            \n\n                Job Openings at De Royal Drinkables and Refreshments Limited\n\n               \n            \n        \n            \n\n                Job Openings at Fiphs Infrastructure Limited\n\n               \n            \n        \n            \n\n                Job Vacancies at Honour Flow Group of Companies\n\n               \n            \n        \n            \n\n                Job Openings at Westfield Consulting\n\n               \n            \n        \n            \n\n                Job Openings at Caring Habitat\n\n               \n            \n        \n            \n\n                Senior Civil Engineer Job at Sales People Nigeria Limited\n\n               \n            \n        \n            \n\n                Job Vacancies at Oando Plc\n\n               \n            \n        \n            \n\n                Job Vacancies at Atis Limited\n\n               \n            \n        \n            \n\n                Job Openings at Mai Shayi Coffe Roasters\n\n               \n            \n        \n            \n\n                Job Openings at DMOT Enterprises\n\n               \n            \n        \n        \n\n    \n\n\n\n\n        \n        \n   \n\n\n                    \n                            \n            \n        \n        \n        \n\n        \n\n    \n\n        \n\n            \n\n                \n\n                    Job Seekers\n\n                    \n\n                        Search for Jobs\n                         Featured Jobs\n                         Jobs by Specialization\n                         Jobs by Industry\n                         Jobs by Location\n                         \n                        Companies Currently Hiring\n\n                        Upload CV\n\n                        Free Aptitude Test Practice\n                        \n                        Scholarships and Financial Aid\n\n                        Testimonies\n                    \n\n                \n\n                \n\n                    Employers\n\n                    \n\n                        Post A Job\n\n                        Search Resumes/Profiles\n\n                        Create Employer Account\n\n                        Advertise\n\n                        Pricing\n\n                    \n\n                \n\n                \n\n                    Tools & Resources\n\n                    \n\n                        Contact us\n                        \n                        Our Blog\n\n                        Job XML/RSS Feeds\n \n                        Free Aptitude Test Practice\n\n                        Bank Details\n\n                        FAQ & Support\n\n                    \n\n                \n\n                \n\n                    Connect with us\n\n                    \n\n                        \n\n                            \n\n                            \n\n                        \n\n                        \n\n                            \n\n                            \n\n                        \n\n                \n\n                        \n\n                            \n\n                            \n\n                        \n\n                    \n\n\n\n                    \n\n                        Customer Care\n\n                        09134259221 \n\n                        (9am - 5pm) weekdays\n\n                         info [at] jobgurus.com.ng\n\n                    \n\n\n\n                \n\n            \n\n        \n\n    \n\n\n\n    \n\n        \n\n\n\n            \n\n                Privacy Policy\n\n                Terms & Conditions\n\n                Sitemap\n                \n                About us\n\n            \n\n\n\n            Copyright © 2025 Jobgurus.com.ng - Latest Jobs in Nigeria 2025. All right reserved.",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]