[
  {
    "title": "Secretary (Female) Job at BuildSpace Technology Hub",
    "link": "https://www.jobgurus.com.ng/jobs/view/secretary-female-job-at-buildspace-technology-hub-1",
    "pubDate": "Fri, 20 Jun 2025 11:38:10 GMT",
    "source": "JobGurus",
    "keyword": "buildspace technology hub",
    "duplicate": false,
    "classifications": [],
    "content": "BuildSpace Technology Hub - We are an innovative tech company based in Makurdi, Benue State, focused on delivering digital solutions that drive business growth and efficiency.\n\nWe are recruiting to fill the position below:\n\nJob Position: Secretary (Female)\n\nJob Location: Makurdi, Benue\nEmployment Type: Full-time\nIndustry: Technology / IT Services\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are an innovative tech company based in Makurdi, Benue State, focused on delivering digital solutions that drive business growth and efficiency.\n\tAs we expand our operations, we are looking for a female Secretary to join our team and support our day-to-day administrative and project coordination activities.\n\n\nJob Summary\n\n\n\tThe ideal candidate will be responsible for providing administrative support, managing communication, and assisting in project-related tasks as needed.\n\tThe candidate must be proactive, detail-oriented, well-organized, and able to multitask in a dynamic tech environment.\n\n\nKey Responsibilities\nAdministrative Support:\n\n\n\tManage daily office operations and provide clerical and administrative assistance to the team.\n\tSchedule meetings, appointments, and travel arrangements.\n\tPrepare and manage correspondence, reports, presentations, and other documents.\n\tMaintain efficient and organized filing systems, both physical and electronic.\n\tHandle incoming calls, emails, and office inquiries professionally.\n\n\nProject Execution Support:\n\n\n\tAssist in the coordination and execution of projects as assigned by supervisors or project leads.\n\tTrack the progress of tasks and ensure timely completion of assigned responsibilities.\n\tParticipate in project meetings and document action items, decisions, and timelines.\n\tCollaborate with team members to meet project objectives and deadlines.\n\n\nTask Accountability & Communication:\n\n\n\tEnsure all assigned tasks are completed accurately and on time.\n\tMaintain clear and consistent communication with supervisors and team members.\n\tPromptly report any challenges, roadblocks, or delays that may affect task delivery.\n\tFollow up with relevant stakeholders to ensure continuous task progression.\n\n\nExternal Representation:\n\n\n\tVisit other companies, agencies, or partners on behalf of the company when required.\n\tDeliver documents, attend external meetings, and represent the company professionally.\n\tBuild and maintain positive relationships with external contacts as assigned.\n\n\nAdditional Duties:\n\n\n\tCarry out any other responsibilities as assigned by the supervisor or management.\n\tSupport various teams with ad hoc administrative or project-related tasks as needed.\n\n\nRequirements\n\n\n\tMinimum of OND or equivalent; a degree in Office Management, Administration, or a related field is an advantage.\n\tMust be female and reside within or very close to Lobi Quarters, Makurdi.\n\tStrong written and verbal communication skills.\n\tProficiency in Microsoft Office and Google Workspace tools.\n\tAbility to prioritize tasks and work with minimal supervision.\n\tProfessional demeanor and good interpersonal skills.\n\tPrevious experience as a secretary or administrative assistant is an added advantage.\n\n\nWhat We Offer\n\n\n\tMonthly salary ranging from N50,000 to N77,000, based on experience and performance.\n\tA dynamic work environment in the tech industry.\n\tOpportunity for career growth and skills development.\n\n\nMethod of Application\nInterested and qualified candidates should send their Resume and Cover Letter to: talent.hunt1@yahoo.com using “Application for Female Secretary – Makurdi\" as the subject of the mail.\n\nNote: Only candidates residing within or around Lobi Quarters, Makurdi will be considered.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Social Media Manager Job at Victoriasid Travels and Tours",
    "link": "https://www.jobgurus.com.ng/jobs/view/social-media-manager-job-at-victoriasid-travels-and-tours",
    "pubDate": "Fri, 20 Jun 2025 11:38:10 GMT",
    "source": "JobGurus",
    "keyword": "victoriasid travels and tours",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Victoriasid Travels and Tours is a leading travel and tours company committed to providing seamless and budget-friendly travel experiences. Our services include expertly curated travel packages, visa processing, second passport acquisition, and citizenship programs. Whether for leisure, business, or relocation, we ensure hassle-free solutions tailored our clients needs.\n\nWe are recruiting to fill the position below:\n\nJob Position: Social Media Manager\nJob Location: Kado, Abuja (Hybrid, 2-3 days onsite weekly)\n\nAbout the Role\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are looking for a creative, smart, and dedicated Social Media Manager to join our team.\n\tThe ideal candidate will be responsible for managing our social media presence across Instagram, Facebook, and TikTok, with a focus on promoting travel-related content.\n\tThis is a hybrid position, with onsite presence required 2–3 times a week for content creation, team collaboration, and performance reporting.\n\n\nKey Responsibilities\n\n\n\tManage and grow our presence across Instagram, Facebook, and TikTok\n\tDevelop,Design, schedule, and publish engaging travel content\n\tCollaborate with the team on content strategy and campaign planning\n\tMonitor analytics and provide regular reports on performance\n\tEdit and produce short-form videos and reels for social media\n\tStay up-to-date with the latest social media trends, tools, and best practices\n\tRespond to DMs, comments, and inquiries promptly and professionally\n\tRepresent the brand positively and professionally across all platforms\n\n\nRequirements\n\n\n\tMust be presentable, tech-savvy, and camera-friendly\n\tStrong understanding of content creation, page growth, and community engagement\n\tProficient in basic video editing tools and mobile editing apps\n\tFamiliarity with travel content, trends, and destinations\n\tMust not have too many other engagements – dedication is key\n\tAbility to work independently and meet deadlines\n\tMust be available for immediate employment\n\tAge Requirement: Must be below 25 years old\n\n\nPreferred Qualifications:\n\n\n\tPrevious experience managing social media for a travel agency is a strong plus\n\tPrior success creating viral or highly engaging social media content\n\tFamiliarity with using Canva, Inshot, Capcut and other design and editing tools.\n\tKnowledge of analytics tools like Meta Business Suite, TikTok Analytics, etc.\n\n\nWork Schedule:\n\n\n\tHybrid role: Report to the office 2–3 times per week\n\tRemote tasks to be handled independently with check-ins\n\n\nNote: Send your CV, Portfolio, links to social media pages you've managed, and a short cover note explaining why you're a good fit via the above link.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Vacancies at MBIS International",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancies-at-mbis-international-2",
    "pubDate": "Fri, 20 Jun 2025 11:38:10 GMT",
    "source": "JobGurus",
    "keyword": "mbis international",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "MBIS International, a reputable Nursery and Primary education, is recruiting suitably qualified candidates to fill the following positions below:\n\nWe are recruiting to fill the following positions below:\n\n1.) Experienced Female School Receptionist\n\nJob Location: Ibadan, Oyo\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are a prestigious school dedicated to academic excellence and holistic development of our pupils.\n\tAs we continue to expand, we are seeking a highly skilled, effective, and proficient receptionist with an effervescent personality someone who is naturally happy, involved, and articulate  to join our dynamic nursery and primary school.\n\tOur expectations are very high, and we are unapologetically focused on excellent oral and written communication within our school community.\n\tAs our receptionist, you will be the first point of call for visitors to the school, parents, staff and children.\n\tAs the ‘face’ of the school, you will be welcoming, personable, and helpful; being able to represent us in a professional and friendly manner.\n\tIn addition, it is essential that you are organised, be able to multi-task, work flexibly and have a ‘can do’ approach to work, as no two days are the same.\n\tIf you are passionate about education, have a strong administrative background, and are ready to take on a multifaceted role, we would love to hear from you!\n\n\nKey Responsibilities\n\n\n\tServe as the first point of contact for parents, staff, and visitors, ensuring a warm and professional welcome.\n\tManage front desk operations efficiently in a fast-paced school environment.\n\tHandle phone calls, emails, and correspondence with utmost professionalism and accuracy.\n\tRespond to phone and walk-in school enquiries, ensuring timely and helpful assistance.\n\tMaintain organised and detailed records, ensuring smooth administrative processes.\n\tTake initiative in problem-solving and supporting the school’s operational needs.\n\tCoordinate appointments, meetings, and school events effectively\n\n\nAdministrative:\n\n\n\tPrinting of all learning resources, workbooks, assessments, timetables and calendars\n\tAssisting with the production of school publications; collating, printing of timetables, examination scripts, collation of marks and printing of school reports\n\tAssisting with basic accounting functions, such as cross-checking produced school bills, circulating, processing and reconciling all fee payments\n\tEnsuring that all after school enrichment programmes are running smoothly and in line with safeguarding procedures\n\tDiary management of all school meetings and events\n\tProcessing medication and incident report forms in collaboration with the welfare officer\n\tParticipating in school meetings, parent information day and parent-teacher conferences\n\tActively involved in public relations and marketing activities; including daily social media postings on our social media platforms.\n\n\nRequirements\n\n\n\tMust live within commuting distance of Jericho, Ibadan.\n\tA Bachelor’s degree in Education or Management\n\tA minimum of 3 years sustained post-graduation experience in administration within an educational environment.\n\tProven experience as a receptionist or administrative professional in a high-standard organisation; preferably a school.\n\tExceptional attention to detail, organisation, and ability to multitask.\n\tOutstanding verbal and written communication skills.\n\tProficiency in Microsoft Office Suite and administrative tools\n\tA proactive problem-solver who is resourceful, positive, and enthusiastic.\n\tStrong interpersonal skills and a calm, professional approach.\n\tFlexible and adaptable in a fast-paced environment.\n\tAbility to work independently and as part of a team in a demanding and high-expectation environment.\n\tA naturally effervescent personality that reflects a happy, involved, and articulate nature\n\tAbility to cope with periods of pressure and meet deadlines\n\tA high level of professionalism and a smart appearance.\n\n\nApplication Closing Date: 15th July, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their recent full-length photograph, along with their cover letter and CV (detailing how they meet the above requirements): eyfsrecruitment@gmail.com using the Job Position as the subject of the mail.\n\nNote: If you meet these high standards and are ready to make a meaningful impact in our school community, we would love to hear from you!.\n\n \n\n2.) Academic Corordinator\n\nJob Location: Ibadan, Oyo\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe are seeking a dedicated, highly organised, and ethically grounded Academic Coordinator to lead and supervise the academic arm of our Nursery and Primary School.\n\tThis role is pivotal to ensuring teaching quality, curriculum fidelity, assessment integrity, and learner progress.\n\tIf you are passionate about education, can mentor teachers, unafraid to uphold high standards and step in when necessary to maintain continuity in instruction, this leadership opportunity is for you.\n\n\nAbout the Role\n\n\n\tAs Academic Coordinator, you will oversee all aspects of teaching and assessment. You will be responsible for ensuring consistent, high-quality lesson delivery, using the school’s structured British curriculum materials.\n\tYou will also be expected to provide instructional support and guidance to teachers, and when needed, step into the classroom to cover lessons and ensure no learning time is lost.\n\tThis is not just a supervisory role — it is an active, hands-on leadership position that requires deep engagement with daily teaching and learning.\n\n\nCore Responsibilities\nYour day-to-day tasks will include:\nInstructional Oversight & Support:\n\n\n\tCoordinate and supervise daily teaching activities in all Nursery and Primary classes\n\tConduct lesson observations to confirm alignment with the school-provided curriculum materials and provide professional feedback to staff\n\tProvide on-the-ground support to teachers during instructional hours\n\tStep into the classroom to cover lessons when a teacher is absent or unavailable\n\tMentor teachers on instructional techniques, marking consistency, and professional conduct\n\n\nAssessment & Reporting:\n\n\n\tEnsure timely and accurate administration and marking of all school-based assessments\n\tTrack teacher performance, learner progress, and marking standards\n\tSupport the preparation and timely submission of pupil progress reports\n\tEnsure all pupil reports are accurate, comprehensive, and submitted on time\n\n\nCurriculum & Academic Planning;\n\n\n\tCollaborate with the school’s Curriculum Director on curriculum execution and academic performance goals\n\tLiaise with school leadership on curriculum reviews, learner needs, and staffing gaps\n\n\nStaff Development & Coordination:\n\n\n\tContribute to teacher recruitment, onboarding, and development\n\tAttend academic meetings, training sessions, and instructional reviews\n\n\nMinimum Requirements\nApplicants must meet all of the following criteria:\n\n\n\tBachelor’s degree in Education (B.Ed); a PGDE is a plus\n\tMinimum of 3 years of experience in an academic leadership or supervisory role\n\tStrong background in primary-level instruction within a structured school system\n\tTRCN certification is highly desirable\n\tExceptional written and spoken English communication skills\n\tHighly proficient in: Microsoft Word, Excel, PowerPoint, and email communication\n\tStrong understanding of lesson planning, curriculum alignment, assessment cycles, and pupil tracking\n\tProven ability to mentor teachers and enforce academic standards\n\tHigh standards of professionalism, consistency and ethical conduct\n\n\nWhat We’re Looking For:\n\n\n\tThis role goes beyond administration—it is hands-on instructional leadership at its core. We’re seeking a confident, proactive leader who is deeply committed to academic excellence, consistent standards, and continuous school improvement.\n\n\nThe ideal candidate will:\n\n\n\tHave a clear vision for academic excellence and consistency, and work daily to uphold it across all classes\n\tBe fully present, hands-on, and engaged in daily teaching and learning practices\n\tLead by example, demonstrating high-quality teaching, strong work ethic, and professional integrity\n\tMentor and manage teaching staff with both firmness and support, fostering growth while holding everyone to non-negotiable standards\n\tInspire teachers while confidently challenging mediocrity and addressing underperformance\n\tBe passionate about curriculum integrity, learner progress, and assessment accountability\n\tWork practically and proactively to improve classroom practice and ensure learners are always progressing\n\tOperate with fairness, discretion, and strong ethical judgment in all decisions and interactions\n\tBe committed to the school’s academic mission, ready to solve problems and drive improvement daily.\n\n\nApplication Closing Date: 15th July, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV, Cover letter describing their leadership experience and approach (Optional but encouraged), Any performance tracking samples, teacher feedback samples, or academic plans they have developed to: eyfsrecruitment@gmail.com using \"Application for Academic Coordinator Position\" as the subject of the mail.\n\nPlease Note\n\n\n\tOnly candidates with a proven track record in academic leadership, curriculum supervision, and teacher management will be considered.\n\tThis is a role for someone who leads by example, takes full ownership, and is committed to doing the work properly every day.\n\tIf you are not prepared to model the standards you expect from others — including stepping into classrooms when necessary — please do not apply.\n\n\n \n\n3.) Female Primary Teacher\n\nJob Location: Jericho - Ibadan, Oyo\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe are looking to appoint creative, responsible, and enthusiastic Primary Teachers to join our growing team.\n\tIf you are an experienced educator with a growth mindset, a love for learning, and a passion for working with young pupils, then our children need you!\n\tOur school delivers a structured British curriculum, and we provide complete lesson plans, PowerPoints, and assessments to support your teaching.\n\tWe seek candidates who are committed to excellence, ethical in practice, and dedicated to learner progress.\n\n\nWhat We Provide\n\n\n\tComplete lesson plans, slides, and assessments\n\tCurriculum-aligned teaching resources\n\tSupportive training and regular staff development\n\n\nKey Responsibilities\n\n\n\tDeliver all lessons using the school’s provided materials\n\tMark all assigned pupil work promptly and professionally\n\tAdminister assessments according to school guidelines\n\tMaintain a clean, organised, and engaging classroom environment\n\tProvide constructive written feedback in pupils’ books and communicate effectively with parents\n\tWork professionally under the direction of the Curriculum Director.\n\n\nEssential Requirements\nFor your application to be considered, you must meet all of the following criteria:\n\n\n\tFemale applicants only\n\tMinimum of 3 years of post-graduation experience teaching in a structured school setting\n\tTRCN certification is mandatory\n\tMust be a resident in Ibadan and live within a reasonable commuting distance of Jericho, Ibadan\n\tB.Ed in Primary Education Studies or B.Sc. with PGDE from a reputable institution\n\tStrong classroom management and excellent teaching skills in core subjects: English, Mathematics, and Science\n\tAble to teach a broad range of primary subjects\n\tConfident use of Microsoft Word, Excel, PowerPoint, and email\n\tAbility to adopt the school’s handwriting scheme and write legibly\n\tExcellent written and spoken English language skills\n\tStrong organisational skills and ability to maintain high-standard classroom displays\n\tHigh expectations for pupil behaviour, progress, and attainment\n\tSound knowledge of learner tracking, assessment, and feedback\n\tStrong understanding of safeguarding practices in educational environments\n\tHave thorough understanding of best practices in teaching\n\tWillingness to use only school-provided lesson materials (no personal schemes)\n\n\nApplication Closing Date: 30th June, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV, cover letter, and a brief lesson plan (in Mathematics or English) to: eyfsrecruitment@gmail.com using \"Application for Primary Teaching Position\" as the subject of the mail.\n\nImportant Interview Points to Note:\nThis role is not for candidates seeking to cut corners or avoid accountability. Applicants will be tested during the interview on:\n\n\n\tMarking standards\n\tClassroom management\n\tProfessional ethics and responsibility.\n\n\nNote\n\n\n\tYour cover letter and CV must clearly demonstrate your recent, relevant primary teaching experience.\n\tApplications that do not meet the listed requirements will not be considered.\n\tOnly honest, hardworking, and ethical teachers will be considered. If you are not prepared to meet these expectations, please do not apply.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Openings at Cavista",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-cavista-4",
    "pubDate": "Fri, 20 Jun 2025 11:38:10 GMT",
    "source": "JobGurus",
    "keyword": "cavista",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Cavista is a global technology company creating cloud-based software solutions for clients. With operations around the world, we globalize, standardize and localize our processes, while at the same time remaining sensitive to specific needs in different regions. Our mission is to empower organizations with the world’s best technology solutions.\n\nWe are recruiting to fill the following positions below:\n\n1.) Business Operations Manager\n\nJob Location: Ilupeju, Lagos\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Business Operations Manager is a critical leadership role designed to serve as a strategic partner to the General Manager, ensuring seamless business operations, driving organizational efficiency, and spearheading key initiatives.\n\tThis position demands a visionary leader with a strong operational mindset, capable of optimizing processes, enhancing performance, and fostering cross-functional collaboration.\n\tThe successful candidate will act as a force multiplier for the General Manager, stepping in to lead critical functions, manage stakeholder relationships, and execute high-impact projects that align with Cavista Technologies’ long term objectives.\n\n\nKey Responsibilities\n\n\n\tServe as the primary deputy to the General Manager, assuming leadership responsibilities in their absence, including executive decision-making, stakeholder engagements, and board-level presentations.\n\tPartner with the executive leadership team to formulate, refine, and execute the company’s strategic roadmap, ensuring alignment with Cavista Technologies mission, vision, and growth targets.\n\tConduct comprehensive business analysis to identify operational inefficiencies, market opportunities, and areas for innovation, presenting data-driven recommendations to the leadership team.\n\tOversee the implementation of key strategic initiatives, ensuring timely execution, resource optimization, and measurable outcomes.\n\tLead the design and execution of operational strategies to enhance productivity, reduce costs, and improve service delivery across all business units.\n\tEstablish and monitor key performance indicators (KPIs) to evaluate business performance, providing actionable insights to drive continuous improvement.\n\tStreamline cross-functional workflows, fostering collaboration between Finance, People, Talent, IT and Delivery teams to ensure operational synergy.\n\tChampion the adoption of best practices, automation, and technology-driven solutions to elevate operational efficiency and scalability.\n\tIn the absence of the General Manager, Cavista Technologies in high-level client meetings, negotiations, and industry forums, reinforcing the company’s reputation as a trusted technology partner.\n\tAnalyze market trends, competitive landscapes, and emerging technologies to position Cavista Technologies as an industry leader.\n\tAct as a liaison between senior leadership and respective team leads, ensuring transparent communication, goal alignment, and conflict resolution.\n\tEnsure adherence to corporate governance standards, regulatory requirements, and internal compliance policies.\n\tProactively identify operational, financial, and reputational risks, implementing mitigation strategies to safeguard business continuity.\n\tAlign with the General Manager to oversee contract management, vendor relationships, and procurement processes to ensure cost efficiency and risk mitigation.\n\n\nQualifications\n\n\n\tAdvanced Degree: MBA or master’s degree in business administration, Operations Management, or a related field from a reputed institution.\n\tProfessional Experience: Minimum of 12+ years of progressive leadership experience in business operations, general management, or strategic consulting, with at least 5 years in a senior management role within the technology or IT services sector.\n\tFinancial Literacy: Strong understanding of budgeting, financial analysis, and cost optimization.\n\tIndustry Expertise: Demonstrated success in scaling operations, driving digital transformation, or managing P&L for technology-driven organizations.\n\tStrategic Vision: Ability to translate business objectives into actionable plans with measurable outcomes.\n\tOperational Acumen: Expertise in process optimization, lean management, and performance metrics.\n\tLeadership Excellence: Proven track record of building, leading, and inspiring high performing teams.\n\tStakeholder Management: Exceptional negotiation, communication, and relationship building skills.\n\tInnovation Mindset: Passion for leveraging technology to solve complex business challenges.\n\n\nAdditional Information:\n\n\n\t5 - day workweek.\n\tFlextime.\n\tCompetitive Health Insurance (Employee + Spouse + 4 children).\n\tWellness Programs\n\tEmployee Training Programs\n\tGrowth and Development\n\tRemote working and IT Assets provided for Remote employees\n\tMentoring and Counseling\n\tReferral Bonus\n\tWork from Anywhere - Flexibility that allows you to work where you are most comfortable, whether at home, at work, or a combination of both.\n\n\nClick here to apply online\n\n \n\n2.) IT Support Technician\n\nJob Location: Ilupeju, Lagos\nEmployment Type: Full Time\n\nJob Description\n\n\n\tWe are seeking a highly skilled Female IT Support Technician to provide technical assistance and support for hardware, software, and network related issues across the organization.\n\tThe ideal candidate will be responsible for troubleshooting IT problems, maintaining systems, and ensuring smooth day to day operations for end users.\n\tThis role requires expertise in Microsoft Azure, cloud infrastructure, and IT security best practices.\n\n\nResponsibilities\nWhat you will do:\n\n\n\tProvide first-line technical support to employees by diagnosing and resolving hardware, software, and network-related issues.\n\tInstall, configure, and maintain computers, printers, mobile devices, and other IT equipment to ensure optimal performance.\n\tMonitor and maintain IT infrastructure, including servers, networks, and security systems, with a focus on Microsoft Azure cloud services.\n\tManage Azure Active Directory (Azure AD) for user account provisioning, access controls, and security policies.\n\tAssist with user account management, including password resets, access requests, and system configurations.\n\tRespond to IT service requests and incidents in a timely manner, ensuring minimal disruption to operations.\n\tPerform system updates, patches, and software installations to maintain security and efficiency.\n\tAssist in IT asset inventory management, tracking and documenting IT equipment and licenses.\n\tSupport remote employees by troubleshooting VPN, cloud-based systems, and remote desktop environments.\n\tCollaborate with the IT team on projects, upgrades, and implementation of new technologies, particularly Azure-based solutions.\n\tImplement Azure security best practices, including role-based access control (RBAC), identity protection, and endpoint security.\n\tProvide user training and guidance on IT best practices, cloud-based collaboration tools, and security protocols.\n\n\nQualifications\n\n\n\tBachelor’s degree in Information Technology, Computer Science, or a related field (or equivalent work experience).\n\t1-3 years of experience in IT support, helpdesk, or technical support roles.\n\tProficiency in troubleshooting Windows, macOS, and Linux operating systems.\n\tFamiliarity with ticketing systems and IT service management frameworks (e.g., ITIL).\n\tKnowledge of cybersecurity best practices, firewalls, and endpoint security.\n\tHands-on experience with Microsoft Azure administration, including Azure AD, virtual machines, and cloud security.\n\tStrong knowledge of Active Directory, Office 365, networking protocols, and cloud-based services.\n\tAbility to work independently and collaboratively in a fast-paced environment.\n\tStrong problem-solving skills, customer service orientation, and excellent communication abilities.\n\n\nBenefits\n\n\n\tCompetitive Compensation \n\t5 - day workweek\n\tFlextime\n\tCompetitive Health Insurance (Employee + Spouse + 4 children)\n\tWellness Programs\n\tEmployee Training Programs\n\tGrowth and Development\n\n\nClick here to apply online\n\n \n\n3.) Quality Assurance Engineer\n\nJob Location: Lagos\nEmployment Type: Full Time\n\nJob Description\n\n\n\tCollaborate with Product Owners to review and analyze business and functional requirements and design documents for sound testing strategies. \n\tResponsible for testing of a product, including writing the test plans and test cases, writing automation scripts, and testing the complete application from the UI through to the backend. \n\tPerform detailed cross-browser/cross-device testing, browser-based testing, mobile testing. \n\tMaintain requirements traceability with test case coverage. \n\tProvide expertise in understanding what to test, as well as how it should be tested. \n\tImplement test methodology best practices as defined by departmental standards. \n\tAdvocate for testing standards \n\tMust maintain strong relationships with internal customers. \n\tFacilitate testing meetings, summarize results, issue/defect reporting, maintain metrics and provide go/no go recommendation. \n\tReview software and production issues as they occur for a holistic analysis of the impacts and possible causes. \n\tCreate, execute, and document test plans and test cases (UAT, Integration, End-to-End, Regression, Beta), ensuring functional coverage and application performance. \n\n\nQualifications\n\n\n\tInterested candidates should possess relevant qualifications\n\t5+ years as a professional Quality Assurance Analyst testing (8+ years if no University degree) applications with high volume and high-reliability requirements \n\tAbility to work effectively with little supervision and strong attention to detail in a team environment. \n\tAptitude for learning new technologies; supported by solid problem solving and troubleshooting skills. \n\tAbility to work well with a variety of people with varying technical skill sets. \n\tAbility to leverage experience to deliver reliable and repeatable tests. \n\tBroad understanding of quality engineering principles and test methodologies \n\tAbility to contribute to a vision of future state of testing by troubleshooting hardware and software issues. \n\tBasic SQL, Unix/Linux skills \n\tExperience in manual testing, automation testing experience is a plus. \n\tExcellent communication skills (written, verbal and listening) \n\t5-year experience in functional, integration or system testing web-based applications desired \n\tExperience executing test plans and scripts and verifying expected results. \n\tStrong understanding of common software development life cycles (waterfall, iterative, agile) and contemporary software quality assurance processes and automated tools \n\n\nBenefits\nCavista offers even more:\n\n\n\tCompetitive Compensation.\n\t5 - day workweek.\n\tFlextime.\n\tCompetitive Health Insurance (Employee + Spouse + 4 children).\n\tWellness Programs\n\tEmployee Training Programs\n\tGrowth and Development\n\tRemote working and IT Assets provided for Remote employees\n\tMentoring and Counseling\n\tReferral Bonus\n\tWork from Anywhere - Flexibility that allows you to work where you are most comfortable, whether at home, at work, or a combination of both\n\n\nClick here to apply online    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Project Manager (Nigeria) Job at BBC Media Action",
    "link": "https://www.jobgurus.com.ng/jobs/view/project-manager-nigeria-job-at-bbc-media-action",
    "pubDate": "Fri, 20 Jun 2025 11:38:10 GMT",
    "source": "JobGurus",
    "keyword": "bbc media action",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "(adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\nBBC Media Action is the BBC’s international development organisation, and we believe in the power of media and communication for good. We work in more than 20 countries around the world, supporting the independent media essential to democracy and development. Last year, our projects and programmes reached 130 million people facing poverty, inequality and insecurity with information they could trust, helping to improve health, bridge divides, challenge prejudice, and save and change lives. We follow the editorial standards and values of the BBC, but we rely on funding from donors and partners to carry out our work. BBC Media Action delivers a portfolio of projects in Nigeria. It seeks to expand this portfolio of work, but also to ensure that existing projects are delivered on time, on budget, to the highest standards and in accordance with BBC editorial values as well as Media Action methodologies.\n\nWe are recruiting to fill the position below:\n\nJob Position: Project Manager (Nigeria)\n\nJob Location: Nigeria (Right to work in Nigeria required)\nReports to: Project Director\nContract: Fixed-term employment\nDuration: One year\n\nJob Purpose\n\n\n\tThe BBC Media Action office in Nigeria is looking for a Project Manager to support the implementation of a reproductive and family planning project, making sure the agreed targets and objectives are met while ensuring the quality and alignment of project outputs to overall organisational objectives.\n\tThe Project Manager will also ensure that all relevant organisational departments and project partners are kept abreast of project commitments, timelines, strategies and changes to ensure adequate resource allocation and successful project implementation.\n\tThe Project Manager will also be responsible for the planning and coordination of project activities including financial management of the project and reporting on progress to the Project Director.\n\tS/He will coordinate with key stakeholders and will ensure effective relationships and partnerships with a wide range of partners including broadcasters, NGOs, international development agencies, government coordinating bodies, and others.\n\tThe role reports to the Project Director and will work closely with other implementing teams and the Senior Management Team.\n\n\nMain Duties and Responsibilities\n\n\n\tOversee the planning and implementation of all activities for the project in accordance with project budget and timelines.\n\tSupport the design and coordination of workshops, events, monitoring, evaluation and feedback/learning sessions, and work with relevant stakeholders to develop a comprehensive content roadmap for a multimedia, multiplatform, multi-partner SBC intervention\n\tContribute to the articulation of the project’s theory of change and ensure that key research findings are fed into project design and delivery.\n\tSupport the development of media content insofar as ensuring it links to the project ‘theory of change’ and intended development outcomes.\n\tWork with selected partners to develop a holistic evidence-based communication strategy for an SBC intervention on FP informed by detailed analysis and segmentation of audiences.\n\tMonitor project activities – working closely with relevant stakeholders and other teams to deliver the project and donor commitments while aligning with BBC editorial standards and values and Media Action’s best practice.\n\tOnboard and maintain strong, collaborative relationships with partners and organisations for the benefit of the project, in line with BBC Media Action values.\n\tSupport the development of relevant project management tools that aid the effective design and implementation of project activities, to include but not limited to theory of change, logframe/results framework and workplans.\n\tSupport the development of knowledge management systems and processes that help to collect, organize, store and share BBC Media Action Nigeria’s information/knowledge assets in a manner that such can be readily available, accessible and effectively used for the benefit of the organization.\n\tManage project budgets (including budget forecasting) to ensure the full and successful delivery of project outputs in accordance with that budget and in line with Media Action’s financial procedures and the funder’s operating guidelines.\n\tWork closely with the Project Director and the Finance department to identify and resolve any potential financial issues.\n\tNegotiate and/or mediate conflicting views and priorities arising within the project or across departments/teams, to ensure solutions meet the needs of the project and BBC Media Action.\n\tLead on reporting of project progress, both to donor, internally to BBC Media Action in Abuja and London, and externally to other stakeholders around the world.\n\tContribute to the development and writing of new proposals, or working as part of a larger team responding to donor requirements.\n\tCoordinate with other relevant Project Managers and Media Action departments to build synergy between projects, to deliver the highest quality work at best value for the donor.\n\tEnsure that project activities comply with BBC Media Action and donor standards around safeguarding of children and vulnerable adults.\n\tThe role will also lead or support to ensure that relevant safeguarding due diligence is conducted with any local partner organisations that may be working with vulnerable adults or children as part of the project and where any risks are identified, ensure that projects are designed to mitigate these risks.\n\tAny other tasks assigned by Media Action to achieve project and organisational objectives.\n\n\nRequired Skills, Knowledge, and Experience\n\n\n\tStrong technical understanding of and experience of working in reproductive and family planning projects, including media development and communications for behaviour and social change\n\tExperience managing complex activities with demonstrated capacity to manage the project/activities effectively.\n\tProven ability to build consensus and inspire different teams or departments to work together to achieve goals.\n\tAbility to forge strong working relations quickly and gain the trust of colleagues and partners, for example in other international NGOs, in government, in media houses, and elsewhere.\n\tExperience managing activity budgets and reporting/providing updates against scheduled activities and/or spend.\n\tAbility to work on own initiative and organise time effectively within a range of often conflicting deadlines, juggling competing priorities to meet project needs and objectives.\n\tDemonstrable business development skills.\n\tExperience at developing and articulating theories of change and other relevant project management/implementation tools.\n\tAdequate knowledge of the context/country of work, it’s development issues and needs to support the role.\n\tConfident public speaker with experience of presentations to colleagues, donors and stakeholders.\n\tStrong interpersonal and communication skills.\n\tExcellent written and spoken English.\n\n\nMethod of Application\nInterested and qualified candidates should submit their CV with cover letter (in English, PDF or Microsoft Word format) which outlines their experience and suitability for the role, and availability status, by email to: hr.recruitment@ng.bbcmediaaction.org using the Job Position as the subject of the mail.\n\nNote\n\n\n\tOnly applicants with a separate cover letter will be considered.\n\tPlease do not send certificates or other attachments.\n\tOnly shortlisted candidates will be notified.\n\n\nSafeguarding:\n\n\n\tThis role may involve working with groups of vulnerable children, youth, and adults.\n\tFor the successful candidate, mandatory training will be provided on BBC Media Action’s safeguarding policy and staff code of conduct.\n\tBBC Media Action operates a zero-tolerance policy concerning all forms of abuse and exploitation of vulnerable people.\n\tA police background check may form part of the recruitment    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]