[
  {
    "title": "Human Resources Officer Job at Sales Force Consulting",
    "link": "https://www.jobgurus.com.ng/jobs/view/human-resources-officer-job-at-sales-force-consulting-1",
    "pubDate": "Tue, 24 Jun 2025 10:45:50 GMT",
    "source": "JobGurus",
    "keyword": "sales force consulting",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Sales Force Consulting - Our client is into production of cellotape adhesive tapes, gums and diverse stationery items. Their factory is located at Agbara Industrial Layout with outlets in Onitsha and key states of Nigeria. Due to an on-going expansion, they are presently recruiting self-motivated candidates to fill the position below:\n\nJob Position: Human Resources Officer\nJob Location: Agbara, Ogun\nEmployment Type: Full-time\nInterview mode: Physical\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWork with HR team to plan and conduct employee recruitments, orientation and all on-boarding activities.\n\tWork with HR Manager and HODs to set up key performance measurement matrix and indicators for all job functions and ensure planning, monitoring and appraisal of all employee work results periodically.\n\tMonitor performance appraisal procedures and ensure its compliance.\n\tEncourage employee communications and provide current and prospective employees with information about policies, job function, working conditions, wages, and opportunities for promotion and employee benefits.\n\tEnsure proper management of staff resources and maintenance of occupational health safety.\n\n\nRequirements\n\n\n\tHND / B.Sc / BA.\n\t1 - 2 years of HR work experience is required\n\tHR Certification is an advantage.\n\tCandidate must be a passionate about HR, Peoples Management and Business Sustainability\n\tThey must have worked or is currently working in a well organized company with HR systems and procedures\n\tCandidate must presently reside with Agbara axis.\n\n\nSkill Set:\n\n\n\tAbility to work independently with little supervision.\n\tAttention to details.\n\tLeadership skills.\n\tOrganizational skills.\n\n\nOther Conditions:\n\n\n\tApplicants must be very hardworking, target oriented, with high level of integrity\n\n\nSalary\nN150,000 / Month.\n\nMethod of Application\nInterested and qualified candidates should send their updated CV (PDF or Word) to: salesforceconsultingng@gmail.com using \"Human Resources Officer\" as the subject of the email.\n\nNote\n\n\n\tFor inquiries: send a Text or WhatsApp message to: 08120796570\n\tOnly candidates who meet set criteria shall be shortlisted for interview.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Customer Sales Agent Job at ProductHeights Consulting",
    "link": "https://www.jobgurus.com.ng/jobs/view/customer-sales-agent-job-at-productheights-consulting-1",
    "pubDate": "Tue, 24 Jun 2025 10:45:50 GMT",
    "source": "JobGurus",
    "keyword": "productheights consulting",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "ProductHeights Consulting - We work with MSMEs owners and entrepreneurs to put systems, structures, processes, policies and procedures for the optimal, efficient and effective running of their businesses. At Productheights consulting, we strive for the best of every business owner.\n\nWe are recruiting to fill the position below:\n\nJob Position: Customer Sales Agent\n\nJob Locations: Abuja (FCT), Akwa Ibom, Delta, Kwara, Lagos, Osun, Oyo\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are looking for a dynamic and results-driven Customer Sales Agent to join our team.\n\tThe ideal candidate will be responsible for engaging with prospective and existing customers, promoting our products, and ensuring excellent customer satisfaction.\n\tYou will be the first point of contact for customers, helping them make informed purchase decisions while driving sales and revenue growth.\n\n\nKey Responsibilities\nCustomer Interaction:\n\n\n\tHandle inbound and outbound customer inquiries via phone, WhatsApp, email, and other channels.\n\tProvide detailed information about products and services to prospective customers.\n\tRespond promptly to customer inquiries and resolve any issues effectively.\n\n\nSales & Promotions:\n\n\n\tPromote and sell the company’s products by understanding customer needs and preferences.\n\tConvert leads from social media platforms (e.g., Facebook and Instagram) into paying customers.\n\tUpsell and cross-sell additional products to maximize revenue per customer.\n\n\nFollow-Up & Relationship Building:\n\n\n\tFollow up with potential customers who have shown interest in the products to close sales.\n\tBuild and maintain positive relationships with customers to encourage repeat business.\n\n\nRecord-Keeping & Reporting:\n\n\n\tDocument customer details, inquiries, and sales in spreadsheets or CRM systems.\n\tTrack sales metrics and prepare regular reports for management.\n\n\nRequirements\n\n\n\tCandidates should possess an OND qualification with 0 - 5 years work experience.\n\tProven experience in sales, customer service, or a related role.\n\tStrong communication and interpersonal skills.\n\tAbility to build rapport with customers and maintain professionalism.\n\tProficiency in using WhatsApp Business, social media, and basic office tools like Excel and Google Sheets.\n\tResults-oriented with a strong desire to meet and exceed sales targets.\n\tAbility to multitask and prioritize tasks effectively.\n\n\nPreferred Skills:\n\n\n\tExperience in the haircare, skincare, or beauty industry is a plus.\n\tKnowledge of CRM software or other sales tools is an advantage.\n\tFluency in local languages is an added benefit.\n\n\nWork Environment:\n\n\n\tThis role may involve working remotely.\n\tFlexibility to work weekends or evenings as required to meet customer demands.\n\n\nSalary\nN40,000 - N75,000 / Month.\n\nMethod of Application \nInterested and qualified candidates should send their CV to: productheightsconsulting@gmail.com using the Job Position as the subject of the email.\n\nNote: Only female applicants are needed.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Social Media Manager Job at Efezi Southsea Nigeria Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/social-media-manager-job-at-efezi-southsea-nigeria-limited",
    "pubDate": "Tue, 24 Jun 2025 10:45:50 GMT",
    "source": "JobGurus",
    "keyword": "efezi southsea nigeria limited",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance"
    ],
    "content": "Efezi Southsea Nigeria Limited, established in 2009, is a hospitality consultancy firm specializing in providing expert services to small and medium-sized hotels.\n\nWe are recruiting to fill the position below:\n\nJob Position: Social Media Manager\n\nJob Location: Ikeja, Lagos\n\nKey Responsibilities\nStrategy Development:\n\n\n\tPlan and execute a comprehensive social media strategy aligned with business goals.\n\tIdentify target audiences and choose appropriate platforms (e.g., Facebook, Instagram, X/Twitter, TikTok, LinkedIn).\n\n\nContent Creation & Management:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tCreate, curate, and schedule engaging content (text, images, videos, reels, etc.).\n\tMaintain a consistent brand voice and visual identity across platforms.\n\n\nEngagement & Community Management:\n\n\n\tRespond to comments, messages, and inquiries in a timely and professional manner.\n\tMonitor conversations, trends, and brand mentions online.\n\n\nAdvertising & Promotion:\n\n\n\tRun paid social media campaigns to promote services, offers, or events.\n\tOptimize ads for performance, reach, and return on investment (ROI).\n\n\nAnalytics & Reporting:\n\n\n\tTrack key performance indicators (KPIs) such as reach, engagement, follower growth, and conversions.\n\tPrepare and present regular performance reports and insights for improvement.\n\n\nCollaboration:\n\n\n\tWork closely with marketing, design, and sales teams to align efforts.\n\tCollaborate with influencers or partners for campaigns or events.\n\n\nTrend Monitoring:\n\n\n\tStay updated on the latest social media trends, tools, and best practices.\n\tRecommend innovative ideas to keep the brand competitive online.\n\n\nBenefits Attached\n\n\n\tCommission– yes\n\tLayover - yes\n\tStaff meal - yes.\n\n\nMethod of Application\nInterested and qualified candidates should send their Applications to: efezisouthsea2000@gmail.com using the Job Position as the subject of the email.\n\nNote: All corresponding are via Email    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Frontend Developer Job at Rehoboth Labs",
    "link": "https://www.jobgurus.com.ng/jobs/view/frontend-developer-job-at-rehoboth-labs",
    "pubDate": "Tue, 24 Jun 2025 10:45:50 GMT",
    "source": "JobGurus",
    "keyword": "rehoboth labs",
    "duplicate": false,
    "classifications": [
      "Software Engineering"
    ],
    "content": "Rehoboth Labs - We are a forward-thinking technology consultancy dedicated to delivering innovative digital solutions, custom software, and strategic consultancy services. Our mission is to enhance business processes and drive digital transformation across industries, helping organisations streamline operations and achieve sustainable growth in today's competitive marketplace.\n\nWe are recruiting to fill the position below:\n\nJob Position: Frontend Developer\n\nJob Location:  Nigeria\nEmployment Type: Contract\n\nSummary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are looking for a talented UI Developer to join our team on a contract basis for a period of 2 to 3 months.\n\tYou’ll be working on a modern codebase built with React, Next.js, and TypeScript, contributing to both UI implementation and writing robust test coverage using Vitest (or similar testing frameworks).\n\n\nWhat We're Looking For\n\n\n\tStrong hands-on experience with React, Next.js, and TypeScript\n\tA solid project portfolio that clearly demonstrates your skills and ability to build production-grade applications (personal, freelance, or open-source projects are fine)\n\tExperience with any modern testing framework (e.g., Jest, Vitest, Testing Library)\n\tWillingness to learn and adapt quickly, especially with Vitest if you're not already familiar\n\tAbility to solve problems independently and effectively leverage AI tools to speed up development and improve quality\n\tGood communication skills – you will be collaborating remotely, so clarity and responsiveness are important\n\tAccess to a reliable internet connection and stable power supply.\n\n\nSalary\nN80,000 - N100,000 monthly. \n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Health and Safety Officer Job at Dangote Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/health-and-safety-officer-job-at-dangote-group-1",
    "pubDate": "Tue, 24 Jun 2025 10:45:50 GMT",
    "source": "JobGurus",
    "keyword": "dangote group",
    "duplicate": false,
    "classifications": [],
    "content": "Dangote Group is one of Nigeria’s most diversified business conglomerates with a hard – earned reputation for excellent business practices and products’ quality with its operational headquarters in the bustling metropolis of Lagos, Nigeria in West Africa.\n\nWe are recruiting to fill the position below:\n\nJob Position: Health and Safety Officer\nJob Location: Okpella Plant, Edo\nEmployment Type: Full-time\n\nJob Overview\n\n\n\tParticipate in implementing the DCP approved occupational safety program, analysing and administering various components of the safety programs.\n\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tMonitor DCP employees, contracts and sub-contracts to ensure compliance safety rules and regulations.\n\tEnsure all persons including the general public, with proximity of DCP premises sites and operating locations are not exposed to the risks of health and safety.\n\tEnsure that work is carries out in a safe manner and acceptable standards with minimum risk to all persons, property, equipment and materials.\n\tReport near miss, unsafe act, unsafe conditions of contracts and sub-contracts to DCP Management.\n\tEnsure that contracts carry out toolbox on daily basis before starting of any work.\n\tEnsure that all necessary fire apparatus on site are maintained in serviceable condition and regular inspected.\n\tEnsure that necessary contact is made for emergency call out of medical facilities in case of serious accident or illness.\n\tUpon receipt of a report of noncompliance or any condition which poses a serious or imminent danger to health or health, issues a request for immediate corrective action from the contractors.\n\tThe elimination of risk of injury of all persons affected by DCP operations and prevention of damage to all property and plant. \n\n\nRequirements\n\n\n\tBachelor's Degrees in Engineering or a related field.\n\tPostgraduate/Professional qualification from an HSE body such as NEBOSH, OSHA, ISPON.\n\tMinimum of 6 years of experience in safety, preferably in the cement or related industry.\n\n\nSkills and Behaviors:\n\n\n\tStrong analytical and problem-solving skills\n\tAdequate knowledge of the cement and manufacturing industries.\n\tAdequate knowledge of Safety regulations.\n\tAbility to analyze incidences and proffer valuable solutions.\n\tAbility to communicate incidences and emergencies clearly.\n\tStrong organizational skills.\n\tBasic computer skills.\n\tHigh sense of responsibility.\n\tExcellent communication and interpersonal and presentation skills.\n\tAbility to work independently and as part of a team.\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]