[
  {
    "title": "Assistant Branch Manager Job at Supersaver Supermarket",
    "link": "https://www.jobgurus.com.ng/jobs/view/assistant-branch-manager-job-at-supersaver-supermarket-1",
    "pubDate": "Mon, 09 Jun 2025 15:17:05 GMT",
    "source": "JobGurus",
    "keyword": "supersaver supermarket",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Supersaver Supermarket, established in 2013, is Nigeria's fastest growing brand in the retail sector with branches in diffrent parts of Lagos and massive expansion plans in various parts of the Nigeria. Our businesses cut across retail trade, wholesale trade, manufacturing and Agriculture.\n\nWe are recruiting to fill the position below:\n\nJob Position: Assistant Branch Manager\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAssist the Branch Manager in overseeing daily outletactivities\n\tSupervise and motivate staff to achieve branch performance targets\n\tHandle customer issues professionally and efficiently\n\tEnsure proper stock management and coordinate with procurement and inventory team\n\tMonitor compliance with company policies and operational procedures\n\tContribute to staff training, scheduling, and general store management\n\n\nRequirements\n\n\n\tCandidates should possess an HND / B.Sc Degree\n\tAt least 3 years of experience in retail, with 2 years in a supervisory or managerial role.\n\tStrong leadership, communication, and interpersonal skills\n\tAbility to work under pressure and adapt in a fast-paced environment\n\tMust be flexible to work shifts, weekends, and public holidays.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: supersaverhr@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Manager Job at Rubels and Angels Food Court",
    "link": "https://www.jobgurus.com.ng/jobs/view/manager-job-at-rubels-and-angels-food-court",
    "pubDate": "Mon, 09 Jun 2025 15:17:05 GMT",
    "source": "JobGurus",
    "keyword": "rubels and angels food court",
    "duplicate": false,
    "classifications": [],
    "content": "Rubels & Angels is a Fine Dining and Take out Restaurant redefining the food service industry.\n\nWe are recruiting to fill the position below:\n\nJob Position: Manager\nJob Location: Lagos\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tOversee daily restaurant operations to ensure smooth and efficient service.\n\tManage staff recruitment, training, scheduling, and performance evaluations.\n\tEnsure high levels of customer satisfaction by maintaining service and food quality standards.\n\tMonitor inventory, order supplies, and manage vendor relationships.\n\tHandle customer complaints and resolve issues promptly and professionally.\n\tMonitor financial performance, including budgeting, cost control, and sales reporting.\n\tEnforce health, safety, and hygiene regulations to ensure a safe dining environment.\n\n\nRequirements\n\n\n\tInterested candidates should possess a BSc Degree with 2 - 3 years of experience. \n\tMust reside within the axis of ago palace, lagos state.\n\n\nSalary\nN150,000 - N200,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: rubelsangels@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Quality Control Officer Job at JMG Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/quality-control-officer-job-at-jmg-limited",
    "pubDate": "Mon, 09 Jun 2025 15:17:05 GMT",
    "source": "JobGurus",
    "keyword": "jmg limited",
    "duplicate": false,
    "classifications": [],
    "content": "JMG Industries Limited is a diversified solution provider with a broad portfolio in power generation, electrical infrastructures, industrial equipment, elevators & escalators and HVAC solutions. With 20 years of experience in Africa and strong partnerships with some of the world’s leading brands, JMG combines global technologies and regional expertise to fulfill the development needs of the African market.\n\nWe are recruiting to fill the position below:\n\nJob Position: Quality Control Officer\nJob Location: Lagos\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tCarry out quality assessment measures of all raw materials\n\tConduct visual and measurement tests, and rejecting and returning unacceptable materials\n\tMonitor operations to ensure that they meet production standards\n\tApprove in-process production by confirming required specifications, conducting visual and measurement tests, and communicating the required adjustment to the production supervisor\n\tDocument and update inspection results by completing reports\n\tApprove all finished products by confirming specifications and conducting required test\n\tRemove and segregate all products that fail to meet specifications or defective and complete documentation\n\tMaintain safe work environment by following standards and procedures and complying with regulations\n\tRecommend improvement measures to the production process to ensure quality control standards are met.\n\tCarry out laboratory tests.\n\n\nRequirement\n\n\n\tMust have experience in plastic production.\n\n\nSalary\nN120,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: lagosproductionjobs@yahoo.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Account Officer Job at Vet etcetera Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/account-officer-job-at-vet-etcetera-limited",
    "pubDate": "Mon, 09 Jun 2025 15:17:05 GMT",
    "source": "JobGurus",
    "keyword": "vet etcetera limited",
    "duplicate": false,
    "classifications": [],
    "content": "Vet etcetera Limited is a company that is into Integrated farming as well as veterinary cosmetic production.\n\nWe are recruiting to fill the position below:\n\nJob Position: Account Officer\nJob Location: Chikuku, Abuja\nEmployment Type: Full-time\n\nRequirements\n\n\n\tCandidates must posses an OND/HND in Accounting.\n\tRelevant accounting certifications (added advantage)\n\tProficient in Microsoft Office (Word, Excel, PowerPoint) and accounting software.\n\n\nSalary\nN70,000 - N100,000 Monthly.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nMethod of Application\nInterested and qualified candidates should send their Applications and CV to: anorued@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Design Architect Job at the Classroom by Ultimus",
    "link": "https://www.jobgurus.com.ng/jobs/view/design-architect-job-at-the-classroom-by-ultimus",
    "pubDate": "Mon, 09 Jun 2025 15:17:05 GMT",
    "source": "JobGurus",
    "keyword": "the classroom by ultimus",
    "duplicate": false,
    "classifications": [],
    "content": "The Classroom by Ultimus offers a full bouquet of ambiance fittings ranging from Decorative & Effect paints, Tiles, Sanitary wares, Smart Kitchens, Vanity wares, Chandeliers, Spotlights, wall scones, Table & Floor Lamps Faucets & Kitchen mixers.\n\nWe are recruiting to fill the position below:\n\nJob Position: Design Architect\nJob Location: Victoria Island, Lagos\nEmployment Type: Full-time\nReports To: Senior Project Architect\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThis role requires a right - brained revolutionary thinker who is willing to dare the impossible to create masterpieces.\n\tThe position will require the production of schematic designs that are functional, safe, sustainable and aesthetically pleasing.\n\tYou will also be involved in interior design development and execution, construction drawings preparation, design proposal schemes, construction documentation and leading project teams.\n\n\nMain Duties and Responsibilities\n\n\n\tDeveloping 3D architectural and interior designs and ensuring effective execution of designs.\n\tProceed with research and development of preliminary schematic designs to set the direction of the project\n\tActively seeking new design and construction methods\n\tReviewing of documents for quality control evaluations\n\tMeeting with clients to discuss project objectives, needs, and budget\n\tWork with the project manager and other project team members from the preliminary design and drawings stage to working drawing and execution.\n\tEnsure compliance with building codes and zoning regulations\n\tPreparing and presenting design proposals, including detailed drawings of finished buildings, renovations, or restorations\n\tMeeting with construction professionals and clients to discuss feasibility of designs\n\tParticipate in site visits and project meetings\n\tIncorporate sustainable and energy-efficient design principles\n\tWorking with contractors, surveyors, and building service engineers to create a construction schedule and bring the designs to fruition\n\tWorking with computer-aided design software to create blueprints and images\n\tParticipating in project management throughout the construction\n\n\nQualifications\n\n\n\tArchitectural degree is required (B.Sc., M.Sc.)\n\tLicensed by recognised Architectural Body in Nigeria (ARCON)\n\tMinimum three years’ experience\n\tProficient in standard industry software: Revit Architecture ,3D max studio + VRAY Sketchup + VRAY, AutoCAD, Adobe Photoshop, Adobe illustrator, Adobe InDesign, MS Office packages (Microsoft project inclusive).\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and design Portfolio to: careers@theclassroom.com.ng using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]