[
  {
    "title": "Recruitment Officer Job at Pem Security Guard Network Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/recruitment-officer-job-at-pem-security-guard-network-limited",
    "pubDate": "Mon, 03 Nov 2025 20:40:34 GMT",
    "source": "JobGurus",
    "keyword": "pem security guard network limited",
    "duplicate": false,
    "classifications": [],
    "content": "Pem Security Guard Network Limited is a fully licensed and insured security company with years of experience in the industry. We take pride in our highly trained security personnel, state-of-the-art technology,and a strong commitment to deliveri ng top-tier security solutions. We We offer a range of security services that meet the needs of individuals,corporate organizati ons, religious bodies,businesses and events. Our services include manned guarding, event security, corporate drivers,CCTV installati on amongst others\n\nWe are recruiting to fill the position below:\n\nJob Position: Recruitment Officer\nJob Location: Awka, Anambra\nEmployment Type: Part-time\n\nJob Summary\n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a highly motivated and detail-oriented Guards Recruitment Officer to join our esteemed Security and Investigations team.\n\tThe ideal candidate will be responsible for the strategic recruitment of security personnel, ensuring that our organization attracts and retains top talent in the security industry.\n\tThis role requires not only a deep understanding of the unique qualifications and attributes that successful security guards possess but also the ability to effectively communicate our organization's values and expectations.\n\tAs a Guards Recruitment Officer, you will play a crucial role in shaping our workforce, collaborating closely with hiring managers to understand their specific needs and to develop tailored recruitment strategies.\n\tYou will utilize various platforms and innovative methods to identify and engage with potential candidates, conduct thorough interviews, and assess their suitability for various security roles.\n\tAdditionally, maintaining comprehensive records of recruitment activities and candidate evaluations will be key to reporting on recruitment metrics and improving our processes.\n\tWe welcome individuals who are passionate about the security field and who possess an eye for detail and a commitment to excellence in recruitment practices.\n\n\nResponsibilities\n\n\n\tDevelop and implement effective recruitment strategies for sourcing security personnel.\n\tCollaborate with hiring managers to identify staffing needs and develop job descriptions.\n\tScreen and evaluate candidates through interviews and assessments to determine suitability for security roles.\n\tMaintain and update recruitment databases and records for tracking application processes.\n\tPromote the organization and its career opportunities at job fairs and recruitment events.\n\tStay informed on industry trends and best practices in recruitment and talent acquisition.\n\tProvide support and guidance to candidates throughout the hiring process, ensuring a positive experience.\n\n\nRequirements\n\n\n\tBachelor's Degree in Human Resources, Business Administration, or a related field preferred.\n\tProven experience in recruitment or human resources, preferably in the security or investigations industry.\n\tStrong understanding of the qualifications and skills required for security personnel.\n\tExcellent communication and interpersonal skills, with the ability to engage with diverse candidates.\n\tProficiency in applicant tracking systems and recruitment software.\n\tStrong organizational skills and attention to detail in managing candidate records.\n\tAbility to work independently and manage multiple recruitment projects simultaneously.\n\n\nMethod of Application \nInterested and qualified candidates should send their cover letter and resume to: pemsec2@gmail.com using the Job Position as the subject of the mail.\n\nNote: This position is strictly for those residents in Awka.    \n\n    \n\n        Click here to Apply",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]