[
  {
    "title": "Mechanical Engineer (Piping) Job at Timospiden Global Services",
    "link": "https://www.jobgurus.com.ng/jobs/view/mechanical-engineer-piping-job-at-timospiden-global-services",
    "pubDate": "Fri, 04 Jul 2025 14:42:25 GMT",
    "source": "JobGurus",
    "keyword": "timospiden global services",
    "duplicate": false,
    "classifications": [],
    "content": "Timospiden is a global firm of technical and non technical manpower supply company.\n\nWe are recruiting to fill the position below:\n\nJob Position: Mechanical Engineer (Piping)\n\nJob Location: Akwa Ibom \n\nRequirements\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tCandidates should possess a Bachelor's Degree with 6-15 years work experience.\n\tSpecialized in construction of Critical Piping, non-critical piping, Utility piping & its associated pipe supports including it associated grouting, painting & Insulation.\n\tMandatory experience in Combined cycle Power plant construction Projects\n\tFamiliar with Piping GA drawings, Iso drawings, P&I drawings, Piping Line list, Piping Terminal points, Pipe support drawings (Standard & Non-standard supports like spring supports, snubber supports).\n\tAble to extract BOQ from Piping Iso drawings\n\tAble to calculate the Piping weld joints / Dia inch from Iso drawings\n\tAble to prepare Field weld joints in Iso drawings\n\tKnowledge in Site fabrication spools (Large bore / small bore) as per codes/standards\n\tKnowledge in site fabrication of Standard pipe supports like Tee supports, baseplates etc.,\n\tAble to prepare/set the Daily / Weekly / Monthly Targets for Piping production as per schedule requirements\n\tAble to prepare Schedule in MS Project / MS Excel format and submit progress report with Plan vs Actuals, Manpower allocation plan, Equipment Allocation plan, Tools & Tackles requirement plan as per schedule requirement.\n\tAble to calculate surface area of piping systems for painting / insulation work volume arrival / procurement purpose.\n\tFamiliar with using Auto level station / Theodolite machines for Project Benchmark co-ordinates cross check and transferring to Piping work place requirements.\n\tConduct Line walkdown before Hydro test / Pneumatic test.\n\tFamiliar with Purging requirements, Blowing requirements, N2 preservation requirements\n\tFamiliar with welding processes and its requirements\n\tFamiliar with all type of major Potential Welding defects & its Control measures\n\tFamiliar with All Hand tools, Machines, Fit up tools, Welding Tools, Fabrication machines, Tools required for Piping production including Rigging tools & gears, Hydraulic Jacks etc.,\n\tFamiliar with Crane selection concept for Erection works\n\tFamiliar with Lifting plan preparation for any Critical Lifting / Erection works taking the location of Centre of Gravity factor into consideration\n\tFamiliar with Piping Metallic expansion bellows fit up and installation\n\tFamiliar with Fit up / welding of dis-similar piping materials & its special requirements\n\tFamiliar with NDT requirements like RT, UT, MT, PT\n\tFamiliar with Pre-heating requirements, Post welding Heat treatment requirements\n\tFamiliar with all Piping materials codes & Specifications especially used in Combined Cycle Power plant projects\n\tFamiliar with selection of appropriate Welding electrodes & its applications.\n\tFamiliar with Hydro test procedures, Able to conduct Hydro test / Pneumatic test with all necessary hydro test kits like Temporary spools, Testing manifolds, Pressure hoses, Pressure gauges etc.,\n\tAble to understand, study & prepare the Mark up of Test limits (Hydro test / Pneumatic test) of various piping systems in P&I drawing, Able to understand the Hydro test requirements and execute accordingly.\n\tFamiliar with Chemical cleaning procedures after Hydro test of piping systems\n\tFamiliar with Steam blow out procedures after Chemical cleaning of piping systems with temporary spools arrangements/requirements/Walkdowns/Target plate setting and requirements etc.,\n\tHigh Safety standards implementation with High Production output generation without compromising Quality & within Cost / Budget allocated.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: nureni.babatunde@energy-mgt.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Accountant Job at One Charming Party",
    "link": "https://www.jobgurus.com.ng/jobs/view/accountant-job-at-one-charming-party-1",
    "pubDate": "Fri, 04 Jul 2025 14:42:25 GMT",
    "source": "JobGurus",
    "keyword": "one charming party",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "One Charming Party is a premier luxury event planning and decoration company based in Lagos, Nigeria, with a reach that extends across the country. Renowned for crafting extraordinary celebrations for both children and adults, we specialize in delivering unforgettable and visually stunning events.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWith over 13 years of experience and a portfolio that boasts more than 300 meticulously planned parties, our expertise lies in creating exclusive, personalized experiences. Every element of our bespoke décor is thoughtfully designed to reflect your unique style, leaving a lasting impression on you and your guests. At One Charming Party, we don’t just plan events; we curate exceptional memories and seamless lifestyle management experiences. This is more than an event—it’s the celebration you deserve!\n\nWe are recruiting to fill the position below:\n\nJob Position: Accountant\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nResponsibilities\n\n\n\tManage budgeting, forecasting, and financial planning for events.\n\tTrack expenses to ensure cost efficiency.\n\tHandle vendor payments and client invoicing.\n\tEnsure compliance with tax laws and prepare financial reports.\n\tConduct cost analysis to optimize expenses.\n\n\nRequirements\n\n\n\tDegree in Accounting or Finance; certifications like ACA/ACCA/ICAN preferred.\n\tKnowledge of financial processes in event planning and hospitality.\n\tProficiency in accounting tools (e.g., QuickBooks, Sage).\n\tStrong attention to detail and analytical skills.\n\n\nSalary\nN150,000 / month. \n\nMethod of Application\nInterested and qualified candidates should send their CV to: recruitment@onecharmingparty.com.ng using \"Accountant\" as the subject of the mail.\n\nNote: Proximity to Victoria Island, Lagos is essential for effective team and event management.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Head of Collections Job at Ascentech Services Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/head-of-collections-job-at-ascentech-services-limited",
    "pubDate": "Fri, 04 Jul 2025 14:42:25 GMT",
    "source": "JobGurus",
    "keyword": "ascentech services limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Ascentech Services Limited is a full-fledged Human Resource Solution Provider incorporated in 2013 with its Head Office in Lagos, Nigeria. We are committed to forging long-term partnerships with our clients by creating and delivering robust and flexible services that address the changing needs of their business.\n\nWe are recruiting to fill the position below:\n\nJob Position: Head of Collections\nJob Location: Kano\nEmployment Type: Full-time\nDivision: Credit & Risk Management\nReports To: National Head of Credit\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a highly experienced and field-oriented Head of Credit to oversee all credit-related activities across the Northern region, with a base in Kano.\n\tThe ideal candidate must have a strong background in micro-lending, digital loan companies (e.g., Palmpay, Opay), or microfinance institutions, and possess a deep understanding of risk assessment, credit operations, and grassroots lending dynamics.\n\tThis role demands someone who is not only analytically strong but also highly mobile and hands-on—spending time in the field to assess clients directly, work closely with our sales agents, and help us build a strong, responsible loan portfolio.\n\tFluency in Hausa is required for effective communication and engagement with local customers.\n\n\nKey Responsibilities\n\n\n\tCredit Strategy & Operations\n\tLead credit operations across the Northern region (Kano, Yola, Abuja) in alignment with the company’s credit risk framework.\n\tDesign, implement, and manage credit approval processes that are tailored to the socio-economic realities of the region.\n\tCustomer Assessment & Field Work\n\tCollaborate closely with sales agents to identify high-potential and low-risk customers during onboarding.\n\tPersonally conduct or oversee field visits for credit evaluation, especially for larger or high-risk clients.\n\tMonitor portfolio performance, ensuring high repayment rates and early risk detection.\n\tGuide and support credit officers, CROs, and recovery agents within the region.\n\tEnsure all client assessments include proper due diligence, affordability analysis, and KYC verification.\n\tPromote responsible lending and financial literacy within target communities.\n\tTeam Leadership & Performance Monitoring\n\tSupervise a regional team consisting of 1 CRO, 1 Loan Officer, and 1 Recovery Agent.\n\tDevelop KPIs and performance dashboards to ensure visibility on credit activities and portfolio health.\n\tProvide mentorship and support for continuous learning and ethical field practices.\n\tStakeholder Collaboration\n\tWork closely with the National Head of Credit, risk teams, and sales leadership to align strategies.\n\tAct as the regional liaison for credit-related policy updates and operational changes.\n\tCollaborate with technology teams to improve credit tools and customer experience.\n\tCompliance & Reporting\n\tEnsure strict adherence to credit policies, KYC/AML requirements, and regulatory guidelines.\n\tGenerate and submit regular reports on portfolio performance, delinquency trends, and operational insights.\n\n\nRequired Qualifications & Experience\n\n\n\tMinimum of 5 years of experience in credit, risk management, or loan operations in a loan fintech (e.g., Palmpay, Opay), microfinance bank, or consumer lending institution.\n\tProven field experience in customer evaluation, loan disbursement, and collections.\n\tDeep understanding of grassroots lending, informal sector borrowers, and local market behavior.\n\tBachelor's Degree in Finance, Economics, Business Administration or related fields (MBA or professional certification is a plus).\n\tProficient in Microsoft Excel and data-driven decision-making.\n\n\nKey Competencies & Skills:\n\n\n\tFluency in Hausa (spoken and written) .\n\tStrong interpersonal and communication skills for both fieldwork and internal coordination.\n\tExcellent judgment in assessing borrower risk and ensuring compliance.\n\tHigh level of integrity, accountability, and leadership.\n\tComfortable working in both office and rural field environments.\n\tWorking Conditions:\n\tBased full-time in Kano, with frequent travel to Yola and Abuja.\n\tCombination of office-based responsibilities and regular field assessments.\n\tMay be required to work extended hours based on client or portfolio needs.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: cv@ascentech.com.ng using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "I.T Assistant Job at Gilbert Igweka Global Concept Nigeria Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/it-assistant-job-at-gilbert-igweka-global-concept-nigeria-limited",
    "pubDate": "Fri, 04 Jul 2025 14:42:25 GMT",
    "source": "JobGurus",
    "keyword": "gilbert igweka global concept nigeria limited",
    "duplicate": false,
    "classifications": [],
    "content": "Gilbert Igweka Global Concept Nigeria Limited is currentlyrecruiting suitably qualified candidates to fill the position below:\n\nWe are recruiting to fill the position below:\n\nJob Position: I.T Assistant\n\nJob Location: Ado Ekiti, Ekiti\nEmployment Type: Full-time\n\nJob Description\n\n\n\tWe're seeking an experienced IT Assistant to join our team. The successful candidate will be responsible for maintaining our IT infrastructure.\n\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tNetwork Management: Design, implement, and manage network infrastructure.\n\tSystem Administration: Manage and maintain servers, databases, and applications.\n\tTroubleshooting: Identify and resolve technical issues.\n\tSecurity: Implement and maintain security measures.\n\tCollaboration: Work with teams to ensure IT solutions meet business needs.\n\n\nRequirements\n\n\n\tBachelor's Degree in Computer Science, IT, or related field.\n\t2-3 years of experience in IT engineering.\n\tStrong knowledge of networking, system administration, and security.\n\tExcellent problem-solving and communication skills.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and Application Letter to: itdigital.gig@gmail.com using \"Application for IT Assistant Position\" as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Project Engineer (Oil & Gas) Job at Elvaridah",
    "link": "https://www.jobgurus.com.ng/jobs/view/project-engineer-oil-gas-job-at-elvaridah",
    "pubDate": "Fri, 04 Jul 2025 14:42:25 GMT",
    "source": "JobGurus",
    "keyword": "elvaridah",
    "duplicate": false,
    "classifications": [
      "Software Engineering",
      "Marketing"
    ],
    "content": "At Elvaridah, we emphasize on the critical matters and prospects of organizations such as business growth, strategy, planning, marketing, structure, and people management across different industries. We help companies focus on the growth of their businesses while aligning costs with strategy. With our all-inclusive approach and expertise, we capture values across the boundaries of any organization. Elvaridah focuses on optimizing all the different parts of a business as a unit.\n\nWe are recruiting to fill the position below:\n\nJob Position: Project Engineer (Oil & Gas)\n\nJob Location: Lagos\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Project Engineer is responsible for coordinating engineering and technical activities related to oil and gas projects.\n\tThis role involves designing, planning, and supporting project execution to ensure compliance with industry standards, safety regulations, and project objectives.\n\n\nKey Responsibilities\n\n\n\tAssist in project planning, scheduling, and execution to ensure timely completion.\n\tDevelop engineering designs, specifications, and technical documentation.\n\tCoordinate with contractors, suppliers, and internal teams to ensure smooth operations.\n\tAssist in procurement activities, including reviewing technical bids and specifications.\n\tProvide technical support and troubleshooting during project execution.\n\tPrepare project reports, progress updates, and documentation for stakeholders.\n\tMonitor project performance, ensuring adherence to budget, scope, and quality.\n\tEnsure compliance with safety regulations, industry standards, and company policies.\n\tConduct risk assessments and implement mitigation strategies.\n\tCollaborate with the Project Manager and other team members to optimize project efficiency.\n\n\nQualifications & Skills\n\n\n\tBachelor’s Degree in Engineering (Mechanical, Civil, Petroleum, or related field).\n\t4 - 5 years of experience in oil and gas project engineering.\n\tKnowledge of project management principles and engineering design.\n\tFamiliarity with industry codes and standards (API, ASME, ASTM, etc.).\n\tStrong problem-solving and analytical skills.\n\tExcellent communication and teamwork abilities.\n\tProficiency in engineering software (AutoCAD, SolidWorks, or similar).\n\tUnderstanding of safety protocols and HSE regulations.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: careers@elvaridah.com using “Project Engineer (Oil & Gas)” as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]