[
  {
    "title": "Job Vacancies at TNL Pharmaceutical Company",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancies-at-tnl-pharmaceutical-company",
    "pubDate": "Tue, 10 Jun 2025 11:37:15 GMT",
    "source": "JobGurus",
    "keyword": "tnl pharmaceutical company",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "TNL Pharmaceutical company is one of the leading pharmaceutical in Nigeria and we are recruiting to fill the following positions in Abuja, Benue, Delta, Gombe, Kogi, Abia, Akwa Ibom, Anambra, Cross River , Ebonyi, Edo, Enugu, Lagos and Taraba\n\nWe are recruiting to fill the position below:\n\n1.) Customer Service Officer\n\nJob Locations: Igando, Lagos & Abuja (FCT)\nEmployment Type: Full-time\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tServe as the first point of contact for customer inquiries via phone, email, or in person\n\tResolve customer complaints and issues promptly and professionally\n\tProvide accurate information about products, services, and policies\n\tProcess orders, forms, applications, and requests\n\tMaintain customer records and update account information as needed\n\tEscalate unresolved issues to the appropriate department or supervisor\n\tCollaborate with team members to improve overall customer satisfaction\n\n\nRequirements\n\n\n\tHigh School Diploma or equivalent (additional qualifications in customer service or administration are a plus)\n\tPrevious experience in a customer service or front-desk role preferred.\n\t2 to 3 years of experience as a Medical Sales Representative\n\tExcellent communication and interpersonal skills\n\tStrong problem-solving abilities and attention to detail\n\tAbility to multitask and work under pressure\n\tComputer literacy.\n\n\nApplication Closing Date: 20th June, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV and cover letter to: tnlrecruitment01@gmail.com using the Job Position as the subject of the mail.\n\n \n\n \n\n2.) Demand Generation Manager\n\nJob Locations:  Abuja (FCT) and Igando - Lagos\nEmployment Type: Full-time\n\nJob Responsibilities\n\n\n\tCoordinate sales activities within the region to achieve the agreed sales budgeted value on a monthly basis in line with the company’s objectives and procedures\n\tWork with the available resource to ensure all demand generation activities planned out at the beginning of every month for General hospitals, Private clinics, Pharmacist, Laboratories and trade associations are achieved.\n\tIdentifying, qualifying, and securing business opportunities; coordinating business demand generation activities; developing customized targeted sales strategies\n\tBuilding business relationships with current and potential clients (i.e. Distributors, Prescribers and other sales stakeholder) to ensure the overall financial target of the company is met.\n\tUnderstanding customer and prescriber needs and offering solutions and support; answering potential questions and follow-up call questions; responding to client requests for proposals.\n\tManagement of the customer relations desk to achieved desired customer satisfaction and expected volumes of focus products are achieved.\n\tCollaborating with sales and leadership to secure, retain, and grow accounts\n\tCreating informative presentations; presenting and delivering information to potential customer and prescriber at meetings, industry exhibits, trade shows, and conferences\n\tCreating and maintaining a list/database of prospect clients; maintaining a database (Salesforce, CRM, Excel, etc.) of prospective client information\n\tCold calling; making multiple outbound calls to potential clients; closing sales and working with the client through the closing process\n\tMeeting all quotas for cold, active, inactive calls, appointments, and interviews; meeting or exceeding annual sales goals\n\tMaintaining a pipeline of all sales administration using CRM software\n\tCollaborating with management on sales goals, planning, and forecasting; maintaining short- and long-term business development plans.\n\tDevelop incentive plans that will encourage the entire staff network towards meeting the overall business objectives.\n\tPrepare the monthly report to clearly indicate the company position in relation to set goal and targets towards achieving desire growth plan\n\tPartake in the development of the Global Sales Budget from the regional sales budget cascaded into monthly forcast\n\tCooperate with the Marketing department in developing marketing plan and ensure necessary supports are provided by the sales personnel to achieve the desired objectives.\n\tDevelop the training need and organize relevant on-the-job training for sales and marketing personnel to ensure improvement in individual performances.\n\tManage the New Product Development program to ensure robust products are developed to move the company to the expected financial turnover.\n\tContinuously monitor and develop necessary policy for the sales activities to ensure all transactions are conducted with zero fraudulent and no-unethical incidence.\n\tDevelop and review SOPs relating to Business Development processes to ensure necessary systems are in place to ensure business integrity and consistency.\n\tPartake in periodic demand and supply review meetings to ensure effective product availability.\n\tAny other job related responsibilities as may be assigned from time to time.\n\n\nQualifications and Requirements\n\n\n\tB. Pharm., B.Sc/HND Biochemistry or Science related course (MBA desired)\n\tNot less than 6 years of experience.\n\tMust be computer literate.\n\n\nApplication Closing Date: 15th June, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their Applications to: tnlrecruitment01@gmail.com using the Job Position as the subject of the mail.\n\n \n\n \n\n3.) Medical Sales Representative\n\nJob Location: Igando, Lagos\nEmployment Type: Full-time\n\nJob Responsibilities\n\n\n\tDetailing of company products to Health Care professionals: doctor’s pharmacist, nurses etc. to ensure set of planned objectives are achieved\n\tEnsuring the achievement of sales and products target for assigned respective region, territory and areas.\n\tEnsuring proper implementation of marketing activities such as focus group meetings, clinical meeting and presentations, Lab Forums, Distributor’s Forum and any other scientific based presentations to all Hcp’s.\n\tOrganizing conferences for doctors and other Hcp’s to achieved planned objectives.\n\tBuilding/developing brand kol (Key opinion leaders) at all designated territory/region. Ensuring the scientific updating of the kol on recent informations about company brands and engaging them on prescription generating.\n\tKeeping detailed records of all contacts; (Customer’s data base) for Hospitals, Clinics, Pharmacies and other assigned customer.\n\tReaching (and if possible exceeding) annual sales targets;\n\tPlanning work schedules and weekly and monthly itinerary, collaboratively with Institution Managers.\n\tReporting competitor activity and competitors’ products;\n\tMaintaining knowledge of new developments in Government Regulations, anticipating potential negative and positive impacts on the business and adapting strategy accordingly;\n\tRegularly attending company meetings, technical data presentations and briefings;\n\tKeeping up-to-date with the latest clinical data supplied by the company, and interpreting, presentation and discussing this data with health professionals during presentations;\n\tDeveloping strategies for increasing opportunities to meet and talk to contacts in the medical and health care sector\n\tManaging debt in the region-Staying informed about the activities of health services in a particular area.\n\n\nRequirements\n\n\n\tCandidates should possess a B.Pharm, B. Med. or other related health qualification\n\tMust have 3 years of experience in pharmaceutical Sales and Marketing.\n\tMust be computer literate.\n\n\nApplication Closing Date: 15th June, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their Applications to: tnlrecruitment01@gmail.com using the Job Position as the subject of the mail.\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Sales Executive Job at Bogo Beverage Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/sales-executive-job-at-bogo-beverage-limited-1",
    "pubDate": "Tue, 10 Jun 2025 11:37:15 GMT",
    "source": "JobGurus",
    "keyword": "bogo beverage limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Bogo Beverage Limited is a young and dynamic total manufacturing, distribution and marketing of quality beverage company, with a strong entrepreneurial spirit and growth mindset. We are determined to dominate the beverage sector with our quality brands, apt commercial acumen and cognate experience of the Nigerian consumers and Africa\n\nWe are recruiting to fill the position below:\n\nJob Position: Sales Executive\n\nJob Location: Kano\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a proactive and results-driven Sales Executive to join our dynamic team at a leading beverage company.\n\tThe ideal candidate will be responsible for driving sales growth, maintaining strong relationships with distributors and retailers, and expanding our market presence in Onitsha and surrounding areas.\n\n\nKey Responsibilities\n\n\n\tDevelop and execute effective sales strategies to achieve company targets.\n\tIdentify new sales opportunities and maintain strong relationships with existing customers, distributors, and retail outlets.\n\tNegotiate pricing, delivery, and terms of sale with clients.\n\tMonitor market trends, customer needs, and competitor activity.\n\tConduct regular field visits to ensure product availability and visibility.\n\tManage customer complaints and resolve issues promptly to ensure customer satisfaction.\n\n\nRequirements\n\n\n\tMinimum of OND/HND/B.Sc. in Marketing, Business Administration, or any related field.\n\t3+ years of proven experience in sales, preferably in the beverage or FMCG industry.\n\tStrong understanding of the Island market and its business terrain.\n\tExcellent communication, negotiation, and interpersonal skills.\n\tAbility to work independently and meet targets under minimal supervision.\n\tGood analytical and problem-solving abilities.\n\tShould own a car, know how to drive, possess a valid driver’s license and be willing to travel within designated sales territories.\n\tCandidate must currently reside in Kano\n\tApplicants who do not meet this location requirement will not be considered.\n\n\nMethod of Application\nInterested and qualified candidates should send their corresponding Resumes to: careers.bogo@outlook.com using \"Sales Executive – Kano\" as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Marketing Officer Job at Vet etcetera Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/marketing-officer-job-at-vet-etcetera-limited",
    "pubDate": "Tue, 10 Jun 2025 11:37:15 GMT",
    "source": "JobGurus",
    "keyword": "vet etcetera limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Vet etcetera Limited is a company that is into Integrated farming as well as veterinary cosmetic production.\n\nWe are recruiting to fill the position below:\n\nJob Position: Marketing Officer\nJob Location: Chikuku, Abuja (FCT) \nEmployment Type: Full-time\n\nJob Description / Requirements\n\n\n\tMust posses OND/HND/BSc in Marketing\n\tMust have a valid driver's license\n\tExperience in marketing or communications\n\tStrong social media skills and excellent writing and design abilities.\n\n\nSalary\nN70,000 - N100,000 Monthly.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nMethod of Application\nInterested and qualified candidates should send their Applications and CV to: anorued@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Vacancies at Sterling Health HMO",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancies-at-sterling-health-hmo",
    "pubDate": "Tue, 10 Jun 2025 11:37:15 GMT",
    "source": "JobGurus",
    "keyword": "sterling health hmo",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Sterling Health HMO is a National Health Insurance Agency (NHIA)-accredited Health Maintenance Organization (HMO) that has been providing 24/7/365 quality affordable healthcare service to the public and private sector nationally since 2007.\n\nWe are recruiting to fill the following positions below:\n\n1.) Operations Manager\n\nJob Location: Lagos, NG\nJob Type: Full Time \n\nRequirements\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tA Chartered Accountant (ACA) not less than 10 years post qualification with experience in a similar Healthcare setting or HR/IT setting or Finance and Administration\n\tMBA is an advantage.\n\tAge not less than 45 years old.\n\n\nRemuneration\nSalary & benefits are negotiable for the well qualified applicants.\n\nMethod of Application\nInterested and qualified candidates should forward their CV to: Sterlinghmo@gmail.com using the Job Position as the subject of the email.\n\n \n\n \n\n2.) Accounts Officer\n\nJob Location: Lagos, NG\nJob Type: Full Time \n\nRequirements\n\n\n\tMinimum qualification HND / BSc Accounts.\n\tThe vacancy exists to Reconcile Accounts and Claims payments between the HMO and partner Hospital/Healthcare providers in a timely manner.\n\tIt is a task assignment and KPIs must be met\n\tExperience in a similar setting will be an advantage.\n\n\nMethod of Application\nInterested and qualified candidates should forward their CV to: Sterlinghmo@gmail.com using the Job Position as the subject of the email.\n\n \n\n3.) ICT / Digital Media Manager\n\nJob Location: Lagos, NG\nJob Type: Full Time \n\nDetails\n\n\n\tAs a tech driven Company, the qualified applicant is expected to lead the ICT team with innovative solutions and world class resources.\n\tMust be capable of developing, leading industry-related content, interpreting regular data analytics and research on improving cutting edge technology \n\tExperience in a similar Healthcare setting on Managerial level is required.\n\tAge not less than 35 years.\n\n\nMethod of Application\nInterested and qualified candidates should forward their CV to: Sterlinghmo@gmail.com using the Job Position as the subject of the email.\n\n \n\n4.) Senior Nurse\n\nJob Location: Lagos, NG\nJob Type: Full Time \n\nRequirements\n\n\n\tCertified Nurses\n\tNot less than 10 years of post qualification\n\tNot less than 35 years old\n\tExperience in an HMO setting is an advantage.\n\n\nMethod of Application\nInterested and qualified candidates should forward their CV to: Sterlinghmo@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Openings at Candel FZE",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-candel-fze",
    "pubDate": "Tue, 10 Jun 2025 11:37:15 GMT",
    "source": "JobGurus",
    "keyword": "candel fze",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "The Candel FZE is a manufacturing company engaged in the development, production, marketing and distribution of agrochemicals, specialised fertilisers, seeds and allied products in Nigeria.It is located in the Lekki Free Zone, Ibeju- Lekki; near Dangote Refinery, Lagos.\n\nWe are recruiting to fill the following positions below:\n\n1.) Trainee Accountant\n\nJob Location: Lagos\n\nJob Description\n\n\n\tWe are looking for a responsible Trainee Accountant who will work with a Senior Accountant.\n\n\nJob Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDaily duties include making income or expense entries into the accounting system.\n\tEntering vendor invoices, paying bills and creating invoices for clients.\n\tChecking entries for accuracy; making necessary corrections and filing documents as needed.\n\tWorking on payroll, quarterly taxes, asset inventory, cost accounting or other disciplines within the accounting department.\n\tThe trainee accountant will work with qualified and experienced accountants and begin to appreciate how different core functions operate within the organization.\n\n\nJob Requirements\n\n\n\tCandidates should possess a B.Sc in Accounting (minimum of Second Class Honors, Upper Division) from one of Nigeria’s universities\n\tOur Ideal candidate is aged not more than 25 years old.\n\n\nApplication Closing Date: 15th July, 2025.\n\nMethod of Application\nInterested and qualified candidates should submit their CV to: hr@candelcorp.com using the Job Position as the subject of the email.\n\n \n\n \n\n2.) Truck Driver\n\nJob Location: Ibeju Lekki, Lagos\nEmployment Type: Full-time\n\nJob Description\n\n\n\tWe are looking for a licensed truck driver who will be responsible for the safe and timely delivery of goods and other articles of trade to our customers.\n\tYou will be tasked with driving and maintaining trucks that will be assigned to you, as well as working closely with our team of dispatchers in order to plan routes and track deliveries.\n\n\nResponsibilities\n\n\n\tDrive long distances to deliver goods to customers.\n\tRecord cargo deliveries.\n\tRefuel and clean vehicle.\n\tFollow traffic laws.\n\tInspect trucks and record issues.\n\tFollow accident procedures.\n\tReport mechanical problems to maintenance personnel.\n\tGet goods to the client on time.\n\tMaintain a positive attitude with customers.\n\tKeep commercial driver license up to date.\n\n\nRequirements\n\n\n\tMust be able to drive a 5 tonne (Dyna), 15 tonne, and 30 tonne (container carrying) truck.\n\tCandidates should have completed Senior Secondary School.\n\tOur ideal candidate should be above the age of 35 years old.\n\tComfortable driving to any part of Nigeria.\n\tFluency in more than one of Nigeria’s major languages and at least three years of experience.\n\n\nApplication Closing Date: 9th July, 2025.\n\nMethod of Application\nInterested and qualified candidates should submit their CV to: hr@candelcorp.com using the Job Position as the subject of the email.\n\n \n\n3.) Qualified Accountant\n\nJob Location: Lagos\n\nAbout the Role\n\n\n\tAs a Qualified Accountant, reporting to the General Manager (Finance and Accounts), you will play a crucial role in managing and overseeing the company's financial records and reporting. \n\tYou will be responsible for ensuring accuracy, compliance, and providing valuable insights to support strategic decision-making.\n\n\nKey Responsibilities\n\n\n\tOverseeing and managing the day-to-day accounting operations.\n\tPreparing and analyzing financial statements (e.g., balance sheet, income statement, cash flow statement) in our countries of operation.\n\tEnsuring compliance with relevant accounting standards (e.g., IFRS) and local standards in our countries of operation.\n\tManaging the general ledger and ensuring its accuracy.\n\tPreparing and filing tax returns and ensuring tax compliance in our countries of operation.\n\tPreparing and analyzing group budgets and forecasts.\n\tProviding financial analysis and reporting to management.\n\tLiaising with external auditors and regulatory authorities in our countries of operation.\n\tDeveloping and implementing accounting policies and procedures.\n\tConducting internal audits and ensuring adherence to internal controls in our countries of operation.\n\tReconciling bank accounts and other financial recordsin our countries of operation.\n\tDeveloping, mentoring and supervising junior accounting staff.\n\tContributing to the continuous improvement of accounting processes.\n\tPerforming other accounting duties as assigned.\n\n\nQualifications and Experience\n\n\n\tBachelor's Degree in Accounting, Finance, or a related field. A Master's degree in Business, Accounting or Finance will be an advantage.\n\tMaximum of 8 years of progressive accounting training and experience, preferably from any of the global big four accounting firms, a Free Zone environment or a similar industry.\n\tProfessional accounting certification (e.g., ACA, ACCA, CPA) is mandatory.\n\tStrong knowledge of accounting principles, practices, and regulations (including IFRS).\n\tProven experience in preparing and analyzing financial statements.\n\tExcellent understanding of tax laws and compliance requirements in Nigeria and /or Ghana.\n\tProficiency in accounting software and ERP systems (e.g., Microsoft Dynamics, Sage, QuickBooks).\n\tAdvanced proficiency in Microsoft Excel and other MS Office Suite applications.\n\tStrong analytical, problem-solving, and decision-making skills.\n\tExcellent attention to detail and accuracy.\n\tStrong communication (both written and verbal) and interpersonal skills.\n\tAbility to work independently and as part of a team.\n\tStrong organizational and time-management skills with the ability to meet deadlines.\n\n\nWhat We Offer\n\n\n\tA competitive salary and benefits package.\n\tOpportunities for professional growth and development.\n\tA dynamic and supportive work environment within the Lekki Free Zone.\n\tThe chance to contribute to the success of a growing organization in the agriculture, manufacturing and distribution industries.\n\n\nApplication Closing Date: 7th July, 2025.\n\nMethod of Application\nInterested and qualified candidates should submit their CV to: hr@candelcorp.com using the Job Position as the subject of the email.\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]