[
  {
    "title": "Job Vacancies at Dreamcity Property & Investment Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancies-at-dreamcity-property-investment-limited-1",
    "pubDate": "Thu, 19 Jun 2025 13:28:37 GMT",
    "source": "JobGurus",
    "keyword": "dreamcity property & investment limited",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance"
    ],
    "content": "Dreamcity Property & Investment Limited remains at vanguard of residential and commercial real estate development across major cities in Nigeria, delivering reliable residential structures with quality infrastructures, luxury apartments in highbrow cities and commercials real estate with good returns for our investors, whom have overtime become part of our success story.\n\nWe are recruiting to fill the following positions below:\n\n1.) Business Development Manager\n\nJob Location: Abuja (FCT) and Lagos\nEmployment Type: Full-time (Onsite)\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a dynamic and experienced Business Development Manager for our estate industry with the ability to drive business development, marketing, and sales initiatives.\n\tThe ideal candidate will be responsible for handling statutory and regulatory compliance, strategic planning, and fostering key client relationships.\n\tThe role requires a minimum of 5 years of relevant experience and educational qualifications in Business Management or a related field.\n\n\nResponsibilities\n\n\n\tDevelop and implement strategic business development plans to drive growth and expansion.\n\tLead marketing and sales efforts to attract new clients and maintain existing relationships.\n\tEnsure compliance with statutory and regulatory requirements in the estate industry.\n\tIdentify new business opportunities and market trends to capitalize on market potential.\n\tCollaborate with internal teams to optimize business processes and enhance operational efficiency.\n\tConduct market research and analysis to identify competitive advantages and positioning.\n\tPrepare and present business proposals, reports, and presentations to stakeholders.\n\tManage and mentor a team of business development professionals to achieve targets.\n\tMonitor industry developments, competitor activities, and customer feedback to inform business strategies.\n\tEstablish and maintain strong partnerships with key stakeholders, clients, and industry associations.\n\n\nRequirements\n\n\n\tBachelor's Degree in Business Management, Marketing, or a related field; Master's degree preferred.\n\tProven track record of at least 5 years in business development, marketing, and sales in the estate industry.\n\tStrong understanding of statutory and regulatory compliance requirements in the real estate sector.\n\tExcellent communication, negotiation, and interpersonal skills.\n\tStrategic thinker with the ability to analyze market trends and develop innovative business strategies.\n\tLeadership qualities with experience in managing and motivating teams.\n\tProficiency in CRM software, MS Office suite, and other business development tools.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: recruitment.office@dreamcityproperty.com using the Job Position and Location as the subject of the email.\n\n \n\n2.) General Manager\n\nJob Locations: Jabi, Abuja (FCT) and Victoria Island, Lagos\nEmployment Type: Full-time & Onsite\n\nJob Summary\n\n\n\tAre you an accomplished professional with a wealth of experience in administration, HR, marketing, business development, construction site supervision, and real estate management?\n\tAre you ready to take the lead and drive success in the ever-evolving world of real estate and property construction? If so, we have a fantastic opportunity for you!\n\tAt DreamCity Group, a leading real estate and property construction company, we are seeking a highly skilled and motivated General Manager to oversee our operations, drive growth, and ensure excellence in all aspects of our business.\n\tWe are looking for an individual with at least 7 years of experience in the industry and a strong track record of success.\n\n\nResponsibilities\n\n\n\tOversee administration, HR, Sales, marketing, business development, construction site supervision, and real estate management functions.\n\tDevelop and maintain strong relationships with clients, stakeholders, and partners to drive target sales results, business growth and secure new opportunities.\n\tSales strategy development, lead generation and management, sales forecasting and reporting and sales targets achievement\n\tMonitor and analyze market trends, identify new market segments, and develop innovative strategies to expand our business footprint.\n\tEnsure exceptional project execution by overseeing construction site supervision, quality control, and adherence to timelines and budgets.\n\tLead and inspire a high-performing team, fostering a culture of team work collaboration, growth, and excellence.\n\tOversee financial management, including budgeting, forecasting, and cost control measures to achieve profitability targets.\n\tEnsure compliance with regulatory requirements and industry standards in all aspects of our operations.\n\n\nRequirements\n\n\n\tRelevant educational qualifications in Business Administration, Construction Management, or a related field.\n\tMinimum of 7 years of experience in administration, HR, sales, marketing, business development, construction site supervision, and real estate management in the real estate and property construction industry.\n\tProven track record of success in driving business growth, securing new clients, and expanding market presence.\n\tStrong leadership skills, with the ability to inspire and motivate teams to achieve exceptional results.\n\tExcellent communication, negotiation, and presentation skills.\n\tIn-depth knowledge of the real estate and property construction industry, including market trends, regulations, and best practices.\n\tAbility to multitask, prioritize, and manage projects effectively in a fast-paced environment.\n\n\nMethod of Application\nInterested and qualified candidates should submit their CV to: recruitment.office@dreamcityproperty.com using the Job Position and Location as the subject of the email.\n\nNote: Only shortlisted candidates will be contacted for further selection stages.\n\n \n\n \n\n3.) Sales Executive\n\nJob Location: Victoria Island, Lagos\nEmployment Type: Full-time\nSlots: 5 Openings\n\nJob Description\n\n\n\tAre you an ambitious and results-driven sales professional with a passion for the real estate and construction industry?\n\tWe have an exciting opportunity for a Sales Executive (Female & Male) to join our team.\n\tWe are seeking someone with a minimum of 3 years of relevant experience and relevant educational qualifications to contribute to our sales efforts and help us achieve our monthly sales targets.\n\n\nResponsibilities\n\n\n\tGenerate leads and actively seek out new sales opportunities in the real estate and construction industry\n\tBuild and maintain relationships with potential clients, understanding their needs and providing appropriate solutions\n\tConduct sales presentations and negotiations to close deals within specified timelines\n\tCollaborate with the sales team to meet and exceed personal / team monthly sales targets\n\tProvide exceptional customer service, ensuring client satisfaction and fostering long-term relationships\n\tStay updated on industry trends, market conditions, and competitor activities\n\tUtilize Excel, CRM software and other sales tools to track sales activities, manage customer data, and generate reports\n\tCollaborate with marketing teams to develop effective sales campaigns and promotional materials\n\tAttend industry events, conferences, and networking opportunities to expand professional networks and generate leads\n\tLead Management, including keeping accurate records of sales activities, sales calls, meetings, and follow-ups\n\tConduct site and project inspections with prospective clients and customers for sales closures.\n\tProvide regular feedback and insights to the sales team and management to drive sales growth\n\tStay up-to-date with product knowledge and industry developments.\n\n\nRequirements\n\n\n\tCandidates should possess minimum of a First Degree or HND qualification\n\tMinimum of 3 years of successful experience in sales, business development, marketing, preferably in the real estate and construction industry\n\tStrong educational background in Sales, Marketing or other fields\n\tProven track record of meeting or exceeding sales targets\n\tResult-oriented mindset with a focus on achieving sales goals\n\tProficiency in CRM software, office suites and other relevant sales tools.\n\tExcellent communication, negotiation, and interpersonal skills\n\tStrong ability to build and maintain relationships with clients\n\tAbility to work independently and as part of a team.\n\tSelf-motivated and driven to succeed.\n\tAbility to work in a fast-paced environment and meet deadlines.\n\n\nMethod of Application\nInterested and qualified candidates should submit their CV to: recruitment.office@dreamcityproperty.com using the Job Position and Job Location as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Procurement and Logistics Officer Job at International Organization for Migration",
    "link": "https://www.jobgurus.com.ng/jobs/view/procurement-and-logistics-officer-job-at-international-organization-for-migration",
    "pubDate": "Thu, 19 Jun 2025 13:28:37 GMT",
    "source": "JobGurus",
    "keyword": "international organization for migration",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "International Organization for Migration (IOM) is a related organisation of the United Nations, and as the leading UN agency in the field of migration, works closely with governmental, intergovernmental and non-governmental partners. IOM is dedicated to promoting humane and orderly migration for the benefit of all. It does so by providing services and advice to governments and migrants.\n\nWe are recruiting to fill the position below:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Position: Procurement and Logistics Officer - Expedited SVN Recruitment\nJob Identification: 15549\nJob Location: Katsina\nJob Schedule: Full-time\nContract Type: Special Short Term Graded (Up to 9 months)\nVacancy Type: Special Vacancy Notice\nRecruiting Type: General Service\nGrade: G-5\n\nContext\n\n\n\tWorking under the overall supervision of the Supply Chain Officer (SCO) and the direct supervision of the Head of Sub Office the incumbent will be responsible for the coordination and implementation of the procurement process including obtaining quotations, tendering, purchases and deliveries of supplies/services at the Katsina Sub-Office as well as the Mission in Nigeria in accordance with IOM’s Procurement policies and procedures.\n\n\nResponsibilities\n\n\n\tReceive Purchase Requisition Forms and make sure are fully endorsed prior to procuring using the IOM authorization matrix as applicable for the Sub-Office and Mission as a whole.\n\tAssist Requesting units in requirements definition by providing information on products available in the market and their specifications.\n\tPrepare objective evaluation criteria to evaluate bids for Works, services and supply in coordination with requesting units and ensure these criteria are featured in the solicitation documents before advertising or sharing them with potential Bidders.\n\tSolicit Quotations/Proposals, prepare Bids Analysis Summaries (BAS) in conformity to the requirements shown in the Purchase requisition Form (PRF) and issue Purchase Order (PO) through WAVE Oracle. Make sure POs are delivered to vendors and their signatures obtained and filing system are up-to-date\n\tOrganize and facilitate Pre-Bid Conferences by inviting potential Bidders and sharing relevant information regarding Tenders.\n\tGuide the Bids Evaluation and Awards Committee on the process of Bids Opening, evaluation and recommendation while ensuring full compliance with IOM Procurement Rules and Regulations;\n\tEnsure all procurements are performed in accordance with the IOM procurement rules (IN168 Rev.3 and implement existing mechanisms to avoid fraud and ensure transparency to complement the IOM rules and regulations on procurement.\n\tProvide a monthly checklist on Open Purchase orders and Purchase Requests and follow up with relevant colleagues to ensure their timely closure in the WAVE Oracle Module.\n\tCoordinate preparation of contracts using the standard IOM template for procuring services, goods and works for the organization and follow up with the legal department on their review and to obtain their endorsement in support of the Sub-Office’s and Mission’s operations\n\tParticipate in negotiations with contracted firms on the implementation of activities under the project components and monitor progress of contracts implementation to ensure that they abide by the stipulated standards, procedures and planned procurement timetables.\n\tConduct post-evaluation checks of selected/shortlisted Bidders by carrying out reference checks and vendor searches against exclusion databases of the UN/Governmental agencies.\n\tFollow-up with suppliers and ensure timely delivery of requested supplies and services and keep the concerned project staff informed on the status of the delivery as well as invoice submission\n\tCoordinate with the receiving units on Goods/Services to be received and obtain the satisfactory delivery notes, Goods Receipt Notes and invoices from the receiving unit.\n\tMake sure both IOM and Beneficiary assets are created appropriately in WAVE Oracle prior to procurement and are acquired, transferred and retired in accordance with IOM’s asset management practices.\n\tPrepare and maintain price list database of regular supplies for the Sub-Office and provide information on price estimates to Requesting Departments for preparation of Purchase Requests\n\tDevelop Key Performance Indicators (KPI’s) with the guidance and support of the Procurement and Logistics Officer (PLO), document the performance of Supplier against the Established long Term Agreements (LTAs) using established KPI’s and follow up with suppliers on improvements.\n\tEnsure safe running condition of the fleet and Office Power Generators by monitor accuracy of records according the Vehicle/Generator Logbooks, Servicing/Maintenance records & Fuel Consumption.\n\tPerform any other duties as may be required from time to time.\n\n\nRequirements\nEducation:\n\n\n\tUniversity Degree in Business Administration, Purchasing & Supply or a related field from an accredited academic institution\n\n\nExperience:\n\n\n\tAt least two years of experience in Supply Chain Management. \n\tSkills and knowledge in Conducting local/international procurement, clearing & forwarding, Government laws and regulations, insurance and inventory/stock/supplies and management. \n\tVery good understanding of IOM Procurement and Logistics policies. \n\tKnowledge of Oracle is desired \n\tCommon software applications such as Word, Excel, PowerPoint, and Access. \n\tDemonstrated ability to maintain integrity in performing responsibilities assigned. Add in details xxx\n\n\nSkills:\n\n\n\tSkills and knowledge in Conducting local/international procurement, clearing & forwarding, Government laws and regulations, insurance and inventory/stock/supplies and management.\n\tVery good understanding of IOM Procurement and Logistics policies.\n\tKnowledge of Oracle is desired,\n\tCommon software applications such as Word, Excel, PowerPoint and Access.\n\tDemonstrated ability to maintain integrity in performing responsibilities assigned.\n\n\nLanguages:\n\n\n\tFor all applicants, fluency in English Language is required (oral and written).\n\tIOM’s official languages are English, French and Spanish.\n\tProficiency of language(s) required will be specifically evaluated during the selection process, which may include written and/or oral assessments.\n\n\nRequired Competencies\nCompetencies will be assessed during the selection process.\n\nValues - all IOM staff members must abide by and demonstrate these three values:\n\n\n\tInclusion and respect for diversity: Respects and promotes individual and cultural differences. Encourages diversity and inclusion.\n\tIntegrity and transparency: Maintains high ethical standards and acts in a manner consistent with organizational principles/rules and standards of conduct.\n\tProfessionalism: Demonstrates ability to work in a composed, competent and committed manner and exercises careful judgment in meeting day-to-day challenges.\n\tCourage: Demonstrates willingness to take a stand on issues of importance.\n\tEmpathy: Shows compassion for others, makes people feel safe, respected and fairly treated.\n\n\nCore Competencies – behavioural indicators (Level 1):\n\n\n\tTeamwork: Develops and promotes effective collaboration within and across units to achieve shared goals and optimize results.\n\tDelivering results: Produces and delivers quality results in a service-oriented and timely manner. Is action oriented and committed to achieving agreed outcomes.\n\tManaging and sharing knowledge: Continuously seeks to learn, share knowledge and innovate.\n\tAccountability: Takes ownership for achieving the Organization’s priorities and assumes responsibility for own actions and delegated work.\n\tCommunication: Encourages and contributes to clear and open communication. Explains complex matters in an informative, inspiring and motivational way.\n\n\nManagerial Competencies – behavioural indicators (Level 1) (applicable only if position is with direct reports):\n\n\n\tLeadership: Provides a clear sense of direction, leads by example and demonstrates the ability to carry out the Organization’s vision. Assists others to realize and develop their leadership and professional potential.\n\tEmpowering others: Creates an enabling environment where staff can contribute their best and develop their potential.\n\tBuilding Trust: Promotes shared values and creates an atmosphere of trust and honesty.\n\tStrategic thinking and vision: Works strategically to realize the Organization’s goals and communicates a clear strategic direction.\n\tHumility: Leads with humility and shows openness to acknowledging own shortcomings.\n\n\nRequired Skills:\n\n\n\tSupply Chain Management, Procurement, Warehouse and Stock Management, Transport / Freight Logistics (Goods and Materials)\n\n\n \n\nNotes\n\n\n\tAny offer made to the candidate in relation to this vacancy notice is subject to funding confirmation.\n\tThis selection process may be used to staff similar positions in various duty stations. Recommended candidates will remain eligible to be appointed in a similar position for a period of 24 months.\n\tThis post is subject to local recruitment. Only those holding a valid residence and work permit for the country where this position is based will be eligible for consideration.\n\tAppointment will be subject to certification that the candidate is medically fit for appointment, verification of residency, visa, and authorizations by the concerned Government, where applicable.\n\tIOM has a zero-tolerance policy on conduct that is incompatible with the aims and objectives of the United Nations and IOM, including sexual exploitation and abuse, sexual harassment, abuse of authority and discrimination based on gender, nationality, age, race, sexual orientation, religious or ethnic background or disabilities.\n\tIOM does not charge a fee at any stage of its recruitment process (application, interview, processing, training or other fee). IOM does not request any information related to bank accounts.\n\tIOM only accepts duly completed applications submitted through the IOM online recruitment system. The online tool also allows candidates to track the status of their application.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Openings at Auldon Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-auldon-limited",
    "pubDate": "Thu, 19 Jun 2025 13:28:37 GMT",
    "source": "JobGurus",
    "keyword": "auldon limited",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance"
    ],
    "content": "Auldon Limited is a toy trading company strategically located in the commercial centre of idumota Lagos Nigeria, it is a wholesale distribution organization servicing major departmental stores, Multi-National Organizations and educational institutions within Nigeria and its sub-region. Founded as Arigold Toys in 1996 before transforming into a limited liability company, with the registration RC-439491 and named auldon limited in the year 2002. Auldon was featured on Forbes as the biggest toy trading company in Nigeria with a valuation of over $10 million.\n\nWe are recruiting to fill the following positions below:\n\n1.) E-Commerce Manager\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Location: Idumota, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe are currently recruiting for an E-Commerce Manager who will be responsible for the overall strategy, operations, and performance of a company's online sales channels.\n\tHe/She will develop and implement strategies to drive revenue growth, manage online stores, innovate new digital experiences, and oversee product rollouts.\n\tThis role requires a blend of strategic thinking, technical skills, and strong communication abilities.\n\n\nKey Responsibilities\n\n\n\tDeveloping and Executing E-commerce Strategy: This includes setting goals, identifying target audiences, and defining the overall online sales approach.\n\tManaging Online Stores: Ensuring the website is functioning optimally, managing product listings, and optimizing the user experience to increase sales and customer satisfaction.\n\tOverseeing Product Rollouts: Translating commercial goals into briefs for creative and website development teams, and implementing changes to the online store for new product launches.\n\tInnovating New Digital Experiences: Staying up-to-date with industry trends, analyzing website data, and brainstorming new ideas to improve the online customer experience.\n\tBuilding and Maintaining E-commerce Websites: This includes managing product pages, landing pages, and other aspects of the website's functionality.\n\tCommunication: Effectively communicating the needs of the e-commerce channel to other departments and understanding the needs of other teams to ensure alignment and collaboration.\n\tData Analysis: Analyzing website data, sales figures, and customer behavior to identify areas for improvement and make data-driven decisions.\n\n\nRequirements\n\n\n\tBachelor’s Degree in Business, Marketing, E-Commerce, IT, or a related field.\n\t3 - 5 years of experience as an e-commerce manager or in a similar e-commerce or digital marketing role.\n\tStrong understanding of digital marketing and e-commerce technologies\n\tExcellent communication and interpersonal skills\n\tStrong analytical and problem-solving abilities\n\tExperience with e-commerce platforms (e.g., Shopify, Magento)\n\tProven track record of driving revenue growth\n\tLeadership and team management experience\n\tAbility to manage multiple projects simultaneously.\n\n\nSalary\nN150,000 - N250,000 Monthly. \n\nApplication Closing Date: 3rd July, 2025.\n\nMethod of Application\nInterested and qualified candidate should send their CV to: operations@auldontoys.com using Job Position as the subject of the mail.\n\n \n\n2.) Social Media Manager / Content Creator\n\nJob Location: Lagos Island, Lagos\nEmployment Type: Full-time\n\nJob Description\n\n\n\tWe are looking for a talented Social media manager/Content creator to administer our social media accounts.\n\tYou will be responsible for creating original text and video content, managing posts and responding to followers.\n\tYou will manage our company image in a cohesive way to achieve our marketing goals.\n\tAs a Social media manager, we expect you to be up-to-date with the latest digital technologies and social media trends.\n\tYou should have excellent communication skills and be able to express our company's views creatively. Ultimately, you should be able to handle our social media presence, ensuring high levels of web traffic and customer engagement.\n\n\nResponsibilities\n\n\n\tPerform research on current benchmark trends and audience preferences\n\tDesign and implement a social media strategy to align with business goals\n\tSet specific objectives and report on ROI\n\tGenerate, edit, publish and share engaging content daily, e.g. original text, photos, videos and news.\n\tMonitor SEO and web traffic metrics\n\tCollaborate with other teams, like marketing, sales and customer service, to ensure brand consistency\n\tCommunicate with followers, respond to overleaves in a timely manner and monitor customer reviews.\n\n\nQualifications and Requirements\n\n\n\tBachelor's degree in Marketing, Communications, or related field.\n\tMinimum of 3 years of experience in social media management or digital marketing.\n\tProven track record of developing and implementing successful social media strategies and campaigns.\n\tStrong understanding of social media platforms, algorithms, and best practices.\n\tExcellent written and verbal communication skills.\n\n\nApplication Closing Date: 1st July, 2025.\n\nMethod of Application\nInterested and qualified candidate should send their CV to: operations@auldontoys.com using Job Position as the subject of the mail.\n\n \n\n3.) Graphics Designer / Video Editor\n\nJob Location: Lagos Island, Lagos\nEmployment Type: Part-time\n\nJob Summary\n\n\n\tWe are currently recruiting for a Graphics Designer / Video Editor that can help to visually represent the company’s creative products.\n\n\nResponsibilities\n\n\n\tEditing video content for various platforms\n\tDesigning graphics for marketing materials, and social media\n\tWorking under tight deadlines\n\tMaintaining a high standard of quality\n\tStaying up-to-date with industry trends\n\tCollaborating with marketing and creative teams\n\tEnsuring consistency in brand messaging\n\tCreating engaging content that resonates with customers\n\tCreating compelling and effective logos, designs, print and digital media\n\tCreating attractive Graphic & Video Content.\n\n\nQualifications\n\n\n\tDegree in Graphic Design, Visual Arts, or a related field.\n\t2 - 4 years of experience as a Graphic Designer and Video Editor.\n\tStrong portfolio showcasing design and video editing skills.\n\tProficiency in design and video editing software (Adobe Creative Suite, Final Cut Pro, etc.).\n\n\nSalary:\nN150,000 Monthly.\n\nApplication Closing Date: 1st July, 2025.\n\nMethod of Application\nInterested and qualified candidate should send their CV to: operations@auldontoys.com using Job Position as the subject of the mail.\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]