[
  {
    "title": "General Manager Job at PNN Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/general-manager-job-at-pnn-group",
    "pubDate": "Mon, 30 Jun 2025 20:41:26 GMT",
    "source": "JobGurus",
    "keyword": "pnn group",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "PNN is a pan-African technology service provider that began operations out of Nigeria in 1998, playing a significant role in the development of the communications and power sectors of the economy. Over the last 21 years, we have grown into a group of companies focused on the sale, deployment and management of communications and power infrastructure throughout Africa. We provide cost efficient services to our clients, allowing them focus on their core business of service delivery.\n\nWe are recruiting to fill the position below:\n\nJob Position: General Manager\n\nJob Location: Nigeria\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe're seeking an experienced General Manager to lead our team with a strong background in the Payment Terminal Service Provider (PTSP) industry.\n\tThe ideal candidate will have proven leadership skills, industry expertise, and a track record of driving business growth.\n\n\nKey Responsibilities\n\n\n\tDevelop and implement business strategies to drive growth and profitability (Strategic Leadership)\n\tOversee daily operations, ensuring efficiency and compliance (Operations Management)\n\tLead and motivate cross-functional teams (Team Management)\n\tLeverage PTSP knowledge to identify opportunities and mitigate risks (Industry Expertise)\n\tFoster relationships with partners, vendors, and regulatory bodies (Stakeholder Management)\n\tMonitor financial performance and ensure sustainable growth (Financial Management)\n\tIdentify and mitigate operational risk, ensuring compliance with regulatory requirements (Risk Management)\n\n\nRequirements\n\n\n\tBachelor's Degree in Business Administration, Finance, or a related field\n\t5-10 years of experience in the PTSP industry, preferably in a leadership role\n\tProven track record of business growth and strategic leadership\n\tStrong understanding of payment terminal services, industry trends, and regulations\n\tExcellent leadership, communication, and interpersonal skills\n\tStrong financial management and analytical skills\n\n\nPreferred Qualifications:\n\n\n\tExperience with payment processing, acquiring, and switching\n\tKnowledge of industry-specific regulations (e.g., PCI-DSS)\n\tFamiliarity with technology trends in payment terminals.\n\n\nWhat We Offer\n\n\n\tCompetitive salary and benefits package\n\tOpportunity to lead a dynamic team\n\tProfessional growth and development.\n\n\nMethod of Application\nInterested and qualified candidates should send their Resume and Cover Letter to: hr@pnngroup.net using the Job Position  as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Business Development Manager Job at Swift Consulting",
    "link": "https://www.jobgurus.com.ng/jobs/view/business-development-manager-job-at-swift-consulting",
    "pubDate": "Mon, 30 Jun 2025 20:41:26 GMT",
    "source": "JobGurus",
    "keyword": "swift consulting",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "Swift Consulting - We are experts in our fields of work, we use the most modern systems and up-to date knowledge to provide support in all fields particularly in Human Resources, Accounting and Finance, Facility Management, Health Maintenance, Education and Business Management. Our team consists of experts in different professions with a wealth of experience in different sectors both within and outside Nigeria.\n\nWe are recruiting to fill the position below:\n\nJob Position: Business Development Manager\nJob Location: Ikoyi, Lagos\nEmployment Type: Full-time (Hybrid)\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are currently recruiting for a qualified and well experienced applicant to fill the role of Business Development Manager for one of our clients in the Logistics/Tech industry.\n\n\nResponsibilities\n\n\n\tLead, motivate, and manage the sales team to meet and exceed targets.\n\tAddress team challenges and ensure consistent performance.\n\tBuild and maintain strong client relationships, ensuring customer satisfaction and loyalty.\n\tDevelop and execute sales strategies to achieve and exceed revenue targets.\n\tAnalyze sales data to identify trends, opportunities, and areas for improvement.\n\tTrack and analyze sales data to optimize performance.\n\n\n\n\n\nRequirements\n\n\n\tBSc/ HND Degree in Business Administration, Marketing, or any relevant field.\n\tProven experience in the same or similar role, preferably in the Logistic/Transport firm and Financial institutions.\n\tStrong communication, analytical, problem solving and Leadership skills.\n\tProficiency in CRM software, sales analytics tools, and other sales enablement technologies.\n\tFemales are strongly advised to apply.\n\n\nSalary\nCompetitive.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hireme@swiftconsulting.com.ng using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Openings at Ziba Consulting",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-ziba-consulting-1",
    "pubDate": "Mon, 30 Jun 2025 20:41:26 GMT",
    "source": "JobGurus",
    "keyword": "ziba consulting",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Ziba Consulting - We offer recruitment services to organizations and we are recruiting suitable candidates to fill the position below:\n\n1.) General Manager\n\nJob Location: Victoria Island, Lagos\nWork Schedule: 6 days per week, 8-hour shift\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are looking for an experienced and results-driven General Manager to oversee all aspects of restaurant operations, drive profitability, and ensure the highest standards of service and efficiency.\n\tThe ideal candidate has 2–3 years of management experience, with a proven ability to lead teams, streamline processes, and manage performance.\n\tExperience in the hospitality industry is an added advantage.\n\n\nKey Responsibilities\n\n\n\tOversee the daily operations of the restaurant, ensuring a smooth, efficient, and profitable workflow.\n\tLead and supervise department heads, including restaurant, kitchen, finance, and support teams.\n\tDevelop and implement business strategies that enhance productivity, service quality, and customer satisfaction.\n\tManage budgets, control costs, and ensure financial targets are met.\n\tMonitor inventory, procurement, and supplier relationships for efficiency and cost-effectiveness.\n\tEnsure compliance with health, safety, and hygiene standards.\n\tTrain, mentor, and evaluate staff performance to build a motivated and capable team.\n\tAnalyze business performance data and prepare regular reports for senior stakeholders.\n\tResolve customer complaints and implement service improvements.\n\tPromote a positive and professional work culture within the organization.\n\n\nRequirements\n\n\n\tBachelor’s Degree in Business Administration, Hospitality Management, or a related field.\n\t2 – 3 years of proven experience in a managerial role; experience in the hospitality or restaurant industry is an added advantage.\n\tStrong leadership, communication, and interpersonal skills.\n\tExcellent problem-solving and decision-making abilities.\n\tFinancial acumen with experience managing budgets and operational KPIs.\n\tProficiency in Microsoft Office and familiarity with POS or restaurant management systems.\n\tAbility to work flexible hours, including evenings and weekends.\n\n\nCompensation & Benefits\n\n\n\tCompetitive salary of N250,000 monthly.\n\tPerformance-based bonuses\n\tOpportunity for career growth in a reputable and growing brand\n\n\nApplication Closing Date: 21st July, 2025.\n\nClick here to apply online\n\n \n\n2.) Internal Auditor\n\nJob Location: Victoria Island, Lagos\nEmployment Type: \nWork Schedule: 6 days per week, 8-hour shift\nReports to: General Manager\n\nJob Summary\n\n\n\tWe are seeking a detail-oriented and analytical Internal Auditor to evaluate and enhance our financial and operational performance.\n\tThe ideal candidate will have 2–3 years of relevant auditing experience and a keen eye for identifying risk, inefficiencies, and areas for improvement in processes related to financial controls, compliance, inventory management, and operational procedures.\n\tYou will work closely with the General Manager and senior management to ensure accountability, mitigate risks, and maintain strong internal control systems across all departments.\n\n\nKey Responsibilities\n\n\n\tConduct regular internal audits across all departments to evaluate internal controls, operational efficiency, and compliance with company policies.\n\tReview financial documents, accounting records, and transaction processes to ensure accuracy and transparency.\n\tWork closely with management to implement improvements in internal processes and compliance measures.\n\tSupport management in identifying fraud risks and investigating any irregularities.\n\tEnsure adherence to financial regulations, statutory laws, and tax compliance.\n\tMonitor and audit inventory systems to identify stock discrepancies, waste, and theft.\n\tAssess the effectiveness of procurement, cash handling, payroll, and vendor payment systems.\n\tPrepare detailed audit reports, highlighting key findings, risks, and recommendations for corrective actions.\n\tConduct follow-up audits to ensure previously identified issues have been resolved.\n\tProvide recommendations to enhance cost control, profitability, and risk management.\n\n\nRequirements\n\n\n\tBachelor’s degree in Accounting, Finance, or a related field.\n\t2–3 years of relevant internal audit or accounting experience (restaurant or hospitality experience is an added advantage).\n\tStrong understanding of accounting principles, financial reporting, and risk assessment.\n\tProficiency in using accounting software and Microsoft Excel.\n\tHigh level of integrity, accuracy, and attention to detail.\n\tStrong analytical, organizational, and problem-solving skills.\n\tAbility to work independently and communicate audit findings effectively to management.\n\tSound knowledge of local tax and financial regulations.\n\tProfessional certification (e.g., ACA, ACCA, CIA) is a plus but not mandatory.\n\tCandidates in their 40s are advised to apply.\n\n\nCompensation\n\n\n\tCompetitive salary ranging from N170,000 – N200,000 / month.\n\tPerformance-based bonuses\n\n\nApplication Closing Date: 21st July, 2025.\n\nClick here to apply online\n\n \n\n3.) Talent Acquisition Specialist\n\nJob Location: Lekki, Lagos\nReports To: Internal HR & COO\n\nJob Summary\n\n\n\tThe Internal Recruiter plays a key role in driving the end-to-end recruitment process by engaging with clients and ensuring that each role is filled efficiently with top-quality candidates.\n\tThis role requires strong organizational skills, attention to detail, and the ability to manage multiple recruitment pipelines simultaneously while maintaining excellent client communication.\n\n\nKey Responsibilities\nClient Engagement & Communication:\n\n\n\tLiaise with clients to gather job briefs and clarify role requirements.\n\tProvide consistent updates to clients on the status of their roles.\n\tCoordinate interview scheduling, feedback, and follow-up communications.\n\n\nRecruitment Coordination:\n\n\n\tSubmit qualified profiles to clients professionally and on time.\n\tConduct initial screening interviews to ensure candidate alignment.\n\n\nProcess Improvement & Oversight:\n\n\n\tIdentify bottlenecks or delays in the recruitment process and escalate where necessary.\n\tCollaborate with the Internal HR Manager to develop and refine recruitment processes and SOPs.\n\tEnsure consistency and adherence to timelines and client expectations.\n\n\nCollaboration & Documentation:\n\n\n\tDocument all communications, role updates, and feedback accurately.\n\tMaintain organized records of candidate submissions and client correspondence.\n\n\nKey Performance Indicators (KPIs)\n\n\n\tTimeliness of client updates and candidate submissions.\n\tClient satisfaction and feedback.\n\tInterview-to-shortlist conversion rate.\n\tRole Fill rate within agreed timelines.\n\tCoordination effectiveness with external recruiters.\n\n\nRequirements\n\n\n\tBachelor’s Degree in Human Resources, Business Administration, or related fields.\n\t1–3 years of experience in recruitment, talent acquisition, or HR coordination.\n\tStrong communication and relationship management skills.\n\tAbility to multitask and manage multiple roles across various industries.\n\tProficiency in Google Workspace (Docs, Sheets, Gmail), job boards, and sourcing platforms.\n\tHighly organized, deadline-driven, and detail-oriented.\n\n\nSalary\nN150,000 - N200,000 Monthly.\n\nApplication Closing Date: 18th July, 2025.\n\nClick here to apply online\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "IT Specialist Job at Unified Payment Services Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/it-specialist-job-at-unified-payment-services-limited",
    "pubDate": "Mon, 30 Jun 2025 20:41:26 GMT",
    "source": "JobGurus",
    "keyword": "unified payment services limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Unified Payment Services Limited is Nigeria’s premier Payments & Financial Technology company that operates as a shared infrastructure for the banking community in Nigeria and Payments Service Provider within and outside Nigeria, with a vision to be the most preferred e-payment service provider in Africa.\n\nWe are recruiting to fill the position below:\n\nJob Position: IT Specialist\n\nJob Location: Lagos\n\nJob Objective(s)\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tTo provide technical support to hope psbank by ensuring optimal functioning of digital banking channels and platforms, implementing new solutions, and maintaining system stability and performance.\n\n\nDuties & Responsibilties\n\n\n\tExecute technical implementation of new digital banking solutions and upgrades.\n\tGenerate daily, weekly, monthly, and quarterly performance and operations reports.\n\tConduct testing and deployment of updates across Hope banking channels including USSD, Internet Banking, Agency, and Mobile platforms.\n\tPerform continuous monitoring of transactions across all banking channels to ensure seamless operations.\n\tTrack and manage issues using a structured issue management system.\n\tConduct daily monitoring and performance checks on the Hope Core Banking Application (PRIME).\n\tPerform and validate daily data backup procedures.\n\tProvide second-level support to the Hope PSBank Customer Care team.\n\tMonitor daily transaction flow on Hope’s processing system (HDP).\n\tOversee resource utilization and performance of the Hope Digital Platform servers.\n\tUndertake assigned ad-hoc tasks to support team and organizational goals.\n\n\nJob Requirements\n\n\n\tEducation: B.Sc. / B.Tech / B.Eng Degree in Information Technology, Computer Science, Engineering, or other relevant Applied Sciences.\n\tExperience:\n\t\n\t\t4 - 6 years of relevant experience in system integration, software testing, or quality assurance.\n\t\tExperience with agency banking solutions is a strong advantage.\n\t\n\t\n\n\nKey Competency Requirements:\nKnowledge: \n\n\n\tE-payment industry knowledge Behavioural\n\tResults oriented\n\tDemonstrates Integrity\n\tProactive\n\tDecisive\n\tAnalytical Creative & Innovative.\n\n\nSkills & Competencies:\n\n\n\tProficiency in Postgress, Microsoft SQL Server management studio\n\tGood troubleshooting and analytical skills.\n\tGood written and verbal communication skills and excellent collaborative skills.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: ademuyiwa.adetunji@up-ng.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Head, Procurement Job at E?clat Human Resource Consulting",
    "link": "https://www.jobgurus.com.ng/jobs/view/head-procurement-job-at-eclat-human-resource-consulting",
    "pubDate": "Mon, 30 Jun 2025 20:41:26 GMT",
    "source": "JobGurus",
    "keyword": "e?clat human resource consulting",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "E?clat Human Resource Consulting is a specialized and progressive management firm headquartered in Abuja, Nigeria. Our focus is to enable our clients to achieve their desired outcomes by providing them with bespoke workable systems, structures, and people.\n\nOur team represents a diverse spectrum of professionals who are solution-oriented and dedicated to promoting the practice of statutory ethical business advisory while rendering services for public, private, and third-sector organizations. We understand that every client is unique, therefore we take responsibility for each client’s experience, their firm, and its resources\n\nWe are recruiting to fill the position below:\n\nJob Position: Head, Procurement\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Location: Wuse 2, Abuja (FCT) \nEmployment Type: Full-time\n\nResponsibilities\nThe ideal candidate will (but is not limited to):\n\n\n\tDevelop and execute a comprehensive procurement strategy aligned with the overall business objectives and financial goals of the hospitality group/hotel.\n\tIdentify opportunities for cost savings, efficiency improvements, and value creation across all procurement categories.\n\tEstablish and maintain strong, mutually beneficial relationships with key suppliers, vendors, and contractors.\n\tLead negotiations for terms, and pricing to secure the most favorable conditions while ensuring quality and service standards.\n\tImplement and manage inventory control systems to optimize stock levels, minimize waste, and prevent stockouts, particularly for perishable goods.\n\tEnsure timely delivery of goods and services, coordinating with relevant departments to meet operational demands.\n\tDevelop and implement best practices for purchasing, order placement, receiving, and storage.\n\tMonitor and report on key procurement metrics, including cost savings, supplier performance, and compliance.\n\tDevelop and implement a robust supplier selection and evaluation process, including due diligence, performance monitoring, and risk assessment.\n\tAddress and resolve supplier performance issues, disputes, and non-compliance promptly and effectively.\n\tOversee the entire procure-to-pay cycle, from requisition to payment, ensuring efficiency and accuracy.\n\tDevelop, implement, and enforce procurement policies, procedures, and ethical guidelines to ensure transparency, fairness, and accountability.\n\tEnsure compliance with all local, national, and international laws, regulations, and industry standards (e.g., food safety, health & safety, import/export).\n\tIdentify and mitigate procurement-related risks, including supply chain disruptions, quality issues, and financial exposure.\n\tImplement sustainable procurement practices, considering environmental and social impacts in purchasing decisions.\n\tForecast future procurement needs and market trends to proactively address potential supply chain disruptions and opportunities.\n\tContribute to the annual budgeting process by providing accurate cost projections and identifying potential areas for cost reduction.\n\tProvide strong leadership, mentorship, and support to the procurement team, fostering a culture of teamwork, reliability, and a positive attitude, and identifying needs for role-specific training.\n\tEnsure that all procurement activities adhere strictly to internal policies, industry regulations, and requirements.\n\tCollaborate closely with all internal departments to understand their needs and ensure procurement supports their objectives.\n\tProvide expert advice and support to internal stakeholders on procurement-related matters.\n\tParticipate in management meetings and contribute to overall business strategy.\n\n\nRequirements\n\n\n\tA Bachelor's Degree in Supply Chain Management, Business Administration, Economics, Engineering, or a closely related field.\n\tMinimum of 7 years of progressive experience in procurement or supply chain management, with at least 3 years in a senior leadership or management capacity.\n\tDemonstrated expertise in strategic sourcing, complex contract negotiation, and robust supplier relationship management.\n\tProven ability to drive significant cost savings and implement process improvements that lead to efficient day-to-day operations.\n\tStrong command of procurement software.\n\n\nRequired Competencies:\n\n\n\tAbility to develop high-level strategies while ensuring their seamless execution through efficient day-to-day tasks and operational precision.\n\tProven capability to secure advantageous terms and build strong, reliable partnerships with suppliers, crucial for smooth operation.\n\tExceptional ability to lead, mentor, and empower a diverse team, fostering teamwork.\n\tStrong analytical skills to interpret complex data and l enhance efficiency and smooth operation.\n\tSolid understanding of financial principles, budget management, and total cost of ownership to drive profitable and efficient procurement decisions.\n\tOutstanding verbal, written, and presentation skills, with the ability to effectively engage in customer interaction.\n\n\nMode of Application\nInterested and qualified candidates should send their CVs to: jobs.eclathrconsulting@gmail.com using \"Head, Procurement, Abuja\" as the email subject.\n\nNote: Only shortlisted candidates will be contacted.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]