[
  {
    "title": "Business Development Officer Job at Natafamdavid Consulting Nigeria Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/business-development-officer-job-at-natafamdavid-consulting-nigeria-limited",
    "pubDate": "Sat, 28 Jun 2025 15:38:35 GMT",
    "source": "JobGurus",
    "keyword": "natafamdavid consulting nigeria limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Natafamdavid Consulting Nigeria Limited is a business growth consultancy company offering tailor made services targeted at building profitable and productive companies with a focus on building sustainable enterprises, comprehensive HR advisory services, brand growth, corporate governance, business strategy and advisory services at different sections of the value chain.\n\nOur services are across-the-board and we are driven by a strong passion to create value for our clients. From the het go, we set out to work with clients across diverse industries, providing strategic solutions to increase our success matrix, productivity, profitability.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Business Development Officer\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\n\nResponsiblilites\n\n\n\tIdentify and pursue new business opportunities to increase restaurant revenue\n\tDevelop and maintain relationships with corporate clients, event planners, and local businesses\n\tImplement marketing strategies to attract new customers and retain existing ones\n\tConduct market research to understand trends and customer preferences\n\tCollaborate with the restaurant team to create attractive catering packages, special events, and loyalty programs\n\tMeet and exceed sales targets and KPIs\n\tRepresent the restaurant at networking events and food industry expos\n\tPrepare regular reports on sales performance and business opportunities\n\n\nRequirements\n\n\n\tProven experience in business development, sales, or marketing—preferably in hospitality, F&B, or related industries\n\tStrong communication, negotiation, and interpersonal skills\n\tExcellent organizational and time-management abilities\n\tCreativity in identifying and capitalizing on growth opportunities\n\tBachelor’s degree in Business Administration, Marketing, Hospitality Management, or related field (preferred).\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: nadrecruitmentng@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Life Underwriter Job at Fortis Global Insurance Plc",
    "link": "https://www.jobgurus.com.ng/jobs/view/life-underwriter-job-at-fortis-global-insurance-plc",
    "pubDate": "Sat, 28 Jun 2025 15:38:35 GMT",
    "source": "JobGurus",
    "keyword": "fortis global insurance plc",
    "duplicate": false,
    "classifications": [],
    "content": "Fortis Global Insurance Plc. ’FGI’ is a dynamic and innovative force poised to redefine the insurance landscape in Nigeria. We are driven by a singular vision: to deliver unparalleled value and a seamless experience to every customer.\n\nAt FGI, we believe the future of insurance is intelligent, intuitive, and deeply personal. We are built from the ground up as a technology-driven enterprise, leveraging cutting-edge solutions to simplify complex processes, enhance accessibility, and provide swift, reliable service. Our digital-first approach ensures that managing the insurance needs of our clients is effortless, secure, and always at their fingertips.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Life Underwriter\nJob Location: Lagos\nEmployment Type: Full-time\nDepartment: Underwriting\nReports to: Head of Underwriting\n\nJob Summary\n\n\n\tThe Life Underwriter is responsible for evaluating life insurance applications and determining the risk eligibility of applicants in line with company policies and regulatory requirements.\n\tThis role involves analyzing medical report, financial, occupational, and lifestyle information to assess mortality risk and ensure sound underwriting decisions that align with the company’s risk appetite and profitability goals.\n\n\nKey Responsibilities\n\n\n\tReview and assess life insurance applications for completeness and accuracy.\n\tEvaluate risk based on medical history, financial background, lifestyle, and occupation using underwriting guidelines and automated systems.\n\tInterpret medical reports, attending physician statements (APS), lab results, and paramedical exams.\n\tMaintain up-to-date knowledge of underwriting guidelines, medical advancements, and regulatory changes.\n\tEnsure compliance with internal policies, industry standards, and legal requirements.\n\tAssist in training junior underwriters and supporting underwriting audits, if applicable.\n\tMake accurate decisions regarding approval, rating, postponement, or denial of life insurance applications within assigned authority limits.\n\tCollaborate with reinsurance partners for facultative underwriting cases.\n\tCommunicate effectively with agents, brokers, and internal stakeholders to clarify underwriting decisions.\n\tContribute to continuous improvement in underwriting practices and risk assessment tools.\n\n\nQualifications and Experience\n\n\n\tBachelor’s degree in insurance, business, health sciences, or related field.\n\tMinimum 3-5 years of experience in life insurance underwriting.\n\tCertification or working toward a professional designation\n\tStrong understanding of medical terminology, underwriting guidelines, and mortality risk factors.\n\tExperience working with automated underwriting systems and reinsurance platforms.\n\tExcellent analytical, decision-making, and organizational skills.\n\tStrong verbal and written communication abilities.\n\tAttention to detail and ability to work independently and under pressure.\n\n\nKey Competencies:\n\n\n\tRisk Assessment\n\tMedical & Financial Analysis\n\tCommunication & Interpersonal Skills\n\tConfidentiality & Professionalism\n\tDecision-Making\n\tRegulatory Compliance\n\tCustomer Focus\n\tTeam Collaboration.\n\n\nMethod of Application\nInterested and qualified candidates should send a copy of their updated CV to: recruitment@fortisglobalinsurance.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Junior Product Manager Job at Co Creation Hub",
    "link": "https://www.jobgurus.com.ng/jobs/view/junior-product-manager-job-at-co-creation-hub",
    "pubDate": "Sat, 28 Jun 2025 15:38:35 GMT",
    "source": "JobGurus",
    "keyword": "co creation hub",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "CcHUB is Nigeria’s first open living lab and pre-incubation space being designed to be a multi-functional, multi-purpose space where work to catalyze creative social tech ventures take place. The HUB is a place for technologists, social entrepreneurs, government, tech companies, impact investors and hackers in and around Lagos to co-create new solutions to the many social problems in Nigeria.\n\nWe are recruiting to fill the position below:\n\nJob Position: Junior Product Manager\n\nJob Location: Lagos\nJob type: Full-time\n\nJob Purpose\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAs a Junior PM you will be responsible for assisting the Product team in developing and managing the teams suite of products.\n\tYou will be in charge of coming up with ideas or strategies that improve products as well as increase its user base.\n\n\nKey Responsibilities\n\n\n\tCollaborate with engineering and design teams to define and deliver high-quality products.\n\tPrepare and maintain clear Product Requirement Documents (PRDs), user flows, and detailed specifications.\n\tTranslate product vision into actionable requirements that align with business objectives.\n\tAnalyze user data, conduct market research, and identify opportunities for product improvement.\n\tPlan and execute usability tests to uncover product issues and track performance.\n\tCoordinate feedback across teams, ensuring alignment between product direction and company goals.\n\tPartner with marketing to develop strategies that drive product adoption and engagement.\n\tGather and interpret customer feedback to inform product decisions and prioritize feature enhancements.\n\n\nQualifications\nKey Competencies:\n\n\n\tEducational Background: Holds a B.Sc degree in Computer Science, a scientific discipline, or a related field.\n\tIndustry Experience: At least 2 years of experience as a Product Manager, specifically within a SaaS environment.\n\tFoundational Knowledge in Product Management: Completed formal training or courses in product management principles and practices.\n\tTeam Collaboration: Experience working within cross-functional product teams, contributing to end-to-end product development.\n\tHands-On Product Development: Practical experience in building and launching software products, with a clear understanding of the product lifecycle.\n\tProject Management & Execution: Strong project management skills with a keen attention to detail and ability to manage timelines and deliverables.\n\tProcess & UX Mindset: Demonstrates a strong focus on efficiency, user experience, and continuous process improvement.\n\tCommunication Skills: Excellent verbal and written communication skills in English, with the ability to clearly convey complex ideas to diverse audiences.\n\tDomain Knowledge (added advantage): Experience in EdTech or the education sector is an added advantage.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Tax Manager, Africa Job at Zipline",
    "link": "https://www.jobgurus.com.ng/jobs/view/tax-manager-africa-job-at-zipline",
    "pubDate": "Sat, 28 Jun 2025 15:38:35 GMT",
    "source": "JobGurus",
    "keyword": "zipline",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Zipline - Do you want to change the world? Zipline uses drones to deliver critical and life-saving medicine to thousands of hospitals serving millions of people in multiple countries. Our mission is to provide every human on Earth with instant access to vital medical supplies. Join Zipline and help us make this a reality for billions of people.\n\nWe are recruiting to fill the position below:\n\nJob Position: Tax Manager, Africa\n\nJob Location: Lagos\nJob Schedule: Full-time\n\nAbout You and the Role  \n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are looking for a hands-on, motivated Tax Manager to manage all African country taxes. We are located in Cote D’Ivoire, Ghana, Kenya, Nigeria, and Rwanda. You will manage all taxes (excluding payroll taxes) in these countries to ensure they’re accurately and timely filed. You will collaborate with the Accounting and Finance team to ensure tax-related accounts are correctly reflected in the financials. \n\tYou will perform reviews of the income tax provision for statutory financial reporting and corporate income tax returns. \n\tYou will collaborate with local Accounting and Finance leads on tax audits. \n\tAs our key tax person, you will continue to look for ways to increase efficiency in the tax processes without sacrificing quality while looking for ways to minimize our taxes through thoughtful tax planning ideas. \n\tThe Africa Tax Manager will report to the Head of Tax with a dotted line to African Country Controller. The Africa Tax Manager will serve as the Tax Lead for all African countries. \n\n\nWhat You'll Do\nThe Africa Tax Manager will perform the following duties:\n\n\n\tPrepare VAT and other indirect tax returns for all African countries\n\tPrepare monthly tax account reconciliations\n\tPrepare audit ready tax workpapers and documentation\n\tPrepare and manage quarterly Corporate Income Tax (CIT) tax declarations and any required payments\n\tGather documentation and manage all (CIT) returns to ensure returns are accurately and timely filed by external tax preparers\n\tManage African countries tax calendar to ensure timely filing of all tax returns and declarations\n\tCollaborate with local accounting and finance leads to manage tax audits \n\tCollaborate with the Accounting and Finance teams to address all tax related matters\n\tReview annual income tax provision calculations\n\tAssist in preparing and reviewing transfer pricing calculations\n\tReview and monitor intercompany transactions for tax implications\n\tProvide tax consultation and training to other business functions\n\tProvide tax development and updates to the Head of Tax and other business functions\n\tLiaise and manage relationship with outside tax advisors\n\tCollaborate with Head of Tax to develop and implement tax planning ideas\n\tContinue to enhance and improve internal control in the tax area\n\tSupport other countries outside of Africa as needed\n\n\nRequirements\nWhat You'll Bring:\n\n\n\tCandidates should a Bachelor's Degree Bachelor’s Degree in Accounting, Finance, or related field\n\tAt least 7 years of tax experience working with a multinational company with operations in various African countries and/or similar experience from an international public accounting firm\n\tGraduate degree or professional certification is a plus \n\tStrong analytical, problem-solving and organizational skills\n\tExcellent communication (oral and written) and interpersonal skills\n\tAbility to work in a fast-paced environment and willing to work outside of business hours with colleagues overseas primarily in the USA\n\tProficient with software such as Microsoft Officer Suite and/or Google G Suite specifically Excel and Google Sheet.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]