[
  {
    "title": "Accountant Job at JMK Nigeria Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/accountant-job-at-jmk-nigeria-limited",
    "pubDate": "Mon, 30 Jun 2025 21:14:51 GMT",
    "source": "JobGurus",
    "keyword": "jmk nigeria limited",
    "duplicate": false,
    "classifications": [],
    "content": "JMK Nigeria Limited is a multipurpose business enterprise in the retail and beauty fields.\n\nWe are recruiting to fill the position below:\n\nJob Position: Accountant\nJob Location: Ilorin, Kwara\nEmployment Type: Full-time\n\nResponsibility\n\n\n\tMaintain accounts of a multipurpose business ranging from beauty salon to supermarket.\n\n\nRequirements\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tCandidates should possess an HND qualification with 2 years of work experience.\n\n\nMethod of Application\nInterested and qualified candidates should submit in writing, a formal Letter of Application and an updated CV to: ayodele.toyin1@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Procurement Officer Job at Olusco Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/procurement-officer-job-at-olusco-group",
    "pubDate": "Mon, 30 Jun 2025 21:14:51 GMT",
    "source": "JobGurus",
    "keyword": "olusco group",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Olusco Group is a reputable business conglomerate with specialized service in Real Estate Development, Management and Consultancy. We are more than just a business conglomerate; we're a partner in helping you simplify your everyday life, and giving you the freedom to be more human by availing you luxurious eco- friendly futuristic smart homes.\n\nWe’re deeply invested in identifying and developing prime real estate locations, and creating luxurious homes and structures that are tailored to our clients' needs and preferences. We pride ourselves in our consistent delivery of customer satisfaction, professionalism, and commitment to excellence.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Procurement Officer\nJob Location: Abuja (FCT)\nEmployment Type: Full-time\n\nResponsibilities\n\n\n\tIdentify potential suppliers, conduct supplier evaluations, and negotiate contracts and pricing terms.\n\tManage vendor relationships and monitor supplier performance to ensure compliance with contractual agreements and quality standards.\n\tCoordinate with internal stakeholders, such as production, finance, and operations, to align procurement activities with business needs.\n\tMaintain accurate records of procurement transactions, contracts, and vendor information.\n\tMonitor inventory levels and forecast demand to ensure adequate stock levels while minimizing carrying costs.\n\tStay abreast of market trends, industry developments, and regulatory requirements to inform procurement decisions.\n\tIdentify opportunities for cost savings and process improvements within the procurement function.\n\tDevelop and implement procurement strategies to optimize sourcing and supplier selection processes.\n\n\nQualifications and Requirements\n\n\n\tBachelor's degree in Business Administration, Supply Chain Management, or related field.\n\t3+ years of experience in procurement or supply chain roles.\n\tStrong negotiation and contract management skills.\n\tExcellent communication and interpersonal abilities.\n\tProficiency in procurement software and Microsoft Office Suite is a plus.\n\tAnalytical thinking and problem-solving skills.\n\tAbility to work independently and as part of a team.\n\tAbuja residents only.\n\n\nSalary\nN150,000 - N200,000 Monthly.\n\nMethod of Application\nInteretsed and qualified candidates should send their Cover Letter and CV to: oluscogroupofcompanies@gmail.com using the Job Position as the subject of the mail.\n\nNote: Only qualified candidates would be contacted for an interview.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Teller Officer Job at Mecer Consulting Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/teller-officer-job-at-mecer-consulting-limited",
    "pubDate": "Mon, 30 Jun 2025 21:14:51 GMT",
    "source": "JobGurus",
    "keyword": "mecer consulting limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Mecer Consulting Limited is a world class Human Capital Development and Business Growth Re-engineering firm. Our services include, but not limited to: Workforce Development - ISO (QMS, EMS, FSMS, ITMS, MDQMS and all other quality certification) Implementation and Audit.\n\nWe are recruiting to fill the position below:\n\nJob Position: Teller Officer\nJob Location: Abuja (FCT)\nEmployment Type: Full-time\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tProcess financial transactions (deposits, withdrawals, transfers, loan payments)\n\tMaintain accurate records and ensure compliance with regulations\n\tProvide exceptional customer service and promote bank products/services\n\tBalance cash drawer and identify/reconcile discrepancies\n\tHandle customer inquiries and complaints professionally\n\n\nRequirements\n\n\n\tBachelor’s degree or HND in Accounting, Finance, or related field\n\t1-2 years of experience as a Teller or in a customer-facing role\n\tStrong numerical and analytical skills\n\tHigh level of integrity and attention to detail\n\tExcellent communication and interpersonal skills\n\n\nMethod of Application\nInterested and qualified candidates should send a copy of their CV to: recruitment@mecer.consulting using \"Teller\" as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Account Officer (NYSC) - Male Job at Lotus Capital Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/account-officer-nysc-male-job-at-lotus-capital-limited",
    "pubDate": "Mon, 30 Jun 2025 21:14:51 GMT",
    "source": "JobGurus",
    "keyword": "lotus capital limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Lotus Capital Limited is a full-service ethical investment management company specializing in Asset Management, Private Wealth Management, and Financial Advisory services. Lotus Capital is a pioneer in non-interest finance in Nigeria and duly registered with the Securities & Exchange Commission (SEC) as Fund Managers. Over the last 14 years, we have consistently contributed towards the growth of non-interest finance in the Nigerian capital market, and also manage 3 mutual funds listed on the Nigerian Stock Exchange.\n\nWe are recruiting to fill the position below:\n\nJob Position: Account Officer (NYSC) - Male\n\nJob Location: Lagos\nEmployment Type: Nysc\n\nRequirements\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tInterested candidates should possess a Bachelor's Degree in Accounting\n\tMust have 10 - 11 months of NYSC service left\n\tProficient in MS Word and Excel\n\tMust be tech-savvy\n\tMale preferable for gender balance.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: careers@lotuscapitallimited.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]