[
  {
    "title": "Human Resources & Admin Manager Job at International Facilities Services (IFS) Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/human-resources-admin-manager-job-at-international-facilities-services-ifs-group",
    "pubDate": "Wed, 09 Jul 2025 11:14:29 GMT",
    "source": "JobGurus",
    "keyword": "international facilities services (ifs) group",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "International Facilities Services (IFS) Group is a Cleaning and Facility Management company. We are a leading international facility management services group providing maintenance, industrial cleaning, trading & consultancy, & healthcare support services.\n\nWe are recruiting to fill the position below:\n\nJob Position: Human Resources & Admin Manager\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nMain Purpose of the Job\n     \n\n            \n    \n\n\n\n\n\tSupport the growth of companies within the IFS group by providing comprehensive Human Resource and administration services that support the achievement of corporate objectives\n\n\nKey Result Areas\n\n\n\tHR Operations & Recruitment\n\tTraining & Development\n\tPerformance Management\n\tCompensation & Benefit\n\tAdministration\n\n\nKey Performance Areas - Actions\nHR Operations & Recruitment:\n\n\n\tAssess and anticipate human resources-related needs\n\tEnsure effective recruitment, selection and onboarding processes\n\tEnsure proper data capturing, documentation, verifications and adherence to entire recruitment and placement policy outlines.\n\tEnsure proper induction, kitting and placement for all new hires\n\tMake sure to sustain business policy on human resource pool across all levels. i.e. constant pool of recruitable candidates- 3 replacement available for any operational staff position and 2 replacement for any admin and management staff position\n\tPrepare contracts for promotions, transfers, and new hires in collaboration with department management.\n\tEnsure good level of adherence by staff to all business policies\n\tDevelop and manage the annual HR plan and budget.\n\n\nTraining and Development:\n\n\n\tEnsure continual training and retraining of new hires and operatives alike across all locations and branches\n\tFacilitates regular team meetings to discuss issues, share knowledge, share achievements, and provides training and direction.\n\tIdentifies training and development needs and provides the resources needed to develop team members.\n\tResponsible for manpower development – ensure appropriate annual training schedule and ensures completeness and accuracy of training records.\n\n\nPerformance Management:\n\n\n\tEstablish and monitor all employee performance using company tracker and other performance tools\n\tHolds all employees accountable with clear KPI’s, policies & procedures\n\tEstablish and Implement and Monitor Performance Tracking System including Time & Attendance and Work Packs, and SOP’s/KPI’s\n\n\nCompensation, Benefits & Employee Relations:\n\n\n\tResponsible for implementing employee compensation and benefit schemes\n\tEnsures accurate payroll administration and implementation to point of payment.\n\tCommunicate HR policies to employees\n\tManage employee complaints and grievances\n\tProtect the interest of employees and company in accordance with company policies and regulatory requirements\n\tManage employee communication and feedback – email, telephone, newsletters, retreats etc.\n\n\nAdministration:\n\n\n\tEnsure the management of all head office facility and coordinate all other branch locations and staff apartments including security, cleaning and maintenance\n\tEnsure adequate procurement and supplier management\n\tEnsure adequate management of all company motor vehicles\n\tEnsure optimal utilization of power and all other company resources\n\tEnsure smooth running of all the administrative aspects of the business\n\n\nOthers:\n\n\n\tAny other assignment as may be communicated to you by your line manager or management representative\n\n\nQualifications\n\n\n\tInterested candidates should possess a Bachelor's Degree with 7 years of experience.\n\n\nSalary\nN300,000 - N750,000 / Month.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Sales Coach Job at Ecozar Technologies",
    "link": "https://www.jobgurus.com.ng/jobs/view/sales-coach-job-at-ecozar-technologies",
    "pubDate": "Wed, 09 Jul 2025 11:14:29 GMT",
    "source": "JobGurus",
    "keyword": "ecozar technologies",
    "duplicate": false,
    "classifications": [],
    "content": "Ecozar Technology is a leading solar energy company in Nigeria. Specializing in the design, installation and maintenance of micro and mini grid solar projects and inverter power backup solutions.\n\nEcozar Technology is not just any solar company; we stand as a trusted solar energy company in Nigeria, leading the pack among the top solar companies in Lagos our unwavering commitment to meeting the power requirements of Nigeria is evident in every project we undertake, fueled by our passionate pursuit of solar installation excellence across Nigeria. Ecozar Technology \"Building a sustainable energy for the future\".\n\nWe are recruiting to fill the position below:\n\nJob Position: Sales Coach\n     \n\n            \n    \n\n\n\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\n\nSummary\n\n\n\tWe are looking for a Sales Coach to coordinate training activities that will help maximize our sales team’s performance.\n\tSales Coach responsibilities include mentoring new salespeople, designing individual and team training courses and preparing educational material.\n\tTo be successful in this role, you should have a good understanding of sales techniques and the ability to motivate employees of varying seniority.\n\tUltimately, you will help our salespeople develop their skills and achieve their quotas.\n\n\nResponsibilities\n\n\n\tAct as a consultant to salespeople and provide helpful advice on coping with job-related challenges\n\tOnboard and train new salespeople\n\tIdentify individual and team training needs\n\tDevelop educational material, including presentations, sales scripts and case studies\n\tDesign training courses using gamification, role-playing activities and job simulation\n\tGather feedback on all training programs from trainees, managers and instructors\n\tSet annual learning and development objectives for the sales team\n\tMaintain updated records of educational curriculum and material\n\tEvaluate employees’ performance after each training\n\tMonitor costs of training programs.\n\n\nRequirements and Skills\n\n\n\tBSc Degree in Education, Human Resources or relevant fields\n\tWork experience as a Sales Coach, sales trainer or similar role\n\tExperience in a sales or customer service position is a plus\n\tFamiliarity with role-playing activities and e-learning platforms\n\tHands-on experience creating presentations (e.g. videos or slides)\n\tExcellent communication skills with the ability to motivate people\n\tProblem-solving skills\n\tAdditional training certification is a plus.\n\n\nSalary\nN250,000 - N300,000 monthly.\n\nMethod of Application\nInterested and qualified candidates should forward their detailed CV to the human resource personel via: ecozartechnologiesltd@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Cost / Budget Analyst Job at May & Baker Nigeria Plc",
    "link": "https://www.jobgurus.com.ng/jobs/view/cost-budget-analyst-job-at-may-baker-nigeria-plc",
    "pubDate": "Wed, 09 Jul 2025 11:14:29 GMT",
    "source": "JobGurus",
    "keyword": "may & baker nigeria plc",
    "duplicate": false,
    "classifications": [],
    "content": "May & Baker Nigeria Plc was founded on September 4, 1944 as Nigeria's first pharmaceutical company. It has its origin in England, the United Kingdom in 1834 where three chemists founded Grimwade, May & Pickett, a firm for manufacturing chemicals for pharmaceutical products.\n\nWe are recruiting to fill the position below:\n\nJob Position: Cost / Budget Analyst\n\nJob Location: Nigeria\nWorking Hours: Full Time\n\nQualifications\n     \n\n            \n    \n\n\n\n\n\tThe incumbent must possess a minimum of HND/B.Sc in Accountancy or related field, be partly ICAN qualified with a minimum of four years cognate experience in Factory Accounting / Costing and Budgets.\n\tThe preferred candidate must possess good numerical and analytical skills in addition to excellent communication skills.\n\tCandidates must be computer literate with working knowledge of relevant ERP, self-disciplined, methodical and thorough in approach with ability to work cordially within a team to achieve results.\n\n\nJob Benefits\nAttractive and negotiable.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: careers@may-baker.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Content Creator Job at FoliXx Hospitality",
    "link": "https://www.jobgurus.com.ng/jobs/view/content-creator-job-at-folixx-hospitality",
    "pubDate": "Wed, 09 Jul 2025 11:14:29 GMT",
    "source": "JobGurus",
    "keyword": "folixx hospitality",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "FoliXx Hospitality is an organization whose grand purpose is to achieve global relevance among leaders in the hospitality guild, by unparalleled culture and service. We are a resolute people, committed to continuous excellent service delivery, our value systems are built upon: integrity, excellence, attitude, competence, and continuous improvement.\n\nWe are recruiting to fill the position below:\n\nJob Position: Content Creator\n\nJob Location: Ikate, Lekki - Lagos\nEmployment Type: Full-time\n\nAbout the Role\n     \n\n            \n    \n\n\n\n\n\tWe are looking for a talented and proactive Content Creator / Social Media Manager to lead our digital storytelling, grow our brand presence across multiple social platforms, and engage with our online community.\n\tYou’ll be responsible for developing creative content strategies, producing high-quality content (video, graphics, text), managing our social media channels, and analyzing performance to drive growth and engagement.\n\n\nKey Responsibilities\nContent Creation:\n\n\n\tDevelop and execute content strategies aligned with marketing and brand goals.\n\tCreate original, engaging, and platform-appropriate content (videos, Reels, graphics, carousels, memes, blogs, captions, etc.).\n\tShoot and edit short-form video content using tools like CapCut, InShot, or Adobe Premiere.\n\tDesign on-brand graphics using Canva, Photoshop, or other design tools.\n\tPlan and maintain a consistent visual aesthetic across platforms.\n\n\nSocial Media Management:\n\n\n\tManage daily operations of social media accounts (Instagram, TikTok, Twitter, Facebook, LinkedIn, YouTube, etc.).\n\tSchedule, post, and monitor content using tools like Later, Buffer, or Meta Business Suite.\n\tEngage with followers — reply to comments, DMs, and encourage conversation.\n\tIdentify and leverage trends, hashtags, and viral opportunities to boost visibility.\n\tGrow follower count, engagement, and conversions through strategic content and campaigns.\n\n\nCommunity & Influencer Engagement:\n\n\n\tBuild and manage online communities; monitor brand sentiment and audience feedback.\n\tCollaborate with influencers, content partners, and creators to amplify reach.\n\tPlan and execute giveaways, live sessions, and engagement-driven activities.\n\n\nStrategy & Analytics:\n\n\n\tDevelop monthly content calendars and campaign plans.\n\tTrack content performance using native analytics and tools like Meta Insights, Google Analytics, or Sprout Social.\n\tPrepare monthly reports with insights and recommendations for growth.\n\tStay updated on industry trends, platform changes, and competitor activities.\n\n\n\n\n\nRequirements\nPreferred Qualifications:\n\n\n\tDegree in Marketing, Communications, Media, or a related field.\n\tExperience working with lifestyle, fashion, wellness, or service-based brands.\n\tFamiliarity with paid social campaigns (optional but a plus).\n\tBasic knowledge of email marketing or blog management is a bonus.\n\n\nOther Requirements:\n\n\n\tProven experience as a content creator, social media manager, or digital marketer.\n\tStrong portfolio showcasing social media work and content creation.\n\tStrong understanding of Instagram, TikTok, Facebook, Twitter, YouTube, and emerging platforms.\n\tAbility to shoot content with a phone or camera and edit for multiple platforms.\n\tExcellent visual storytelling, copywriting, and editing skills.\n\tProficient with Canva, CapCut, Adobe Suite, or other relevant tools.\n\tKnowledge of SEO, hashtags, and digital marketing best practices.\n\tAbility to work independently, manage multiple projects, and meet deadlines.\n\tCreativity, initiative, and a finger on the pulse of online culture.\n\n\nSalary\nN200,000 - N250,000 monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV and Portfolio to: hr@folixxhospitality.com using the Job Posias the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]