[
  {
    "title": "Sales Representative Job at Agurate Online Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/sales-representative-job-at-agurate-online-limited-2",
    "pubDate": "Fri, 04 Jul 2025 21:14:52 GMT",
    "source": "JobGurus",
    "keyword": "agurate online limited",
    "duplicate": false,
    "classifications": [],
    "content": "Agu.ng is a nationally recognized fashion retailer owned and managed by Agurate Online Limited. Agurate Online Limited was incorporated under the Nigerian laws by the Corporate affairs commission in August 2015. We’re passionate about Fashion retail both online and offline – and it goes way beyond fashion.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nAt Agu.ng, fashion is a way of life. We provide the best fashion materials and accesories. We are located in Onitsha Mall, Enugu mall, Novare mall lekki, Novare Gateway Mall Abuja and Circle mall Osapa. As we strive to bring your lovely fashion to your neighborhood, you can always shop on our website.\nWe differentiate ourselves through a combination of unique designs and styles merged with unequaled standards of quality and authenticity. Our founders Agurate Online limited is a company built on hardwork, fairness and customer satisfaction.\n\nWe are recruiting to fill the position below:\n\nJob Position: Sales Representative \n\nJob Location: Circle Mall, Jakande, Lekki - Lagos\nEmployment Type: Full-time\n\nJob Description\n\n\n\tWe are looking for a young and experienced Sales Associate who will engage and assist walk-in customers with product knowledge to optimize sales opportunities as well as managing financial transactions. (Females Only For Gender Balance)\n\n\nDuties\n\n\n\tWelcome and guide walk-in customers.\n\tProvide accurate information (e.g., product features and pricing).\n\tAnswer customers’ questions about specific products/services.\n\tCross-sell products.\n\tEnsure racks are fully stocked.\n\tInform customers about discounts and special offers.\n\tProvide customer feedback to the Store Supervisor.\n\tStay up to date with new products/services.\n\n\nRequirements\n\n\n\tMust have at least 2 years of sales experience\n\tProximity to Circle Mall is very important\n\tMust stay around Lekki - Ajah axis\n\n\nSalary\nN120,000 / month.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: careers@agu.ng using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Warehouse Officer Job at Food Concepts Plc",
    "link": "https://www.jobgurus.com.ng/jobs/view/warehouse-officer-job-at-food-concepts-plc-2",
    "pubDate": "Fri, 04 Jul 2025 21:14:52 GMT",
    "source": "JobGurus",
    "keyword": "food concepts plc",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Food Concepts commenced operations in 2001. From inception, our aim has been clear-cut and focused: to revolutionize the food sector in West Africa and to deliver extraordinary satisfaction to our stakeholders.\n\nSince launching in 2004, Chicken Republic (Subsidiary of Food concepts) has already opened 55 stores in Nigeria and Ghana. On this basis, we are proud of the brand’s hard-earned reputation as the fastest growing chicken QSR in West Africa and the number 1 chicken QSR in Nigeria (both in revenues and number of outlets). In addition, Chicken Republic was ranked as one of Nigeria’s top 20 brands across all categories (Financial Standards Awards 2009).\n\nWe are recruiting to fill the position below:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Position: Warehouse Officer\n\nRequisition ID: 1917\nJob Location: Oregun, Lagos\nEmployment Type: Full-time\nDepartment:: Supply Chain Department\nReports to (Title): Warehouse/Logistics Manager\n\nJob Purpose\n\n\n\tTo operationalize the company’s warehouse and delivery process and ensure the deliverables and output are in line desired goals and objectives.\n\n\nCore Responsibilities and Key Result Areas\n\n\n\tInventory/Logistics Monitoring\n\tEnsure accuracy of stock picked for shipment\n\tEnsure zero stock losses both in Warehouse and in-transit to production units, regional warehouse hubs and stores\n\tEnsure full monitor adherence to health, safety and environmental guidelines\n\tEnsuring receipt of goods in line with specifications on purchase orders or as instructed by Supply Chain Division\n\tApply appropriate asset management procedures in order to achieve maximum return on assets\n\tPerform continuous evaluation of warehouse security and implementation of necessary measures to maintain safety of stock.\n\tDevelop preventative maintenance systems and contingency plans.\n\tSupport in the offloading and loading of stocks in the warehouse\n\tEscort stocks to defined destination and ensure issuance is according to the waybill and invoice.\n\tParticipate in cycle counting and monthly stock count activities\n\tMaintain high standard of housekeeping and hygiene in work area assigned\n\tProvide regular update on stock position as may be required\n\tGenerate picklist based on requisition from the various units\n\tUpdate bin cards based on shipments of stock items to different Business units\n\tUpdate bin cards based on items received into the warehouse.\n\n\nKey Performance Indicators\n\n\n\tQuality of stock delivered\n\tSavings on goods/services\n\tLevel of target achieved\n\tDelivery turnaround time\n\n\nJob Specifications\n\n\n\tA minimum of a Bachelor’s Degree in Business Administration is required\n\tMinimum of 2 years of experience in similar role.\n\tPossession of any relevant certification is essential\n\n\nKnowledge Requirements:\n\n\n\tKnowledge of warehouse management procedures and best practices\n\tKnowledge of warehouse management software and database\n\tKnowledge of warehousing, distribution and maintenance operations\n\tKnowledge of QSR/Food Industry trends/ practices.\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Electrical Engineer Job at Bakery Solutions Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/electrical-engineer-job-at-bakery-solutions-limited",
    "pubDate": "Fri, 04 Jul 2025 21:14:52 GMT",
    "source": "JobGurus",
    "keyword": "bakery solutions limited",
    "duplicate": false,
    "classifications": [],
    "content": "Bakery Solutions Limited (Bread Meal) is a bakery located around Ikeja close to Omole Phase 1 Area, its a bakery known for their kind of produts. It has a clean working enviroment and it is well organized.\n\nWe are recruiting to fill the position below:\n\nJob Position: Electrical Engineer\n\nJob Location: Ojodu Berger, Lagos\n\nResponsibilities\n\n\n\tElectrical Installation\n\tWiring\n\tDetecting of electrical fault.\n\tGeneral Maintenance work\n\n\nRequirements\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tInterested candidates should possess a Bachelor's Degree / HND or NCE qualification. \n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: okechukwu.ibem@breadmealng.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Business Development Adviser Job at Society for Family Health",
    "link": "https://www.jobgurus.com.ng/jobs/view/business-development-adviser-job-at-society-for-family-health",
    "pubDate": "Fri, 04 Jul 2025 21:14:52 GMT",
    "source": "JobGurus",
    "keyword": "society for family health",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Society for Family Health (SFH) is one of the leading non-governmental public health organisations in Nigeria, implementing programmes in Reproductive Health/Family Planning, HIV & AIDS prevention and treatment, malaria prevention and treatment, primary health care system strengthening and maternal, newborn and child health care. We work in partnership with the Federal and State Governments of Nigeria, the Global Fund, United States Agency for International Development (USAID), Department for International Development (DFID), Bill & Melinda Gates Foundation, MSD for Mothers and Children Investment Fund Foundation among other international donors.\n\nWe are recruiting to fill the position below:\n\nJob Position: Business Development Adviser\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Location: Lagos, Nigeria\nJob type: Full time\n\nResponsibilities\nThe successful candidate will be required to perform the following functions:\n\n\n\tFacilitate training of PPMVs on business development and entrepreneurship to utilize micro-credit to improve their delivery of products and services.\n\tFacilitate PPMV aggregation in the form of cooperatives to ensure easy access to low interest loans.\n\tFacilitate efforts to improve PPMV access to quality health commodity by facilitating engagement of PPMV networks with interested, reputable manufacturers and drug suppliers.\n\tPlan and conduct training programs to build capacity of PPMVs to manage commodity inventories better.\n\tWork with IntegratE team to ensure PPMVs are trained on LARC methods at the Schools of Health Technology in line with the approved guidelines for the three-Tiered Accreditation System.\n\n\nRequirements\nThe successful candidate will be required to possess the following qualification:\n\n\n\tS/he must possess a Degree / equivalent in any of the management, social and biological sciences.\n\tA postgraduate Degree in Public Health or social works will be an advantage\n\tCandidates must have a minimum of 7 years post qualification experience in program management, training and business development and integration, especially among the private health sector / provider.\n\n\nTechnical Requirement:\n\n\n\tBusiness and entrepreneurship\n\tDevelopment skills\n\tGood Negotiation\n\tCommunication and presentation skills\n\tAbility to discover, create, and communicate the value of interventions.\n\tMust be proficient in the use of Microsoft word, power point and excel packages.\n\tUse factual data to produce and deliver credible and understandable reports.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Quantity Surveyor / Quality Control Officer Job at De Talents",
    "link": "https://www.jobgurus.com.ng/jobs/view/quantity-surveyor-quality-control-officer-job-at-de-talents",
    "pubDate": "Fri, 04 Jul 2025 21:14:52 GMT",
    "source": "JobGurus",
    "keyword": "de talents",
    "duplicate": false,
    "classifications": [],
    "content": "De Talents is currently recruiting suitably qualified candidates to fill the position below:\n\nJob Position: Quantity Surveyor / Quality Control Officer\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tPreparation of consolidated BOQs and Budgets for Internal and Client projects.\n\tEvaluation of tender submissions, ensuring quantities and specifications are in line with tender and projects specifications.\n\tAssist with preparation and Compilation of Tender documentations\n\tAssist in preparing cost estimate for different phases of the project, advice the project management on possible cost over runs and, on the action, necessary to remain within the approved project budget.\n\tWork very close with the project team to ensure that measurements, variations and contractual matters are properly recorded and notified.\n\tEvaluation of Value of work done (VOWD) by Contractors in preparation for payment certificates\n\tWork very close with the project team to ensure that measurements, variations and contractual matters are properly recorded and notified.\n\tVerify labour, plant & equipment (resources) strengths on projects\n\tVerify material deliveries i.e. quantities, quality for compliance with Specifications required purchase order.\n\tMonitor contractors and evaluate work progress on site.\n\tPrepare progress reports and flag any discrepancies immediately on the same day for all the above items\n\tPerform and implement all post contract duties including but not limited to measurements, preparation of variations orders, analysis of site design changes, interim valuation certificates, final accounts and evaluation reports.\n\tMaintain proper records of agreed measurement-oriented/Item rate variation with the client’s authorized representative and ensure compliance with such rates.\n\tAssist in collaboration with the Project Accountant in collecting the data to prepare financial reports and cash flow forecasts and financial and contractual matters related to work on site.\n\tMonitoring and Inspection of supplied Goods, Materials and Services ordered from Vendors and Suppliers to ensure that products and services meet established quality standards and specifications.\n\tMaintaining detailed records of inspections, identifying defects or deviations from quality standard or required specifications.\n\tMonitoring the effectiveness of existing processes and making recommendations for improvements to enhance overall purchase standards.\n\n\nRequirements\nEducation and Qualifications:\n\n\n\tQualifications from either a recognized institute or training Organization\n\tRelevance experience in job related field.\n\n\nExperience:\n\n\n\tMinimum 5 years of relevant experience in related role.\n\n\nMethod of Application\nInterested and qualified candidates should send their detailed CV to: hrdetalents@gmail.com using the Job Position as the subject of the email.\n\nNote\n\n\n\tYour work experience should reflect start and end months and year (Example: July 2013 – May 2018).\n\tOnly selected candidates will be contacted.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]