[
  {
    "title": "Job Vacancies at Radisson Onyx Hotel",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancies-at-radisson-onyx-hotel",
    "pubDate": "Tue, 09 Sep 2025 10:41:40 GMT",
    "source": "JobGurus",
    "keyword": "radisson onyx hotel",
    "duplicate": false,
    "classifications": [],
    "content": "Radisson Onyx Hotel - Unwinding in paradise at this hotel. We offer the perfect blend of luxury and relaxation. With us, you will get only pure high-class treatment. A hotel stay is not just about the room, it’s about the experience, creating memories that will last a lifetime at this hotel where luxury meets paradise.\n\nWe are recruiting to fill the following positions below:\n\n1.) Food and Beverage Manager\n\nJob Location: Awka, Anambra\nEmployment Type:\n\nJob brief\n     \n\n            \n    \n\n\n\n\n\tWe are seeking a highly skilled and experienced Food and Beverage Manager to oversee and optimize all aspects of our F&B operations.\n\tAs the manager, you will be responsible for ensuring the delivery of exceptional guest experiences, while effectively forecasting, planning, and managing F&B orders, staff, and finances.\n\tYour primary objective will be to maximize sales and revenue by consistently meeting and exceeding customer expectations, fostering employee engagement, and maintaining a strong focus on quality and efficiency.\n\tBy implementing innovative strategies and maintaining high standards, you will play a pivotal role in driving the success of our F&B department and enhancing overall guest satisfaction.\n\n\nResponsibilities\n\n\n\tManage all F&B and day-to-day operations within budgeted guidelines and to the highest standards\n\tPreserve excellent levels of internal and external customer service\n\tDesign exceptional menus, purchase goods and continuously make necessary improvements\n\tIdentify customers needs and respond proactively to all of their concerns\n\tLead F&B team by attracting, recruiting, training and appraising talented personnel\n\tEstablish targets, KPI’s, schedules, policies and procedures\n\tProvide a two way communication and nurture an ownership environment with emphasis in motivation and teamwork\n\tComply with all health and safety regulations\n\tReport on management regarding sales results and productivity\n\n\nRequirements and skills\n\n\n\tCulinary school diploma or degree in food service management or related field\n\tProven food and beverage management experience\n\tWorking knowledge of various computer software programs (MS Office, restaurant management software, POS)\n\tAbility to spot and resolve problems efficiently\n\tMastery in delegating multiple tasks\n\tCommunication and leadership skills\n\tUp to date with food and beverages trends and best practices\n\tAbility to manage personnel and meet financial targets\n\tGuest-oriented and service-minded.\n\n\nMethod of Application\nInterested and qualified candidates should forward their CVs and cover letters to: uchee3@yahoo.com using the Job Position as the subject of the email.\n\n \n\n2.) Laundry Manager\n\nJob Location: Awka, Anambra\n\nMain Function\n\n\n\tThe Laundry Manager will oversee all laundry operations to ensure high-quality cleaning, finishing, and timely delivery of linens, uniforms, and guest laundry.\n\tThis role is critical in maintaining the standards of hygiene, cleanliness, and presentation required in a hospitality or service environment.\n\tThe ideal candidate must be highly organized, detail-oriented, and skilled in managing both people and processes within a fastpaced laundry facility.\n\n\nRole Responsibilities\nOperational Oversight:\n\n\n\tManage daily laundry operations, including washing, drying, ironing, and finishing of linens, uniforms, and guest items.\n\tMonitor workflow to ensure timely completion of laundry tasks.\n\tMaintain consistent quality standards in cleaning and presentation.\n\n\nStaff Supervision and Training:\n\n\n\tSupervise laundry team members and allocate tasks effectively.\n\tTrain and develop staff in laundry procedures, equipment use, and safety practices.\n\tConduct performance evaluations and ensure adherence to service standards.\n\n\nEquipment and Facility Management:\n\n\n\tOversee the operation and maintenance of laundry equipment to ensure efficiency and safety.\n\tCoordinate with maintenance teams for repairs and servicing of laundry machines.\n\tEnsure the laundry area is kept clean, safe, and organized at all times.\n\n\nInventory and Cost Control:\n\n\n\tManage inventory of detergents, chemicals, and laundry supplies.\n\tMonitor usage to reduce wastage and control operational costs.\n\tEnsure accurate records of laundry loads, damages, and losses.\n\n\nGuest Service and Quality Assurance:\n\n\n\tEnsure timely and high-quality service for guest laundry, dry cleaning, and pressing.\n\tAddress guest complaints or issues related to laundry services.\n\tUphold the highest standards of hygiene and garment care.\n\n\nCompliance and Safety:\n\n\n\tEnforce compliance with health, hygiene, and safety regulations.\n\tConduct regular training on safe handling of laundry chemicals and equipment.\n\tMaintain proper documentation for audits and inspections.\n\n\nQualifications and Requirements\nEducation and Certifications:\n\n\n\tHND or B.Sc in Hospitality Management, Textile Care, Business Administration, or related field.\n\tProfessional certification in Laundry Management or Hospitality Operations is an advantage.\n\n\nExperience:\n\n\n\tMinimum of 2 years of experience in laundry operations, with at least 2 years in a supervisory or managerial role within hospitality, healthcare, or large-scale laundry facilities.\n\tExperience handling high-volume laundry operations is highly desirable.\n\n\nSkills:\nOperational and Technical:\n\n\n\tStrong knowledge of laundry processes, textile care, and stain treatment.\n\tProficiency in operating and maintaining industrial laundry equipment.\n\n\nLeadership and Team Management:\n\n\n\tProven ability to lead, train, and motivate diverse teams.\n\tStrong supervisory and conflict resolution skills.\n\n\nQuality and Guest Service Orientation:\n\n\n\tAttention to detail with a commitment to high-quality laundry service.\n\tAbility to handle guest laundry requests professionally and promptly.\n\n\nOrganizational and Financial Acumen:\n\n\n\tSkilled in managing laundry budgets, inventory, and cost control.\n\tAbility to track laundry operations and prepare performance reports.\n\n\nHealth, Safety, and Compliance:\n\n\n\tStrong knowledge of safety practices and hygiene standards in laundry operations.\n\tAbility to enforce compliance with regulatory and internal standards.\n\n\nMethod of Application\nInterested and qualified candidates should forward their CVs and cover letters to: uchee3@yahoo.com using \"Laundry Manager\" as the subject of the email.\n\n \n\n \n\n3.) Night Duty Manager\n\nJob Location: Awka, Anambra\nEmployment Type: Full-time\n\nJob Description\n\n\n\tWe are seeking a dedicated and professional Night Duty Manager to join our team in Awka, Nigeria.\n\tAs the Night Duty Manager, you will be responsible for overseeing all hotel operations during the night shift, ensuring exceptional guest experiences, and maintaining the highest standards of service and safety.\n\tManage all aspects of hotel operations during the night shift, including check-ins, check-outs, and guest inquiries\n\tPerform night audit functions, ensuring accurate balancing of hotel revenues in rooms and food & beverage departments\n\tAddress guest concerns promptly and efficiently, implementing solutions to enhance guest satisfaction\n\tEnsure the safety and security of guests and staff throughout the night\n\tSupervise and motivate the night shift team, promoting a culture of excellence and teamwork\n\tHandle emergency situations and make critical decisions when necessary\n\tCollaborate with other departments to ensure seamless operations and resolve any issues that arise during the night shift\n\tMaintain accurate records and prepare detailed reports for the day shift team\n\tImplement and enforce hotel policies and procedures to maintain consistency in service delivery\n\tIdentify opportunities for process improvements and cost savings within the night operations.\n\n\nQualifications\n\n\n\tBachelor's degree in Hospitality Management, Business Administration, or related field (preferred)\n\tProven experience as a Night Duty Manager or similar role in the hospitality industry\n\tStrong understanding of hotel operations, particularly front office and night audit procedures\n\tExcellent customer service skills with a guest-centric approach\n\tProficiency in hotel management software,orsimilar systems\n\tSolid financial acumen with the ability to analyze and interpret financial data\n\tOutstanding leadership and team management skills\n\tExceptional problem-solving abilities and decision-making skills\n\tExcellent verbal and written communication skills\n\tAbility to work independently and remain calm under pressure\n\tFlexible and adaptable to changing priorities in a fast-paced environment\n\tDetail-oriented with strong organizational and multitasking abilities\n\tExperience in crisis management and handling emergency situations\n\tWillingness to work night shifts, weekends, and holidays as required.\n\n\nMethod of Application \nInterested and qualified candidates should send their Application to: uchee3@yahoo.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Marketer Job at Zhongxin Network Technology Company Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/marketer-job-at-zhongxin-network-technology-company-limited-1",
    "pubDate": "Tue, 09 Sep 2025 10:41:40 GMT",
    "source": "JobGurus",
    "keyword": "zhongxin network technology company limited",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance"
    ],
    "content": "(function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){\n        (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),\n        m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)\n    })(window,document,'script','//www.google-analytics.com/analytics.js','ga');\n\n    ga('create', 'UA-43112273-1', 'jobgurus.com.ng');\n    ga('send', 'pageview');\n\n\n\n\n    \n        \n    Home\n    Jobs\n    Free Aptitude Test Practice\n    Employer? Post a Job\n            Register\n        Sign in\n        Contact us\n    \n\n    \n\n        \n    \n        \n\n            \n\n                \n\n                    \n                        Toggle navigation\n                        \n                        \n                        \n                    \n\n                    \n                \n            \n\n            \n                \n\n\tJobs\n\tJob Seekers\n\tAptitude Test\n\tScholarships\n\n            \n\n            \n                \n\n                                            Register\n                        Sign in\n                    \n                    Employer? Post a Job\n                \n            \n\n        \n\n    \n\n        \n        \n            \n            \n                 \n    \n                    \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n        \n     \n\n\n                            \n                    \n        \n                        CLICK HERE TO JOIN OUR WHATSAPP CHANNEL \n                    \n    \n\n    \n                                \n                    \n\n                        \n                            \n                        \n\n                        \n                            \n                                Any Specialization\n                                                                    Accounting / Audit / Finance\n                                                                    Administration/ Office/ Operations\n                                                                    Advertising/ Social Media/ Marketing/ PR\n                                                                    Agriculture / Agro Allied\n                                                                    Analyst/ Quality Control\n                                                                    Automotive/ Car Services\n                                                                    Aviation / Airline\n                                                                    Banking / Insurance\n                                                                    Building Design / Architecture\n                                                                    Construction / Mining\n                                                                    Consulting / Business Strategy/ Planning\n                                                                    Craftsmen / Artisans\n                                                                    Creatives (Arts, Design, Fashion)\n                                                                    Customer Service\n                                                                    Domestic / Janitorial Services\n                                                                    Driving / Haulage\n                                                                    Education / Teaching / Training\n                                                                    Engineering / Technical\n                                                                    Executive / Management\n                                                                    Freelance / Data Entry\n                                                                    Government Agencies / Public Sector\n                                                                    Graduates / Freshers\n                                                                    Grants /  Scholarships\n                                                                    Hospitality / Food Services\n                                                                    HSE / Safety Management\n                                                                    Human Resources / Recruitment\n                                                                    Information Technology / ICT\n                                                                    Internship/ Industrial Training\n                                                                    Legal / Law\n                                                                    Logistics / Transportation/ Supply\n                                                                    Manufacturing / Production\n                                                                    Maritime Services / Shipping\n                                                                    Media / Art / Entertainment\n                                                                    Medical/ Healthcare / Pharmaceutical\n                                                                    Military / Para-Military\n                                                                    NGO / Community Services\n                                                                    Oil & Gas / Energy\n                                                                    Procurement/ Purchasing\n                                                                    Project Management\n                                                                    Real Estate / Property / Surveying\n                                                                    Research / Survey\n                                                                    Risk Management / Compliance\n                                                                    Sales / Business Development\n                                                                    Secretarial / PA\n                                                                    Security / Intelligence\n                                                                    Software/ Programming / Web development\n                                                                    Sports / Fitness\n                                                                    Supply Chain/ Store\n                                                                    Technicians\n                                                                    Telecommunications\n                                                                    Tourism / Travels\n                                                                    Vocational Trade and Services\n                                                            \n                        \n\n                        \n                            \n                                Any Work Level\n                                                                    Entry Level (Trainee)\n                                                                    Executive (Director, Head of Dept)\n                                                                    Experienced (Non-Manager)\n                                                                    Internship\n                                                                    Manager (Staff Supervisor)\n                                                                    Senior Executive (MD, CEO, COO)\n                                                                    Vocational (Skilled/Unskilled Labour)\n                                                            \n                        \n\n                        \n                            \n                                 Search\n                            \n                        \n                    \n                \n                            \n            \n\n\n\n\n\n\n            \n\n                \n                                        \n                    \n                                        \n                    \n                    \n\n                    \n                        \n                        \n\n{\n  \"@context\": \"https://schema.org\",\n  \"@type\": \"JobPosting\",\n  \"title\": \"Marketer\",\n  \"description\": \"Zhongxin Network Technology Company Limited is&amp;nbsp;a start-up company that is into sales of computer, phone and accessories.\n\nWe are recruiting to fill the position below:\n\nJob Position: Marketer\n\nJob Location:&amp;nbsp;Lagos&amp;nbsp;\nEmployment Type: Full-time\n\nJob Description\n\n\n\tWe are seeking a highly driven and results-oriented Marketer to join our growing team. This pivotal role is responsible for identifying new business opportunities, building strategic relationships, and ultimately driving revenue growth for the company.\n\tThe ideal candidate will be a persuasive communicator, a skilled negotiator, and possess a deep understanding of the sales cycle, from lead generation to closing deals.\n\n\nKey Responsibilities\nCampaign Development &amp;amp; Execution:\n\n\n\tAssist in the planning, development, and execution of integrated marketing campaigns across digital and traditional channels (e.g., social media, email, content marketing, print, events).\n\tCoordinate with internal teams (e.g., sales, product) and external partners (e.g., agencies, vendors) to ensure seamless campaign delivery.\n\tMonitor campaign performance and identify areas for optimization.\n\n\nContent Creation &amp;amp; Management:\n\n\n\tCreate compelling and engaging marketing content, including but not limited to website copy, blog posts, social media updates, email newsletters, and basic promotional materials.\n\tEnsure all content aligns with brand guidelines and marketing objectives.\n\tAssist in managing content calendars and ensuring timely publication.\n\n\nDigital Marketing Support:\n\n\n\tSupport the management of social media platforms, including scheduling posts, engaging with the audience, and monitoring trends.\n\tAssist in the execution of email marketing campaigns, including list segmentation and performance tracking.\n\tContribute to SEO efforts by assisting with keyword research and content optimization.\n\tUtilize digital analytics tools (e.g., Google Analytics) to track website traffic and user behavior, providing basic reports.\n\n\nMarket Research &amp;amp; Analysis:\n\n\n\tConduct basic market research to understand customer needs, market trends, and competitor activities.\n\tAssist in analyzing marketing data to derive insights and inform future strategies.\n\n\nBrand Consistency:\n\n\n\tEnsure brand consistency across all marketing materials and communications.\n\tAdhere to established brand guidelines in all marketing activities.\n\n\nCommunication &amp;amp; Collaboration:\n\n\n\tCommunicate effectively with team members and other departments regarding marketing initiatives.\n\tActively participate in team meetings and brainstorming sessions.\n\n\nReporting:\n\n\n\tPrepare regular reports on marketing campaign performance and key metrics.\n\n\nQualifications\n\n\n\tEducation: Bachelor&amp;#39;s degree in Marketing, Business Administration, Mass Communication, or a related field.\n\tExperience: 1-2 years of proven experience in a marketing role, preferably in industry if relevant, e.g., tech, retail, financial services].\n\n\nSkills:\nTechnical Skills:\n\n\n\tProficiency in social media platforms (Facebook, Instagram, LinkedIn, X, etc.).\n\tFamiliarity with email marketing platforms (e.g., Mailchimp, Constant Contact).\n\tBasic understanding of SEO principles.\n\tKnowledge of digital analytics tools (e.g., Google Analytics).\n\tProficiency in Microsoft Office Suite (Word, Excel, PowerPoint).\n\tExperience with graphic design tools (e.g., Canva, basic Adobe Creative Suite) is a plus.\n\n\nSoft Skills:\n\n\n\tExcellent written and verbal communication skills.\n\tStrong creative thinking and content development abilities.\n\tGood analytical and problem-solving skills.\n\tHigh attention to detail and strong organizational skills.\n\tAbility to work independently and collaboratively in a team environment.\n\tProactive and results-oriented.\n\tAbility to manage multiple tasks and meet deadlines.\n\tEagerness to learn and adapt to new marketing trends and technologies.\n\n\nSalary\nN180,000 / month.\n\nMethod of Application\nInterested and qualified candidates should send their CV to:&amp;nbsp;hrzhongxinnetwork@gmail.com&amp;nbsp;using the Job Position as the subject of the mail.\",\n  \"datePosted\": \"2025-09-09\",\n  \"validThrough\": \"2025-10-08\",\n  \"employmentType\": \"Full-Time\",\n  \"hiringOrganization\": {\n    \"@type\": \"Organization\",\n    \"name\": \"Zhongxin Network Technology Co. Ltd\"\n    \n  },\n  \"jobLocation\": {\n    \"@type\": \"Place\",\n    \"address\": {\n      \"@type\": \"PostalAddress\",\n       \"postalCode\": \". \",\n       \"addressRegion\": \". \",\n       \"streetAddress\": \". \",\n      \"addressLocality\": \"Lagos\",\n      \"addressCountry\": \"NG\"\n     \n      \n    }\n  },\n  \"identifier\": {\n    \"@type\": \"PropertyValue\",\n    \"name\": \"\",\n    \"value\": \"187083\"\n  },\n  \"baseSalary\": {\n    \"@type\": \"MonetaryAmount\",\n    \"currency\": \"NGN\",\n    \"value\": {\n      \"@type\": \"QuantitativeValue\",\n      \"minValue\": 150000,\n      \"maxValue\": 250000,\n      \"unitText\": \"MONTH\"\n    }\n  }\n}\n\n\n\nMarketer Job at Zhongxin Network Technology Company Limited\n\n\n\n\n        \n    \n\n        \n        Zhongxin Network Technology Company Limited is a start-up company that is into sales of computer, phone and accessories.\n\nWe are recruiting to fill the position below:\n\nJob Position: Marketer\n\nJob Location: Lagos \nEmployment Type: Full-time\n\nJob Description\n     \n\n            \n    \n\n\n\n\n\tWe are seeking a highly driven and results-oriented Marketer to join our growing team. This pivotal role is responsible for identifying new business opportunities, building strategic relationships, and ultimately driving revenue growth for the company.\n\tThe ideal candidate will be a persuasive communicator, a skilled negotiator, and possess a deep understanding of the sales cycle, from lead generation to closing deals.\n\n\nKey Responsibilities\nCampaign Development & Execution:\n\n\n\tAssist in the planning, development, and execution of integrated marketing campaigns across digital and traditional channels (e.g., social media, email, content marketing, print, events).\n\tCoordinate with internal teams (e.g., sales, product) and external partners (e.g., agencies, vendors) to ensure seamless campaign delivery.\n\tMonitor campaign performance and identify areas for optimization.\n\n\nContent Creation & Management:\n\n\n\tCreate compelling and engaging marketing content, including but not limited to website copy, blog posts, social media updates, email newsletters, and basic promotional materials.\n\tEnsure all content aligns with brand guidelines and marketing objectives.\n\tAssist in managing content calendars and ensuring timely publication.\n\n\nDigital Marketing Support:\n\n\n\tSupport the management of social media platforms, including scheduling posts, engaging with the audience, and monitoring trends.\n\tAssist in the execution of email marketing campaigns, including list segmentation and performance tracking.\n\tContribute to SEO efforts by assisting with keyword research and content optimization.\n\tUtilize digital analytics tools (e.g., Google Analytics) to track website traffic and user behavior, providing basic reports.\n\n\nMarket Research & Analysis:\n\n\n\tConduct basic market research to understand customer needs, market trends, and competitor activities.\n\tAssist in analyzing marketing data to derive insights and inform future strategies.\n\n\nBrand Consistency:\n\n\n\tEnsure brand consistency across all marketing materials and communications.\n\tAdhere to established brand guidelines in all marketing activities.\n\n\nCommunication & Collaboration:\n\n\n\tCommunicate effectively with team members and other departments regarding marketing initiatives.\n\tActively participate in team meetings and brainstorming sessions.\n\n\nReporting:\n\n\n\tPrepare regular reports on marketing campaign performance and key metrics.\n\n\nQualifications\n\n\n\tEducation: Bachelor's degree in Marketing, Business Administration, Mass Communication, or a related field.\n\tExperience: 1-2 years of proven experience in a marketing role, preferably in industry if relevant, e.g., tech, retail, financial services].\n\n\nSkills:\nTechnical Skills:\n\n\n\tProficiency in social media platforms (Facebook, Instagram, LinkedIn, X, etc.).\n\tFamiliarity with email marketing platforms (e.g., Mailchimp, Constant Contact).\n\tBasic understanding of SEO principles.\n\tKnowledge of digital analytics tools (e.g., Google Analytics).\n\tProficiency in Microsoft Office Suite (Word, Excel, PowerPoint).\n\tExperience with graphic design tools (e.g., Canva, basic Adobe Creative Suite) is a plus.\n\n\nSoft Skills:\n\n\n\tExcellent written and verbal communication skills.\n\tStrong creative thinking and content development abilities.\n\tGood analytical and problem-solving skills.\n\tHigh attention to detail and strong organizational skills.\n\tAbility to work independently and collaboratively in a team environment.\n\tProactive and results-oriented.\n\tAbility to manage multiple tasks and meet deadlines.\n\tEagerness to learn and adapt to new marketing trends and technologies.\n\n\nSalary\nN180,000 / month.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hrzhongxinnetwork@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n\n    \n    \n\n\n\n\n        \n        \n\n\n\n\n   \n\n\n    \n        Similar Jobs\n    \n\n    \n        \n                        Job Openings at Auldon Limited\n                        Social Media / Digital Marketer Job at Fastest Cakes Limited\n                        Digital Marketing Officer Job at A4S\n                        Marketing Lead Job at ResQ-X Limited\n                        Social Media Manager Job at Baker Industries Limited\n                        Social Media Manager Job at Business Insider Africa\n                        Marketing Manager Job at Wowtiger\n                        Marketing Manager Job at AM Consulting\n                        Social Media Manager Job at Pruvia Integrated Limited\n                        Content Creator (Social Media Manager) Job at Future Moves Recruitment Agency Limited\n                    \n    \n\n\n\n                        \n                    \n\n                    \n                        \n\n\n\n    \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n\n\n\n\n\n          \n\n\n    \n\n        Hottest Jobs\n\n        \n        \n            \n\n                Job Openings at Bosak Microfinance Bank Limited\n\n               \n            \n        \n            \n\n                Job Openings at Duplo\n\n               \n            \n        \n            \n\n                Job Openings at Krystal Medical Centre\n\n               \n            \n        \n            \n\n                Job Vacancies at Coronation\n\n               \n            \n        \n            \n\n                Stanbic IBTC University Scholarship Job at Stanbic IBTC Bank\n\n               \n            \n        \n            \n\n                Office Manager Job at US Embassy\n\n               \n            \n        \n            \n\n                FINACIAL ADVISORS\n\n               \n            \n        \n            \n\n                Job Openings at Felton Energy Services Limited\n\n               \n            \n        \n            \n\n                Job Vacancies at Arion Energy Services Limited\n\n               \n            \n        \n            \n\n                Job Vacancies at Arnergy Solar Limited\n\n               \n            \n        \n        \n\n    \n\n\n\n\n        \n        \n   \n\n\n                    \n                            \n            \n        \n        \n        \n\n        \n\n    \n\n        \n\n            \n\n                \n\n                    Job Seekers\n\n                    \n\n                        Search for Jobs\n                         Featured Jobs\n                         Jobs by Specialization\n                         Jobs by Industry\n                         Jobs by Location\n                         \n                        Companies Currently Hiring\n\n                        Upload CV\n\n                        Free Aptitude Test Practice\n                        \n                        Scholarships and Financial Aid\n\n                        Testimonies\n                    \n\n                \n\n                \n\n                    Employers\n\n                    \n\n                        Post A Job\n\n                        Search Resumes/Profiles\n\n                        Create Employer Account\n\n                        Advertise\n\n                        Pricing\n\n                    \n\n                \n\n                \n\n                    Tools & Resources\n\n                    \n\n                        Contact us\n                        \n                        Our Blog\n\n                        Job XML/RSS Feeds\n \n                        Free Aptitude Test Practice\n\n                        Bank Details\n\n                        FAQ & Support\n\n                    \n\n                \n\n                \n\n                    Connect with us\n\n                    \n\n                        \n\n                            \n\n                            \n\n                        \n\n                        \n\n                            \n\n                            \n\n                        \n\n                \n\n                        \n\n                            \n\n                            \n\n                        \n\n                    \n\n\n\n                    \n\n                        Customer Care\n\n                        09134259221 \n\n                        (9am - 5pm) weekdays\n\n                         info [at] jobgurus.com.ng\n\n                    \n\n\n\n                \n\n            \n\n        \n\n    \n\n\n\n    \n\n        \n\n\n\n            \n\n                Privacy Policy\n\n                Terms & Conditions\n\n                Sitemap\n                \n                About us\n\n            \n\n\n\n            Copyright © 2025 Jobgurus.com.ng - Latest Jobs in Nigeria 2025. All right reserved.",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Operations Controller Job at RedCloud Technology",
    "link": "https://www.jobgurus.com.ng/jobs/view/operations-controller-job-at-redcloud-technology-1",
    "pubDate": "Tue, 09 Sep 2025 10:41:40 GMT",
    "source": "JobGurus",
    "keyword": "redcloud technology",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "(function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){\n        (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),\n        m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)\n    })(window,document,'script','//www.google-analytics.com/analytics.js','ga');\n\n    ga('create', 'UA-43112273-1', 'jobgurus.com.ng');\n    ga('send', 'pageview');\n\n\n\n\n    \n        \n    Home\n    Jobs\n    Free Aptitude Test Practice\n    Employer? Post a Job\n            Register\n        Sign in\n        Contact us\n    \n\n    \n\n        \n    \n        \n\n            \n\n                \n\n                    \n                        Toggle navigation\n                        \n                        \n                        \n                    \n\n                    \n                \n            \n\n            \n                \n\n\tJobs\n\tJob Seekers\n\tAptitude Test\n\tScholarships\n\n            \n\n            \n                \n\n                                            Register\n                        Sign in\n                    \n                    Employer? Post a Job\n                \n            \n\n        \n\n    \n\n        \n        \n            \n            \n                 \n    \n                    \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n        \n     \n\n\n                            \n                    \n        \n                        CLICK HERE TO JOIN OUR WHATSAPP CHANNEL \n                    \n    \n\n    \n                                \n                    \n\n                        \n                            \n                        \n\n                        \n                            \n                                Any Specialization\n                                                                    Accounting / Audit / Finance\n                                                                    Administration/ Office/ Operations\n                                                                    Advertising/ Social Media/ Marketing/ PR\n                                                                    Agriculture / Agro Allied\n                                                                    Analyst/ Quality Control\n                                                                    Automotive/ Car Services\n                                                                    Aviation / Airline\n                                                                    Banking / Insurance\n                                                                    Building Design / Architecture\n                                                                    Construction / Mining\n                                                                    Consulting / Business Strategy/ Planning\n                                                                    Craftsmen / Artisans\n                                                                    Creatives (Arts, Design, Fashion)\n                                                                    Customer Service\n                                                                    Domestic / Janitorial Services\n                                                                    Driving / Haulage\n                                                                    Education / Teaching / Training\n                                                                    Engineering / Technical\n                                                                    Executive / Management\n                                                                    Freelance / Data Entry\n                                                                    Government Agencies / Public Sector\n                                                                    Graduates / Freshers\n                                                                    Grants /  Scholarships\n                                                                    Hospitality / Food Services\n                                                                    HSE / Safety Management\n                                                                    Human Resources / Recruitment\n                                                                    Information Technology / ICT\n                                                                    Internship/ Industrial Training\n                                                                    Legal / Law\n                                                                    Logistics / Transportation/ Supply\n                                                                    Manufacturing / Production\n                                                                    Maritime Services / Shipping\n                                                                    Media / Art / Entertainment\n                                                                    Medical/ Healthcare / Pharmaceutical\n                                                                    Military / Para-Military\n                                                                    NGO / Community Services\n                                                                    Oil & Gas / Energy\n                                                                    Procurement/ Purchasing\n                                                                    Project Management\n                                                                    Real Estate / Property / Surveying\n                                                                    Research / Survey\n                                                                    Risk Management / Compliance\n                                                                    Sales / Business Development\n                                                                    Secretarial / PA\n                                                                    Security / Intelligence\n                                                                    Software/ Programming / Web development\n                                                                    Sports / Fitness\n                                                                    Supply Chain/ Store\n                                                                    Technicians\n                                                                    Telecommunications\n                                                                    Tourism / Travels\n                                                                    Vocational Trade and Services\n                                                            \n                        \n\n                        \n                            \n                                Any Work Level\n                                                                    Entry Level (Trainee)\n                                                                    Executive (Director, Head of Dept)\n                                                                    Experienced (Non-Manager)\n                                                                    Internship\n                                                                    Manager (Staff Supervisor)\n                                                                    Senior Executive (MD, CEO, COO)\n                                                                    Vocational (Skilled/Unskilled Labour)\n                                                            \n                        \n\n                        \n                            \n                                 Search\n                            \n                        \n                    \n                \n                            \n            \n\n\n\n\n\n\n            \n\n                \n                                        \n                    \n                                        \n                    \n                    \n\n                    \n                        \n                        \n\n{\n  \"@context\": \"https://schema.org\",\n  \"@type\": \"JobPosting\",\n  \"title\": \"Operations Controller\",\n  \"description\": \"RedCloud is a highly-diverse, dynamic team comprised of driven talent from 21 different countries, speaking at least 10 languages, with a footprint in seven locations worldwide - and we&amp;rsquo;re still growing. With a team across 3 continents, over 30+ nationalities contributing to open commerce movement, we&amp;rsquo;re always looking for new talent to join our mission and drive our business and our technology forward, from our touchpoints in London, Buenos Aires and Lagos.\n\nOur vision is to reinvent the way in which financial services and products are delivered. The company&amp;#39;s goal is to pioneer the way in which more than 100 million businesses around the world access any financial product easily and securely, to help them succeed in the fourth industrial revolution. Our mission&amp;nbsp;is&amp;nbsp;to&amp;nbsp;grow&amp;nbsp;global&amp;nbsp;online commerce for the world&amp;rsquo;s small businesses by removing the&amp;nbsp;barriers to online trading for hundreds of millions of independent retailers and their suppliers across the world&amp;rsquo;s supply chains.\n\nWe are recruiting to fill the position below:\n\nJob Position:&amp;nbsp;Operations Controller\nJob Locations:&amp;nbsp;Abuja and Lagos\nEmployment Type: Full Time (Hybrid)\n\nJob Description\n\n\n\tAs an Operations Controller, you will be instrumental in providing contract admin support and insightful data analysis to help drive sales performance and profit objectives.\n\tYou will be responsible for sales process adoption and compliance to ensure greater sales effectiveness and efficiency.\n\tThe successful candidate reports to the Operations Manager.\n\n\nWhat you will be doing\n\n\n\tCollate customer contract onboarding documents as received from sales.\n\tProvide pricing and contract support by providing the sales team with high-quality and competitive proposals.\n\tMonitoring and analysing key sales and business performance indicators and trends to drive strategic and tactical business decisions.\n\tSources imagery when client cannot provide them.\n\tEnsures CRM tool is updated with all client information and documents.\n\tSets up online training appointments with clients once the onboarding process has been completed.\n\tConduct monthly customer calls to ensure client satisfaction.\n\tAssist with product pricing updates as received from GTM/Account Management Team\n\tAssist with requests for product additions/amendments.\n\tAssist with ad-hoc dashboard management for out-of-stock products as reported from the field sales team.\n\n\nWhat you should have\n\n\n\tHave Diploma / Degree in Commerce, Marketing, Business Administration, or a related field.\n\t3 - 5 years of prior experience in a similar role.\n\tKnowledge of business intelligence tools and strong capabilities in Excel will be an advantage.\n\tAnalytical mind as well as strong commercial acumen.\n\tProactive and possess excellent interpersonal and communication skills.\n\tExperience in matrix environments requiring you to work with a wide range of stakeholders.\n\tKeen attention to detail and adherence to deadlines.\n\n\nBenefits\n\n\n\tWorking with a pioneering provider of eCommerce solutions you will have the opportunity to join an international company who are growing massively, we encourage ambition and creativity.\n\n\nPlus, you will get:\n\n\n\tFirst Class Salary\n\t25 days annual leave increasing to 26 days after your first 12 months in the business.\n\tCompany Equipment.\n\",\n  \"datePosted\": \"2025-09-09\",\n  \"validThrough\": \"2025-10-10\",\n  \"employmentType\": \"Full-Time\",\n  \"hiringOrganization\": {\n    \"@type\": \"Organization\",\n    \"name\": \"RedCloud Technology\"\n    \n  },\n  \"jobLocation\": {\n    \"@type\": \"Place\",\n    \"address\": {\n      \"@type\": \"PostalAddress\",\n       \"postalCode\": \". \",\n       \"addressRegion\": \". \",\n       \"streetAddress\": \". \",\n      \"addressLocality\": \"Lagos\",\n      \"addressCountry\": \"NG\"\n     \n      \n    }\n  },\n  \"identifier\": {\n    \"@type\": \"PropertyValue\",\n    \"name\": \"\",\n    \"value\": \"187081\"\n  },\n  \"baseSalary\": {\n    \"@type\": \"MonetaryAmount\",\n    \"currency\": \"NGN\",\n    \"value\": {\n      \"@type\": \"QuantitativeValue\",\n      \"minValue\": 0,\n      \"maxValue\": 0,\n      \"unitText\": \"MONTH\"\n    }\n  }\n}\n\n\n\nOperations Controller Job at RedCloud Technology\n\n\n\n\n        \n    \n\n        \n        RedCloud is a highly-diverse, dynamic team comprised of driven talent from 21 different countries, speaking at least 10 languages, with a footprint in seven locations worldwide - and we’re still growing. With a team across 3 continents, over 30+ nationalities contributing to open commerce movement, we’re always looking for new talent to join our mission and drive our business and our technology forward, from our touchpoints in London, Buenos Aires and Lagos.\n     \n\n            \n    \n\n\n\nOur vision is to reinvent the way in which financial services and products are delivered. The company's goal is to pioneer the way in which more than 100 million businesses around the world access any financial product easily and securely, to help them succeed in the fourth industrial revolution. Our mission is to grow global online commerce for the world’s small businesses by removing the barriers to online trading for hundreds of millions of independent retailers and their suppliers across the world’s supply chains.\n\nWe are recruiting to fill the position below:\n\nJob Position: Operations Controller\nJob Locations: Abuja and Lagos\nEmployment Type: Full Time (Hybrid)\n\nJob Description\n\n\n\tAs an Operations Controller, you will be instrumental in providing contract admin support and insightful data analysis to help drive sales performance and profit objectives.\n\tYou will be responsible for sales process adoption and compliance to ensure greater sales effectiveness and efficiency.\n\tThe successful candidate reports to the Operations Manager.\n\n\nWhat you will be doing\n\n\n\tCollate customer contract onboarding documents as received from sales.\n\tProvide pricing and contract support by providing the sales team with high-quality and competitive proposals.\n\tMonitoring and analysing key sales and business performance indicators and trends to drive strategic and tactical business decisions.\n\tSources imagery when client cannot provide them.\n\tEnsures CRM tool is updated with all client information and documents.\n\tSets up online training appointments with clients once the onboarding process has been completed.\n\tConduct monthly customer calls to ensure client satisfaction.\n\tAssist with product pricing updates as received from GTM/Account Management Team\n\tAssist with requests for product additions/amendments.\n\tAssist with ad-hoc dashboard management for out-of-stock products as reported from the field sales team.\n\n\nWhat you should have\n\n\n\tHave Diploma / Degree in Commerce, Marketing, Business Administration, or a related field.\n\t3 - 5 years of prior experience in a similar role.\n\tKnowledge of business intelligence tools and strong capabilities in Excel will be an advantage.\n\tAnalytical mind as well as strong commercial acumen.\n\tProactive and possess excellent interpersonal and communication skills.\n\tExperience in matrix environments requiring you to work with a wide range of stakeholders.\n\tKeen attention to detail and adherence to deadlines.\n\n\nBenefits\n\n\n\tWorking with a pioneering provider of eCommerce solutions you will have the opportunity to join an international company who are growing massively, we encourage ambition and creativity.\n\n\nPlus, you will get:\n\n\n\tFirst Class Salary\n\t25 days annual leave increasing to 26 days after your first 12 months in the business.\n\tCompany Equipment.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n\n    \n    \n\n\n\n\n        \n        \n\n\n\n\n   \n\n\n    \n        Similar Jobs\n    \n\n    \n        \n                        Job Vacancies at Radisson Onyx Hotel\n                        General Manager Job at Ayekooto\n                        Data Verification Officer Job at Lafiya Telehealth App\n                        Admin Officer Job at Zanibal Solutions Nigeria Limited\n                        Receptionist / Admin Officer Job at Primestix Construction Limited\n                        Human Resource Manager / Admin Job at Interswstik Nigeria Limited\n                        HR / Admin Officer Job at Afconrecruit Limited\n                        Cafe Manager Job at Mactay Consulting\n                        Administrative Officer Job at Golden Heritage Plc\n                        Front Desk Admin Job at Filmhouse Cinemas Limited\n                    \n    \n\n\n\n                        \n                    \n\n                    \n                        \n\n\n\n    \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n\n\n\n\n\n          \n\n\n    \n\n        Hottest Jobs\n\n        \n        \n            \n\n                Job Openings at Bosak Microfinance Bank Limited\n\n               \n            \n        \n            \n\n                Job Openings at Duplo\n\n               \n            \n        \n            \n\n                Job Openings at Krystal Medical Centre\n\n               \n            \n        \n            \n\n                Job Vacancies at Coronation\n\n               \n            \n        \n            \n\n                Stanbic IBTC University Scholarship Job at Stanbic IBTC Bank\n\n               \n            \n        \n            \n\n                Office Manager Job at US Embassy\n\n               \n            \n        \n            \n\n                FINACIAL ADVISORS\n\n               \n            \n        \n            \n\n                Job Openings at Felton Energy Services Limited\n\n               \n            \n        \n            \n\n                Job Vacancies at Arion Energy Services Limited\n\n               \n            \n        \n            \n\n                Job Vacancies at Arnergy Solar Limited\n\n               \n            \n        \n        \n\n    \n\n\n\n\n        \n        \n   \n\n\n                    \n                            \n            \n        \n        \n        \n\n        \n\n    \n\n        \n\n            \n\n                \n\n                    Job Seekers\n\n                    \n\n                        Search for Jobs\n                         Featured Jobs\n                         Jobs by Specialization\n                         Jobs by Industry\n                         Jobs by Location\n                         \n                        Companies Currently Hiring\n\n                        Upload CV\n\n                        Free Aptitude Test Practice\n                        \n                        Scholarships and Financial Aid\n\n                        Testimonies\n                    \n\n                \n\n                \n\n                    Employers\n\n                    \n\n                        Post A Job\n\n                        Search Resumes/Profiles\n\n                        Create Employer Account\n\n                        Advertise\n\n                        Pricing\n\n                    \n\n                \n\n                \n\n                    Tools & Resources\n\n                    \n\n                        Contact us\n                        \n                        Our Blog\n\n                        Job XML/RSS Feeds\n \n                        Free Aptitude Test Practice\n\n                        Bank Details\n\n                        FAQ & Support\n\n                    \n\n                \n\n                \n\n                    Connect with us\n\n                    \n\n                        \n\n                            \n\n                            \n\n                        \n\n                        \n\n                            \n\n                            \n\n                        \n\n                \n\n                        \n\n                            \n\n                            \n\n                        \n\n                    \n\n\n\n                    \n\n                        Customer Care\n\n                        09134259221 \n\n                        (9am - 5pm) weekdays\n\n                         info [at] jobgurus.com.ng\n\n                    \n\n\n\n                \n\n            \n\n        \n\n    \n\n\n\n    \n\n        \n\n\n\n            \n\n                Privacy Policy\n\n                Terms & Conditions\n\n                Sitemap\n                \n                About us\n\n            \n\n\n\n            Copyright © 2025 Jobgurus.com.ng - Latest Jobs in Nigeria 2025. All right reserved.",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]