[
  {
    "title": "Human Resource Officer Job at DMOT Enterprises",
    "link": "https://www.jobgurus.com.ng/jobs/view/human-resource-officer-job-at-dmot-enterprises-1",
    "pubDate": "Fri, 27 Jun 2025 13:47:51 GMT",
    "source": "JobGurus",
    "keyword": "dmot enterprises",
    "duplicate": false,
    "classifications": [],
    "content": "DMOT Enterprises - Our client, a snack factory, is recruiting to fill the position below:\n\nJob Position: Human Resource Officer\nJob Location: Ogun\nEmployment Type: Full-time\n\nRequirements\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tHND/BSc Degree in Social Sciences or Arts\n\tWe expect candidate with 2 years of HR experience.\n\tMBA/MSC/MA is MANDATORY\n\tExperience in manufacturing setting will be good\n\tExcel and Power-point Usage should be good.\n\tshould be ready to work in Sagamu and attend interviews.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: ayomaku@yahoo.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "IT Support Officer Job at St. David's Pharmacy",
    "link": "https://www.jobgurus.com.ng/jobs/view/it-support-officer-job-at-st-davids-pharmacy",
    "pubDate": "Fri, 27 Jun 2025 13:47:51 GMT",
    "source": "JobGurus",
    "keyword": "st. david's pharmacy",
    "duplicate": false,
    "classifications": [],
    "content": "St. David's Pharmacy Nigeria Limited is a reputable pharmaceutical company that provides direct patient care services that optimize the use of medication and promote health, wellness, and disease prevention.\n\nWe are recruiting to fill the position below:\n\nJob Position: IT Support Officer\n\nJob Location: Agungi, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe seek to hire an IT Support Officer with good knowledge of ICT functions.\n\n\nRequirements\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tPrevious experience in retail outlet will be an added advantage.\n\tMust have at least 1 year of experience.\n\tMust reside close to Agungi.\n\n\nSalary\nN80,000 - N110,000 Monthly\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hrstdavidspharmacy@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Electrical Engineer Job at African Natural Resources and Mines Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/electrical-engineer-job-at-african-natural-resources-and-mines-limited",
    "pubDate": "Fri, 27 Jun 2025 13:47:51 GMT",
    "source": "JobGurus",
    "keyword": "african natural resources and mines limited",
    "duplicate": false,
    "classifications": [],
    "content": "African Natural Resources and Mines Limited (ANRML), established by African Industries Group, operates a fully integrated iron ore mining and processing plant in Gujeni village, Kagarko LGA, Kaduna state—the first of its kind in Nigeria.\n\nWe are recruiting to fill the position below:\n\nJob Position: Electrical Engineer\nJob Location: Kaduna\nEmployment Type: Full-time\n\nDescription\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Electrical Engineer is responsible for the maintenance, troubleshooting, and improvement of electrical systems and equipment within the pellet plant.\n\tThe role supports continuous and safe plant operations by ensuring high equipment availability, energy efficiency, and compliance with safety and regulatory standards.\n\n\nKey Responsibilities\n\n\n\tPlan and execute preventive, corrective, and predictive maintenance of electrical equipment such as MCCs, motors, VFDs, switchgear, transformers, lighting systems, and control panels.\n\tMonitor plant electrical systems and resolve issues to minimize downtime and ensure stable plant operations.\n\tLead troubleshooting efforts on electrical faults and coordinate with instrumentation and mechanical teams for integrated problem-solving.\n\tSupport the installation and commissioning of new electrical systems or equipment upgrades.\n\tPrepare and maintain technical documentation, maintenance records, and reports.\n\tAssist in the planning and execution of shutdown maintenance and turnarounds.\n\tIdentify opportunities for energy efficiency and propose improvements to reduce power consumption.\n\n\nQualifications and Skills\n\n\n\tBachelor’s Degree in Electrical Engineering from a recognized institution.\n\t3 - 5 years of experience in electrical maintenance, preferably in a pellet plant or heavy process industry.\n\tStrong knowledge of industrial power systems, motor control centers, variable frequency drives (VFDs), and PLC systems.\n\tFamiliarity with national and international electrical codes (e.g., IEC, NEC).\n\tProficiency in electrical troubleshooting, reading schematics, and using diagnostic tools.\n\tExperience with Computerized Maintenance Management Systems (CMMS) like SAP or Maximo is an advantage.\n\tGood analytical, communication, and team coordination skills.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: george.mathew@anrml.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Inventory Officer Job at St. David's Pharmacy Nigeria Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/inventory-officer-job-at-st-davids-pharmacy-nigeria-limited",
    "pubDate": "Fri, 27 Jun 2025 13:47:51 GMT",
    "source": "JobGurus",
    "keyword": "st. david's pharmacy nigeria limited",
    "duplicate": false,
    "classifications": [],
    "content": "St. David's Pharmacy Nigeria Limited is a reputable pharmaceutical company that provides direct patient care services that optimize the use of medication and promote health, wellness, and disease prevention.\n\nWe are recruiting to fill the position below:\n\nJob Position: Inventory Officer\nJob Location: Ikeja / Agungi, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe seek to hire an Inventory Officer with good knowledge of inventory in a pharmceutical company.\n\n\nRequirements\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tPrevious experience in a retail outlet will be an added advantage.\n\tMust have at least 1 year of experience in inventory management.\n\tMust reside close to advertised locations(Ikeja and Agungi)\n\n\nSalary\nN100,000 - N130,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hrstdavidspharmacy@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Inventory Officer Job at Kkon Technologies",
    "link": "https://www.jobgurus.com.ng/jobs/view/inventory-officer-job-at-kkon-technologies-1",
    "pubDate": "Fri, 27 Jun 2025 13:47:51 GMT",
    "source": "JobGurus",
    "keyword": "kkon technologies",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Kkon Technologies stands as an Open Access Network provider with a dedicated focus on Fiber To The Business (FTTB) and metro wireless radio service, aiming to establish flawless fiber and radio connectivity for numerous businesses throughout the country.\n\nWe are recruiting to fill the position below:\n\nJob Position: Inventory Officer\nJob Location: Lagos\nEmployment Type: Contract\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Inventory Officer is responsible for managing and overseeing all aspects of the store inventory management, including stock control, storage, and issuance of materials.\n\tThis involves maintaining optimal stock levels, tracking inventory, ensuring the accuracy of inventory records, and implementing measures to minimize stockouts as well as prevent excess stocking.\n\tThe Inventory Officer will work closely with various departments to ensure smooth operations and efficient supply chain management.\n\n\nResponsibilities\n\n\n\tReceive, inspect, and record incoming materials, verifying quantity, quality, and condition against purchase orders.\n\tMonitor and control inventory levels, track stock movements, and conduct regular stock counts to ensure accuracy of inventory records.\n\tUpdate inventory ERP systems to reflect stock transactions, adjustments, and movements accurately.\n\tInvestigate and resolve discrepancies in inventory records promptly.\n\tCoordinate with procurement teams to place orders for replenishment stock, ensuring timely delivery and availability of inventory items.\n\tPrepare and present weekly inventory reports showing summaries of receipts, issuances, opening stock, closing balance, stock variances, and other required documentation.\n\tCollaborate with other departments to forecast inventory needs, plan accordingly, and implement inventory control procedures and best practices.\n\tMaintain compliance with organizational policies, safety standards, and regulatory requirements related to inventory management.\n\n\nSalary\nN100,000 - N150,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their resume to: careers@fob.ng using Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]