[
  {
    "title": "Job Vacancies at Limewood Villa Hotel",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancies-at-limewood-villa-hotel-1",
    "pubDate": "Fri, 20 Jun 2025 11:13:37 GMT",
    "source": "JobGurus",
    "keyword": "limewood villa hotel",
    "duplicate": false,
    "classifications": [],
    "content": "Limewood Villa Hotel, is Located in the heart of Lekki Phase 1. Limewood Villa has accommodations with a restaurant, free parking, pool, bar and lounge. The facility offers 24 hours front desk and room service to its customers, along with free Wi-Fi throughout the property. Nearby attractions include points like Filmhouse Imax Cinema, Upbeat recreation center, Nike art gallery and Lekki conservation centre.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWith an excellent pool site, restaurant, garden sit out area and a roof top bar. At the hotel each room, is unique to the other. No room is the same, the rooms come with air conditioning, smart flat screen TVs, in-built Bluetooth speakers, luggage holder, electric tea pot, shower, free toiletries. All rooms have mini fridge in them. Featuring our executive suits, which are more spacious than the normal suits with a tube in the bathroom. Also, certain rooms comes with a balcony area to relax.\n\nWe are recruiting to fill the following positions below:\n\n1.) Housekeeper\n\nJob Location: Lekki Phase 1, Lagos\nEmployment Type: Full-time\n\nSummary\n\n\n\tHousekeeper is responsible for taking care of a Hotel building’s general cleanliness to provide tidy and sanitary amenities to guests. Their duties include cleaning floors, making beds and dusting surfaces throughout the Hotel.\n\tA Housekeeper needs to clean the work area to the standards of limewood Villa Hotel.\n\tThis requires attention to detail, physical strength and the stamina to work long shifts.\n\n\nHere are examples of a Housekeeper’s duties:\n\n\n\tUnderstand the company’s policy on work shifts, guest’s possessions and privacy issues.\n\tProvide basic housekeeping duties including changing the sheets, changing and arranging the towels, restocking toilet supplies, vacuuming, dusting and rearranging the room after guests check out.\n\tClean, disinfect and store all equipment at the end of the shift.\n\tMaintain a positive relationship with employees and guests.\n\tMonitor and report on the inventory of cleaning supplies.\n\tReport and return any guest properties found in the rooms while rendering service.\n\tReport cases of property damage in commercial spaces to supervisor.\n\tWork with a team of housekeepers on each shift.\n\tRespond to calls for housekeeping problems, such as spills and broken glass.\n\tCollect and remove trash and debris.\n\tAssist with laundry management, including washing, drying, ironing and sorting linen.\n\tReport, turn in and log all lost and found items.\n\tClean upholstered furniture.\n\tPerform detailed deep cleans when required.\n\n\nQualifications\n\n\n\tInterested candidates should possess an NCE, OND, SSCE / NCE / NECO qualification with 5 - 10 years of experience.\n\n\nSalary\nN50,000 - N60,000 monthly. \n\nMethod of Application\nInterested and qualified candidates should forward their CV to the \"HR\" via: hospitalityjobopening1@gmail.com using the Job Position as the subject of the email.\n\nNote: For more information WhatsApp: 08058043665.\n\n \n\n2.) Mixologist / Barman\n\nJob Location: Lekki Phase 1, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tMixologist/Barman serve cocktails, wine,beer, and other drinks to bar and restaurant guests.\n\tThey follow classic recipes and create signature cocktail drinks.\n\tMixologist should also ensure their bar runs efficiently and that all Guests are satisfied with their drink orders. Responsibilities in details.\n\tVerify the customers’ ages.\n\tMix traditional and creative cocktails.\n\tProcess payment.\n\tClean glasses and bar utensils.\n\tMake suggestions based on customer tastes and preferences.\n\tRecord and balance sales reports.\n\tOpen and maintain tabs throughout their shift\n\tBuild a rapport with regular customers to create a positive atmosphere.\n\tKnowledge of different types of alcohol, drink recipes and pairings, along with the ability to deal with customers in various moods.\n\tYou be physically demanding as well, requiring long periods of time in one small space, moving heavy objects and working with glass.\n\n\nRequirements\n\n\n\t\n\tInterested candidates should possess an NCE, OND, SSCE, HND qualification with 5 - 13 years of experience.\n\t\n\n\nSalary\nN80,000 - N100,000 per month. \n\nMethod of Application\nInterested and qualified candidates should forward their CV to the HR via: hospitalityjobopening1@gmail.com using the Job Position as the subject of the email.\n\nNote: For more information WhatsApp: 08058043665.\n\n \n\n \n\n3.) Waitress\n\nJob Location: Lekki Phase 1, Lagos\nEmployment Type: Full-time\n\nSummary\n\n\n\tA Waitress is responsible for ensuring a guest in a restaurant, bar, or other dining area has a positive experience at Limewood Villa hotel establishments by exhibiting excellent customer service.\n\tYour duties include greeting guests and taking their orders, communicating with members of the kitchen about orders, and carrying meals or beverages to the correct tables.\n\n\nResponsibilties\n\n\n\tGreeting guests and escort them to their tablesand taking drink and food orders.\n\tPresent menu and provide detailed information when asked (e.g. about portions, ingredients or potential food allergies).\n\tStaying attentive to the needs of guests in the dining area.\n\tTake accurate food and drinks orders, using a POS ordering software, order slips or by memorization.\n\tCommunicate order details to the Kitchen Staff.\n\tDelivering food from the kitchen to the guests.\n\tEnsuring the food order is made correctly by kitchen staff and looks presentable for guests.\n\tFollowing health code standards with regards to the handling of food.\n\tPrepare tables by setting up linens, silverware and glasses.\n\tPerforming shift duties like delivering racks of cups to the service station, rolling silverware, pre-bussing tables, wiping tables and removing debris and more.\n\tInform customers about the day’s specials.\n\tOffer menu recommendations upon request.\n\tUp-sell additional products when appropriate.\n\tCarry dirty plates, glasses and silverware to kitchen for cleaning.\n\tDeliver checks and collect bill payments.\n\tMeet with restaurant staff to review daily specials, changes on the menu and service specifications for reservations (e.g. parties).\n\tFollow all relevant health department regulations.\n\tCheck customers’ IDs to ensure they meet minimum age requirements for consumption of alcoholic beverages.\n\tCheck dishes and kitchenware for cleanliness and presentation and report any problems.\n\tArrange table settings and maintain a tidy dining area.\n\tExcellent presentation skills.\n\tTeam spirit.\n\tStrong organizational and multitasking skills, with the ability to perform well in a fast-paced environment.\n\tAttentiveness and patience for customer.\n\tActive listening and effective communication skills.\n\n\nQualifications\n\n\n\tInterested candidates should possess a Bachelor`s Degree, HND, NCE, OND, SSCE / GCE / NECO qualification.\n\n\nSalary\nN50,000 - N60,000 monthly.\n\nMethod of Application\nInterested and qualified candidates should forward their CV to the HR via: hospitalityjobopening1@gmail.com using the Job Position as the subject of the email.\n\nNote: For more information, WhatsApp: 08058043665.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Human Resources  Manager Job at Volition Capital",
    "link": "https://www.jobgurus.com.ng/jobs/view/human-resources-manager-job-at-volition-capital",
    "pubDate": "Fri, 20 Jun 2025 11:13:37 GMT",
    "source": "JobGurus",
    "keyword": "volition capital",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Volition Capital was set up to help the honest and hardworking to create wealth. We fulfill our mandate through investment education, cooperatives and partnerships with credible local and international investment companies. Our target audience is working professionals and retirees.\n\nWe are recruiting to fill the position below:\n\nJob Position: Human Resources  Manager\n\nJob Location: Lekki Phase 1, Lagos\nEmployment Type: Full-time (Hybrid)\nReporting Line: Operations Manager\n\nRoles & Responsibilities\nEmployee Lifecycle Management:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tOversee end-to-end recruitment processes, ensuring timely and effective hiring.\n\tManage onboarding and offboarding processes.\n\tAdminister employee benefits and allowances.\n\tSupport career management initiatives, including promotions, transfers, and role changes.\n\n\nPeople Development:\n\n\n\tImplement internship, training and development programs to enhance employee skills and competencies.\n\tTrack employee performance and support managers in performance evaluation.\n\tDevelop career growth strategies and succession planning frameworks.\n\n\nEmployee Happiness:\n\n\n\tDevelop and implement initiatives that promote employee well-being and satisfaction.\n\tAct as a point of contact for employee concerns and provide support as needed.\n\tFoster a positive workplace culture through engagement activities and feedback mechanisms.\n\n\nQualifications & Experience\n\n\n\tA University degree or equivalent certification.\n\tMinimum of 10 years of experience in an HR or related role.\n\tProven track record in recruitment, employee relations, and people development.\n\tFamiliarity with HR analytics and reporting.\n\n\nSkill Sets and Values:\n\n\n\tStrong interpersonal and documentation skills.\n\tExcellent organizational and problem-solving abilities.\n\tProficiency in HR software and data management.\n\tAbility to handle confidential information with integrity.\n\tStrong knowledge of labour laws and HR best practices.\n\n\nBenefits\n\n\n\tCompetitive remuneration in line with industry benchmarks\n\tHealth insurance\n\tWork-from-home options\n\tStaff-only investment opportunities\n\tCommunication allowance\n\tBirthday allowance\n\tHigh degree of autonomy & flexibility\n\tGlobal growth opportunities.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Senior Accountant Job at Volition Capital",
    "link": "https://www.jobgurus.com.ng/jobs/view/senior-accountant-job-at-volition-capital",
    "pubDate": "Fri, 20 Jun 2025 11:13:37 GMT",
    "source": "JobGurus",
    "keyword": "volition capital",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Volition Capital was set up to help the honest and hardworking to create wealth. We fulfill our mandate through investment education, cooperatives and partnerships with credible local and international investment companies. Our target audience is working professionals and retirees.\n\nWe are recruiting to fill the position below:\n\nJob Position: Senior Accountant\n\nJob Location: Lekki Phase 1, Lagos\nEmployment Type: Full-time (Hybrid)\nReporting Line: Chief Executive Officer\n\nRoles & Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tStreamline Financial Reporting: Develop a holistic dashboard from individual financial schedules. Provide source data for Management Accounts and QuickBooks entries.\n\tQuality Assurance: Ensure all QuickBooks entries, Management Accounts, and Audited Financial Statements are traceable to verifiable source figures from schedules and bank statements.\n\tOffshore Payment Assistance: Provide support and documentation for offshore payments to clients\n\tStakeholder Relationship Management: Develop and maintain strong relationships with banks, payment platforms, and investment partners.\n\tFinancial Strategy Optimization: Design and implement strategies to reduce costs and increase profitability.\n\tRegulatory Reporting: Complete the accounts section of quarterly SEC filings.\n\tShared Cost Coordination: Oversee shared costs, records, and invoices across group companies.\n\tOversight: Ensure accuracy in the Accounts Associate’s work.\n\n\nQualifications, Skill Sets, and Values\n\n\n\tBachelor’s degree in Accounting, Finance, or a related field.\n\tMinimum 10 years of accounting/finance experience, with at least 3 years in a management role.\n\tMust be a Chartered Accountant\n\tExpertise in IFRS and financial statement preparation.\n\tAdvanced proficiency in Microsoft Excel and QuickBooks.\n\tStrong analytical, organisational, and critical-thinking skills.\n\tExcellent interpersonal and communication skills.\n\tAccuracy and attention.\n\tExperience with SEC filings and accounts compliance is a strong advantage.\n\n\nRemuneration and Perks\n\n\n\tCompetitive remuneration in line with industry benchmarks.\n\tHealth insurance\n\tWork-from-home options\n\tStaff-only investment opportunities\n\tHigh degree of autonomy & flexibility.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "General Manager Job at Domeo Resources International",
    "link": "https://www.jobgurus.com.ng/jobs/view/general-manager-job-at-domeo-resources-international",
    "pubDate": "Fri, 20 Jun 2025 11:13:37 GMT",
    "source": "JobGurus",
    "keyword": "domeo resources international",
    "duplicate": false,
    "classifications": [],
    "content": "Domeo Resources International (DRI) is a prolific organisation which proffers HR and Management Consultancy solutions premised on excellence and innovation. DRI analyses various organisational problems, develops improvement plans, deploys those plans and monitors the plans to ensure improved organisational performance.\n\nWe are recruiting to fill the position below:\n\nJob Position: General Manager\nJob Location: Abuja (FCT)\nEmployment Type: Full-time\n\nExperiences / Qualifications\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tBachelor's degree in Hospitality Management, Business Administration, or related field; a Master’s degree is an added advantage.\n\tMinimum of 10 years of experience in the hospitality industry, with at least 5 years in a senior management role in a superior luxury 5-star hotel.\n\n\nMethod of Application\nInterested and qualified candidates should forward their CVs and cover letter detailing their vision for the role to: recruitment@domeoresources.org using \"General Manager, Hospitality\" as the subject of the mail.\n\nNote: Only shortlisted candidates will be contacted.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Internal Audit & Control Supervisor Job at Mogtech Group Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/internal-audit-control-supervisor-job-at-mogtech-group-limited-1",
    "pubDate": "Fri, 20 Jun 2025 11:13:37 GMT",
    "source": "JobGurus",
    "keyword": "mogtech group limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Mogtech Group Limited is a holding company with different member companies operating in different aspects of the Nigerian economy. They include: Alkanes Petroleum and Gas Limited and Alkanes-Diaplous Limited (previously known as Alkanes Energy Services Limited). As a holding company, we provide top-notch shared services in Accounts/Finance, Human Resources /Administration, Legal services, Health / Safety / Environment and Internal audit for member companies, creating and maintaining quality standards across the group, both in terms of people, processes and procedures.\n\nWe are recruiting to fill the position below:\n\nJob Position: Internal Audit & Control Supervisor\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Location: Lagos\nEmployment Type: Full Time\n\nMain Responsibilities\n\n\n\tDetermine internal audit and control scope and develop annual plans\n\tDesign appropriate financial, physical and technical controls for the company.\n\tS/He designs and implements an audit plan for the company\n\tResponsible for the planning and conducting of routine and periodic audits and compliance, providing assurance on the effectiveness of risk management and control procedures.\n\tTo maintain and improve on the organisation’s risk management framework and monitor the risk maturity and ensure it is reflected in the strategy.\n\tS/he is to identify key risks to business objectives, evaluate and test controls in place to ensure that areas for improvement are identified and risks minimized.\n\tTo monitor the effectiveness of established business control policies, processes and procedures and communicate identified weaknesses in controls management, and recommend workable solutions or review / update as appropriate\n\tMaintain and improve on existing policies, processes, procedures and regulations for increase in efficiency and/or effectiveness of the internal control systems with a view to promoting good corporate governance towards achieving the organisations mission and vision.\n\tResponsible for the development and implementation of an internal risk-based audit strategy and plan for the company.\n\tTo conduct periodic evaluation of business continuity and the disaster recovery processes.\n\tTo conduct ad-hoc investigations and handle issues arising from audit exercises. To validate adequacy, integrity and reliability of data from source applications systems.\n\tConduct follow up audits to monitor management’s interventions\n\tPrepare and present reports that reflect audit’s results and document process\n\tAnalyse key information technology issues that have material impact on operational effectiveness\n\tAssess degree and advise on the requirements for compliance with laws, regulations and code of business practices.\n\tAny other duties that may be communicated by the Head of Internal Audit & Control.\n\n\nRequirements and Qualifications\n\n\n\tBachelor's Degree in Accounting, Finance, Business Administration, or any related field\n\t3 - 5 years of proven experience in internal audit, risk management, or related field, preferably in the maritime industry.\n\tHe / She mustn’t be ICAN/ACA certified but must be in certain stages\n\tStrong understanding of internal control frameworks, audit methodologies, and regulatory requirements.\n\tProficiency in conducting risk assessments, internal audits, and control testing procedures.\n\tKnowledge of accounting principles, financial reporting standards, and auditing techniques.\n\tStrong communication and interpersonal abilities, with the capacity to interact professionally and effectively with stakeholders at all levels.\n\tDetail-oriented with a focus on accuracy and thoroughness in work.\n\tProficiency in Microsoft Office applications (e.g., Word, Excel, PowerPoint) and audit software tools.\n\tCommitment to integrity, ethics, and professionalism in all aspects of work.\n\tAdaptability and flexibility to navigate changing priorities and business needs.\n\tStrong project management skills, with the ability to plan, organize, and execute audit engagements within established timelines and budgets.\n\tContinuous learning mindset, with a commitment to staying updated on industry trends, regulations, and best practices in internal audit and risk management.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: careers@mogtech-group.com.ng using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]