[
  {
    "title": "Executive Assistant / Business Manager (Airbnb Operations) Job at Raphael Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/executive-assistant-business-manager-airbnb-operations-job-at-raphael-group-1",
    "pubDate": "Tue, 03 Jun 2025 10:45:31 GMT",
    "source": "JobGurus",
    "keyword": "raphael group",
    "duplicate": false,
    "classifications": [],
    "content": "Raphael Group is professional Virtual Assistant service that connects employers with skilled remote assistants. We offer a wide range of services to support individuals and businesses, including scheduling, email management, research, and more. We take the hassle out of finding and hiring qualified virtual assistants, allowing you to focus on growing your business.\n\nWe are recruiting to fill the position below:\n\nJob Position: Executive Assistant / Business Manager (Airbnb Operations)\n\nJob Location: Remote\nEmployment Type: Full-time\nWorking Hours:Full-time: (Wednesday - Sunday, 10 am - 4 pm)\n\nAbout the Role\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe’re seeking a highly organized, proactive, and experienced Executive Assistant / Business Manager to oversee daily operations and manage a remote team of Virtual Assistants (VAs), cleaners, and service providers for an established Airbnb property management business.\n\tThis role is ideal for someone with a solid background in Airbnb hosting or short-term rental property management, combined with exceptional people management and leadership skills.\n\tYou will serve as the right hand to the business owner - ensuring seamless day-to-day operations, managing teams, and maintaining high standards across all properties.\n\n\nKey Responsibilities\n\n\n\tOversee and coordinate a team of Virtual Assistants (VAs) responsible for guest communications, calendar management, and operational tasks.\n\tManage schedules, assign tasks, and monitor performance of VAs, cleaning staff, maintenance personnel, and other service providers (e.g., electricians, plumbers, handymen).\n\tEnsure all Airbnb properties are guest-ready, well-maintained, and compliant with hosting standards at all times.\n\tHandle escalated issues from team members or on-the-ground staff quickly and professionally.\n\tCoordinate regular property inspections, deep cleaning schedules, and urgent repair needs.\n\tAssist with onboarding, training, and performance evaluations of new team members.\n\tCreate and maintain systems and Standard Operating Procedures (SOPs) that promote efficiency, accountability, and outstanding guest experiences.\n\tProvide executive-level support to the business owner - including project tracking, operational reporting, and highlevel administrative support.\n\n\nRequirements\n\n\n\t3+ years of experience in Airbnb or vacation rental management, property coordination, or short-term rental operations.\n\tProven experience in managing remote teams.\n\tStrong interpersonal, organizational, and leadership skills; capable of guiding teams with clarity, empathy, and decisiveness.\n\tProficiency in using tools such as the Airbnb platform, Google Workspace (Docs, Sheets, Calendar), Slack, Trello or Asana (project management tools), and other property management software.\n\tSelf-motivated, detail-oriented, and able to resolve problems efficiently under pressure.\n\tWillingness to be on-call and responsive to urgent matters that may arise on weekends.\n\n\nWhat We Offer\n\n\n\tSalary:N175,000 / Monthly.\n\tA key leadership role within a growing and professional Airbnb management company\n\tRemote working environment with flexibility and autonomy\n\tOpportunities to lead and scale a remote operations team\n\tCompetitive pay with performance-based growth potential.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Social Media Manager Job at Raphael Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/social-media-manager-job-at-raphael-group-1",
    "pubDate": "Tue, 03 Jun 2025 10:45:31 GMT",
    "source": "JobGurus",
    "keyword": "raphael group",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Raphael Group - A professional virtual assistant service that connects employers with skilled remote assistants. We offer a wide range of services to support individuals and businesses, including scheduling, email management, research, and more. We take the hassle out of finding and hiring qualified virtual assistants, allowing you to focus on growing your business.\n\nWe are recruiting to fill the position below:\n\nJob Position: Social Media Manager\n\nJob Locations: Abuja (FCT) and Lagos\nEmployment Type: Full-time\n\nDescription\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are a dynamic and forward-thinking company seeking a dedicated and experienced Social Media Manager to join our team.\n\tIf you are proactive, creative, and have a proven track record of managing successful social media campaigns, we would love to hear from you.\n\n\nKey Responsibilities\n\n\n\tDevelop, implement, and manage social media strategies across various platforms (Facebook, Instagram, Twitter, LinkedIn, etc.).\n\tCreate engaging multimedia content and manage social media accounts, ensuring brand consistency and voice.\n\tAnalyze social media metrics and derive actionable insights to optimize performance.\n\tCollaborate with other departments to align social media strategies with overall marketing goals.\n\tStay up-to-date with the latest social media best practices and technologies.\n\tMonitor SEO and web traffic metrics to assess campaign effectiveness.\n\tManage social media advertising campaigns, including budget allocation and performance tracking.\n\n\nRequirements\n\n\n\tInterested candidates should possess an HND / Bachelor's Degree\n\tMinimum of 5 years of experience in social media management, with a strong portfolio of successful campaigns.\n\tClear proof of work, including case studies or examples of past projects.\n\tProficiency in social media management tools (e.g., Hootsuite, Buffer, Sprout Social).\n\tCreative thinker with the ability to develop innovative and engaging content.\n\tStrong organizational and multitasking skills with the ability to manage multiple projects simultaneously.\n\tStrong understanding of social media KPIs and analytics tools (Google Analytics, Facebook Insights, etc.).\n\tExcellent communication, writing, and editing skills.\n\tExperience with graphic design tools (e.g., Adobe Creative Suite, Canva) is a plus.\n\tMust be really good with CapCut.\n\n\nDesired Attributes:\n\n\n\tHighly motivated and proactive with a passion for social media and digital marketing.\n\tStrong analytical skills and attention to detail.\n\tAbility to work independently and as part of a team.\n\tExcellent time management and organizational skills.\n\tAbility to stay calm under pressure and meet tight deadlines.\n\tPositive attitude and strong work ethic.\n\n\nSalary\nN135,000 / month.\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Human Resource Manager (Male) Job at Debmyk Consult",
    "link": "https://www.jobgurus.com.ng/jobs/view/human-resource-manager-male-job-at-debmyk-consult",
    "pubDate": "Tue, 03 Jun 2025 10:45:31 GMT",
    "source": "JobGurus",
    "keyword": "debmyk consult",
    "duplicate": false,
    "classifications": [],
    "content": "Debmyk is Consulting firm which specialized in HR outsourced services such as recruitment, training and development, performance management, among others.\n\nWe are recruiting to fill the position below:\n\nJob Position: Human Resource Manager (Male)\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Oveview\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAre you a strategic thinker with a passion for people?We are looking for an experienced and dynamicHuman Resources Managerto lead and grow our HR function.\n\tThis is an exciting opportunity to shape our workplace culture and drive initiatives that support our most valuable asset, our people.\n\n\nKey Responsibilities\n\n\n\tLead end-to-end recruitment, onboarding, and retention strategies.\n\tDevelop and implement HR policies, procedures, and compliance programs.\n\tManage performance review cycles and support leadership in talent development.\n\tFoster a positive and inclusive workplace culture.\n\tOversee payroll, compensation, and benefits administration.\n\tHandle employee relations, conflict resolution, and disciplinary processes.\n\tProvide guidance to managers on HR best practices and employment law.\n\n\nWhat We’re Looking For\n\n\n\tBachelor’s degree in Human Resources, Business Administration, or related field.\n\t5+ years of progressive HR experience, with at least 2 years in a leadership or managerial role.\n\tCIPM or SHRM Certification\n\tAbility to travel across Nigeria for business purposes\n\tStrong knowledge of labor laws and HR best practices.\n\tExcellent interpersonal, leadership, and organizational skills.\n\tExperience with HRIS systems and Microsoft Office tools.\n\n\nBenefits\n\n\n\tSalary: N300,000 - N600,000 Monthly.\n\tCompetitive salary and benefits package.\n\tOpportunities for professional development and career growth.\n\tSupportive, team-oriented company culture.\n\tA chance to make a real impact in a growing organization.\n\n\nMethod of Application\nInterested and qualified candidates should: send their CV to: wonderiyanu014@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]