[
  {
    "title": "IT Executive Job at Merit Healthcare Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/it-executive-job-at-merit-healthcare-limited",
    "pubDate": "Sat, 21 Jun 2025 13:03:28 GMT",
    "source": "JobGurus",
    "keyword": "merit healthcare limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Merit Healthcare Limited is a Pharmaceutical Company that deals with importation, distribution and marketing of pharmaceutical products.\n\nWe are recruiting to fill the position below:\n\nJob Position: IT Executive\n\nJob Location: Lagos \nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe IT Executive is responsible for managing and supporting the day-to-day IT operations of the organization, including system administration, hardware and software support, network management, data security, and troubleshooting.\n\tThe role ensures that all IT infrastructure runs efficiently and supports the organization’s objectives through the effective use of technology.\n\n\nKey Responsibilities\n\n\n\tInstall, configure, and maintain hardware and software systems, including desktops, laptops, printers, servers, and mobile devices.\n\tProvide technical support and troubleshooting assistance to staff across all departments on IT-related issues.\n\tMonitor and maintain IT infrastructure, including LAN/WAN, routers, switches, firewalls, and internet connectivity.\n\tImplement software updates, patches, and antivirus protection across all systems and devices.\n\tAssist in planning and executing IT projects, such as system upgrades, migrations, and new installations.\n\tEnsure data backup and disaster recovery protocols are followed and systems are secure against threats.\n\tManage email systems, user accounts, and access controls in line with company policies.\n\tMaintain IT asset inventory and oversee procurement, licensing, and maintenance of software and hardware.\n\tSupport the implementation of ERP, CRM, or other enterprise solutions, working closely with vendors and internal users.\n\tEnsure compliance with data protection regulations, internal policies, and IT best practices.\n\n\nRequirements\n\n\n\tCandidates should possess relevant qualifications with at least 5 years of experience.\n\n\nKey Skills & Competencies:\n\n\n\tSolid knowledge of IT systems, networking, and hardware\n\tStrong troubleshooting and diagnostic skills\n\tFamiliarity with Microsoft Office 365, Windows OS, Linux (where applicable)\n\tAbility to manage multiple tasks and priorities under pressure\n\tGood understanding of cybersecurity practices\n\tExcellent communication and interpersonal skills\n\tStrong documentation and reporting skills.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: odewale_shola@merithealthcare.com.ng using the Job Position and Location as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Personal Assistant (P.A) to the Executive Director Job at Africa Youth Growth Foundation (AYGF)",
    "link": "https://www.jobgurus.com.ng/jobs/view/personal-assistant-pa-to-the-executive-director-job-at-africa-youth-growth-foundation-aygf",
    "pubDate": "Sat, 21 Jun 2025 13:03:28 GMT",
    "source": "JobGurus",
    "keyword": "africa youth growth foundation (aygf)",
    "duplicate": false,
    "classifications": [],
    "content": "Africa Youth Growth Foundation (AYGF) is a regional non- Governmental Organisation that focuses on the following thematic areas ; Migration, Public Health, Education, Democratic Governance, livelihood, Climate Change and Environment\n\nWe are recruiting to fill the position below:\n\nJob Position: Personal Assistant (P.A) to the Executive Director\nJob Location: Abuja (FCT)\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Personal Assistant (P.A) to the Executive Director (ED) will provide high-level administrative, strategic, and operational support to ensure the smooth functioning of the Executive Director’s office.\n\tThe role requires a proactive, highly organized, and discreet individual capable of managing competing priorities and representing the ED with professionalism in all engagements.\n\n\nResponsibilities\n\n\n\tManage the ED’s calendar, schedule meetings, appointments, and travel arrangements.\n\tHandle confidential correspondence, reports, and documents on behalf of the ED.\n\tServe as the first point of contact for internal and external stakeholders seeking audience with the ED.\n\tOrganize logistics for meetings, retreats, and public engagements involving the ED.\n\tMaintain an efficient electronic and physical filing system for the ED’s office.\n\tAssist in conducting research and compiling briefing documents and reports.\n\tDraft, edit, and format memos, presentations, speeches, and official communications.\n\tCoordinate and prepare background materials and agendas for meetings, conferences, and engagements.\n\tFollow up on action points and ensure deadlines are met.\n\tEnsure the ED is well-prepared for all meetings and external engagements.\n\tRepresent the ED in meetings or engagements when delegated.\n\n\nQualifications and Experience\n\n\n\tQualification should be a minimum of a B.Sc. in Administration, Social Sciences, Communications, or a related field.\n\tMinimum of 3 years of proven experience as a Personal Assistant, Executive Assistant, or in a similar role.\n\tExperience working in an NGO or development sector is highly desirable.\n\n\nMethod of Application\nInterested and qualified candidates should send their Resume and a Cover Letter detailing relevant experience and motivation. to: recruitment@aygf.org using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Human Resource Manager Job at Pavilion Technology Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/human-resource-manager-job-at-pavilion-technology-limited",
    "pubDate": "Sat, 21 Jun 2025 13:03:28 GMT",
    "source": "JobGurus",
    "keyword": "pavilion technology limited",
    "duplicate": false,
    "classifications": [],
    "content": "Pavilion Technology Limited provides end-to-end vertical technology, security infrastructure solutions, smart data platforms, and manned security options for businesses. We are dedicated to ensuring your safety by combining unmatched expertise and skill to design and implement protection solutions that creates a secure customer experience, foster business security reinvention, streamline operational excellence, and deliver trust and compliance.\n\nWe are recruiting to fill the position below:\n\nJob Position: Human Resource Manager\nJob Location: Lagos MainLand, Lagos\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tIdentifying and designing initiatives to achieve departmental plans.\n\tOversee recruitment, staff retention, performance management, and reward processes and all employee related matters in the company.\n\tImplement and coordinate performance management process.\n\tProcess leave status and allowances.\n\tEnsure staff training and development.\n\tRecommend and advise on employ related initiatives.\n\n\nRequirements\n\n\n\tDegree in Human Resources, or a related field.\n\tAt least 10 years of work experience with at least 5 years in HR Managerial role.\n\tProficiency in use of HR ERP.\n\tWork experience in a private security company will be an added advantage.\n\tKnowledge of Nigeria Labour Law and other employee related regulations.\n\tExcellent organizational skills and strong communication skills.\n\n\nCompetencies:\n\n\n\tStrong interpersonal skills.\n\tGood written and verbal communication skills.\n\tTeam spirit.\n\tAttention to detail.\n\tPersonal effectiveness.\n\tAnalytical skill.\n\tStrategic management competencies.\n\n\nMethInterested and qualified candidates should send their CV to: career@paviliontechnology.com using \"Human Resource Manager\" as the subject of the email.\n\nNote: Only shortlisted candidates will be contacted.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Sales and Marketing Executive Job at President Paints Nigeria Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/sales-and-marketing-executive-job-at-president-paints-nigeria-limited-1",
    "pubDate": "Sat, 21 Jun 2025 13:03:28 GMT",
    "source": "JobGurus",
    "keyword": "president paints nigeria limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "President Paints Nigeria Limited is a prestigious paint-producing company that has existed for over 35 years. We deliver quality and beauty products.\n\nWe are recruiting to fill the position below:\n\nJob Position: Sales and Marketing Executive\n\nJob Location: Abule Egba, Lagos\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tSource for the market for Paint products.\n\tSource for contracts, follow-up, and seal deals.\n\tGenerate unique sales plan.\n\tChannel customer feedback to the customer care department for resolution.\n\tGive feedback about products and sales performance.\n\n\nRequirements\n\n\n\tCandidates should possess an OND / HND qualification with 1 - 2 years of work experience.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hr@presidentpaints.org using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Network Operations Manager  Job at Ikeja Electricity Distribution Company (IKEDC)",
    "link": "https://www.jobgurus.com.ng/jobs/view/network-operations-manager-job-at-ikeja-electricity-distribution-company-ikedc",
    "pubDate": "Sat, 21 Jun 2025 13:03:28 GMT",
    "source": "JobGurus",
    "keyword": "ikeja electricity distribution company (ikedc)",
    "duplicate": false,
    "classifications": [],
    "content": "Ikeja Electricity Distribution Company (IKEDC) - Buoyed by a mission to redefine customer experience and be the provider of choice wherever energy is consumed, the Ikeja Electric (IE), Nigeria's largest power distribution network, came into existence on November 1st, 2013 following the handover of the defunct Power Holding Company Of Nigeria (PHCN) to NEDC/ KEPCO Consortium under the privatization scheme of the Federal Government of Nigeria.\n\nWe are recruiting to fill the position below:\n\nJob Position: Network Operations Manager \nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAs a Network Operations Manager, you will be responsible for overseeing all operations and maintenance activities within the business unit.\n\tYou will lead efforts to ensure the smooth functioning of the distribution network, prevent equipment failure, and implement strategies for loss and accident reduction.\n\n\nYou Will Contribute To\n\n\n\tAllocating tasks and supervising employees to ensure targets are met within the business unit.\n\tAuditing records to maintain compliancewith operational methods and qualit standards.\n\tPlanning, organizing, and coordinating the operation and maintenance of 11kV and 415kV distribution networks.\n\tManaging technical activities for smooth functioning of the network and ensuring timely inspections and commissioning of new projects.\n\tCollaborating with the Corporate Office and managing materials, budgets, and resources for efficient operations.\n\tDriving loss reduction strategies and ensuring compliance with safety and regulatory policies.\n\n\nRequirements\nEducation:\n\n\n\tBachelor’s degree in Electrical Engineering, Mechanical Engineering, or a related technical field.\n\n\nWork Experience:\n\n\n\tA minimum 8-10 years of relevant work experience in operations and maintenance within the power sector.\n\n\nSkills & Competencies:\n\n\n\tThe role affords you to develop technical and behavioral competencies, that is, skills, knowledge, and behaviors required to successfully perform in the role and contribute to the organization's goals.\n\n\nTechnical Competencies:\n\n\n\tNetwork Data Analysis Management\n\tOperations & Maintenance Management\n\tSub-station Planning Maintenance\n\tSystem Support Load Management\n\tHigh & Low Tension Operation & Maintenance Management\n\tNetwork Location Mapping\n\tEquipment Testing & Commissioning Management\n\tElectricity Industry Regulatory Knowledge\n\n\nBehavioral Competencies:\n\n\n\tCustomer Centricity – Minimize downtime and enhance service reliability to improve customer experience.\n\tRisk Management – Identify potential risks and implement preventive measures to ensure system stability.\n\tPeople Leadership – Guide maintenance teams for effective task execution and strict adherence to safety protocols.\n\tSupervisory/Managerial Skills – Oversee daily operations, ensuring timely issue resolution and regulatory compliance.\n\tEntrepreneurship – Drive process improvements and cost-effective solutions for operational efficiency.\n\tChange Management – Adapt to new technologies and evolving maintenance strategies to boost performance.\n\tResult-Driven Approach – Optimize resource allocation to meet maintenance goals and minimize downtime.\n\n\nMinimum Requirements:\n\n\n\tThis opportunity is a Senior Manager role; the complexity of this role will work across all Functions and Department of the Business.\n\tThe role reports directly to the Business Manager.\n\tSuccessful applicants will typically possess the following criteria:\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]