[
  {
    "title": "UI / UX Designer (Web3 Experience Preferred) Job at Galdun X",
    "link": "https://www.jobgurus.com.ng/jobs/view/ui-ux-designer-web3-experience-preferred-job-at-galdun-x",
    "pubDate": "Tue, 01 Jul 2025 13:30:13 GMT",
    "source": "JobGurus",
    "keyword": "galdun x",
    "duplicate": false,
    "classifications": [],
    "content": "Galdun X, established in 2023 as a web development agency, GaldunX has rapidly evolved into a full-service digital agency. Our mission is to onboard exceptional talent and deliver outstanding results for clients and companies. In just a few months, we've assembled a skilled and dedicated team with an average of over three years of experience, all united by a shared commitment to building high-quality products and providing top-notch services.\n\nWe are recruiting to fill the position below:\n\nJob Position: UI / UX Designer (Web3 Experience Preferred)\n\nJob Locations: Abuja (FCT), Lagos and Rivers\nEmployment Type: Remote (Full-Time)\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are looking for a talented UI/UX Designer with a passion for clean design and experience in Web3 products.\n\tYou will be responsible for creating user-friendly interfaces for digital platforms that reflect GaldunX's standard of excellence and innovation.\n\n\nResponsibilities\n\n\n\tDesign user interfaces for web and mobile platforms\n\tCreate wireframes, prototypes, and high-fidelity mockups\n\tCollaborate with product and dev teams from concept to launch\n\tApply user research to inform design decisions\n\tTranslate complex ideas into clean, intuitive designs\n\tIntegrate Web3 elements into seamless user flows\n\tEnsure design consistency across all platforms and devices.\n\n\nRequirements\n\n\n\tExperience: Minimum of 2 Years in UI/UX Design\n\tStrong UI/UX portfolio (must include live projects or case studies)\n\tProficiency in Figma and other standard design tools\n\tExperience designing for Web3, DeFi, or crypto-related platforms\n\tDeep understanding of user-centered design principles\n\tAbility to create responsive, mobile-first interfaces\n\tKnowledge of design systems and accessibility standards\n\tBasic knowledge of HTML/CSS\n\n\nCompensation\nN35,000 / month (Review & Increase After 3 Months Based on Performance).    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "School Manager Job at WaterBrooks Academy",
    "link": "https://www.jobgurus.com.ng/jobs/view/school-manager-job-at-waterbrooks-academy",
    "pubDate": "Tue, 01 Jul 2025 13:30:13 GMT",
    "source": "JobGurus",
    "keyword": "waterbrooks academy",
    "duplicate": false,
    "classifications": [],
    "content": "WaterBrooks Academy is a world-class Educational institute providing educational services at Pre-nursery, Nursery, Primary, College and Advanced Levels.\n\nWe are recruiting to fill the position below:\n\nJob Position: School Manager\n\nJob Location: Ilorin, Kwara \nEmployment Type: Full-time\n\nResponsibilities\n\n\n\tTo oversee the operations of a growing Junior and Senior Secondary School.\n\n\nRequirements\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tCandidates should possess a Bachelor's Degree / Master's Degree with 1-5 years of work experience.\n\n\nSalary\nN45,000 - N65,000 / Month.\n\nMethod of Application\nInterested and qualified candidates should send their Applications and CV to: waterbrooksacademy@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Sales Executive Job at Eljo Stores",
    "link": "https://www.jobgurus.com.ng/jobs/view/sales-executive-job-at-eljo-stores",
    "pubDate": "Tue, 01 Jul 2025 13:30:13 GMT",
    "source": "JobGurus",
    "keyword": "eljo stores",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Eljo Stores is a reputable grocery store located in the heart of Kubwa, Abuja, offering both wholesale and retail services. We pride ourselves on providing quality products at competitive prices, backed by excellent customer service.\n\nWe are recruiting to fill the position below:\n\nJob Position: Sales Executive\n\nJob Location: Kubwa, Abuja (FCT) \nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Sales Executive will be responsible for driving sales, building strong customer relationships, and expanding our client base. This role requires someone who is confident, persuasive, and passionate about retail and marketing.\n\n\nKey Responsibilities\n\n\n\tActively seek out new sales opportunities through cold calling, networking, and physical outreach in the Kubwa area and beyond.\n\tMaintain relationships with existing customers by providing support, guidance, and after-sales service.\n\tMeet and exceed sales targets set by the management.\n\tPresent, promote, and sell products using solid arguments to both new and existing customers.\n\tHandle customer inquiries and complaints professionally and promptly.\n\tMonitor customer preferences and market trends to identify new opportunities and report feedback to management.\n\tCollaborate with the store team to ensure customer satisfaction and smooth sales operations.\n\tEnsure daily account reconciliation.\n\n\nRequirements\n\n\n\tMinimum of OND or equivalent; a degree in Marketing, Business Administration, or a related field is an added advantage.\n\tAt least 2 years of proven experience in a sales or customer-facing role, preferably in a retail or grocery environment.\n\tExcellent verbal and written communication skills.\n\tStrong negotiation and persuasive skills.\n\tGood knowledge of marketing and sales techniques.\n\tAbility to work independently and as part of a team.\n\tMust reside in or around Kubwa, Abuja.\n\tProficiency in using mobile appsis an added advantage.\n\n\nWhat We Offer\n\n\n\tCompetitive salary with performance-based incentives.\n\tA friendly and supportive work environment.\n\tOpportunities for career growth and development.\n\tStaff discounts and benefits.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: eljoinservices@gmail.com using \"Application for Sales Executive – Eljo Stores\" as the subject of the mail.\n\nNote\n\n\n\tIf you're passionate about sales and customer service and want to grow with a trusted brand, we’d love to hear from you.\n\tOnly shortlisted candidates will be contacted.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]