[
  {
    "title": "Secretary Job at Across Global Travels & Tours Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/secretary-job-at-across-global-travels-tours-limited",
    "pubDate": "Tue, 10 Jun 2025 11:13:33 GMT",
    "source": "JobGurus",
    "keyword": "across global travels & tours limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Across Global Travels & Tours Limited is a reputable, fully accredited and trusted travel and tour company, founded in 2011 and incorporated under Nigerian government with Registration number: RC 959132. We specialize in providing wide range of trustworthy travel and tour solutions such as Jobs Recruitment, Visa Consulting, Study Abroad Packages, Tour Operations, Flight Ticketing and General Visa Consultancy. We have grown to be one of the most respected in our areas of expertise and have gained the trust of our customers over the years. Across Global Travels & Tours Limited is one of the most renowned and trusted travel and tourism companies in Nigeria.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Secretary\nJob Location: Ibadan, Oyo\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe are seeking a Secretary who can work perfectly on CorelDRAW &  with social media and digital marketing skills\n\n\nRequirements\n\n\n\tCorelDRAW and Digital marketing skills are very important for this position.\n\tWe need a very confident, smart-thinking secretary who can boldly speak in public, attend radio adverts and many more\n\tApplicants must be a resident of Ibadan living very close to our office Location in Ibadan, Ring Road area, Oyo state.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: mracross007@gmail.com using the Job Position as the subject of the email.\n\nNote: Applicants must be a resident of Ibadan living very close to our office Location in Ibadan, Ring Road area, Oyo state.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Guest Services Assistant (Temporary) Job at Destiny Suites",
    "link": "https://www.jobgurus.com.ng/jobs/view/guest-services-assistant-temporary-job-at-destiny-suites",
    "pubDate": "Tue, 10 Jun 2025 11:13:33 GMT",
    "source": "JobGurus",
    "keyword": "destiny suites",
    "duplicate": false,
    "classifications": [],
    "content": "Destiny Suites is the umbrella name of the guest houses of the Dream Centre of the Life Oasis International Church, Osogbo. Destiny Suites will be in full operation between 5th of July and 13th of July, 2025 because our church's convention, The Annual God Of Breakthroughs Convention and Homecoming (GOBC&H) 2025, will be holding within that period.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Guest Services Assistant (Temporary)\nJob Location: Osogbo, Osun\nEmployment Type: Temporary, 9 Days\nDuration: July 5th – July 13th, 2025\nShift: 8:00 AM - 8:00 PM OR 8:00 PM to 8:00 AM daily (12-hour shift)\nDress Code: White Shirt and Black Trouser (males) /Skirt (for females).\n\nJob Summary\n\n\n\tWe are seeking reliable and courteous individuals to join our team as Guest Services Assistants during a special 9-day period.\n\tIf you're a Christian and you enjoy creating a warm and welcoming experience for guests, this opportunity is for you.\n\n\nKey Responsibilities\n\n\n\tWelcome and attend to guests professionally\n\tHandle check-ins, check-outs, and guest inquiries\n\tSupport housekeeping and laundry duties when required\n\tEnsure cleanliness and orderliness in common areas\n\tRespond promptly to guest needs and complaints\n\n\nRequirements\n\n\n\tPrevious experience in hospitality or customer service is an advantage\n\tGood communication and interpersonal skills\n\tAbility to multitask and stay professional under pressure\n\tMust be available for all 9 days (July 5–13). These include 2 days of training.\n\tMust adhere to the white and black dress code daily.\n\n\nSalary\nN30,000 Monthly.\n\nMethod of Application \nInterested and qualified candidates should send their CV / Resume to: gobchadmin@dreamcentre.org using the Job Title as the subject of the email.\nAnd\nClick here to apply online\n\nNote: Join us in creating an excellent experience for our valued guests!    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Executive Assistant Job at Premium Links",
    "link": "https://www.jobgurus.com.ng/jobs/view/executive-assistant-job-at-premium-links",
    "pubDate": "Tue, 10 Jun 2025 11:13:33 GMT",
    "source": "JobGurus",
    "keyword": "premium links",
    "duplicate": false,
    "classifications": [],
    "content": "Premium Links, a firm with topnotch advertising skills, is recruiting to fill the position below:\n\nJob Position: Executive Assistant\nJob Location: Ibadan, Oyo\nEmployment Type: Full-time\n\nResponsibilities and Duties\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tCalendar Management: Scheduling, coordinating, and managing the executive's appointments, meetings, and travel arrangements.\n\tCommunication: Drafting and editing emails, memos, reports, and presentations, as well as screening and prioritizing incoming communications.\n\tAdministrative Tasks: Maintaining records, filing documents, preparing expense reports, and ordering office supplies.\n\tTravel Planning: Coordinating flights, accommodations, and transportation for the executive's travel.\n\tConfidentiality: Handling confidential information with discretion and integrity.\n\tMeeting Coordination: Organizing meetings, taking minutes, and distributing action items.\n\tProject Support: Assisting with special projects, research, and analysis as needed.\n\tLiaison: Acting as a point of contact for the executive, connecting them with internal and external parties.\n\tProcess Improvement: Identifying areas for process improvement and implementing efficient administrative systems.\n\n\nRequirements\n\n\n\tInterested candidates should possess an OND / HND / BSc Degree with 2+ years work experience.\n\n\nRequired Skills:\nOrganizational Skills:\n\n\n\tCalendar Management: Effectively managing the executive's schedule, including meetings, appointments, and travel arrangements.\n\tTime Management: Prioritizing tasks, meeting deadlines, and effectively using time to support the executive's needs.\n\tProject Management: Assisting with planning and execution of projects, often including tasks like event planning or implementation of new systems.\n\tDocument Control: Maintaining and organizing records, ensuring accurate and easy retrieval of information.\n\n\nCommunication Skills:\n\n\n\tVerbal and Written Communication: Communicating clearly and effectively with various stakeholders, including internal and external contacts.\n\tActive Listening: Understanding and responding to the executive's needs and instructions.\n\tInterpersonal Skills: Building strong relationships with colleagues, clients, and other stakeholders.\n\n\nTechnical Skills:\n\n\n\tSoftware Proficiency: Familiarity with office software suites like Microsoft Office or Google Workspace.\n\tData Entry: Accurately inputting and maintaining data in various systems.\n\tTyping and Email Management: Efficiently typing documents and managing email correspondence.\n\n\nSoft Skills:\n\n\n\tProblem-Solving: Identifying and resolving issues, often requiring independent thinking and decision-making.\n\tAttention to Detail: Ensuring accuracy and thoroughness in all tasks, including documents and presentations.\n\tAdaptability: Adjusting to changing priorities and demands in a fast-paced environment.\n\tEmotional Intelligence: Understanding and managing emotions, building rapport with others, and navigating complex situations with tact.\n\tConfidentiality and Discretion: Maintaining the confidentiality of sensitive information and exercising discretion in all interactions.\n\tProfessionalism: Maintaining a professional demeanor in all interactions and representing the executive effectively.\n\tProactiveness: Anticipating needs and taking initiative to address them.\n\tMultitasking: Effectively managing multiple tasks and responsibilities simultaneously.\n\n\nSalary\nN120,000 - N160,000 per month. \n\nMethod of Application\nInterested and qualified candidates should send their CV to: Premiumlinks198@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]