[
  {
    "title": "Internal Sales Representative  Job at Mantrac",
    "link": "https://www.jobgurus.com.ng/jobs/view/internal-sales-representative-job-at-mantrac-2",
    "pubDate": "Thu, 12 Jun 2025 10:45:00 GMT",
    "source": "JobGurus",
    "keyword": "mantrac",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Mantrac is the sole distributor for Caterpillar products in Nigeria, distributing and supporting machinery, power systems and material-handling equipment. The company provides customers with comprehensive solutions, backed by technical know-how, experience and in-depth knowledge of their local markets.\n\nWe are recruiting to fill the position below:\n\nJob Position: Internal Sales Representative - Multibrand\n\nJob Location: Lagos\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDevelop and rebuild relationship (Customer Relationship Management - CRM) with designated and targeted customers by phone to sell parts and service offerings and create sales opportunities to meet company objectives and customer satisfaction.\n\n\nMain Duties and Responsibilities\n\n\n\tContact customers to present multi-brand parts and services and answer all technical and commercial inquiries\n\tInform customers by phone about new product offerings\n\tParticipate in quotations preparation, terms of payment for his/her supervisor or manager’s review and approval\n\tPresent relevant technical publications as appropriate to customers and explain benefits / advantages of the multi-brand products, with comparison to OEM and OE products\n\tFollow up on opportunities and quotes to maximize sales and results\n\tKeep good control of customer list and keep updating customer profiles and population in Salesforce or any existing dealer marketing information system\n\tReport any prime product sales leads to his / her supervisor, manager or the prime product manager\n\tAssist with the solution and resolution of customer complaints raised\n\tReport all lost sales of parts and service to supervisor / manager and to ensure such lost sales are appropriately entered into dealer system (Salesforce)\n\tEnsure there are no overdue debt on customers’ parts and service account.\n\tPerform any other related duties as required by product support sales management\n\n\nRequirements\n\n\n\tCandidates should possess an HND / B.Sc. Engineering or equivalent. \n\tAt least 2 years of experience in similar industry (sales, marketing & technical experience)\n\tComputer literate (MS word, Excel).\n\n\nMethod of Application\nInterested and qualified candidates should forward their CV to: recruitment@mantracnigeria.com using the Job Position as the subject of email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Online Marketing Strategist Job at Amani Advisory Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/online-marketing-strategist-job-at-amani-advisory-limited",
    "pubDate": "Thu, 12 Jun 2025 10:45:00 GMT",
    "source": "JobGurus",
    "keyword": "amani advisory limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Amani Advisory Limited - Our client is a fast-growing Nigerian marketing agency serving brands across Africa.\n\nThey are recruiting to fill the position below:\n\nJob Position: Online Marketing Strategist\nJob Location: Lekki, Lagos\nEmployment Type: Full-time (Hybrid)\n\nJob Summary \n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\t We're looking for an experienced Digital Marketing Manager who can own the digital marketing strategy end-to-end—from campaign ideation to execution and performance analysis. You will work across a diverse portfolio of clients in industries ranging from FMCG, fintech, fashion, hospitality, and tech startups.\n\tThis is a role for someone who is both data-driven and creative, understands the Nigerian consumer landscape, and is hands-on with performance marketing tools and content-led growth strategies.\n\n\nResponsibilities\n\n\n\tDevelop and execute comprehensive digital marketing strategies tailored to each client’s business goals.\n\tTranslate brand objectives into actionable digital plans across paid, earned, and owned media.\n\tResearch market trends and audience insights within the Nigerian and African digital ecosystem.\n\tManage multi-platform campaigns across Google Ads, Meta (Facebook/Instagram), Twitter/X, TikTok, LinkedIn, and YouTube.\n\tOversee SEO/SEM efforts including keyword research, backlinking, and on-page optimization.\n\tImplement email marketing flows (Mailchimp, Klaviyo, etc.) for nurture and acquisition.\n\tCollaborate with the creative team to ideate, brief, and approve high-performing ad creatives and content formats (video, static, carousels, UGC).\n\tServe as a strategic liaison between internal teams and clients, ensuring alignment and transparency.\n\tSupervise a team of digital executives, performance marketers, and content strategists.\n\tGuide influencer marketing strategies and partnerships, especially for Nigerian Gen Z and Millennial audiences.\n\tMonitor, analyze, and report on campaign performance using GA4, Meta Business Suite, Google Data Studio, and other analytics tools.\n\tCreate and present monthly performance reports, highlighting insights, ROI, and growth opportunities.\n\tEnsure delivery of projects within budget and on time.\n\n\nPerson Specification\n\n\n\t4–6 years of experience in digital marketing (agency experience preferred).\n\tStrong knowledge of the Nigerian digital marketing space—local platforms, culture, and user behavior.\n\tProven experience managing paid media campaigns with measurable ROI.\n\tProficiency in Google Ads, Meta Ads Manager, GA4, SEO tools (SEMRush, Ahrefs), and CRM/email marketing platforms.\n\tStrong copywriting, editing, and campaign storytelling skills.\n\tExcellent Excel, reporting, and dashboarding abilities.\n\tStrong organizational, project management, and multitasking skills.\n\tExperience with eCommerce, tech startups, or FMCG brands in Nigeria.\n\tCertification in Google Ads, Meta Blueprint, or HubSpot is a plus.\n\tBasic understanding of web development, UI/UX, or HTML/CSS.\n\n\nWhat We Offer\n\n\n\tSalary: N300,000 per month. \n\tCompetitive salary + performance bonus.\n\tFast-paced agency environment with diverse clients and industries.\n\tContinuous training, certifications, and growth opportunities.\n\tFlexible working hours and hybrid setup.\n\tAccess to tools and budgets to execute bold campaigns.\n\n\nMethod of Application\nInterested and qualified candidates should forward their CV to: talent@amaniadvisory.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "IT Technical Support & Compliance Officer Job at Enviable Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/it-technical-support-compliance-officer-job-at-enviable-group",
    "pubDate": "Thu, 12 Jun 2025 10:45:00 GMT",
    "source": "JobGurus",
    "keyword": "enviable group",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "Enviable Group is a fast-growing, diversified conglomerate with operations across finance, retail, agriculture, and real estate. Our success relies on a secure, reliable, and policy-driven technology backbone. We are expanding our IT team to ensure every branch receives the same high-quality support and governance that fuels our growth.\n\nWe are recruiting to fill the position below:\n\nJob Position: IT Technical Support & Compliance Officer\nJob Locations: Abuja, Lagos (Ikorodu & Victoria Island), Umuahia - Abia, Enugu and Asaba - Delta\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tYou will be the first-line technical contact for staff in your assigned branch while actively monitoring systems and user activities for compliance with Group IT policies.\n\tThis dual focus - hands-on support and governance oversight means you’ll fix everyday IT issues, train colleagues, and help embed security-minded habits throughout the organisation.\n\n\nKey Responsibilities/KPI\nTypical Activities;End-User Support (50%):\n\n\n\tDiagnose & resolve hardware, software, network, and printer issues (Windows, macOS & mobile)\n\tManage user accounts, Gmail, and Google Workspace services\n\tEscalate complex incidents to Head Office while maintaining ownership until closure\n\n\nCompliance & Monitoring (30%):\n\n\n\tPerform daily/weekly checks against Group IT Policy (asset logs, patch status, AV dashboards, backup reports)\n\tRun spot audits and document findings with corrective actions\n\tEnsure new devices & apps meet security baseline before deployment\n\n\nTraining & Documentation (15%):\n\n\n\tDeliver short classroom or one-on-one sessions on safe computing, phishing awareness, and productivity tips using Google Workspace tools\n\tKeep branch “How-To” guides and knowledge-base articles current\n\n\nProject & Vendor Support (5%):\n\n\n\tAssist with roll-outs (WAN upgrades, CCTV, VoIP, ERP modules)\n\tLiaise with external vendors, verify work quality, and sign-off against SLAs\n\n\nKey Qualifications\n\n\n\tOND / HND / Degree in Computer Science, Information Technology, or related field (or recognised equivalent).\n\tMinimum 3 years of hands-on technical support in a multi-site or enterprise environment.\n\tDemonstrated track record of enforcing or adhering to information-security or IT-governance standards (ISO 27001, ITIL, or similar)\n\tWindows & macOS administration; basic Linux familiarity.\n\tNetworking fundamentals (TCP/IP, DNS, DHCP, VLANs, Wi-Fi).\n\tGoogle Workspace administration (Gmail, Drive, Docs, Sheets, Meet) including groups, shared drives, and access controls.\n\tEndpoint security tools and patch-management platforms.\n\tSoft Skills: Excellent written & spoken English; calm customer-service manner; strong documentation habits; ability to joggle priorities independently.\n\tWillingness to travel between assigned branches - typically one short trip per month - and occasionally assist neighbouring sites (company-funded).\n\tIndustry certifications (Google Workspace Administrator, or equivalent) is a PLUS\n\tExperience with help-desk ticketing systems (Jira, Freshservice, or similar) is an added advantage\n\tBasic scripting (PowerShell / Bash) for automation.\n\tFamiliarity with CCTV, VoIP, or point-of-sale hardware.\n\n\nWhat We Offer\n\n\n\tCompetitive salary + performance bonus + HMO + Pension\n\tFriendly, growth-oriented culture with clear internal promotion paths.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and a concise cover letter (max 1 page) to: careers@enviable.group using the Job Position as the subject of the email.\n\nNote\n\n\n\tOnly shortlisted candidates will be contacted. Short-listed candidates will complete a practical troubleshooting test and policy-scenario interview.\n\tEnviable Group is an equal opportunity employer. All qualified applicants will receive consideration without regard to race, religion, gender, or disability status.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Business Development Manager Job at Dev-Afrique Development Advisors",
    "link": "https://www.jobgurus.com.ng/jobs/view/business-development-manager-job-at-dev-afrique-development-advisors",
    "pubDate": "Thu, 12 Jun 2025 10:45:00 GMT",
    "source": "JobGurus",
    "keyword": "dev-afrique development advisors",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "Dev-Afrique Development Advisors is a social-impact organization of strategy and development professionals committed to solving complex challenges on the African continent. With networks across African countries, we provide high-level advisory and develop unique strategies for non-profit organizations and start-ups in emerging and frontier markets in Africa. Our expertise extends across agriculture, environment and climate change, financial inclusion, health, water sanitation and hygiene and public policy.\n\nWe are recruiting to fill the position below:\n\nJob Position: Business Development Manager\n\nJob Location: Abuja\n\nAbout the Position\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a Business Development Manager with a strong grasp of the development landscape to lead and support our firm’s growth efforts.\n\tThe ideal candidate will have demonstrable experience in identifying opportunities (RFQs, RFPs, EOIs), crafting compelling responses, and driving proposal development.\n\tYou will collaborate across internal teams and external partners to position the organization for strategic wins and long-term success.\n\n\nResponsibilities\nKey responsibilities for this position include:\nOpportunity Scouting & Pipeline Development:\n\n\n\tProactively search and track Requests for Proposals (RFPs), Requests for Quotations (RFQs), Expressions of Interest (EOIs), and other new business opportunities from bilateral/multilateral agencies and foundations.\n\tBuild and manage a robust pipeline of relevant opportunities aligned with the firm’s thematic and geographic priorities.\n\tMaintain and update a database of procurement platforms and tender trackers (e.g., Devex, UNGM, DG Market, etc.).\n\n\nProposal & Bid Development:\n\n\n\tLead end-to-end proposal development processes, including bid/no-bid decisions, timeline management, partner coordination, and submission.\n\tDraft and/or refine technical proposals, capability statements, cover letters, and past performance documentation in response to client requirements.\n\tWork with technical leads and project teams to develop winning methodologies, staffing plans, and technical narratives.\n\tPrepare budget inputs in collaboration with the finance team, ensuring competitive pricing aligned with client expectations.\n\n\nStrategic Partnerships & Relationship Management:\n\n\n\tIdentify and nurture partnerships with local and international organizations for consortium-based bidding.\n\tRepresent the firm in external networking events, partnership meetings, and strategic dialogues with potential clients and collaborators.\n\tMaintain CRM records of donors, partners, and opportunity pipelines.\n\n\nMarket Intelligence & Positioning:\n\n\n\tConduct sector scans and client mapping to identify emerging trends and align business development strategies accordingly.\n\tDevelop marketing collateral and thought leadership content to support outreach efforts.\n\n\nRequirements\n\n\n\tBachelor’s degree in international development, Business, Public Policy, Economics, or a related field; a master’s degree is preferred.\n\tMinimum 5 years of relevant experience in business development or program acquisition, preferably in a consulting, donor-funded, or professional services environment.\n\tDemonstrated track record in identifying and responding to donor-funded RFPs/RFQs/EOIs.\n\tExceptional proposal writing, project management, and communication skills.\n\tStrong knowledge of the development donor landscape (e.g., USAID, World Bank, UN agencies, BMGF, GIZ).\n\tAbility to work collaboratively in multicultural and multidisciplinary teams.\n\tProficiency in Microsoft Office Suite and BD tools.\n\n\nUseful Skills:\n\n\n\tFamiliarity with strategic consulting or advisory firms’ business models.\n\tEntrepreneurial mindset and ability to manage ambiguity in a fast-paced, mission-driven environment.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Account Officer Job at Gas Tech International Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/account-officer-job-at-gas-tech-international-limited",
    "pubDate": "Thu, 12 Jun 2025 10:45:00 GMT",
    "source": "JobGurus",
    "keyword": "gas tech international limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Gas Tech International Limited is an emerging Compressed and Natural Gas organisation situated along the Sagamu-Ore expressway in Ilisan, Ikenne local government area, Ogun State. We are looking to enhance our team with additional talent.\n\nWe are recruiting to fill the position below:\n\nJob Position: Account Officer\n\nJob Location: Ilisan, Ogun\nEmployment Type: Full-time\n\nPosition Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Account Officer is responsible for managing and monitoring all financial transactions related to gas sales at the NGV dispensing station.\n\tThe role ensures the accurate recording of daily sales, proper handling, and reporting of cash inflows, reconciliation of customer payments, and timely preparation of daily and periodic financial reports.\n\tThis position serves as a financial control point to ensure transparency, compliance, and operational efficiency.\n\n\nTasks and Activities of the Role\n\n\n\tVerify and reconcile daily cash and POS Payments from gas sales to vehicle owners\n\tEnsure prompt banking of daily cash and provide deposit slips\n\tAssist in Monthly reconciliations of NGV Point transactions with central accounts\n\tMaintain confidentiality and accuracy in financial documentation.\n\tMaintain receipts, sales documents, and related financial records in an orderly and secure manner.\n\tSupport internal and external audits with necessary documents.\n\tAny other duties as assigned by the Finance Manager.\n\n\nRequired Skills and Qualifications\n\n\n\tCandidates should possess an HND / Bachelor’s Degree in Accounting, Finance, or a related field.\n\tMinimum of 3 Years of experience in cashiering or accounting role, preferably in a retail or fuel/gas sales environment.\n\tStrong understanding of financial reporting and account reconciliation.\n\tGood communication Skills.\n\tAttention to detail.\n\tWillingness to work shifts, weekends, and public holidays as required.\n\n\nCompensation and Benefits\nWe offer a competitive compensation package, including:\n\n\n\tA competitive Salary\n\tHealth Maintenance Organisation (HMO) Plan\n\tAnnual Leave allowance\n\tStatutory Pension Contributions\n\tOpportunities for training and Growth\n\tA safe and supportive work environment.\n\n\nMethod of Application\nInterested and qualified candidates should send their Applications to: hrjobs@gastechltd.com using the Job Position as the subject of the email.\n\nNote: Only qualified candidates will be contacted.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]