[
  {
    "title": "Field Marketer Job at Jobvet Services",
    "link": "https://www.jobgurus.com.ng/jobs/view/field-marketer-job-at-jobvet-services",
    "pubDate": "Wed, 25 Jun 2025 15:43:54 GMT",
    "source": "JobGurus",
    "keyword": "jobvet services",
    "duplicate": false,
    "classifications": [],
    "content": "Jobvet Services - Our client, a Microfinance Bank, is recruiting to fill the position below:\n\nJob Position: Field Marketer\nJob Locations: Garki, Wuse, Kubwa & Nyanya, Abuja (FCT)\nEmployment Type: Full-time\n\nResponsibilities\n\n\n\tMarket and sell credit instruments (Loans) and other financial services\n\tApproach individuals and businesses to promote the bank’s products\n\tAssist customers with account opening and loan applications.\n\n\nRequirements\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tGood communication and sales skills\n\tFemale Preferred.\n\n\nMethod of Application\nInterested and qualified candidates should send their Applications to: jobvet24@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Operations Manager Job at Pruvia Integrated Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/operations-manager-job-at-pruvia-integrated-limited-2",
    "pubDate": "Wed, 25 Jun 2025 15:43:54 GMT",
    "source": "JobGurus",
    "keyword": "pruvia integrated limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Pruvia Integrated Limited is a human resources and management firm with a strong desire to ensure customer satisfaction in the midst of efficient and effective service delivery. As an organization, we are driven by the dictum of ‘Impossibility is Nothing’. Our clients represent the entire spectrum of the Commerce, Hospitality, Information technology, Media, Finance & Insurance Sector, Automobile, Oil & Gas Sector, Real Estate, Manufacturing, FMCG and Small and Medium Enterprises and Communications industries.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Operations Manager\nJob Location: Lagos\nEmployment Type: Full-time\nIndustry: Engineering, Contracting and Fabrication\n\nJob Summary\n\n\n\tWe are seeking an experienced Operations Manager to oversee and optimize our production processes, ensuring timely delivery of high-quality products that meet client expectations.\n\n\nKey Responsibilities\n\n\n\tEnsure production output meets client expectations in terms of quality, timelines, and efficiency.\n\tCoordinate material procurement, quality, and quantity to ensure smooth production operations.\n\tOptimize production resources to achieve high performance and minimize waste.\n\tContinuously monitor and improve production processes and methodologies.\n\tManage production-related projects, ensuring they are completed within budget, timeline, and quality standards.\n\tDevelop and implement operational improvement strategies, ensuring adherence to safety and compliance regulations.\n\n\nRequirements\n\n\n\tMinimum HND/B.Tech/B.Sc. in Mechanical, Metallurgical Engineering, Materials Science, Technology, or Architecture.\n\tAt least 10 years of experience in manufacturing, preferably in aluminum production or fabrication.\n\tStrong understanding of production processes, project management, and quality control standards.\n\tThe applicant must have experience in iron and steel sector.\n\n\nKey Skills & Attributes:\n\n\n\tProven leadership and team management skills.\n\tExcellent communication and problem-solving abilities.\n\tIn-depth knowledge of manufacturing processes and production systems.\n\tHigh organizational skills and attention to detail.\n\tAbility to manage multiple projects simultaneously and meet tight deadlines.\n\n\nPreferred Candidates:\n\n\n\tApplicants with experience in the aluminum fabrication sector have an added advantage.\n\n\nSalary\nSalary: N150,000 Monthly (Attractive).\n\nMethod of Application\nInterested and qualified candidates should send their Resumes and Cover Letter to: jobpruvia@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Senior Procurement Officer Job at Federal College of Education",
    "link": "https://www.jobgurus.com.ng/jobs/view/senior-procurement-officer-job-at-federal-college-of-education",
    "pubDate": "Wed, 25 Jun 2025 15:43:54 GMT",
    "source": "JobGurus",
    "keyword": "federal college of education",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance"
    ],
    "content": "The Federal College of Education, Yola was established in 1974, and occupies a land area of 155 hectares along the Jimeta-Yola Road Adamawa State. The Vision of the College is to be a leading College in Africa in the training of efficient and creative teachers, and the promotion of professionalism, research and community services.\n\nApplications are invited from suitably qualified candidates for the position below:\n\nJob Position: Senior Procurement Officer\n\nJob Location: Yola, Adamawa\nCadre: Procurement\n\nRequirements\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tCandidates should possess a good honours Degree in Marketing, Economics, Purchasing and Supply, Quantity Surveying, Project Engineering and other relevant areas.\n\tCandidates must also possess the relevant cognate work experience and demonstrate good knowledge of computer.\n\n\nGrade\nCONTEDISS 09.\n\nMethod of Application\nInterested and qualified candidates should submit five (5) copies of their applications and current Curriculum Vitae, which should include, among others, the following:\n\n\n\tFull Name (Surname Last in Capital Letters)\n\tPost applied for\n\tPlace and Date of Birth\n\tMarital Status\n\tName, Address and Phone Number of Next of Kin\n\tNumber of Children and their Ages\n\tNationality, State and Local Government of Origin\n\tContact Details (including Mobile Telephone Numbers and Email)\n\tPermanent Home Address\n\tInstitutions Attended with Dates\n\tAcademic and Professional Qualifications with dates\n\tWork Experience with Dates including full details of former and present posts\n\tPresent Employment Status and Salary\n\tList of Publications (where applicable)\n\tExtra-Curricular Activities\n\tAny other relevant information that would facilitate a positive review of your application\n\tNames and Addresses of three (3) relevant referees.\n\n\nApplications should be in a sealed envelope with the Department and position applied for clearly written at the left-hand corner (of the envelope), addressed and submitted to:\nThe Registrar,\nFederal College of Education, Yola,\nP.M.B. 2042,\nYola, Adamawa State,\nNigeria.\n\nNote: Only shortlisted candidates will be invited for an interview.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Cashier Job at Nepal Energy",
    "link": "https://www.jobgurus.com.ng/jobs/view/cashier-job-at-nepal-energy-1",
    "pubDate": "Wed, 25 Jun 2025 15:43:54 GMT",
    "source": "JobGurus",
    "keyword": "nepal energy",
    "duplicate": false,
    "classifications": [],
    "content": "Nepal Energies is a leading player in the Downstream, midstream and upstream sectors of the oil and gas industry in the country. We have branches cut across different regions in the country and across Africa.\n\nWe are recruiting to fill the position below:\n\nJob Position: Cashier \n\nJob Location: Okosodo Ughelli Road, Okuokoko - Delta\nEmployment Type: Full-time\n\nSummary\n\n\n\tAre you ready to grow your career in the fuel retail industry? Nepal Group is expanding and looking for talented professionals to join our team across multiple locations in Nigeria!\n\n\nRequirements\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tCcandidates should possess a Bachelor's Degree with 1 - 3 years of work experience\n\tCandidate must reside in Delta, Okosodoaxis\n\tCandidates must have completed NYSC.\n\n\nMethod of Application\nInterested and qualified candidates should send their resume to: careers@nepalgroupng.com using the Job Position and Location as the subject of the mail (e.g., Station Cashier – Delta Okosodo).    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]