[
  {
    "title": "Full Stack Developer Job at SterlingPRO Business Application Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/full-stack-developer-job-at-sterlingpro-business-application-limited",
    "pubDate": "Thu, 03 Jul 2025 13:49:12 GMT",
    "source": "JobGurus",
    "keyword": "sterlingpro business application limited",
    "duplicate": false,
    "classifications": [
      "Software Engineering"
    ],
    "content": "SterlingPRO Business Application Limited is a FINTECH that provides innovative, market-relevant and industrialized technology consulting solutions that drive high performance to the financial sector primarily.\n\nSterlingPRO is a global brand servicing Top Commercial Banks across Nigeria and Africa with plans to expand into other markets like U.S, Europe and Asia.\n\nWe are recruiting to fill the position below:\n\nJob Position: Full Stack Developer\n\nJob Location: Maryland, Lagos\nEmployment Type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tResearching, designing, implementing and managing software programs.\n\tTesting and evaluating new programs.\n\tIdentify areas for modification in existing programs and subsequently develop these modifications.\n\tDeveloping quality assurance procedures.\n\tDeploying software tools, processes and metrics.\n\tMaintaining and upgrading existing systems.\n\tWriting and implementing efficient code.\n\tDetermining operational practicality.\n\tTraining users.\n\tWorking closely with other developers, UX designers, business and systems analysts.\n\n\nJob Qualifications and Criteria\n\n\n\tCandidate must be a B.Sc. graduate with either of the following disciplines:\n\t\n\t\tComputer Science,\n\t\tInformation Technology\n\t\tor any other related course.\n\t\n\t\n\tCandidate must reside in Lagos; proximity to Maryland is an advantage.\n\tCandidate must not be older than 28 years as of last birthday.\n\tProven experience as a fullstack Software Developer.\n\tFamiliarity with Agile development methodologies, SOLID principles, and SDLC.\n\tKnowledge of Frontend development frameworks (Razor Pages/VUE JS/REACT JS)\n\tKnowledge of ASP.NET Core, ASP.NET MVC 5\n\tKnowledge of ASP.NET Core secure API development\n\tExperience with EFT and ISO8583 messaging is an added advantage\n\tExperience with software design patterns and architectures\n\tKnowledge of programming languages (C#, Java, JavaScript)\n\tKnowledge of Mobile applications development is an added advantage\n\tExperience with databases (MSSQL, Postgres) and Object-Relational Mapping (ORM) frameworks (Entity Framework, Entity framework core)\n\tAbility to learn new languages and technologies.\n\tExcellent communication skills.\n\tResourcefulness and troubleshooting aptitude.\n\tAttention to detail.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hr@sterlingprong.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Front Office Executive (Cum Sales) Job at Infinity Tyres Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/front-office-executive-cum-sales-job-at-infinity-tyres-limited",
    "pubDate": "Thu, 03 Jul 2025 13:49:12 GMT",
    "source": "JobGurus",
    "keyword": "infinity tyres limited",
    "duplicate": false,
    "classifications": [],
    "content": "Infinty Tyres Limted is knows for Tyres Business and other related business from last 40 years. Founded 40 years ago, Infinity Group has established itself as the most preferred company for automotive aftermarket products in Nigeria. The group has expanded its footprint into Ghana and has taken a leadership position in the west African region, for tyres, batteries, lubricants, spare parts and coolants. The group services its customers through vast network of retail sales & service centers across Nigeria & Ghana.\n\nWe are recruiting to fill the position below:\n\nJob Position: Front Office Executive (Cum Sales)\n\nJob Location: Akin Adesola, Victoria Island - Lagos\nEmployment Type: Full-time\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nResponsibilties\n\n\n\tGreet and welcome customers with professionalism and a friendly demeanor.\n\tAnswer customer inquiries and provide information on products, services, and pricing.\n\tHandle customer complaints or concerns, ensuring timely resolution.\n\tRecommend tyres, batteries, lubricants, or other products based on customer needs.\n\tAssist customers in selecting products and services that meet their requirements.\n\tMaintain accurate customer records, warranty registrations, and transaction details in the CRM system.\n\tEnsure proper documentation of customer interactions, sales, and inventory.\n\tProcess and maintain daily, weekly, and monthly reports of sales and out inventory issue invoices and billing.\n\n\nQualifications\n\n\n\tInterested candidates should possess an HND / OND / Bachelor's Degree with 2 - 5 years of work experience.\n\tMust have strong analytical and sales experience\n\tMust be good in excel, ERP and other sales software.\n\tShould have a good managerial skills\n\tCandidates that stays within the preferred location Victoria island or its environment will be considered.\n\n\nSalary\nN120,000 - N125,000 monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: infinitytyreslimited@gmail.com using the Job Position as the subject of the mail.\n\nNote: For Inquiries, send a WhatsApp message to: +234 805 509 2172.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Operational Risk Officer Job at Unified Payment Services Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/operational-risk-officer-job-at-unified-payment-services-limited",
    "pubDate": "Thu, 03 Jul 2025 13:49:12 GMT",
    "source": "JobGurus",
    "keyword": "unified payment services limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Unified Payment Services Limited is Nigeria’s premier Payments & Financial Technology company that operates as a shared infrastructure for the banking community in Nigeria and Payments Service Provider within and outside Nigeria, with a vision to be the most preferred e-payment service provider in Africa.\n\nWe are recruiting to fill the position below:\n\nJob Position: Operational Risk Officer\n\nJob Location: Victoria Island, Lagos\nEmployment Type: Full-time\n\nJob Objectives (s)\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tTo be able to promptly identify, measure, monitor, manage, minimize and report risks that may impact negatively on the achievement of our business objectives in line with the enterprise risk tolerance and business strategy.\n\tCarry out unit-specific risk and control self-assessments, risk mapping, prevention of fraud, implementation of mitigation measures, business continuity and process improvement.\n\n\nDuties & Responsibilities\n\n\n\tOperational risk assessment of all departments within the enterprise and the company subsidiaries.\n\tInternal control to ensure operational effectiveness and efficiency.\n\tRisk advisement for various departments as per new products, implementation, change requests and system integration with UP to mitigate operational, reputational, strategic and regulatory risk.\n\tPreparation of Operational Risk report to Senior Management.\n\tWork closely with other depts. within the organization to investigate and resolve alleged fraudulent incidences. Escalate issues with potential for negative industry and/or corporate exposure.\n\tSpecial investigation and review for suspicious scheme transactions.\n\n\nJob Requirements\n\n\n\tEducation: BSc Degree in Finance, Economics, Computer Science, Social Sciences, Engineering, Business Administration, Information Technology or related fields.\n\tOthers: Strong experience in Operational risk assessment, analysis of business metrics and formulation of Key Risk Indicators.\n\tExperience: 4 - 6 years of experience.\n\n\nKey Competency Requirements:\n\n\n\tKnowledge: Knowledge of Microsoft office packages such as Word, Excel and Powerpoint Relevant Risk Management qualification (E.g. Certified Fraud Examiner – CFE, Certified Operational Risk Manager - CORM, Certified Information System Audit- CISA, Certified Risk Manager – CRM, Professional Risk Manager – PRM, etc.) will serve as added advantage.\n\n\nMethod of Application\nInterested and qualified candidates should send their resumes to: recruitment@up-ng.com or iyanuoluwa.fakorede@up-ng.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Social Media & Digital Marketing Officer Job at ValueJet",
    "link": "https://www.jobgurus.com.ng/jobs/view/social-media-digital-marketing-officer-job-at-valuejet",
    "pubDate": "Thu, 03 Jul 2025 13:49:12 GMT",
    "source": "JobGurus",
    "keyword": "valuejet",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "ValueJet was founded as an airline in 2018. Our vision is to be a global airline connecting people and places using modern air travel, enabled by professional workforce. We offer an end-to-end customer experience backed by up-to-date technology. We are a team of dedicated and passionate people who are committed to providing the best service to our customers. We operate to and from the following cities: Lagos, Abuja, Port Harcourt, Yola, Benin, Asaba, Kano & Jos. We also offer charter services.\n\nWe are recruiting to fill the position below:\n\nJob Position: Social Media & Digital Marketing Officer\n\nJob Location: Lagos\nEmployment: Permanent\n\nAbout the Job\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAre you passionate about crafting compelling content and growing digital communities? ValueJet is looking for someone bold, creative, and data-savvy to lead the charge across our digital platforms.\n\n\nResponsibilities\n\n\n\tCraft authentic stories that connect with our global audience\n\tRunning high-impact digital campaigns that drive results\n\tTurning insights and analytics into smarter strategies\n\n\nWho You Are\n\n\n\tA growth-focused creative with a knack for storytelling, a collaborative mindset, and a deep understanding of digital culture.\n\tYou’re not afraid to try, test, and optimize bringing ideas to life with the right mix of vision and execution.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Admin / Human Resource Manager Job at Nalis Pharmaceuticals Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/admin-human-resource-manager-job-at-nalis-pharmaceuticals-limited",
    "pubDate": "Thu, 03 Jul 2025 13:49:12 GMT",
    "source": "JobGurus",
    "keyword": "nalis pharmaceuticals limited",
    "duplicate": false,
    "classifications": [],
    "content": "Nalis Pharmaceuticals Limited is a Nigerian private limited liability company, founded in 2010 and incorporated by the Corporate Affairs Commission (CAC) in 2011.\n\nNalis began its journey as an importer and distributor of pharmaceutical products, building a strong reputation for reliability and market responsiveness. A major inflection point occurred in 2015, when a federal supply contract for anti-malaria drugs—previously awarded to the company—was discontinued following the inauguration of a new administration. Rather than retreat, Nalis strategically pivoted from distribution to local manufacturing, marking the beginning of a new growth phase.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Admin / Human Resource Manager\nJob  Location: Owerri, Imo\nDepartment: Human Resources and Administration\nReports To: General Manager\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tThe HR/Admin Manager is responsible for overseeing and coordinating the company's human resources and administrative functions.\n\tThis role involves developing and assisting inimplementing HR strategies, managing employee relations, and ensuring compliance with company policies.\n\tAdditionally, the HR/Admin Manager will lead and drive Contract Manufacturing Services and manage the Quality Management System (QMS) to support the company's operational and quality objectives.\n\n\nKey Responsibilities\nHuman Resources Management:\nRecruitment and Staffing:\n\n\n\tDevelop and implement effective recruitment strategies to attract, hire, and retain top talent.\n\tCoordinate the end-to-end recruitment process, including job postings, screening, interviewing, and selection.\n\tCollaborate with department heads to identify staffing needs and develop job descriptions.\n\n\nOnboarding and Training:\n\n\n\tDesign and implement onboarding programs to integrate new employees effectively.\n\tFacilitate training and development programs to enhance employee skills and productivity.\n\tMonitor the effectiveness of training programs and recommend improvements.\n\n\nPerformance Management:\n\n\n\tImplement a structured performance management system, including performance appraisals, goal setting, and feedback.\n\tSupport managers in addressing performance issues and developing performance improvement plans.\n\tIdentify and nurture high-potential employees for career development and succession planning.\n\n\nEmployee Relations:\n\n\n\tAddress employee grievances promptly and fairly while maintaining confidentiality.\n\tPromote a positive and inclusive work environment through team-building activities and communication.\n\tDevelop and implement employee engagement initiatives to improve morale and retention.\n\n\nCompensation and Benefits:\n\n\n\tAdminister payroll and manage employee compensation in compliance with company policies.\n\tEvaluate and update employee benefits programs to remain competitive in the industry.\n\tOversee leave management, timekeeping, and attendance systems.\n\n\nCompliance and Policy Management:\n\n\n\tEnsure compliance with labor laws, health and safety regulations, and company policies.\n\tDevelop, update, and communicate HR policies, procedures, and employee handbooks.\n\tConduct regular audits to ensure HR practices are legally compliant and effective.\n\n\nAdministrative Management:\n\n\n\tSupervise the administrative team to ensure efficient office operations.\n\tManage company records, correspondence, and documentation.\n\tCoordinate logistics for meetings, events, and official company activities.\n\tOversee office facilities, including maintenance and procurement of office supplies.\n\n\nContract Manufacturing Services:\n\n\n\tIdentify and engage with potential contract manufacturing partners to expand production capabilities.\n\tNegotiate contract terms and agreements, ensuring compliance with industry standards and company policies.\n\tCoordinate and monitor contract manufacturing activities to meet production targets, quality standards, and timelines.\n\tDevelop strategies to optimize contract manufacturing processes and improve cost-efficiency.\n\n\nQuality Management System (QMS):\n\n\n\tImplement and maintain a robust Quality Management System (QMS) to ensure compliance with regulatory standards.\n\tMonitor and evaluate QMS performance through audits, inspections, and corrective actions.\n\tDevelop and update standard operating procedures (SOPs) related to quality and compliance.\n\tTrain staff on QMS protocols, quality standards, and compliance requirements.\n\tCoordinate with regulatory agencies and ensure timely certification and approvals.\n\n\nQualifications\n\n\n\tBachelor's degree in Human Resources Management, Business Administration, or a related field.\n\tMinimum of 5 years of experience in HR management and administration.\n\tExperience in contract manufacturing and QMS implementation is an advantage.\n\tStrong knowledge of labor laws, HR practices, and quality management standards.\n\tExcellent leadership, communication, and interpersonal skills.\n\tAbility to handle multiple tasks, prioritize, and manage time effectively.\n\tProficiency in HR management software and Microsoft Office Suite.\n\n\nCompetencies:\n\n\n\tStrategic Thinking\n\tNegotiation and Conflict Resolution\n\tProblem-Solving Skills\n\tStrong Organizational Skills\n\tAttention to Detail\n\tAdaptability and Flexibility\n\tTeam Leadership and Development\n\n\nSalary\nN100,000 - N200,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their updated CV / Resume (PDF or Word format) and Cover Letter addressed to \"The HR Manager\" via: chinnweikem.chinonye@nalispharma.com using the Job Position as the subject of the mail.\n\nNote: For more inquiries, call 09051100376 for more details    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]