[
  {
    "title": "Logistics Manager Job at LD&D Consulting",
    "link": "https://www.jobgurus.com.ng/jobs/view/logistics-manager-job-at-ldd-consulting",
    "pubDate": "Thu, 19 Jun 2025 18:47:40 GMT",
    "source": "JobGurus",
    "keyword": "ld&d consulting",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "LD&D Consulting is a project management consulting firm that specialises in turning key projects into success by working collaboratively with clients and key stakeholders. Our specialist project management team consists of seasoned consultants across various industries. We offer project management consulting, recruiting, Training and Development, HR outsourcing, and payroll services across various industries, including Telecoms, IT, Construction, Transportation, Energy, Sports, Environmental and Health care, Banking & Finance, Services, and Consulting in both private and public sectors.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe provide the best candidates for your recruiting needs by leveraging 25 years of experience working in various industries and closely working with you to understand your requirements.\n\nWe are recruiting to fill the position below:\n\nJob Position: Logistics Manager\n\nJob Location: Ajah, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe are hiring a Logistics Manager to oversee and manage all logistics operations, including coordinating deliveries, tracking finished product movements, and managing transportation activities. The ideal candidate should have prior experience in logistics and a hands-on approach to operational management.\n\n\nKey Responsibilities\n\n\n\tPlan, organize, and manage the movement and distribution of finished furniture products.\n\tCoordinate with drivers and delivery teams to ensure timely deliveries.\n\tTrack logistics activities and maintain accurate records of deliveries and inventory movements.\n\tCollaborate with other departments to align logistics operations with production schedules.\n\tTroubleshoot and resolve any logistical issues as they arise.\n\n\nRequirements\n\n\n\tCandidates should possess a Bachelor's Degree with 2-5 years of experience in logistics operations in the Furniture Manufacturing Industry.\n\tStrong organizational and coordination skills.\n\tAbility to work independently and manage multiple tasks efficiently.\n\tGood communication and interpersonal skills.\n\n\nSalary and Benefti\n\n\n\tN150,000 / Month.\n\tAccommodation: Available (optional)\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: precious@ldd-consulting.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Senior iOS Engineer Job at Carbon Nigeria",
    "link": "https://www.jobgurus.com.ng/jobs/view/senior-ios-engineer-job-at-carbon-nigeria-1",
    "pubDate": "Thu, 19 Jun 2025 18:47:40 GMT",
    "source": "JobGurus",
    "keyword": "carbon nigeria",
    "duplicate": false,
    "classifications": [
      "Software Engineering",
      "Finance"
    ],
    "content": "Carbon is a pan-African digital bank with a mission to provide friction-free finance to its customers. Carbon promises to play a fundamental role in its customers’ lives wherever they are, with flexible solutions. We pride ourselves on our efficiency and with just $10mm of equity raised in 2015, we have disbursed over $100m in loans and earned more than $30mm in revenue over the last 2 years. Carbon has operations in Ghana, Kenya, and Nigeria, supported by a talented team spread between Lagos, Nairobi, London, Argentina, and Palo Alto so we operate with a remote-first mindset. \n\nWe are recruiting to fill the position below:\n\nJob Position: Senior iOS Engineer\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Location: Lagos\nEmployment Type: Full Time\n\nAbout the Role\n\n\n\tWe are looking for a dedicated and ambitious Senior iOS Developer to join our team.\n\tThis is an excellent opportunity to acquire significant experience.\n\n\nResponsibilities\n\n\n\tEnsure that the strategic direction of the company’s mobile applications is aligned to deliver robust, secure, and efficient user experiences. \n\tDesign iOS applications across all Apple devices, creating technical designs and guidance for developers throughout the development lifecycle. \n\tEstablish and enforce best practices for iOS development, including design patterns, code reviews, and developer training. \n\tCollaborate closely with the Quality Assurance team to proactively identify, address, and resolve any issues.\n\tBuild beautiful, smooth, delightful mobile experiences.\n\n\nRequirements\n\n\n\tBS / MS Degree in Computer Science, Engineering, or a related subject. \n\tExperience building native apps in iOS using Swift (mandatory).  \n\tDemonstrate strong analytical and problem-solving skills. \n\tAt least 4 years of software development experience and iOS development skills. \n\tMust have published multiple original iOS apps to the App Store.\n\tExperience with iOS design patterns and Firebase SDKs.\n\tExperience and a strong understanding of APIs and remote data via REST and JSON. \n\tFast-paced and able to work to deadlines.\n\tExperience working with Unit / UI test frameworks\n\tWork knowledge of the general mobile landscape, architectures, trends, and emerging technologies. \n\tSolid understanding of the full software development life cycle. \n\tExperience using AI productivity tools.\n\tRole is hybrid and should be ready to be in the office twice a week.\n\n\nThe following are optional but will enhance your chances of being selected \n\n\n\tKnowledge of at least one backend programming language \n\tAbility to work with UX prototyping tools like Figma, Adobe XD, InvisionApp, etc \n\tKnowledge of GIT. \n\tTest-Driven Development, Continuous Integration, and/or other automated testing skills. \n\tOverall software development experience of 5+ years.\n\tAgile Development experience. \n\tPrior experience working with financial applications \n\tExperience with Swift UI, Combine, or RxSwift.\n\n\nBenefits\n\n\n\tA great and upbeat work environment populated by a multinational team.\n\tHealth Insurance\n\tLife Insurance\n\tCareer Development & Growth.\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Openings at the Place - Smackers Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-the-place-smackers-limited-1",
    "pubDate": "Thu, 19 Jun 2025 18:47:40 GMT",
    "source": "JobGurus",
    "keyword": "the place - smackers limited",
    "duplicate": false,
    "classifications": [],
    "content": "The Place - We are a fast growing, world class, and dynamic, multi-billion Nigerian conglomerates, established and managed by a team of professionals with decades of management consulting and accounting experience/ training from Arthur Andersen (now KPMG in Nigeria). We are a profitable player in the QSR sector of the Hospitality industry in Nigeria with great prospects and staff strength of over 1000 employees. Currently, our operations span across 17 locations in Lagos and Abuja, Nigeria, with rapid expansion plans to penetrate more locations in the short to medium term.\n\nWe are recruiting to fill the following positions below:\n\n1.) IT Officer\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Location: Abuja (FCT)\nEmployment Type: Full-time \n\nJob Description\n\n\n\tTroubleshooting and maintaining wireless and ethernet network systems and  providing rapid solutions.\n\t Installing and administering application servers, laptops and PCs, including operating systems.\n\tTroubleshooting and managing User outlook issues.\n\tCollaborating with internal stakeholders in planning, administration, and execution of projects, processes, issue resolution, and procedures.\n\tMonitoring and maintaining computer systems and networks.\n\tManaging installations, upgrades and configurations of hardware and software\n\tAssessing system (laptops, desktops, servers etc.) performance and recommending improvements where necessary.\n\tSupporting any ERP or business application\n\tProviding technical/user support across the company\n\tProviding timely and accurate customer feedback.\n\tSupporting and testing the roll-out of new technologies, applications and/or features\n\n\nQualifications\n\n\n\tNational Diploma in computer science or related field\n\t1 to 2 years of experience\n\tKnowledge of Microsoft Navision is a plus.\n\n\nPersonalities:\n\n\n\tLogical thought process\n\tAbility to stick to strict deadlines\n\tAbility to work well with people\n\tExcellent organizational skills\n\tWillingness to sometimes work unsociable hours\n\tEnthusiasm for continual learning\n\n\nApplication Closing Date: 3rd July, 2025.\n\nClick here to apply online\n\n \n\n \n\n2.) Storekeeper - Trainee\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Description\n\n\n\tThe Storekeeper - Trainee is primarily responsible for receiving, dating, and storing, and maintaining rotation of goods.\n\tThey pull requisitions, decant, palletize, and retrieve products, equipment, uniforms, etc. and deliver to units as required.\n\n\nQualifications\n\n\n\tMinimum of SSCE and WAEC. Maximum of OND.\n\tPrior experience in retail, preferably in a Store management position, would be advantageous.\n\tMust be organized and punctual.\n\tWell-presented and professional.\n\tExcellent verbal and written communication skills.\n\tProficient in Microsoft Office.\n\n\nApplication Closing Date: 24th June, 2025.\n\nClick here to apply online\n\n \n\n \n\n3.) Maintenance Technician\n\nJob Location: Kubwa, Abuja (FCT)\nEmployment Type: Full-time\n\nJob Description\n\n\n\tConduct daily routine inspection of facilities to drive the proactive identification of potential faults and stop them before failure;\n\tIdentify or receive faults and analyse to identify root cause and resolve;\n\tEscalate issues to supervisor as required;\n\tEnsure issues are properly logged and closed according to company’s policy;\n\tCarry out and also ensure proper preventive/proactive maintenance on facilities as detailed in manuals;\n\tKeep equipment and facilities in assigned location clean and in top form always;\n\tMonitor usage of equipment to prevent mishandling;\n\tHelp drive the energy saving initiatives of the company and ensure achievement of reduction of energy consumption and cost;\n\tFollow up escalated issues to closure;\n\tEnsure timely preparation and submission of daily reports;\n\tEnsure proper handover of issues during shift change;\n\tComplete Spare Requisition Form and Job Completion Form and obtain all required sign-off;\n\tComplete Equipment History Card at the resolution and closure of issues on the equipment;\n\tProvide feedback on Vendor/service providers as required to help in their evaluation;\n\tBuild expertise in assigned areas and on assigned equipment;\n\tPropose/suggest ideas and recommendation on operations, equipment, preventive maintenance and spares management;\n\tTraining and developing self;\n\tContribute actively at team meetings and departmental initiatives;\n\tTest and confirm quality of diesel and sign off before reception\n\n\nQualifications\n\n\n\tMinimum of 1 year of experience\n\tOND and HND holders are eligible to apply\n\tMust be computer literate\n\tMust be residing in Kubwa, Abuja.\n\n\nCompensation\n\n\n\tHealth plan\n\tPension\n\t13th Month bonus\n\tFree Lunch.\n\n\nClick here to apply online\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]