[
  {
    "title": "Job Vacancies at Westfield Consulting",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancies-at-westfield-consulting-1",
    "pubDate": "Wed, 07 Jan 2026 10:19:53 GMT",
    "source": "JobGurus",
    "keyword": "westfield consulting",
    "duplicate": false,
    "classifications": [],
    "content": "Westfield Consulting was founded in January 2012, by a team of Nigerians with over 45 years of cumulative work experience in management and consultancy. Westfield Consulting is a provider of Human Resource and Strategic Management Services.\n\nOur focus on innovation and excellence in service delivery has made us a first choice to our growing clientele in various sectors. We have successfully achieved a positive work force attitude, while engineering a more motivated and committed workforce for our clients with notable results Our results provide a testament about the quality of our services. 70% of our business is repeat business.\n\nWe are recruiting to fill the following positions below:\n\n1.) Shift Supervisor\n     \n\n            \n    \n\n\n\nJob Location: Mowe, Ogun\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tOversee and manage specific production lines during assigned shifts, ensuring efficient operations, quality control, and environmental compliance.\n\tSupervise line staff, maintain equipment, and implement safety and environmental protocols.\n\n\nKey Responsibilities\nLine Operations:\n\n\n\tManage production lines to meet quality and production targets.\n\tSupervise and train line staff to achieve production goals.\n\tMonitor and optimize production processes to minimize waste and reduce costs.\n\n\nEnvironmental:\n\n\n\tImplement and maintain environmental management systems (EMS) and procedures on the production line.\n\tMonitor and reduce waste, emissions, and energy consumption on the line.\n\tConduct regular environmental inspections and audits on the line.\n\tRespond to and investigate environmental incidents on the line.\n\n\nSafety:\n\n\n\tEnsure a safe working environment on the production line.\n\tEnforce safety protocols and conduct regular safety inspections.\n\tInvestigate and address safety incidents on the line.\n\n\nMaintenance:\n\n\n\tMonitor maintenance of production line equipment.\n\tSchedule and coordinate maintenance activities with the maintenance team.\n\tEnsure timely repair and replacement of equipment.\n\n\nQuality:\n\n\n\tEnsure quality control measures are in place and effective on the production line.\n\tMonitor and address quality issues on the line.\n\n\nCommunication:\n\n\n\tCommunicate with other shifts, management, and departments.\n\tProvide shift reports and performance updates.\n\n\nKey Requirements\n\n\n\tBSc / B.Engr. / HND\n\tMinimum of 7 years of experience in the Manufacturing Industry.\n\tStrong recycling experience\n\tAbility to work with little or no Supervision\n\tA dynamic and astute goal-getter.\n\n\nSalary\nN215,000 – N350,000 per month (Gross Salary).\n\nMethod of Application \nInterested and qualified candidates should send their CV to: cvs@westfield-consulting.com with victor.allu@westfield-consulting.com in copy using the Job Position as the subject of the email.\n\nNote: Only shortlisted candidates will be contacted.\n\n \n\n2.) Technical / Maintenance Manager\n\nJob Location: Mowe, Ogun \nEmployment Type: Full-time\n\nKey Responsibilities\n\n\n\tOverall understanding of requirements for the Maintenance of equipment\n\tAbility to coordinate and understand the design requirements of the equipment\n\tCompliance with the proactive maintenance schedule set by management & OEM, and management of our main and auxiliary equipment. (proactive, preventive, corrective)\n\tEstablish and comply with the preventive maintenance schedule set by management & OEM\n\tAdherence to the maintenance budget\n\tReport maintenance-related issues.\n\n\nKey Requirements\n\n\n\tB.Eng. / HND qualification\n\tMinimum of 10 years of experience in the Manufacturing Industry.\n\tRecycling plant experience\n\tStrong experience in Mechanical Engineering and as well dabble into Electrical aspect of maintenance\n\tAbility to work with little or no Supervision\n\tA dynamic and astute goal-getter.\n\n\nSalary\nN700,000 – N900,000 per month (Gross Salary).\n\nMethod of Application \nInterested and qualified candidates should send their CV to: cvs@westfield-consulting.com with victor.allu@westfield-consulting.com in copy using the Job Position as the subject of the email.\n\nNote: Only shortlisted candidates will be contacted.\n\n \n\n \n\n3.) Mechanical Engineer\n\nJob Location:  Mowe, Ogun\nEmployment Type: Full-time\n\nKey Responsibilities\n\n\n\tCarry out daily routine maintenance checks and log recording\n\tBasic mechanical installation, maintenance & repair\n\tCarry out scheduled preventive maintenance\n\tSetting and adjusting industrial machine blades.\n\tInstallation, maintenance, and repair of the mechanical system\n\tCollaborate with team members to identify and solve complex engineering problems.\n\tReview machine performance and take necessary actions where appropriate.\n\n\nKey Requirements\n\n\n\tB.Engr. / HND / OND / Trade Test\n\tMinimum of 4 years of experience in the Manufacturing Industry.\n\tStrong knowledge of trouble shooting and problem solving\n\tA dynamic and astute goal-getter.\n\n\nSalary\nN154,000 – N400,000 per month (Gross Salary).\n\nMethod of Application \nInterested and qualified candidates should send their CV to: cvs@westfield-consulting.com with victor.allu@westfield-consulting.com in copy using the Job Position as the subject of the email.\n\nNote: Only shortlisted candidates will be contacted.    \n\n    \n\n        Click here to Apply",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Openings at Uleval Technology",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-uleval-technology-1",
    "pubDate": "Wed, 07 Jan 2026 10:19:53 GMT",
    "source": "JobGurus",
    "keyword": "uleval technology",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Uleval Technology is an indigenous tech company specialized in Web design and creation, App development and maintenance, content creation, video production and editing. We also train on web design, graphics, social media management, content production, video coverage and editing.\n\nWe are recruiting to fill the following positions below:\n\n1.) Social Media & Digital Marketing Executive\n\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\n\nDescription\n     \n\n            \n    \n\n\n\n\n\tWe are seeking a creative, data-driven, and sales-oriented Social Media & Digital Marketing Executive to manage and grow our media company’s online presence across multiple platforms.\n\tThis role is responsible for building brand visibility, driving audience engagement, and converting followers into customers through the sale of merchandise and digital/physical products using platforms such as TikTok, Facebook, Instagram, X (Twitter), and YouTube.\n\tThe ideal candidate understands content creation, social commerce, paid ads, analytics, and community building, and can translate online engagement into measurable revenue.\n\n\nKey Responsibilities\nSocial Media Management & Growth:\n\n\n\tManage daily operations of all social media platforms (TikTok, Facebook, Instagram, X, YouTube, etc.)\n\tDevelop and execute monthly social media content calendars aligned with brand goals\n\tGrow followers, reach, impressions, and engagement organically and through paid campaigns\n\tMonitor trends, hashtags, viral content, and platform updates to stay ahead\n\n\nContent Creation & Creative Direction:\n\n\n\tCreate engaging, high-quality content including:\n\t\n\t\tShort-form videos (Reels, TikTok, Shorts)\n\t\tGraphics, memes, carousels, and motion posts\n\t\tProduct-focused content and promotional creatives\n\t\n\t\n\tCollaborate with designers, videographers, and editors where necessary\n\tWrite compelling captions, hooks, CTAs, and storylines tailored to each platform\n\tEnsure brand voice, tone, and visual identity are consistently applied\n\n\nSocial Commerce & Product Sales:\n\n\n\t\n\tDrive sales of merchandise and products directly via:\n\n\t\n\t\tTikTok Shop\n\t\tFacebook & Instagram Shops\n\t\tDirect messages and social funnels\n\t\n\t\n\tPlan and execute product launch campaigns, flash sales, and promotions\n\tWork closely with inventory and fulfillment teams to ensure smooth order processing\n\tTrack conversions, revenue, and customer behavior from social channels.\n\n\nPaid Advertising & Campaign Management:\n\n\n\t\n\tPlan, launch, and optimize paid ad campaigns on:\n\n\t\n\t\tFacebook & Instagram Ads\n\t\tTikTok Ads\n\t\n\t\n\tDefine campaign objectives (awareness, engagement, conversions, retargeting)\n\tMonitor ad performance and optimize creatives, copy, and targeting\n\tManage ad budgets and ensure maximum ROI\n\n\nCommunity Management & Brand Engagement:\n\n\n\tRespond to comments, DMs, and inquiries in a timely and professional manner\n\tBuild and nurture an active online community\n\tHandle feedback, reviews, and customer concerns effectively\n\tEngage influencers, creators, and brand ambassadors when needed\n\n\nAnalytics, Reporting & Optimization:\n\n\n\tTrack performance metrics such as:\n\t\n\t\tEngagement rate\n\t\tFollower growth\n\t\tReach and impressions\n\t\tSales and conversion metrics\n\t\n\t\n\tPrepare weekly and monthly performance reports\n\tUse insights to improve content strategy and sales outcomes.\n\n\nKey Performance Indicators (KPIs)\n\n\n\tGrowth in followers and engagement\n\tRevenue generated from social media sales\n\tCampaign performance and ROI\n\tContent consistency and quality\n\tCommunity response time and satisfaction.\n\n\nRequired Skills & Qualifications\nExperience & Education:\n\n\n\tInterested candidates should possess a Bachelor`s Degree\n\t2–5 years experience in social media or digital marketing (preferred)\n\tExperience in media, entertainment, fashion, or e-commerce is an added advantage\n\tRelevant certifications in digital marketing or social media are a plus\n\n\nCore Skills:\n\n\n\tProven experience managing social media for a brand or media company\n\tStrong understanding of TikTok, Facebook, Instagram, and social commerce tools\n\tContent creation skills (video, graphics, copywriting)\n\tBasic graphic design and video editing skills (Canva, CapCut, Adobe, etc.)\n\tKnowledge of paid ads and digital marketing funnels.\n\n\nTechnical & Marketing Skills:\n\n\n\tExperience with TikTok Shop, Meta Commerce, or similar platforms\n\tFamiliarity with analytics tools (Meta Insights, TikTok Analytics, Google Analytics)\n\tUnderstanding of influencer marketing and collaborations\n\tAbility to convert engagement into sales.\n\n\nSoft Skills:\n\n\n\tCreative and trend-aware\n\tResults-driven and sales-focused\n\tStrong communication and storytelling skills\n\tAbility to work independently and meet deadlines\n\tStrong attention to detail.\n\n\nApplication Closing Date: 20th January, 2026.\n\nMethod of Application \nInterested and qualified candidates should send their application to: jobs@uleval.com using the Job Position as the subject of the mail.\n\nNote: This is not a job for freelancers.\n\n \n\n \n\n2.) Waiter / Waitress\n\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\n\nDescription\n\n\n\tYour job involves greeting guests, presenting menus, taking food/drink orders, serving meals, ensuring customer satisfaction, and processing payments, acting as the main link between diners and kitchen staff for a smooth dining experience, requiring skills like endurance, communication, and professionalism to handle various tasks and customer needs.\n\tDuties extend to recommending specials, managing table cleanliness, and resolving complaints, with specific tasks varying from casual to fine dining.\n\n\nKey Responsibilities\n\n\n\tGuest Interaction: Welcome guests, seat them, present menus, answer questions, and provide recommendations.\n\tOrder Management: Accurately take and enter orders into POS systems, communicate with kitchen/bar staff.\n\tService Delivery: Serve food and drinks efficiently, ensuring timely delivery and attentive service.\n\tTable Maintenance: Clear tables, restock supplies, and keep the dining area clean and organized.\n\tPayment Handling: Prepare bills, process payments, and manage transactions accurately.\n\tCustomer Satisfaction: Check in with diners, address concerns, handle complaints, and ensure a positive experience.\n\n\nEssential Skills & Qualities\n\n\n\tCustomer Service: Friendly, attentive, and patient.\n\tCommunication: Clear communication with guests and staff.\n\tMultitasking: Handle multiple tables and requests efficiently.\n\tPhysical Stamina: Ability to stand and walk for long periods.\n\tProblem-Solving: Resolve issues calmly and effectively.\n\tCoordination: Carry trays and plates without dropping items.\n\n\nApplication Closing Date: 21st January, 2026.\n\nMethod of Application \nInterested and qualified candidates should send their CV to: jobs@uleval.com using the Job Position as the subject of the mail.\n\n \n\n3.) Housekeeper\n\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\n\nDescription\n\n\n\tYour job involves maintaining cleanliness and order in the hotel through tasks like dusting, vacuuming, mopping, sanitizing, making beds, managing laundry, and restocking supplies, requiring attention to detail, physical stamina, and reliability to create a sanitary and pleasant environment.\n\tKey duties include general cleaning, handling trash, reporting maintenance issues, and sometimes errands or cooking, while essential requirements are often experience, time management, and physical ability to lift and stand for long periods\n\n\nKey Responsibilities\n\n\n\tCleaning & Sanitizing: Dusting, sweeping, mopping, vacuuming, disinfecting surfaces, cleaning kitchens, bathrooms, and common areas.\n\tBedding & Linens: Making beds, changing linens, and managing laundry.\n\tSupplies Management: Replenishing toiletries, towels, and cleaning supplies.\n\tWaste Management: Collecting and disposing of trash and recycling.\n\tMaintenance Reporting: Identifying and reporting needed repairs or damages.\n\tSpecial Tasks (Private Homes): May include cooking, running errands, or organizing.\n\n\nEssential Skills & Qualifications\n\n\n\tExperience: Previous cleaning or housekeeping experience.\n\tAttention to Detail: A keen eye for cleanliness and order.\n\tPhysical Stamina: Ability to lift, bend, and stay active.\n\tTime Management: Efficiently managing tasks and time.\n\tIndependence: Ability to work unsupervised.\n\tCommunication: Good communication and ability to follow instructions.\n\tProfessionalism: Maintaining a positive attitude and respecting privacy (especially in private residences).\n\n\nApplication Closing Date: 20th January, 2026.\n\nMethod of Application \nInterested and qualified candidates should send their application to: jobs@uleval.com using the Job Position as the subject of the mail.\n\n     \n\n    \n\n        Click here to Apply",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Vacancies at MacTay Consulting",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancies-at-mactay-consulting-3",
    "pubDate": "Wed, 07 Jan 2026 10:19:53 GMT",
    "source": "JobGurus",
    "keyword": "mactay consulting",
    "duplicate": false,
    "classifications": [],
    "content": "MacTay Consulting is one of the first and leading management consulting firms in Nigeria, providing HR services to our clients in Africa since 1982. We focus on adding value to organisations through customized solutions that meet our clients’ needs. We have a proven track record of providing excellent services that impact our clients’ businesses.\n\nWe are recruiting to fill the following positions below:\n\n1.) Bible Teacher (Children’s Ministry)\n\nJob Location: Ikoyi, Lagos\nEmployment Type: Part-Time (Twice Monthly)\n\nJob Summary\n     \n\n            \n    \n\n\n\n\n\tWe are seeking a dedicated and passionate Bible Teacher to teach children twice a month. The ideal candidate will be responsible for delivering engaging, age-appropriate Bible lessons and helping children develop strong Christian values in a fun and interactive learning environment.\n\n\nKey Responsibilities\n\n\n\tTeach Bible lessons to children twice a month in an engaging, relatable, and age-appropriate manner.\n\tPrepare lesson plans, activities, and materials ahead of each session.\n\tCommunicate biblical principles clearly and creatively to young learners.\n\tFoster a safe, welcoming, and nurturing classroom environment.\n\tCollaborate with church/children’s ministry leadership on curriculum planning when needed.\n\tMaintain proper discipline and ensure the safety of all children during classes.\n\tProvide feedback to parents or leadership when required.\n\n\nRequirements\n\n\n\tStrong knowledge of the Bible and Christian teachings.\n\tPrevious experience teaching or working with children is an advantage.\n\tExcellent communication and storytelling skills.\n\tCreativity and ability to engage young learners.\n\tMust be punctual, reliable, and committed to scheduled teaching days.\n\tResides in or can easily commute to Ikoyi.\n\n\nSalary\nN15,000 – N20,000 per teaching session (twice monthly).\n\nApplication Closing Date: 15th January, 2026.\n\nClick here to apply online\n\n \n\n \n\n2.) Contact Center Agent (Debt Recovery)\n\nJob Location: Ilupeju, Lagos\nEmployment Type: Full-time\n\nRequirements\n\n\n\tYear of experience - Minimum of 1 year of experience\n\tQualification - HND/BSc\n\tPrevious experience in contact center and customer service role is a great advantage.\n\n\nSalary\nN100,000 Net per month + other benefits.\n\nApplication Closing Date: 31st January, 2026.\n\nClick here to apply online\n\n \n\n \n\n3.) Physical Therapist (Post-Op Cervical Care Specialist)\n\nJob Location: Ikoyi, Lagos\n\nJob Summary\n\n\n\tWe are seeking a highly skilled and compassionate Physical Therapist to provide specialized rehabilitation care for a patient recovering from Anterior Discectomy and Cervical Fusion (ADCF).\n\tThe successful candidate will focus on restoring cervical range of motion, improving postura+6l alignment, and strengthening supporting musculature while strictly observing all post-surgical precautions.\n\n\nKey Responsibilities\n\n\n\tPatient Assessment: Conduct thorough evaluations of the patient’s post-operative condition, including neurological status, incision healing, mobility, and functional limitations.\n\tManual Therapy: Apply appropriate manual therapy techniques such as massage and soft tissue mobilization to alleviate muscle guarding, spasms, and scar tissue tension in the cervical and upper thoracic regions.\n\tStretching Protocols: Implement gentle, progressive stretching programs to improve flexibility of the neck, shoulders, and chest while maintaining the integrity of the surgical fusion.\n\tTherapeutic Exercises: Develop and supervise a personalized exercise regimen emphasizing deep cervical flexor activation, scapular stabilization, and core strengthening.\n\tPatient Education: Educate the patient on proper posture, ergonomics, and safe neck movements to support recovery during daily activities.\n\n\nQualifications\n\n\n\tBachelor’s or Doctorate degree in Physical Therapy (DPT preferred) with valid professional licensure.\n\tProven experience in orthopedic or neurological rehabilitation, particularly with post-surgical spinal patients.\n\tStrong proficiency in manual therapy techniques.\n\tIn-depth knowledge of ADCF procedures, recovery timelines, and contraindications.\n\n\nSalary\nN15,000 - N30,000 daily.\n\nApplication Closing Date: 10th January, 2026.\n\nClick here to apply online    \n\n    \n\n        Click here to Apply",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]