[
  {
    "title": "Administrative Manager Job at TalentSquare",
    "link": "https://www.jobgurus.com.ng/jobs/view/administrative-manager-job-at-talentsquare",
    "pubDate": "Tue, 17 Jun 2025 15:17:22 GMT",
    "source": "JobGurus",
    "keyword": "talentsquare",
    "duplicate": false,
    "classifications": [],
    "content": "TalentSquare - Our client is a fast-growing children’s fashion brand dedicated to creating stylish, functional, and comfortable clothing for kids. With a strong retail footprint and expanding manufacturing capacity, the brand is on a mission to deliver high-quality apparel that supports children’s active lifestyles.\n\nThey are recruiting to fill the position below:\n\nJob Position: Administrative Manager\n\nJob Location: Lagos\nJob type: Full time\n\nDescription\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThey are now seeking a dynamic and strategic Administrative Manager to ensure smooth day-to-day operations across their retail and production channels.\n\tThis role is central to the business’s growth, offering the opportunity to shape operational processes, manage cross-functional teams, and contribute directly to company efficiency and performance.\n\n\nJob Summary\n\n\n\tThe Administrative Manager is responsible for overseeing the seamless functioning of all operational, logistical, and administrative activities across retail stores and manufacturing facilities.\n\tFrom inventory management to vendor coordination and facility oversight, the role is ideal for a proactive, data-driven professional who thrives in fast-paced environments and enjoys building systems that scale\n\n\nKey Responsibilties\n\n\n\tStrategic Planning & Forecasting: Develop and implement systems for inventory forecasting, resource planning, and operations management.\n\tFacilities Oversight: Manage the upkeep, functionality, safety, and compliance of all retail and manufacturing locations, including lease agreements and infrastructure needs.\n\tVendor & Procurement Management: Build and maintain relationships with suppliers, negotiate favorable terms, and ensure timely procurement of goods and services.\n\tLogistics & Fleet Management: Coordinate transportation schedules and optimize delivery timelines and routes for efficiency and cost-effectiveness.\n\tData & Performance Analytics: Analyze operational data to identify trends, inefficiencies, and areas for improvement. Provide regular reports to leadership.\n\tTeam Leadership: Supervise and mentor the administrative team, promoting a culture of accountability, collaboration, and continuous improvement.\n\tCompliance & Process Improvement: Ensure operational compliance with all legal, safety, and industry regulations. Continuously refine processes to enhance productivity.\n\n\nWhat to Have\n\n\n\tBachelor’s Degree in Business Administration, Operations Management, or related field.\n\t4 - 5 years of proven experience in administrative or operations management; retail or manufacturing industry experience is a strong plus.\n\tStrong skills in inventory control, vendor negotiation, strategic planning, and logistics coordination.\n\tExcellent interpersonal and leadership skills; capable of managing diverse teams and external partners.\n\tA proactive mindset with the ability to work under pressure and prioritize effectively.\n\tProficiency in Microsoft Office Suite and Google Workspace (Excel/Sheets proficiency is a must).\n\tHighly organized with strong problem-solving abilities and attention to detail.\n\tA genuine passion for contributing to a mission-driven brand that positively impacts children’s lives.\n\n\nSalary\nN400,000 - N500,000 monthly.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "HR / Admin Assistant Job at Swift Consulting",
    "link": "https://www.jobgurus.com.ng/jobs/view/hr-admin-assistant-job-at-swift-consulting-1",
    "pubDate": "Tue, 17 Jun 2025 15:17:22 GMT",
    "source": "JobGurus",
    "keyword": "swift consulting",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Swift Consulting, an Education, Human Resources and Management firm, is currently recruiting qualified and well experienced applicants to fill the position below:\n\nJob Position: HR / Admin Assistant\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAssist with recruitment processes, including posting job ads, scheduling interviews, and conducting initial screenings.\n\tMaintain employee records and ensure all HR documents are up-to-date and accurate.\n\tProvide administrative support to the HR department as needed.\n\tRespond to employee inquiries regarding HR policies and procedures.\n\tAssist in onboarding new employees and organizing orientation sessions.\n\tHelp with payroll processing and employee benefits administration.\n\tAssist in organizing company events and training sessions.\n\n\nRequirements\n\n\n\tBachelor’s degree in Human Resources, Business Administration, Psychology, or a related field.\n\tAt least 2 years of experience in an HR/ Administrative role.\n\tStrong organizational and time management skills.\n\tExcellent communication and interpersonal skills.\n\tProficient in Microsoft Office Suite (Word, Excel, PowerPoint).\n\tAbility to handle sensitive information with confidentiality and professionalism.\n\tApplicants must be eager to learn and develop career in HR.\n\n\nSalary\nN70,000 - N80,000 per month. \n\nMethod of Application\nInterested and qualified candidates should send their CV to: hireme@swiftconsulting.com.ng using the Job Position as the subject of the email.\n\nNote: Only qualified candidates will be contacted.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Relationship Manager Job at Pack ‘N’ Pay",
    "link": "https://www.jobgurus.com.ng/jobs/view/relationship-manager-job-at-pack-n-pay",
    "pubDate": "Tue, 17 Jun 2025 15:17:22 GMT",
    "source": "JobGurus",
    "keyword": "pack ‘n’ pay",
    "duplicate": false,
    "classifications": [],
    "content": "Pack ‘N’ Pay is a product of CIC Integrated Services LTD. CIC was created as a wholesale store that supplies food to offshore catering companies to feed the offshore workers. Pack ’N’ Pay was created as a product that would leverage technology to solve the problems of retailers and wholesalers. Pack ‘N’ Pay officially started operations on January 18th 2021 and launched her e-commerce website on March 1st 2021.\n\nWe are recruiting to fill the position below:\n\nJob Position: Relationship Manager\n\nJob Location: Port Harcourt, Rivers\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a proactive, customer-focused Relationship Manager to join our team in Port Harcourt.\n\tThe ideal candidate will be responsible for building strong client relationships, managing customer interactions, and supporting sales efforts.\n\tThis role requires excellent communication skills, a service-oriented mindset, and experience in handling customer accounts and order processing.\n\n\nKey Responsibilities\n\n\n\tServe as the primary point of contact for customers via phone, email, and in person.\n\tProvide accurate information about products and services.\n\tDirect customers to online tools and platforms where applicable.\n\tHandle and resolve customer complaints effectively and professionally.\n\tDemonstrate empathy and patience, especially when managing sensitive customer issues.\n\tMaintain and update customer records in the system.\n\tCollect, review, and analyze customer feedback to improve service delivery.\n\tMonitor and respond to customer reviews across platforms.\n\tCreate and manage reports related to customer interactions and feedback.\n\tBuild and maintain strong customer relationships.\n\tConclude sales for online and walk-in customers.\n\tCheck product availability and communicate updates to customers.\n\tSet up new customer accounts and ensure a smooth onboarding process.\n\tBook and process customer orders accurately and on time.\n\n\nRequirements and Skills\n\n\n\tBachelor’s Degree in Mass Communication, Linguistics, Business Administration, or a related field.\n\t2 - 4 years of relevant experience in customer service, sales support, or relationship management.\n\tExcellent verbal and written communication skills.\n\tStrong interpersonal and customer engagement abilities.\n\tTech-savvy with experience using CRM or customer service software.\n\tDetail-oriented, well-organized, and able to multitask effectively.\n\tYoung, smart, and vibrant, with a passion for customer satisfaction and relationship\n\n\nMethod of Application\nInterested and qualified candidates should forward their CV and Cover Letter to: packnpayhr@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Infrastructure Engineer Job at Layer3",
    "link": "https://www.jobgurus.com.ng/jobs/view/infrastructure-engineer-job-at-layer3",
    "pubDate": "Tue, 17 Jun 2025 15:17:22 GMT",
    "source": "JobGurus",
    "keyword": "layer3",
    "duplicate": false,
    "classifications": [],
    "content": "Layer3 is one of the fastest growing network and security infrastructure companies in West Africa, providing award-winning services, including managed and cloud services, network security, IT infrastructure management, virtualization and mobile device management solutions. Our unique model integrates best-of-breed technologies from global leaders such as Juniper Networks, Blue Coat, Polycom, AirWatch, F5, Extreme Networks and VMware, coupled with our next-generation metro fiber networks, to offer unparalleled services and after sales support to some of the most demanding customers.\n\nWe are recruiting to fill the position below:\n\nJob Position: Infrastructure Engineer\nJob Location: Lagos\nEmployment Type: Full-time\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Summary\n\n\n\tThe Infrastructure Engineer will be responsible for designing, building, and testing the private cloud infrastructure components comprising compute, storage etc.\n\tAlso responsible for working to make sure the underlying private cloud infrastructure architecture and technical decisions support their cloud services, service tiers, and OLAs needed to meet business needs.\n\n\nResponsibilities\nWhat we will challenge you to achieve:\n\n\n\tDesign and architect end to end validated solutions which represent real-world cloud provider implementations\n\tFunction as the technical product expert for specific cloud provider solution areas\n\tWork closely with the cloud business unit providing input on & formal review of product functional specifications prior to development, provide feedback on releases and feature implementations\n\tDesign, implement, and manage scalable and secure cloud infrastructure across public, private, and hybrid environments.\n\tAdminister and support Linux-based systems, ensuring high availability, performance, and security.\n\tDeploy, configure, and manage Open-stack deployment such as Virtuozzo-based virtualization and container environments.\n\tDevelop and maintain Infrastructure as Code (IaC) using tools like Terraform, Ansible, or similar.\n\tCollaborate with DevOps teams to automate deployment pipelines, CI/CD processes, and system monitoring.\n\tProvide technical expertise in containerization technologies including Virtuozzo, Docker, and Kubernetes.\n\tIntegrate third-party services and APIs to enhance cloud platform capabilities.\n\tCreate and maintain custom cloud product offerings and solutions tailored to business needs.\n\tMonitor system performance, conduct capacity planning, and perform root cause analysis on incidents.\n\tImplement and enforce security best practices across cloud and virtualized environments.\n\tWork with cross-functional teams to define cloud strategies and operational procedures.\n\tEnsure compliance with organizational standards and regulatory requirements (e.g., ISO, GDPR).\n\tDocument system configurations, processes, and architectural decisions.\n\n\nRequirements\nWhat you need to have:\n\n\n\tFirst Degree in Engineering or Computer Science.\n\t3-5 years of experience as an Infrastructure Engineer.\n\tA strong understanding of IT automation, management, orchestration and cloud management platform capabilities driving IaaS, SaaS and PaaS is a plus.\n\tStrong hands-on expertise with OpenStack based virtualization Solutions\n\tSubject matter expert on virtualization solutions like Vmware, Proxmox etc.\n\tStrong understanding of storage solutions (ISCSI, NAS, SAN)\n\tSolid experience with Converged and Hyper-converged Virtualization Solutions.\n\tStrong understanding of backup and Disaster recovery solutions like Commvault, Veeam, Netbackup or Acronis.\n\tProficient in Linux system administration (CentOS, Ubuntu, RHEL).\n\tExperience with cloud platforms such as AWS, Azure, Digital Ocean, GCP is a plus\n\tProven experience in cloud infrastructure management and DevOps practices is a plus\n\tScripting skills in Bash is a plus.\n\tFamiliarity with monitoring tools like Prometheus, Grafana, or Zabbix.\n\tStrong problem-solving, communication, and collaboration skills.\n\n\nMethod of Application\nInterested and qualified candidate should send their Applications to: careers@layer3.com.ng using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Supply Chain Expert Job at Runola Nigeria Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/supply-chain-expert-job-at-runola-nigeria-limited",
    "pubDate": "Tue, 17 Jun 2025 15:17:22 GMT",
    "source": "JobGurus",
    "keyword": "runola nigeria limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Runola Nigeria Limited is a parent company with four subsidiaries (AdelooSuites, Runoplast, Runoclean, and RunoFeed)committed to delivering high-quality products and services to our customers. With a strong focus on innovation, efficiency, and excellence, we have established ourselves as a trusted name in the industry.\n\nOur company operates across multiple locations, ensuring seamless production and service delivery while upholding the highest standards of professionalism. We value teamwork, integrity, and continuous growth, providing our employees with opportunities to excel in their careers.\n\nWe are recruiting to fill the position below:\n\nJob Position: Supply Chain Expert\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tThe Supply Chain Expert is responsible for overseeing and optimizing the end-to-end supply chain operations of the organization.\n\tThis includes procurement, logistics, inventory management, demand forecasting, supplier relationship management, and ensuring cost-effective, timely, and high-quality delivery of goods and services.\n\n\nKey Responsibilities\n\n\n\tDevelop and implement supply chain strategies aligned with business goals.\n\tAnalyze supply chain data and performance to identify areas for improvement.\n\tCoordinate logistics activities including shipping, warehousing, and distribution.\n\tCollaborate with cross-functional teams (Production, Sales, Finance) to align supply and demand planning.\n\tOversee procurement activities, vendor selection, and contract negotiations.\n\tManage inventory levels to ensure optimal stock without over/understocking.\n\tMonitor market trends and supplier performance to mitigate supply risks.\n\tDrive sustainability and cost-saving initiatives across the supply chain.\n\n\nQualifications and Skills\n\n\n\tBachelor's Degree in Supply Chain Management, Logistics, Business Administration, or related field. A Master’s Degree or professional certification (e.g., CSCP, CPIM, CIPS) is a plus.\n\tMinimum of 2 – 5 years of experience in supply chain, logistics, or procurement roles.\n\tStrong analytical and problem-solving skills.\n\tExperience with ERP systems (e.g., SAP, Oracle, Microsoft Dynamics).\n\tExcellent negotiation, communication, and interpersonal skills.\n\tAbility to work under pressure and handle multiple priorities.\n\tStrong leadership and project management abilities.\n\n\nKey Competencies:\n\n\n\tStrategic Thinking\n\tOperational Excellence\n\tSupplier/Vendor Management\n\tRisk Management\n\tCost Control and Budgeting\n\tData Analysis and Forecasting\n\tProcess Optimization.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: careers@runola.ng using \"Supply Chain Expert Application\" as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]