[
  {
    "title": "Accountant Job at Redswitch Collections",
    "link": "https://www.jobgurus.com.ng/jobs/view/accountant-job-at-redswitch-collections",
    "pubDate": "Wed, 02 Jul 2025 14:15:48 GMT",
    "source": "JobGurus",
    "keyword": "redswitch collections",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Redswitch Collections - Our client, a reputable professional services firm in Abuja, is recruiting to fill the position below:\n\nJob Position: Accountant\n\nJob Location: Abuja (FCT)\n\nJob Summary\n\n\n\tWe are seeking a skilled Accountant with 2–4 years of practical experience in payroll, statutory compliance, financial reporting, and reconciliations.\n\tThe successful candidate will play a vital role in managing internal accounts and ensuring timely remittances to statutory bodies.\n\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tPrepare and process monthly payroll, PAYE, and pension schedules\n\tFile and remit statutory deductions (ITF, NSITF, PAYE, Pension) accurately and on time\n\tSupport internal financial reporting and analysis\n\tLiaise with tax authorities (FIRS/FCT-IRS) for compliance and queries\n\tMaintained accurate accounting records and ledgers using Excel or accounting software\n\tPerform monthly bank and petty cash reconciliations\n\tEnsure data integrity and confidentiality in all financial processes\n\n\nKey Requirements\n\n\n\tHND/B.Sc. in Accounting, Finance, or related discipline\n\tATS certification or ACA/ACCA (in progress) is an advantage\n\tExperience with QuickBooks, Sage, Wave, or similar tools is a plus\n\tSolid knowledge of Nigerian tax laws and payroll procedures\n\tStrong attention to detail, accuracy, and integrity.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: patrickpatrick1001@gmail.com using “Accountant – Abuja” as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Head of Service Management Job at Hoop Telecoms Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/head-of-service-management-job-at-hoop-telecoms-limited",
    "pubDate": "Wed, 02 Jul 2025 14:15:48 GMT",
    "source": "JobGurus",
    "keyword": "hoop telecoms limited",
    "duplicate": false,
    "classifications": [],
    "content": "Hoop Telecoms Limited was established in 2017 as a full Telecommunications Service provider. Since its formation, Hoop Telecoms has been growing rapidly and is emerging as a leading provider of telecommunication and business solutions. Our goal is to be the telecom company of choice for voice, video, and data for consumers in Nigeria, West Africa, Africa, and globally. Simply put; our vision is global.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nHOOPTEL is led by a strong management team with knowledge and extensive experience in the telecom industry, and other professionals with strong administrative skills and experience. We are primarily focused on delivering solutions to customers in Enterprise networks connectivity, Broadband internet services, Voice communication solutions, Video and secured data solutions, Data Centre and co-location services, managed cloud services, and other related telecommunication systems.\n\nWe are a company driven to provide our customers with solutions that are customized to fit their current needs, yet flexible enough to accommodate their growth plans, at the most competitive pricing on all service offerings, thus optimizing IT spend and future proofing of our solutions.\n\nWe are recruiting to fill the position below:\n\nJob Position: Head of Service Management\n\nJob Location: Ilupeju / Gbagada, Lagos\nEmployment Type: Part-time\nReports To: Managing Director\nCompany: Hoop Telecoms Limited\n\nJob Purpose\n\n\n\tTo provide strategic leadership and direction for the Service Management function, ensuring the delivery of high-quality services that meet customer expectations, align with business goals, and drive operational efficiency.\n\tThe role oversees customer experience, service delivery, incident management, change and problem management, and ensures adherence to SLAs across all technical and operational touchpoints.\n\n\nKey Responsibilities\nStrategic Leadership & Service Governance:\n\n\n\tDevelop and implement service management strategies aligned with corporate goals and customer expectations.\n\tDefine, monitor, and report on KPIs for service delivery, customer satisfaction, and operational efficiency.\n\tOversee the establishment and continuous improvement of ITIL-based service management processes.\n\tLead service reviews and governance forums with internal teams and clients.\n\n\nService Operations & Delivery:\n\n\n\tEnsure consistent and high-quality delivery of telecom services across voice, data, and enterprise products.\n\tOversee Incident, Problem, and Change Management to ensure prompt resolution and minimal disruption.\n\tManage SLA and OLA compliance with internal teams, vendors, and customers.\n\tLead the Service Delivery team to ensure accurate provisioning, monitoring, and troubleshooting of services.\n\n\nCustomer Experience & Relationship Management:\n\n\n\tAct as the escalation point for major service issues and customer complaints.\n\tDrive initiatives to enhance customer experience, service performance, and satisfaction.\n\tEstablish and maintain strong relationships with key enterprise clients, partners, and stakeholders.\n\n\nPerformance Monitoring & Reporting\n\n\n\tImplement and oversee real-time monitoring of network and service performance.\n\tDevelop dashboards and analytics to provide visibility into service health and trends.\n\tPrepare regular reports for the Managing Director and executive leadership on service performance.\n\n\nTeam Leadership & Development:\n\n\n\tLead, mentor, and manage the Service Management and Support teams.\n\tBuild a performance-driven culture focused on accountability, quality, and continuous improvement.\n\tConduct regular training and capacity-building for team members on industry best practices and tools.\n\n\nQualifications and Experience\n\n\n\tBachelor’s Degree in Telecommunications, Engineering, Computer Science, or related field. Master’s degree or MBA is an advantage.\n\tMinimum of 8 - 10 years of relevant experience in service management within the telecommunications industry, with at least 3 years in a leadership role.\n\tITIL Foundation or higher certification is required.\n\tProven track record of managing service operations, SLAs, and customer experience in telecoms.\n\tStrong understanding of telecom infrastructure (ISP, fiber, VoIP, B2B connectivity, etc.).\n\tExperience working with service desk software, monitoring tools, and CRM systems.\n\n\nKey Competencies:\n\n\n\tStrong leadership, interpersonal, and communication skills.\n\tStrategic thinker with the ability to translate strategy into execution.\n\tExcellent problem-solving and decision-making skills.\n\tCustomer-oriented with a passion for delivering quality service.\n\tAbility to thrive in a fast-paced and evolving environment.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hr@hooptelecoms.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Virtual Assistant Job at Raphael Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/virtual-assistant-job-at-raphael-group-3",
    "pubDate": "Wed, 02 Jul 2025 14:15:48 GMT",
    "source": "JobGurus",
    "keyword": "raphael group",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Raphael Group - We are a professional virtual assistant service that connects employers with skilled remote assistants. We offer a wide range of services to support individuals and businesses, including scheduling, email management, research, and more. We take the hassle out of finding and hiring qualified virtual assistants, allowing you to focus on growing your business.\n\nWe are recruiting to fill the position below:\n\nJob Position: Virtual Assistant\n\nJob Locations: Abuja (FCT) and Lagos\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tEditing and Proofreading: Edit and proofread content to ensure grammatical accuracy and engaging presentation.\n\tContent Editing: Create and edit videos using editing tools like Capcut, Inshot, and others to produce high-quality content, design graphics and layouts using Canva.\n\tSoftware Proficiency: Utilize Google Suite and Microsoft Office Suite for document creation, data analysis, and online collaboration.\n\tCommunication: Craft professional emails and manage correspondence with clients and team members.\n\tResearch and Reporting: Conduct thorough product research and compile detailed reports.\n\tTime Management: Manage schedules, appointments, and calendars to ensure efficient time management.\n\tCustomer Support: Handle customer inquiries and provide support via phone, email, or chat.\n\tData Management: Maintain and update databases and internal systems with accuracy.\n\tMeeting Organization: Prepare and organize virtual meetings, including setting up conference calls and webinars.\n\n\nRequirements\n\n\n\tInterested candidates should possess a Bachelor's Degree with at least 3 years of experience. Completion of NYSC is mandatory.\n\tProficiency in video editing software and tools, including Capcut, Inshot, and other relevant applications.\n\tStrong email writing and communication skills.\n\tFamiliarity with social media platforms such as Facebook, Twitter, Instagram, LinkedIn, Pinterest, YouTube, and TikTok.\n\tSkilled in using Canva for graphic design.\n\tFamiliarity with Google Suite and Microsoft Office Suite applications.\n\tAbility to conduct comprehensive product research.\n\tCritical thinking skills and the ability to solve problems effectively.\n\tExcellent command of the English language with clear speaking skills.\n\n\nTechnical Requirements:\nPersonal Laptop:\n\n\n\tProcessor: Not less than Intel Core i5.\n\tRAM: Not less than 8GB.\n\tHard Drive: Available space not less than 500GB HDD.\n\tFree Space: 50GB.\n\tInternet: Strong service provider with a minimum of 20MB download speed and 10MB upload speed.\n\n\nSmartphone:\n\n\n\tLatest OS version support.\n\tMinimum of 4GB RAM.\n\tHigh-quality front-facing camera for video conferencing.\n\tReliable and fast internet connectivity.\n\n\nSalary\nN125,000 monthly. Plus #10,000 data allowance    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Customer Service Representative Job at Lily hospitals Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/customer-service-representative-job-at-lily-hospitals-limited",
    "pubDate": "Wed, 02 Jul 2025 14:15:48 GMT",
    "source": "JobGurus",
    "keyword": "lily hospitals limited",
    "duplicate": false,
    "classifications": [],
    "content": "Lily hospitals Limited, established since 1986 remains one of the foremost hospitals in Nigeria and within the South-South region of the country. It is the first private hospital in Nigeria to achieve ISO 9001:2000 quality management system certification from the Standards Organization of Nigeria (SON) and was also recently accredited with COHSASA (Council for Health Service Accreditation of Southern Africa) Certificate.\n\nWe are recruiting to fill the position below:\n\nJob Position: Customer Service Representative\nJob Location: Woji, Port Harcourt - Rivers\nEmployment Type: Full-time\n\nPosition Overview\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a dedicated and enthusiastic Customer Service Representative to join our dynamic team.\n\tThe ideal candidate will be passionate about assisting customers, resolving inquiries, and providing outstanding service in a friendly environment.\n\n\nResponsibilities\n\n\n\tRespond promptly and professionally to customer inquiries via phone, email, and chat.\n\tIdentify and assess customers' needs to achieve satisfaction.\n\tProvide accurate information regarding products/services and company policies.\n\tHandle and resolve customer complaints in a calm and empathetic manner.\n\tMaintain a positive, empathetic, and professional attitude toward customers.\n\tCollaborate with other team members to ensure a seamless customer experience.\n\n\nRequirements\n\n\n\tMust Have a Minimum of an OND in Health Information Management.\n\tProven experience in health information management and customer service in a healthcare setting.\n\tStrong communication, interpersonal, and problem-solving skills.\n\tKnowledge of medical terminology and patient privacy laws.\n\tAbility to multitask, prioritize, and work efficiently in a fast-paced environment.\n\tMust reside in Port Harcourt or its environs.\n\n\nBenefits\n\n\n\tCompetitive salary based on experience.\n\tHealth insurance and other benefits package.\n\tOpportunities for career growth and professional development.\n\tA supportive and collaborative work environment.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV / Resume detailing their relevant experience to: recruitment@lilyhospitals.net using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]