[
  {
    "title": "Restaurant Account Officer Job at FoodOnline Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/restaurant-account-officer-job-at-foodonline-limited",
    "pubDate": "Fri, 20 Jun 2025 17:40:06 GMT",
    "source": "JobGurus",
    "keyword": "foodonline limited",
    "duplicate": false,
    "classifications": [],
    "content": "FoodOnline Limited - In a fast-paced world with cutting-edge technology and timelines, Food online is a people-centric online food delivery startup committed to satisfying your cravings and stomach demands within the shortest time. We connect you to your favorite Local restaurants, Craving spots and chefs delivering directly to doorsteps.\n\nWe are recruiting to fill the position below:\n\nJob Position: Restaurant Account Officer\n\nJob Location: Jabi / Utako / Wuye / Wuse / Mabushi - Abuja (FCT)\nEmployment Type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe’re looking for smart, young, and organized individuals who can work with restaurants to ensure fast and correct orders.\n\n\nResponsibilities\n\n\n\tReceive order screenshot\n\tBuy and confirm food from restaurant\n\tLabel, seal, and hand over to the assigned rider\n\tCommunicate delays or issues to the team.\n\n\nRequirments\n\n\n\tMinimum SSCE (WAEC, NECO, or equivalent)\n\tMust be at least 16 years old\n\tMust live in or near Jabi, Utako, Wuye, Wuse, or Mabushi\n\tPolite, smart, and presentable\n\tOwn a smartphone with WhatsApp\n\tKnows how to move fast and communicate clearly.\n\n\nSalary and Benefits\n\n\n\tN70,000 / Month\n\tBonus tied to performance\n\tGrowth opportunity in a fast-moving company\n\tOn-the-job training\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Graphics Designer Job at Rishcon Digital Agency",
    "link": "https://www.jobgurus.com.ng/jobs/view/graphics-designer-job-at-rishcon-digital-agency-3",
    "pubDate": "Fri, 20 Jun 2025 17:40:06 GMT",
    "source": "JobGurus",
    "keyword": "rishcon digital agency",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "The name RISHCON is built on three words RICH, SHOWY and CONTENT. These words actually bring meaning to what we want to achieve as a brand. As a digital marketing agency, we help businesses reach their digital marketing,management objectives and we aim to be the GO-TO brand in Africa and beyond when it comes to Social media Management, Content Creation, Advertising and Branding.\n\nWe are recruiting to fill the position below:\n\nJob Position: Graphics Designer\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nRequirements\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tCandidates should possess an OND, HND, or B.Sc Degree\n\tProven 2 to 5 years of graphics design experience.\n\tExcellent IT skills, especially with design softwares like Adobe Photoshop, Illustrator, Corel draw.\n\tExceptional still graphic design and motion design skills.\n\tAbility to collaborate and work in a team.\n\tExceptional creativity and innovation.\n\tExcellent time management, communication and organisational skills.\n\tA keen eye for aesthetics and attention to detail.\n\tAn understanding of the latest trends and their role within a commercial environment.\n\tProfessional approach to time and deadlines.\n\tAbility to juggle multiple projects and work under pressure.\n\n\nSalary\nN60,000 - N70,000 / month.\n\nMethod of Application\nInterested and qualified candidates should send their CV and Portfolio to: rishcon1@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Assistant and Information Management Officer Job at International Committee of the Red Cross",
    "link": "https://www.jobgurus.com.ng/jobs/view/assistant-and-information-management-officer-job-at-international-committee-of-the-red-cross",
    "pubDate": "Fri, 20 Jun 2025 17:40:06 GMT",
    "source": "JobGurus",
    "keyword": "international committee of the red cross",
    "duplicate": false,
    "classifications": [],
    "content": "The International Committee of the Red Cross (ICRC) works worldwide to provide protection and humanitarian assistance to people affected by conflict and armed violence. We take action in response to emergencies and at the same time promote respect for international humanitarian law. We are an independent and neutral organization, and our mandate stems essentially from the Geneva Conventions of 1949. We work closely with National Red Cross and Red Crescent Societies and with their International Federation in order to ensure a concerted, rational, and rapid humanitarian response to the needs of the victims of armed conflict or any other situation of internal violence. We direct and coordinate the international activities conducted in these situations.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting suitable candidates to fill the vacancy below:\n\nJob Position: Assistant and Information Management Officer\n\nJob Location: Mubi, Adamawa\nEmployment Type: Full-time\nGrade: B2\n\nThe Purpose\n\n\n\tThe Mubi Assistant & IM Officer provides administrative support to Mubi Management and is responsible for information management in the Mubi Area of Responsibility (AoR), Biu, and Yola offices, under the supervision of Executive Assistant & IM Officer.\n\tS/he acts as a reference person for written protocols, correspondence, and standard tools in the MUB Sub-delegation and offices.\n\n\nYour Role\n\n\n\tMakes an active contribution to support and implement all projects or programs linked to information management.\n\tActively takes part in any new IM tool deployment in the delegation.\n\tWorks with the Executive Assistant & IM Officer (EAIMO) in organizing training sessions, information dissemination, and preparing training materials.\n\tBriefs newcomers systematically on Information Management, ICRC procedures, and tools.\n\tSupports and trains all staff on Information Management and the above-mentioned subjects.\n\tEnsures compliance with rules and procedures.\n\tDrafts formal and informal non-confidential correspondence for the signature of the management.\n\tEnsures that users understand the need for changes to tools or information sharing processes and supports these changes.\n\tEnsures that all paper and electronic documents received at the IM and Support Office are shared with the concerned staff members.\n\tOrganizes and follows up on training during deployments of new IM tools.\n\tMakes sure that all staff know and apply ICRC rules regarding correspondence and ICRC protocol; proposes a solution in case of contradiction between the rules and local practices; knows the rules regarding the signatures and ensures that these rules are applied by all staff in the delegation.\n\tScreens, prioritizes, dispatches, and follows up on requests, calls, and correspondence; has an overview of the MUB sub-delegation's activities and considers its priorities and challenges when making decisions.\n\tProactively updates him/herself on the training materials, and acts as a focal point for providing training and relaying information.\n\tShares and files documents for the Management.\n\tCreates electronic and paper files for the Management, feeds them with relevant documents, and closes them.\n\tPuts them into boxes at the end of each period and keeps an updated inventory.\n\n\nYour profile: Education & Experience\n\n\n\tUniversity Degree\n\t3 - 5 Years as an information management officer\n\tWorking proficiency in English and Hausa is compulsory. Working proficiency in Fulani is a plus.\n\tAdvanced computer skills, including Microsoft Office suite, SharePoint, HCL Lotus Notes, and other web-based solutions.\n\tApplicant must have a valid working permit to work in Nigeria.\n\n\nWhat We Offer\n\n\n\tRewarding work in a humanitarian and multicultural environment.\n\tCompetitive employment package with medical insurance and ICRC pension plan.\n\tIn-house training opportunities for personal development.\n\tA full-time, open-ended contract.\n\tThe opportunity to join an ICRC talent pool, be considered for future assignments elsewhere, and experience different contexts, fields, and challenges.\n\n\nMethod of Application\nInterested and qualified candidates should: Click here to apply online\nAnd\nSend your resume and a cover letter, valid license to practice (where relevant), and valid ID card to: ABJ_Recruitment_Services@icrc.org using “ABJ202500541 AIMO Mubi SD\" as the subject of the mail.\n\nNote\n\n\n\tOnly applications submitted through the designated MS Form will be considered for this role\n\tLate applications will not be considered.\n\tOnly short-listed candidates will be contacted.\n\tEqual opportunities shall be provided to all employees and applicants for employment based on their demonstrated ability and competence without discrimination based on race, colour, religion, gender, nationality, status, disability etc. (The ICRC values diversity and is committed to creating an inclusive working environment).\n\tWe welcome applications from all qualified candidates;Female &People living with Disabilityapplicants are encouraged to apply.\n\tICRC will not request any monetary payments from applicants at any stage of the recruitment process.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Audit Assistant Job at Colton Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/audit-assistant-job-at-colton-group",
    "pubDate": "Fri, 20 Jun 2025 17:40:06 GMT",
    "source": "JobGurus",
    "keyword": "colton group",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Colton Group is a diversified group with interest in manufacturing, construction, mining, and Construction chemicals.We have a long tradition of providing innovative products that help our clients meet their construction needs and solve everyday challenges. We also continue to expand our business lines to meet emerging market needs.\n\nWe are recruiting to fill the position below:\n\nJob Position: Audit Assistant\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are hiring an Audit Assistant to support our internal audit function. You will be responsible for evaluating operational processes, verifying compliance, and ensuring sound financial practices across departments—from production to sales.\n\tThis is an exciting opportunity to work in a high-impact, quality-driven environment where your attention to detail and integrity will help shape sustainable audit practices.\n\n\nResponsibilities\n\n\n\tConduct periodic audits of manufacturing processes, warehouse inventory, procurement transactions, and sales documentation.\n\tReview raw material usage, batch production sheets, and stock records for accuracy.\n\tAssist with physical stock counts and reconciliation of inventory records.\n\tDraft audit findings and contribute to reports with practical recommendations.\n\tAssist in monitoring the implementation of corrective actions post-audit.\n\tSupport the audit of procurement practices, ensuring adherence to approved suppliers, pricing, and internal controls.\n\tCollaborate with finance, operations, and quality teams to gather supporting audit documentation.\n\tStay up to date on compliance requirements relevant to chemical manufacturing and HSE standards.\n\n\nKey Performance Indicators (KPIs)\n\n\n\tTimeliness and quality of audit documentation\n\tAccuracy of inventory and asset verification\n\tImplementation rate of audit recommendations\n\tNumber of process improvements identified\n\tAudit coverage across key departments\n\n\nRequirements\n\n\n\tB.Sc. / HND qualification in Accounting, Finance, or related field.\n\t4–6 years of experience in audit, preferably in a manufacturing or production-based company.\n\tUnderstanding of internal controls, inventory management, and cost tracking.\n\tStrong Microsoft Excel skills; familiarity with ERP systems (Quickbooks, Tally, SAP, Odoo, etc.) is an advantage.\n\tHigh level of integrity, objectivity, and analytical thinking.\n\tAbility to work independently and within a team under minimal supervision.\n\n\nSalary & Benefits\n\n\n\tCompetitve Salary\n\tHealth insurance and statutory benefits\n\tProfessional development and training support\n\tOpportunity to work with a reputable brand in a high-growth sector\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and a short cover letter to: hr@coltongroupinc.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Brand Builder Job at FactBase Consulting Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/brand-builder-job-at-factbase-consulting-limited",
    "pubDate": "Fri, 20 Jun 2025 17:40:06 GMT",
    "source": "JobGurus",
    "keyword": "factbase consulting limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "FactBase Consulting Limited - Our client, a major and professionally-run manufacturing company in the foods and beverages industry, with its head office located in Ikeja, Lagos, is recruiting honest, diligent and brilliant individuals to grow with its team in the capacity below:\n\nJob Position: Brand Builder\n\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\n\nJob Description (in Summary)\n\n\n\tDevelop and manage strong relationships with on-trade accounts.\n\tExecute brand-building activities.\n\tWork closely with marketing for promotions and activations.\n\n\nRequirements\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDegree/ HND in Business Administration, Marketing, Economics, Social/Physical/ Life Sciences, Humanities or Education.\n\tMinimum of six years of experience in a similar role, with at least three years in on-trade and luxury account management.\n\tStrong skills in MS Office Suite.\n\n\nSalary\nN300,000 - N350,000 / Month.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: factbaseconsulting@gmail.com using the Job Position and preferred location as the subject of the mail.\n\nNote: Only shortlisted candidates will be contacted, please.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]