[
  {
    "title": "Software Engineer (.Net) Job at PayInvert",
    "link": "https://www.jobgurus.com.ng/jobs/view/software-engineer-net-job-at-payinvert",
    "pubDate": "Tue, 08 Jul 2025 16:49:02 GMT",
    "source": "JobGurus",
    "keyword": "payinvert",
    "duplicate": false,
    "classifications": [
      "Software Engineering"
    ],
    "content": "PayInvert was founded by innovators who want a better payment system that is fast, easy, convenient and with no hidden charges. The aim has always been to eradicate long queues and time taken to make payments physically. We are providing a secure way to receive payments electronically from anyone anywhere in the world with a robust reporting system to help companies plan their growth significantly.\n\nWe are recruiting to fill the position below:\n\nJob Position: Software Engineer (.Net)\nJob Location: Abuja (FCT)\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are looking for an experienced and skilled .NET Backend Engineer to join our innovative team focused on building robust and secure payment gateway solutions.\n\tYou will play a pivotal role in developing, maintaining, and optimizing backend systems that power secure transactions for millions of customers.\n\tAs a critical member of our engineering team, your expertise will directly impact our ability to deliver seamless and reliable fintech products.\n\n\nKey Responsibilities\n\n\n\tDevelop, maintain, and enhance robust backend services using .NET and related technologies (.NET Core, ASP.NET, C#, SQL Server).\n\tDesign, build, and optimize scalable APIs that power our payment gateway infrastructure.\n\tImplement industry-standard security practices, ensuring compliance with data protection regulations and PCI DSS standards.\n\tCollaborate closely with product managers, frontend engineers, and DevOps teams to develop and deliver high-quality fintech solutions.\n\tConduct thorough testing, debugging, and troubleshooting of complex backend systems to ensure optimal performance and availability.\n\tEngage actively in code reviews, promoting best practices, coding standards, and continuous integration/continuous deployment (CI/CD).\n\tDevelop technical documentation and support the onboarding of new engineering team members.\n\tContinuously monitor application performance, identify bottlenecks, and implement optimizations to ensure peak reliability and efficiency.\n\n\nRequired Qualifications\n\n\n\t3-5 years of professional backend engineering experience, specifically in .NET development.\n\tProven experience building APIs, backend services, and integration solutions in fintech, payment processing, or related domains.\n\tStrong proficiency with .NET Core, ASP.NET, C#, and relational databases (SQL Server or PostgreSQL).\n\tPractical experience integrating with payment gateways, bank APIs, third-party services, and understanding of financial systems.\n\tFamiliarity with cloud infrastructure (AWS, Azure) and containerization technologies (Docker, Kubernetes).\n\tSolid understanding of security best practices, data encryption, tokenization, authentication, and authorization standards.\n\tAbility to manage tasks independently while effectively collaborating in an agile, team-oriented environment.\n\n\nPreferred Qualifications:\n\n\n\tFamiliarity with frontend frameworks such as React or Angular.\n\tExperience with microservices architecture, message queues (RabbitMQ, Kafka), and event-driven design.\n\tWorking knowledge of DevOps practices, including CI/CD tools (Azure DevOps, Jenkins, GitLab).\n\tPrevious experience working within compliance frameworks (PCI DSS, GDPR, ISO27001).\n\n\nSkills and Competencies:\n\n\n\tExcellent problem-solving skills, analytical thinking, and attention to detail.\n\tStrong communication skills to effectively collaborate across teams and stakeholders.\n\tDemonstrated ability to deliver high-quality software solutions in fast-paced environments.\n\tProactive learner, continuously seeking to improve technical knowledge and skills.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Administrative Personnel / Receptionist Job at Lagos Chamber of Commerce and Industry",
    "link": "https://www.jobgurus.com.ng/jobs/view/administrative-personnel-receptionist-job-at-lagos-chamber-of-commerce-and-industry",
    "pubDate": "Tue, 08 Jul 2025 16:49:02 GMT",
    "source": "JobGurus",
    "keyword": "lagos chamber of commerce and industry",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "The Lagos Chamber of Commerce and Industry (LCCI) isa prominent private sector group in Nigeria, serving as the premier chamber of commerce.Founded in 1888 and incorporated in 1950, it's a non-profit organization dedicated to promoting and protecting trade and industry. The LCCI represents the business community's voice on matters affecting trade, industry, commerce, and agriculture, and also engages in public policy advocacy and trade promotion.\n\nWe are recruiting to fill the position below:\n\nJob Position: Administrative Personnel / Receptionist\n\nJob Location: Lagos\nDepartment: Business Education Services and Training (Innovation Hub)\nReports to:Hub Manager / B.E.S.T Head\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Summary\n\n\n\tWe are seeking an organized, friendly, and efficient administrative professional to manage front desk operations and provide vital administrative support at our Innovation Hub.\n\n\nRole Overview\n\n\n\tYou’ll be the first point of contact for visitors and clients—delivering world-class customer service, managing administrative tasks, and keeping daily operations running smoothly.\n\n\nKey Responsibilities\n\n\n\tWelcome visitors and guide them appropriately\n\tManage calls, emails, bookings, and schedules\n\tPrepare official documents, memos, and correspondence\n\tMaintain office files, supplies, and expense records\n\tCoordinate workspace assignments and internet access for clients\n\tKeep reception and common areas neat and organized.\n\n\nRequirements\n\n\n\tB.Sc. in Business Administration, Office Management, or related field\n\tMinimum of 3 years of experience in a similar administrative role\n\tStrong communication and customer service orientation\n\tExcellent organization, multitasking, and time management skills\n\tProficiency in Microsoft Office and administrative tools.\n\n\nWhat We Offer\n\n\n\tOpportunity to work in a dynamic, innovation-driven environment\n\tCompetitive compensation and support for career growth\n\tRespectful and collaborative team culture.\n\n\nMethod of Application\nInterested and qualified candidates should send their resume and a cover letter to: recruitment@lagoschamber.com using \"Administrative Personnel / Receptionist\" as the subject of the mail.\n\nNote: Only shortlisted candidates will be contacted.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Information Technology Officer Job at Lagos Chamber of Commerce and Industry",
    "link": "https://www.jobgurus.com.ng/jobs/view/information-technology-officer-job-at-lagos-chamber-of-commerce-and-industry",
    "pubDate": "Tue, 08 Jul 2025 16:49:02 GMT",
    "source": "JobGurus",
    "keyword": "lagos chamber of commerce and industry",
    "duplicate": false,
    "classifications": [
      "Software Engineering"
    ],
    "content": "The Lagos Chamber of Commerce and Industry (LCCI) isthe leading private sector group in Nigeria, established to promote and protect trade and industry. Founded in 1888 and incorporated in 1950, it represents the interests of the business community in Lagos and beyond, advocating for policies that support trade, industry, commerce, and agriculture. The LCCI also provides business development services, training, and information to its members.\n\nWe are recruiting to fill the position below:\n\nJob Position: Information Technology Officer\nJob Location: Lagos\nDepartment: Business Education Services and Training (Innovation Hub)\nReports to: Hub Manager (Assistant Manager)\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Summary\n\n\n\tThe Lagos Chamber of Commerce and Industry (LCCI)—Africa’s foremost Chamber of Commerce—is inviting applications from experienced and driven IT professional to support and scale our digital infrastructure at the *LCCI-BOI Innovation Hub*.\n\n\nRole Overview\n\n\n\tThe ideal candidate will be responsible for maintaining robust IT systems and network architecture, ensuring uninterrupted technology operations, and providing innovative solutions to optimize performance and security.\n\n\nKey Responsibilities\n\n\n\tDeliver prompt IT support across hardware, software, and network issues\n\tManage and monitor infrastructure: routers, switches, firewalls, VPNs\n\tMaintain cybersecurity protocols and backup systems\n\tSupport ERP system administration (Odoo 16) and customization\n\tRecommend and implement new tech tools and solutions\n\tSupport digital onboarding and IT asset management\n\tCollaborate with internal teams for tech-driven problem-solving\n\n\nRequirements\n\n\n\tBachelor’s degree in IT, Computer Science, or related field\n\tMinimum of 3 years of experience in IT operations\n\tProficiency in networking, cybersecurity, and ERP systems\n\tWorking knowledge of Windows, Linux, and macOS\n\tHands-on experience with SQL, Python, XML (basic level)\n\tExcellent troubleshooting, communication, and documentation skills\n\tCertifications such as CCNA, CompTIA+, or Microsoft preferred.\n\n\nWhat We Offer\n\n\n\tCompetitive salary & employee benefits\n\tCareer growth in a tech-forward organization\n\tSupportive, collaborative work environment\n\tOpportunities to lead innovation within a respected institution.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and a cover letter to: recruitment@lagoschamber.com using “Information Technology Officer” as the subject of the mail.\n\nNote: Only shortlisted candidates will be contacted.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "HMO Officer Job at Prestigious Consulting",
    "link": "https://www.jobgurus.com.ng/jobs/view/hmo-officer-job-at-prestigious-consulting-2",
    "pubDate": "Tue, 08 Jul 2025 16:49:02 GMT",
    "source": "JobGurus",
    "keyword": "prestigious consulting",
    "duplicate": false,
    "classifications": [],
    "content": "Prestigious Consulting is a professional HR consultancy firm. We focus on improving organizational performance through strategic people & process management.\n\nWe are recruiting to fill the position below:\n\nJob Position: HMO Officer\n\nJob Location: Osapa London, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe're seeking a proactive and organized HMO Officer to join our team in Lagos.\n\tAs an HMO Officer, you'll be responsible for engaging new partners, managing contracts, and ensuring seamless communication with HMO providers.\n\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tOnboard new HMO partners and negotiate tariffs\n\tManage contracts and submit medical claims\n\tFollow up on reimbursements and ensure proper documentation\n\tCommunicate professionally with HMO providers via email and calls.\n\n\nRequirements\n\n\n\tInterested candidates should possess a Bachelor's Degree with 2 - 3 years of experience.\n\tPrior experience with HMO processes and health insurance communication\n\tProactive, organized, and detail-oriented\n\tExcellent communication and negotiation skills.\n\n\nSalary\nN150,000 / Month.\n\nBenefits\n\n\n\tAccommodation available.\n\n\nMethod of Application\nInterested and qualified candidates should send their updated CV to: hrprestigiousconsulting@outlook.com using the Job Position as the subject of the email.\n\nNote: Interested candidates should be available to resume immediately.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Club Manager Job at Quicky Chillis",
    "link": "https://www.jobgurus.com.ng/jobs/view/club-manager-job-at-quicky-chillis",
    "pubDate": "Tue, 08 Jul 2025 16:49:02 GMT",
    "source": "JobGurus",
    "keyword": "quicky chillis",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Quicky Chillis, a 24-hour restaurant at Governor's Road, Ikotun, Lagos, is recruiting suitably qualified candidates to fill the position below:\n\nJob Position: Club Manager\nJob Location: Ikotun, Lagos\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tStaff management: Supervising bartenders, security, DJs, and other staff.\n\tCustomer service: Ensuring patrons have a positive experience.\n\tEvent planning: Coordinating theme nights, live performances, and special events.\n\tMarketing and promotion: Promoting the club through social media, advertising, and events.\n\tFinancial management: Managing budgets, inventory, and revenue.\n\tSafety and security: Ensuring a safe environment for patrons and staff.\n\tCompliance: Adhering to laws, regulations, and licensing requirements.\n\tInventory management: Managing liquor, supplies, and equipment.\n\tConflict resolution: Handling customer complaints and resolving issues.\n\tLeadership: Motivating and managing staff.\n\tCommunication: Effective communication with staff, patrons, and stakeholders.\n\tProblem-solving: Handling unexpected issues and finding solutions.\n\tTime management: Managing multiple tasks and responsibilities.\n\n\nRequirements\n\n\n\tInterested candidates should possess an HND / B.Sc / Master's Degree with 5 - 10 years of work experience.\n\n\nSalary\nN200,000 - N250,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: chilisbyebevande247@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]