[
  {
    "title": "IT Support Specialist Job at Bricks Mursten Mattoni Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/it-support-specialist-job-at-bricks-mursten-mattoni-limited",
    "pubDate": "Thu, 19 Jun 2025 16:46:53 GMT",
    "source": "JobGurus",
    "keyword": "bricks mursten mattoni limited",
    "duplicate": false,
    "classifications": [
      "Software Engineering"
    ],
    "content": "Bricks Mursten Mattoni Limited was established in 2008 with the aim of providing a comprehensive package of services, tailored to our client’s requirements in the chain of sectors. The size of our organization still allows us to offer personal services in the true sense of the word based on reliability, punctuality and effectiveness.\n\nWe are recruiting to fill the position below:\n\nJob Position: IT Support Specialist\n\nJob Location: Lagos\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a highly skilled IT Support Specialist to join our team and provide in-house technical support.\n\tThe ideal candidate must possess strong IT skills, including expertise in backend and frontend web development, Microsoft technologies, and other relevant IT competencies with a proven track record in driving business growth and expansion.\n\n\nKey Responsibilities\n\n\n\tProvide technical support for in-house systems and troubleshoot IT-related issues efficiently.\n\tMaintain and improve backend/frontend web applications, ensuring optimal functionality.\n\tManage and support applications deployed by the organization.\n\tInstall, configure, and maintain hardware, software, and networks.\n\tEnsure cybersecurity measures are in place and best practices are followed.\n\tAssist in training employees on IT tools and best practices.\n\tEnsure appropriate regulations and controls are implemented accordingly, especially during routine maintenance activities.\n\tPerform IT/additional tasks as assigned by MD and the management Team.\n\n\nRequirements\n\n\n\tCandidates should possess a Degree / National Diploma or a Professional qualification in the field of IT with 3- 5 years of work experience in IT. (Professional IT Training Certification with significant experience may be considered)\n\tProficiency in backend and frontend web development (WordPress, HTML, CSS, JavaScript, PHP, etc.), website management.\n\tStrong knowledge of Microsoft technologies (Office 365, Windows Server, Azure, etc.).\n\tExperience in networking, cybersecurity, and general IT infrastructure support.\n\tProblem-solving mindset with excellent communication and troubleshooting skills.\n\tAbility to work independently and efficiently in a fast-paced environment. Proven\n\tMaritime experience will be an added advantage.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and Cover Letter as a single PDF file to: careers@brickslimited.com using the Job Position as the subject of the email.\n\nNote: Only shortlisted candidates will be contacted    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Record Officer / Store Officer Job at Northbury British School",
    "link": "https://www.jobgurus.com.ng/jobs/view/record-officer-store-officer-job-at-northbury-british-school",
    "pubDate": "Thu, 19 Jun 2025 16:46:53 GMT",
    "source": "JobGurus",
    "keyword": "northbury british school",
    "duplicate": false,
    "classifications": [],
    "content": "Northbury British School Kano is one of the leading International Schools in Kano located at No 1 Ibrahim Dabo Road, Tarauni, Kano. A serene and secured learning environment that provides pupils/students with unique and exceptional learning experiences with state-of-the-art facilities, well-trained teachers and classroom technologies.\n\nWe are recruiting to fill the position below:\n\nJob Position: Record Officer / Store Officer\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nRequirements\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tCandidates should possess relevant qualifications and experience.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: northburybritishschool@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Marketing Manager /  IT Personnel Job at Audacia Properties",
    "link": "https://www.jobgurus.com.ng/jobs/view/marketing-manager-it-personnel-job-at-audacia-properties",
    "pubDate": "Thu, 19 Jun 2025 16:46:53 GMT",
    "source": "JobGurus",
    "keyword": "audacia properties",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Audacia Properties, a real estate company, is recruiting to fill the position below:\n\nJob Position: Marketing Manager /  IT Personnel\n\nJob Location: Lekki, Lagos\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDevelop and implement comprehensive marketing strategies to increase brand visibility, customer acquisition, and revenue growth.\n\tManage and coordinate all marketing, advertising, and promotional activities.\n\tLead the development and execution of content marketing, social media, and digital campaigns.\n\tAnalyze market trends, customer behavior, and competitor activities to identify opportunities and challenges.\n\tOversee the creation and distribution of marketing materials such as brochures, presentations, newsletters, and press releases.\n\tManage the marketing budget and allocate resources effectively across campaigns and projects.\n\tTrack performance metrics and prepare regular reports on campaign effectiveness, ROI, and KPIs.\n\tCollaborate with sales, product, and business development teams to align marketing efforts with company goals.\n\tSupervise and mentor members of the marketing team, providing guidance and professional development support.\n\tCoordinate with external vendors, creative agencies, and media contacts when necessary.\n\tEnsure consistent brand messaging and tone across all touchpoints.\n\n\nRequirements\n\n\n\tInterested candidates should possess a Bachelor's Degree with 2 - 3 years of work experience.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and Portfolio to: recruitment@myaudacia.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Fund Accountant Job at DLM Capital Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/fund-accountant-job-at-dlm-capital-group",
    "pubDate": "Thu, 19 Jun 2025 16:46:53 GMT",
    "source": "JobGurus",
    "keyword": "dlm capital group",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "DLM Capital Group - We are a leading investment management firm that offer bespoke investment and trust solutions to institutional and retail clients across Nigeria and Africa. We are committed to delivering superior value through innovation, trust, and long-term partnerships. We are committed to delivering consistent performance and transparency through innovative investment strategies, superior research, and robust risk management practices. We are a leading investment management firm providing tailored asset management solutions to institutional and individual investors.\n\nWe are recruiting to fill the position below:\n\nJob Position: Fund Accountant\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Location: Ikoyi, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tAs we expand our operations, we are looking to hire a detail-oriented and experienced Fund Accountant to join our dynamic team.\n\tThis role is vital in supporting the integrity of our financial reporting, ensuring compliance with regulatory requirements, and enabling sound investment decisions.\n\tThe Fund Accountant will be responsible for the accurate and timely preparation of financial reports, daily and monthly NAV (Net Asset Value) computations, fund reconciliations, and regulatory submissions.\n\tThe ideal candidate will demonstrate deep knowledge of financial reporting within the asset management or investment fund space and a commitment to high standards of accuracy and control.\n\n\nKey Responsibilities\n\n\n\tPrepare and validate daily, weekly, and monthly Net Asset Valuations (NAVs) for assigned funds.\n\tMaintain accurate and up-to-date records of fund transactions including subscriptions, redemptions, investments, dividends, income, expenses, and distributions.\n\tPerform periodic reconciliations of fund positions with custodians, brokers, and fund administrators.\n\tAssist in the preparation of annual audits, liaising with external auditors and ensuring timely audit completion.\n\tMonitor and account for fund-related accruals such as management fees, performance fees, taxes, and other expenses.\n\tGenerate periodic financial statements in accordance with IFRS and applicable fund reporting standards.\n\tEnsure compliance with regulatory and statutory guidelines (e.g., SEC, PENCOM, FRCN) as applicable to the fund structure.\n\tWork collaboratively with the Portfolio Management, Compliance, Risk, and Operations teams to ensure financial integrity and transparency.\n\tStay abreast of changes in accounting standards, capital markets, and investment product developments.\n\n\nCandidate Requirements\n\n\n\tBachelor’s Degree or HND in Accounting, Finance, Economics, or a related discipline.\n\t3 - 5 years of relevant experience in fund accounting, investment management, asset management, or financial services.\n\tRelevant professional qualifications such as ACA, ACCA, or CFA (or in advanced stages) will be an added advantage.\n\tStrong understanding of investment fund structures, securities valuation, IFRS, and financial markets.\n\tProficiency in financial software and tools (e.g., Microsoft Excel, accounting platforms, fund accounting systems).\n\tAbility to work with precision under tight deadlines in a fast-paced environment.\n\tStrong analytical and problem-solving abilities with high attention to detail.\n\tExcellent verbal and written communication skills.\n\tDemonstrated integrity and professionalism in handling confidential and sensitive information.\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Front Desk Executive Job at Kayode Obembe Properties Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/front-desk-executive-job-at-kayode-obembe-properties-limited",
    "pubDate": "Thu, 19 Jun 2025 16:46:53 GMT",
    "source": "JobGurus",
    "keyword": "kayode obembe properties limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Kayode Obembe Properties Limited is a real estate firm incorporated and registered in Nigeria as a limited liability company. We are setting out new standards in delivering properties in real estate sectors. Our company acquires develops, sell/lease and manage properties and real estate products in choice location across the country.\n\nWe are recruiting to fill the position below:\n\nJob Position: Front Desk Executive\n\nJob Location: Chevron, Lagos\nEmployment Type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tMeeting and greeting clients.\n\tKeeping the reception area tidy.\n\tAnswering and forwarding phone calls.\n\tConsultants/Realtors Management.\n\tFollow up on client payments, Receipt Issuing.\n\tFollow up with Realtors/Consultants and ensure sales from the above–mentioned.\n\tSourcing more consultants and establishing new business\n\tMaintain accurate records of business transactions.\n\tE-mail marketing & bulk SMS management.\n\tClient database management/client management follow-up.\n\tFollow up with inventory and impress for office use.\n\tAiming to achieve the best from Realtors/Consultants.\n\tDocument and give a formal report on Realtors/Consultants.\n\tAnd any other duties assigned to you by the Management.\n\n\nRequirements:\n\n\n\tCandidates should possess a Bachelor's Degree qualification with at least 2 years of work experience.\n\tReal Estate background will be an added advantage.\n\tMust reside at Ajah and its Environs.\n\tMust be a female.\n\n\nSalary\nN70,000 / Month.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: recruitment4kayodeobembepro@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]