[
  {
    "title": "Crewing & Personnel Logistics Officer Job at Tilone Subsea Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/crewing-personnel-logistics-officer-job-at-tilone-subsea-limited",
    "pubDate": "Mon, 16 Jun 2025 12:33:14 GMT",
    "source": "JobGurus",
    "keyword": "tilone subsea limited",
    "duplicate": false,
    "classifications": [],
    "content": "Tilone Subsea Limited is a Marine Contracting, Subsea Inspection, Maintenance and Repair (I.M.R.), and E.P.C.I.C. company located in Port Harcourt, Rivers State. We are currently looking for suitable and qualified applicants forthe positions of Crewing & Personnel Logistics Officer to join our reputable organization.\n\nWe are recruiting to fill the position below:\n\nJob Position: Crewing & Personnel Logistics Officer\n\nJob Location: Port Harcourt, Rivers\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDeployment and rotation of the crew\n\tManaging crew documentation and certification\n\tArranging travel and accommodations for the crew\n\tMaintaining accurate records and documentation\n\tConducting audits and inspections\n\tLiaising with stakeholders, crew members, and logistics providers\n\tCoordinating transportation and visas\n\tManaging crew logistics and supply chain\n\tEnsuring compliance with maritime regulations and standards\n\tCoordinating with other departments (e.g., operations, HR)\n\tProviding updates and reports on crewing and logistics\n\tResolving crewing and logistics issues\n\tTroubleshooting problems and finding solutions\n\tCollaborating with others to resolve issues\n\tMaintaining crew databases and records\n\tManaging budgets and costs related to crewing and logistics.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: admin.hr@tilone.ne copy to: oromichealakpodiete@yahoo.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Front Desk Executive Job at Brainshare Technologies & Services Nigeria Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/front-desk-executive-job-at-brainshare-technologies-services-nigeria-limited-5",
    "pubDate": "Mon, 16 Jun 2025 12:33:14 GMT",
    "source": "JobGurus",
    "keyword": "brainshare technologies & services nigeria limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Brainshare Technologies is a Telecom services provider. We provider internet services and other value added services through our fiber optic infrastructure.\n\nWe are recruiting to fill the position below:\n\nJob Position: Front Desk Executive\n\nJob Location: Lekki Phase 1, Lagos\nEmployment Type: Full-time\n\nMain Duties\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tManage incoming and outgoing mails, packages and deliveries and route to the appropriate department.\n\tAnswer and direct calls to the appropriate department or staff member.\n\tMaintain a clean and organized front desk area and board room.\n\tMaintaining a positive, empathetic and professional attitude toward Customers at all times.\n\tKeeping records of Customer interactions, transactions, comments and complaints.\n\tAssist with administrative tasks as needed, such as data entry, filing and document preparation.\n\tEngage Customer over phone and direct them to Customer Support Unit for prompt resolution.\n\tManage the organization website chat bot or other inquiry.\n\tSchedule appointments and meetings for staff members.\n\tEnsure Customer satisfaction and provide professional Customer support at all times.\n\tBuild sustainable relationships and trust with external and internal Customers.\n\tLiaise with Customer Support on fault resolutions and Customer account reconciliation.\n\tManage the social media of the organization.\n\tManage the delivery of parcel/order.\n\tFollow communication procedures, guidelines and policies.\n\tAny other tasks assigned to you by the Management.\n\n\nPersonal Qualities & Qualifications\nRequirements:\nDemand on the Job:\n\n\n\tDegree holder in Mass Communication, English or related discipline from a reputable higher institution.\n\tMust have least 3 years of cognate experience in Front Office Management post NYSC.\n\tExcellent communication skills, both written and verbal.\n\tFemale only with commanding personality.\n\tComputer proficiency with knowledge of Microsoft Office.\n\tAbility to multitask and prioritize tasks effectively.\n\tAbility to work under none or minimal supervision.\n\tProximity to Lekki Phase 1.\n\tMaybe required to work weekend once in a while.\n\n\nJob Holder need to be:\n\n\n\tProblem-solving skills.\n\tAbility to communicate clearly.\n\tA highly effective individual who has an absolute eye for detail and is focused on improving business performance.\n\tService and process knowledge.\n\tFriendly attitude.\n\tStrong time Management.\n\tMust possess excellent customer interface, analytical and presentation skills and be able to influence internal and external organizations.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and picture to: careers@brainshare.ng using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Hotel Facility Manager Job at Invealth Partners Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/hotel-facility-manager-job-at-invealth-partners-limited",
    "pubDate": "Mon, 16 Jun 2025 12:33:14 GMT",
    "source": "JobGurus",
    "keyword": "invealth partners limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "(adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\nInvealth Partners Limited is an Investment and Management company with a focus on creating investment opportunities and strategic partnerships in the African continent. The company is poised to create efficiency and viability in the Infrastructure, healthcare, energy, retail and commodity sector while attracting investment and management of this portfolio to ensure sustainable growth and directly impact on service delivery across targeted ecosystems.  Invealths strategy is one that takes advantage of the need for entry into the African opportunity marmet and developes strategies, models and vehicles that are familiar to investors especially financial management and value growth over an acceptable period. Our company and processes are designed to give investor confidence, and we have a due diligence process that ensures that we only partner in the value based solutions.\n\nInvealth Partners serve to create a link between business opportunities and investors, either private or institutional, with a mid to long-term overview. Our business focus is guided by a strong Environment, Social and Government partnership justification. Africa is the next investment destination…Invealth provides the strategic partnership that provides holistic value.\n\nWe are recruiting to fill the position below:\n\nJob Position: Hotel Facility Manager\nJob Location: Abuja (FCT)\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tThe Hotel Facility Manager is responsible for overseeing the maintenance, safety, and functionality of all hotel facilities and infrastructure.\n\tThis role ensures that the hotel environment is safe, comfortable, and compliant with regulatory standards, supporting exceptional guest experiences and operational efficiency.\n\tThe Facility Manager must have a strong understanding of hotel operations, building systems, and facility management best practices.\n\n\nMain Duties\n\n\n\tSupervise daily maintenance activities, including HVAC, plumbing, electrical, and general repairs, ensuring all hotel facilities are in optimal working condition.\n\tDevelop and implement preventive maintenance schedules for all equipment and systems to minimize downtime and extend asset life.\n\tMonitor and manage facility budgets, including expenditures for repairs, supplies, and contracted services.\n\tMaintain accurate records of maintenance activities, inspections, and repairs in compliance with hotel policies and regulatory requirements.\n\tCollaborate with the housekeeping and front office teams to address facility-related guest complaints and ensure timely resolution.\n\tSupport the procurement of maintenance supplies and negotiate contracts with service providers to achieve cost savings.\n\tLead and train the facility maintenance team, fostering a culture of safety, accountability, and continuous improvement.\n\tParticipate in hotel management meetings, providing updates on facility projects, challenges, and performance metrics.\n\tOversee compliance with health, safety, and environmental regulations, conducting regular inspections and addressing any issues promptly.\n\tCoordinate with external vendors and contractors for specialized repairs, renovations, and routine servicing.\n\tRespond swiftly to facility-related emergencies, ensuring prompt resolution to minimize guest inconvenience and operational disruption.\n\tPrepare and present regular reports on facility status, maintenance costs, and key performance indicators (KPIs) to hotel management.\n\tDevelop and enforce internal controls to safeguard hotel assets and ensure compliance with operational standards.\n\tStay updated on industry trends, new technologies, and best practices in facility management.\n\tEngage in professional development activities to enhance technical and managerial skills.\n\n\nRequirements\n\n\n\tBachelor’s degree in Facility Management, Engineering, Hospitality Management, or a related field (required).\n\tMinimum of 3 years of experience in facility management, preferably within the hospitality industry.\n\tStrong knowledge of building systems (HVAC, electrical, plumbing) and facility management best practices.\n\tProficient in facility management software and Microsoft Office Suite.\n\tExcellent analytical, organizational, and problem-solving skills.\n\tStrong communication and leadership abilities for effective team and stakeholder interaction.\n\tKnowledge of Nigerian health, safety, and environmental regulations applicable to hotels.\n\n\nSalary\nN150,000 - N200,000    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Managing Director Job at DOAH Enterprise",
    "link": "https://www.jobgurus.com.ng/jobs/view/managing-director-job-at-doah-enterprise-2",
    "pubDate": "Mon, 16 Jun 2025 12:33:14 GMT",
    "source": "JobGurus",
    "keyword": "doah enterprise",
    "duplicate": false,
    "classifications": [],
    "content": "DOAH Enterprise - Our client, a reputable Asset Management company based in Lagos, is recruiting to fill the position below:\n\nJob Position: Managing Director\nJob Location: Lagos\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are searching for a Managing Director for a reputable Asset Management Company based in Lagos.\n\tIf you’re a visionary leader with a proven track record in asset management or financial services and ready for your next big move, we’d love to hear from you.\n\n\nMethod of Application\nInterested and qualifed candidates should their CV and Cover Letter to: jobs@doahenterprise.com using \"Managing Director - Asset Management\" as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Social Media Manager Job at 42 Engineering Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/social-media-manager-job-at-42-engineering-limited",
    "pubDate": "Mon, 16 Jun 2025 12:33:14 GMT",
    "source": "JobGurus",
    "keyword": "42 engineering limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "42 Engineering Limited is a leading engineering firm that delivers innovative solutions for our clients.\n\nWe are recruiting to fill the position below:\n\nJob Position: Social Media Manager\nJob Location: Remote\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe're seeking a creative and experienced Social Media Manager to join our marketing team and work remotely.\n\tAs a Social Media Manager, you'll develop and implement our social media strategy, creating engaging content and building our online presence.\n\tYou'll work closely with our team to drive brand awareness, generate leads, and build a strong online community, all while working from the comfort of your own home.\n\n\nResponsibilities\n\n\n\tDevelop and execute social media strategies across multiple platforms (Facebook, Twitter, LinkedIn, Instagram, etc.)\n\tCreate and curate high-quality, engaging content (posts, stories, videos, etc.)\n\tManage and schedule content using social media management tools\n\tMonitor and respond to comments, messages, and reviews\n\tAnalyze social media metrics and adjust strategies accordingly\n\tCollaborate with the marketing team to align social media efforts with overall marketing goals\n\n\nRequirements\n\n\n\t1 - 3+ years of experience in social media management or a related field\n\tStrong understanding of social media platforms and their audiences\n\tAbility to work independently and manage time effectively in a remote setting\n\tStrong analytical and problem-solving skills\n\tReliable internet connection and suitable computer equipment\n\n\nNice to Have:\n\n\n\tExperience with social media management tools (Hootsuite, Sprout Social, etc.)\n\tKnowledge of graphic design software (Adobe Creative Suite, etc.)\n\tFamiliarity with video production and editing software\n\tCertification in social media marketing or a related field\n\n\nWhat We Offer\n\n\n\tSalary: N450,000 - N700,000 Monthly.\n\tCompetitive salary and benefits package\n\tOpportunity to work with a leading engineering firm\n\tFully remote work arrangement with flexible hours\n\tProfessional development opportunities\n\tCollaborative and dynamic team environment (virtual)\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: talktochris10.e@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]