[
  {
    "title": "Job Vacancies at Carlcare Development",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancies-at-carlcare-development",
    "pubDate": "Wed, 10 Dec 2025 18:25:10 GMT",
    "source": "JobGurus",
    "keyword": "carlcare development",
    "duplicate": false,
    "classifications": [],
    "content": "Carlcare Development, formerly known as Tecno Telecoms - established in July 2006, is a high-tech company specializing in the R&D, production, sale and service of mobile communication products. After years of development, Carlcare Development has become an important part of the mobile phone industry and one of the major mobile phone manufacturers in the world. Currently, it has full ownership of three famous mobile phone brands TECNO, itel and Infinix, and an after-sales service brand Carlcare.\n\nWe are recruiting to fill the following positions below:\n\n1.) Data Entry Specialist\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nAbout the Role\n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are looking for a detail-oriented Data Entry Specialist to join our team in Ikeja. The successful candidate will be responsible for accurately entering, updating, and maintaining data across our systems while ensuring accuracy and confidentiality.\n\n\nResponsibilities\n\n\n\tEnter and update data in spreadsheets and internal databases\n\tClean, verify, and organize data for accuracy\n\tUse Excel functions (VLOOKUP, Pivot Tables, basic formulas) for data management\n\tGenerate simple reports as needed\n\tIdentify and correct data inconsistencies\n\tSupport the team with other data-related tasks\n\n\nRequirements\n\n\n\tCandidates should possess an OND/HND/Bachelor’s degree in any field with 1–3 years relevant experience\n\tStrong proficiency in Microsoft Excel\n\tFast and accurate typing skills\n\tHigh attention to detail\n\tGood communication and organizational skills\n\tAbility to work independently and meet deadlines.\n\n\nApplication Closing Date: 17th December, 2025.\n\nMethod of Application \nInterested and qualified candidates should send their CV to: adebayo.deborah@transsion.com using the Job Position as the subject of the email\n\n \n\n \n\n2.) Solar Engineer\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe are seeking a skilled Solar Energy Engineer to join our team in Lagos.\n\tThe ideal candidate will be responsible for designing, installing, and maintaining solar power systems, ensuring optimal performance and compliance with industry standards.\n\tThis role requires strong technical knowledge, hands-on experience, and the ability to troubleshoot system issues effectively.\n\n\nKey Responsibilities\n\n\n\tDesign and develop solar photovoltaic (PV) systems for residential, commercial, or industrial use\n\tConduct site assessments and prepare technical proposals\n\tInstall, test, and commission solar power systems\n\tPerform routine inspections, maintenance, and troubleshooting of solar installations\n\tEnsure compliance with electrical standards and safety regulations\n\tPrepare technical reports, system documentation, and performance analysis\n\tProvide technical support and guidance to clients and internal teams\n\tStay updated on new solar technologies and industry trends\n\n\nRequirements\n\n\n\tDegree in Electrical Engineering, Renewable Energy, or related field\n\t2 - 5 years of hands-on experience with solar PV systems\n\tStrong understanding of solar system design, wiring, inverters, and electrical components\n\tAbility to read technical drawings and electrical schematics\n\tExcellent troubleshooting and analytical skills\n\tStrong attention to detail and commitment to safety\n\tGood communication and teamwork abilities\n\n\nApplication Closing Date: 24th December, 2025.\n\nMethod of Application \nInterested and qualified candidates should send their CV to: adebayo.deborah@transsion.com using the Job Position as the subject of the email.\n\n \n\n \n\n3.) Solar Technician\n\nJob Location: Oyo\n\nJob Summary\n\n\n\tThe Solar Technician will be responsible for installing, maintaining, and repairing solar power systems for residential, commercial, and industrial clients.\n\tThe ideal candidate must have hands-on experience with solar installations and a strong understanding of electrical systems.\n\n\nKey Responsibilities\n\n\n\tInstall, test, and commission solar power systems, including panels, inverters, batteries, and mounting structures.\n\tConduct routine maintenance on solar installations to ensure optimal performance.\n\tTroubleshoot system faults and carry out necessary repairs.\n\tPerform site assessments and determine system design requirements.\n\tEnsure all installations comply with safety standards and company procedures.\n\tPrepare service reports and maintain accurate documentation.\n\tEducate customers on system usage, basic troubleshooting, and safety guidelines.\n\tCollaborate with the engineering and sales teams to support project delivery.\n\tMonitor system performance and recommend upgrades or improvements.\n\n\nRequirements & Qualifications\n\n\n\tOND / HND / B.Sc in Electrical Engineering, Renewable Energy, or related field.\n\t1 - 3 years of proven experience as a Solar Technician or in a similar role.\n\tStrong knowledge of solar PV systems, inverters, batteries (including lithium), and electrical wiring.\n\tGood problem-solving and troubleshooting skills.\n\tPhysical fitness and ability to work at heights.\n\tExcellent communication and customer service skills.\n\tMust reside in Ibadan or be willing to relocate.\n\n\nApplication Closing Date: 12th December, 2025.\n\nMethod of Application \nInterested and qualified candidates should send their CV to: adebayo.deborah@transsion.com using the Job Position as the subject of the email.\n\n     \n\n    \n\n        Click here to Apply",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]