[
  {
    "title": "Sales and Marketing Officer Job at Brilliant Performance Solutions Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/sales-and-marketing-officer-job-at-brilliant-performance-solutions-limited",
    "pubDate": "Sat, 05 Jul 2025 18:19:27 GMT",
    "source": "JobGurus",
    "keyword": "brilliant performance solutions limited",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance"
    ],
    "content": "Brilliant Performance Solutions Limited - Our client is a Group of Companies that are into Computers, Tower erection, Telecom and power system. Our client has its Office at Ajah in Lagos. \n\nThey are recruiting to fill the position below:\n\nJob Posiiton: Sales and Marketing Officer\n\nJob Location: Ajah, Lagos\nEmployment Type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDue to increasing activities, our client urgently desires the services of sales and marketing officers who has at least 3 years’ experience in marketing similar products.\n\tCandidates who have been in selling in other industry will be considered.\n\tAdditionally, this person must possess a minimum of a Diploma in any relevant field.\n\n\nJob Responsibilities\n\n\n\tSetting targets, creating performance plans and maintaining standards for sale representatives\n\tPlanning the sales strategy and Optimization of sales\n\tSearching for clients who might benefit from the company’s products\n\tDocumentation and control of target achievement\n\tDevelop a scalable sales process and ensure representatives adhere to it correctly\n\tPlan and preside over weekly sales team meetings\n\tNegotiation of terms and contracts with clients\n\tReporting to the Managing Director\n\tMaintain a deep understanding of customer needs and monitor their preferences\n\tResolve escalated customer issues and customer complaints regarding sales and service\n\tTracking sales team metrics and sharing them with company leadership\n\tProvide pre-sales and post-sales service support and assistance\n\tAttend marketing events (e.g. conferences or trade shows) representing the company\n\tProviding training and professional development to the sales team\n\tCreating sales goals and implementing initiatives to increase sales\n\tAssisting sales team members to build quality relationships with customers\n\tCollaboration with other company departments, such as marketing or finance, to offer customer support\n\tDeveloping strategies for increasing market share\n\tEnsuring that sales team members follow up with potential customers\n\tGenerating reports and data for sales analysis\n\tHandling escalated client objections and concerns to support other members of the sales team\n\tAny other assignment.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: bphotjobs@gmail.com or jobmasters2020@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Graphics Designer Job at 5thWall Consulting",
    "link": "https://www.jobgurus.com.ng/jobs/view/graphics-designer-job-at-5thwall-consulting",
    "pubDate": "Sat, 05 Jul 2025 18:19:27 GMT",
    "source": "JobGurus",
    "keyword": "5thwall consulting",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance"
    ],
    "content": "At 5thWall Consulting, we are a dynamic outsourcing firm dedicated to providing end-to-end recruitment solutions for businesses across various industries. We specialize in helping organizations attract, assess, and hire top talent that aligns with their goals and culture.\n\nWe are recruiting to fill the position below:\n\nJob Position: Graphics Designer\nJob Location: Lekki, Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a skilled Graphic Designer to create visually appealing and effective designs that communicate our brand's message.\n\tThe ideal candidate will have expertise in graphic design, branding, and visual communication.\n\n\nKey Responsibilities\nVisual Content Creation:\n\n\n\tDevelop creative visual content for both online and offline platforms including social media posts, brochures, flyers, banners, billboards, newsletters, proposals, presentations, property portfolios, and magazines.\n\tDesign inspection templates, project layouts, marketing campaigns, and brand-related promotional materials.\n\tEnsure all designs align with the company's brand identity, color palette, and communication guidelines.\n\n\nSocial Media & Digital Content Support:\n\n\n\tCollaborate with the Social Media Manager and Content Creator to produce visually appealing content tailored for platforms like Instagram, Facebook, LinkedIn, Twitter, and the company's website.\n\tCreate graphics for daily social media content, paid advertisements, announcements, property listings, and campaigns.\n\tAdapt designs for different platforms while maintaining brand consistency.\n\n\nBrand Identity Management:\n\n\n\tMaintain and improve the visual consistency of the company's brand across all materials and platforms.\n\tSupport the development of brand guidelines and ensure all departments and third-party vendors adhere to it.\n\tRegularly propose ideas to strengthen the company's visual identity to appeal to both clients and partners.\n\n\nMarketing and Promotional Material Development:\n\n\n\tDesign all marketing and promotional materials used for property launches, open houses, client engagement events, site inspections, and digital campaigns.\n\tCollaborate with the Sales, Marketing, and Business Development teams to provide visual support for campaigns and proposals.\n\tAssist in developing storyboards and visual concepts for marketing videos and virtual property tours.\n\n\nSupport for Client Presentations & Proposals:\n\n\n\tDesign client-facing materials such as proposals, investment brochures, inspection reports, site layouts, and presentations to make them visually professional and client-friendly.\n\tWork with the CEO, COO, HOO and Sales Team to create customized graphics for client proposals and pitch decks.\n\n\nCollaboration with Creative & Marketing Teams:\n\n\n\tWork closely with the Creative Department, Content Creators, Social Media Manager, Digital Marketers, and Project Teams to ensure all campaigns have appropriate visual assets.\n\tProvide graphics support for internal and external communication needs of the company.\n\tParticipate in brainstorming sessions for creative content planning and campaign execution.\n\n\nPrinting & Production Oversight:\n\n\n\tLiaise with print vendors for the production of high-quality printed materials such as banners, branded bags, branded gifts, roll-ups, flyers, and corporate documents.\n\tEnsure proper supervision of print quality, color accuracy, and timely delivery of printed materials.\n\tManage print-related budgets and provide recommendations for cost-effective production.\n\n\nContent Scheduling & Deadlines:\n\n\n\tWork in line with content calendars and project schedules to ensure all graphics are ready for timely posting or printing.\n\tPrioritize tasks to meet project deadlines, client appointments, and company events.\n\tCommunicate any challenges affecting timelines to the Creative Lead or HOO promptly.\n\n\nInnovation & Trend Monitoring:\n\n\n\tStay up to date with industry trends, creative design techniques, and new software tools to consistently improve the quality of designs.\n\tRecommend and introduce innovative design styles suitable for real estate marketing.\n\tResearch competitors' designs and industry-leading real estate visuals to maintain a competitive edge.\n\n\nArchiving & Documentation:\n\n\n\tProperly archive all design projects and ensure backup of creative assets for future reference or modification.\n\tMaintain an organized database of all design resources, templates, and company-owned media files.\n\n\nOther Duties:\n\n\n\tHandle any additional tasks or special projects assigned by the Management.\n\tAct as a backup in certain administrative functions when required.\n\tProvide general support in office management to maintain an organized and professional work environment.\n\n\nQualifications & Experience\n\n\n\tBachelor’s Degree in graphic design, visual communications, or any related field.\n\tProficiency in graphic design software such as Adobe Creative Suite (Photoshop, Illustrator, InDesign, Sketch, CorelDRAW, etc.\n\tKnowledge of print and digital design techniques and processes.\n\tAttention to detail and strong organizational skills to manage multiple projects and deadlines.\n\tCollaborative skills to work effectively with other designers, clients, and stakeholders.\n\tAbility to adapt to feedback and make revisions to designs as needed.\n\tStrong understanding of typography, color theory, and composition.\n\tCreative thinking and problem-solving skills to develop original and innovative design concepts.\n\tAbility to effectively communicate visual ideas and concepts to clients and team members.\n\tUnderstanding of current design trends and best practices in the industry.\n\tKnowledge of HTML, CSS, and other web design tools can be beneficial for creating interactive and responsive designs.\n\n\nKey Skills and Competencies:\n\n\n\tProficiency in Adobe Creative Suite (Photoshop, Illustrator, InDesign, etc.)\n\tStrong understanding of color theory, typography, and composition\n\tExcellent design skills, with attention to detail and creativity\n\tAbility to work on multiple projects simultaneously and meet deadlines\n\tStrong communication and collaboration skills\n\n\nCompetences:\n\n\n\tVisual design and creativity\n\tTechnical expertise in graphic design software\n\tAttention to detail and quality control\n\tTime management and organizational skills\n\tEffective communication and collaboration\n\n\nSalary\nN250,000 - N300,000 Monthly.\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Videographer Job at 5thWall Consulting",
    "link": "https://www.jobgurus.com.ng/jobs/view/videographer-job-at-5thwall-consulting",
    "pubDate": "Sat, 05 Jul 2025 18:19:27 GMT",
    "source": "JobGurus",
    "keyword": "5thwall consulting",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "At 5thWall Consulting, we are a dynamic outsourcing firm dedicated to providing end-to-end recruitment solutions for businesses across various industries. We specialize in helping organizations attract, assess, and hire top talent that aligns with their goals and culture.\n\nWe are recruiting to fill the position below:\n\nJob Position: Videographer\nJob Location: Lekki-Ajah, Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are looking for a skilled Videographer to film and edit high-quality videos of properties, client testimonials, company events, and promotional content.\n\tOperate professional cameras, drones, lighting, and audio equipment to ensure the best video quality.\n\tAlso, stay up to date with industry trends and innovative video production techniques.\n\n\nKey Responsibilities\nVideo Production and Filming:\n\n\n\tStrategically plan, shoot, and edit video content that highlights property features, including company events, site updates, client testimonials and promotional content.\n\tCapture dynamic, high-quality footage during property inspections, office content, site updates, and company events, ensuring professional standards in resolution, lighting, and sound.\n\n\nCreative Collaboration and Concept Development:\n\n\n\tCollaborate with the Content Creator, Graphics Designer, and marketing team to develop creative concepts that align with the company's brand identity and strategic objectives.\n\tTranslate marketing briefs into visually engaging narratives through detailed storyboarding and script development.\n\n\nPost-Production and Editing:\n\n\n\tUtilize industry-standard editing software to transform raw footage into polished, professional video products.\n\tIncorporate motion graphics, music, and voice-overs seamlessly to enhance storytelling and overall production quality.\n\tOptimize final video outputs for a variety of digital platforms, including websites, social media channels, and email campaigns.\n\n\nTechnical Equipment Management:\n\n\n\tMaintain and manage video production equipment, including cameras, drones, lighting, and audio tools, ensuring optimal performance at all times.\n\tStay informed about emerging technologies and industry trends to continually improve production quality and efficiency.\n\tTroubleshoot technical issues promptly during both filming and editing stages.\n\n\nBrand Consistency and Storytelling:\n\n\n\tEnsure that all video content is consistent with the company's professional image, brand standards, and messaging.\n\tCraft engaging visual stories that not only showcase property details but also convey the lifestyle and community benefits associated with each development.\n\n\nProject Management and Timely Delivery:\n\n\n\tOversee multiple video projects concurrently, managing all phases from pre-production planning to final delivery.\n\tWork within established timelines and budgets, coordinating with cross-functional teams to ensure alignment with broader marketing campaigns.\n\tMaintain a well-organised archive of video assets for easy retrieval and future reference.\n\n\nPerformance Analysis and Continuous Improvement:\n\n\n\tMonitor video performance metrics across various platforms, gathering viewer feedback and insights to refine future projects.\n\tImplement best practices and innovative techniques to continuously enhance video quality and audience engagement.\n\tProvide regular updates and progress reports to the management team on ongoing projects and campaign outcomes.\n\n\nMiscellaneous Duties:\n\n\n\tHandle any additional tasks or special projects assigned by the Management.\n\tAct as a backup in certain administrative functions when required.\n\tProvide general support in office management to maintain an organised and professional work environment.\n\n\nQualifications & Requirements\n\n\n\tB.Sc in film, video production, or any related field\n\tProven experience as a Videographer, preferably in real estate or a related field.\n\tProficiency in video editing software such as Adobe Premiere Pro, Final Cut Pro\n\tProficiency in Davinci resolve, CapCut, After-effect.\n\tExperience operating Drones for aerial shots is a plus.\n\tAbility to manage time effectively and prioritize tasks.\n\tExcellent communication and interpersonal skills.\n\tProfessional appearance and demeanor.\n\tAbility to work independently and collaboratively in a fast-paced environment.\n\tExcellent attention to detail and creativity in visual storytelling.\n\tA portfolio or reel showcasing previous video work.\n\n\nKey Skills & Competencies:\nKey Skills:\n\n\n\tVideo production and filming\n\tEditing and post-production\n\tStoryboarding and script development\n\tMotion graphics and visual effects\n\tSound design and audio editing\n\tCamera operation and equipment management - Drone operation\n\tProject management and timely delivery\n\tCollaboration and teamwork\n\tAnalytical and problem-solving skills\n\tAttention to detail and creative vision\n\tProficiency in industry-standard software and equipment\n\n\nCompetences:\n\n\n\tCreative thinking and visual storytelling\n\tTechnical expertise in video production and editing\n\tAttention to detail and quality control\n\tTime management and organizational skills\n\tEffective communication and collaboration\n\tAdaptability and flexibility in a fast-paced environment\n\tContinuous learning and professional development.\n\n\nSalary\nN250,000 - N300,000 Monthly.\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Computer Engineer / Computer Science Lecturer Job at Brilliant Performance Solutions Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/computer-engineer-computer-science-lecturer-job-at-brilliant-performance-solutions-limited",
    "pubDate": "Sat, 05 Jul 2025 18:19:27 GMT",
    "source": "JobGurus",
    "keyword": "brilliant performance solutions limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Brilliant Performance Solutions Limited - Our client is a key player in the educational sector and currently operates a polytechnic in Ogba, Lagos.\n\nThey are recruiting to fill the position below:\n\nJob Position: Computer Engineer / Computer Science Lecturer\n\nJob Location: Ogba, Lagos\nEmployment Type: Full-time\n\nJob Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tTeach introductory computer technology and data management applications courses to underclassmen as part of the Institution’s general education core curriculum\n\tParticipate with other department faculty members in offering advanced computer science courses to students pursuing Diplomas in fields related to computer and information technology\n\tInstruct and mentor individual applied technology and computer science majors as they work their way through each departments’ undergraduate programs\n\tAssist department staff in managing and maintaining the Institution’s main computer lab, working rotating shifts to ensure it remains open for students during both day and evening hours\n\tCoordinate with faculty as well as outside personnel in discussing research opportunities, and represent department in requesting funding from Institution’s finance department\n\tDevelop curriculum to be used by department staff and to be published and shared with other academic institutions\n\tMake sure that the classroom is a stimulating environment that facilitates learning\n\tGenerate enthusiasm for the subject being taught and inspire all students to work to their potential\n\tLiaise with the Head of Department and learning support where a student may have special educational needs and with the form tutor and Head of House if a student is experiencing pastoral difficulties\n\tWork with department chair as well as the Institution’s admissions department annually to arrange class schedules for each academic semester\n\tMaintain regular office hours during the academic semester to be available to meet with students individually when needed\n\tPlan and prepare well-structured, clearly presented lessons appropriate to the abilities of all students and the syllabus being taught\n\tPromote high standards of behaviour by encouraging a positive, proactive approach to study and build productive relationships with students\n\tSet homework according to policy and pertinent to the student’s ability and wider workload\n\tPromote high standards of organisation\n\tBe punctual to lessons\n\tPromote high standards in the use of English as the common language and help develop English for academic progress\n\tProvide high quality, accurate, constructive and targeted information to parents at Parents' Evenings, in subject reports, incidental meetings and communications\n\tAssess, record and monitor the progress of all students according to faculty guidelines in order to provide accurate information to parents in a variety of forms, as and when neccessary.\n\n\nRequirements\n\n\n\tOur client urgently requires the services of a lecturer in Computer Science or Computer Engineering who has a minimum of a Bachelor`s Degree in Computer Science or Computer Engineering with at least 3 years of lecturing experience.\n\tOur client prefers a candidate who is resident in Lagos or any area close to Ogba or Berger, Lagos.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: bphotjobs@gmail.com or: jobmasters2020@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Bid & Proposal Specialist Job at Infinion Technologies",
    "link": "https://www.jobgurus.com.ng/jobs/view/bid-proposal-specialist-job-at-infinion-technologies",
    "pubDate": "Sat, 05 Jul 2025 18:19:27 GMT",
    "source": "JobGurus",
    "keyword": "infinion technologies",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "Infinion Technologies is a Microsoft-certified partner, we offer custom solutions to Enterprise businesses for business automation using the latest and sophisticated technologies. \n\nWe are recruiting to fill the position below:\n\nJob Position: Bid & Proposal Specialist\nJob Location: Lagos\nEmployment Type: Full-time\n\nAbout the Role\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a detail-oriented, highly organized Bid & Proposal Specialist to take ownership of the full bidding lifecycle across enterprise, government, and Microsoft-partner-driven opportunities.\n\tThis role is critical to driving our revenue growth and positioning us competitively in the market.\n\tThe successful candidate will work closely with cross-functional teams (Sales, Product, Legal, Finance, and People teams) to identify, prepare, submit, and track high-quality bids, tenders, and proposals that align with our solutions and strategic direction.\n\n\nKey Responsibilities\nBid Management & Ownership:\n\n\n\tOwn the end-to-end bid and proposal process: opportunity identification, response planning, documentation, submission, and post-bid review.\n\tMaintain a centralized bid tracker and ensure all bids are submitted on time and in compliance with client requirements.\n\tLead internal kick-off sessions to align stakeholders on bid strategy, responsibilities, and timelines.\n\n\nCollaboration & Coordination:\n\n\n\tCoordinate inputs from Sales, Product, Legal, Finance, HR, and Technology teams.\n\tLiaise with Microsoft Partner Account Managers or representatives to access relevant partner bid platforms and joint-selling opportunities.\n\tBuild and maintain a repository of reusable proposal content, templates, case studies, and compliance documents.\n\n\nDocumentation & Quality Assurance:\n\n\n\tEnsure all proposals are compelling, accurate, customized, and aligned with our service offerings.\n\tEdit and format content to meet brand and client-specific guidelines.\n\tReview final submissions for completeness and quality before delivery.\n\n\nReporting & Continuous Improvement:\n\n\n\tTrack win/loss ratios and analyze performance data to inform future bids.\n\tReport on bidding pipeline status weekly and flag any risks or blockers early.\n\tRecommend improvements to streamline and optimize the proposal process.\n\n\nQualifications & Skills\nEducation & Experience:\n\n\n\tBachelor’s degree in Business, Marketing, Communications, or a related field.\n\tMinimum 5 years of experience in a bid/proposal/tender management role (preferably in a technology, consulting environment).\n\tStrong understanding of the public sector, enterprise procurement processes, and OEM ecosystem (preferred).\n\n\nKey Competencies:\n\n\n\tExceptional project management and time management skills.\n\tHigh attention to detail and ability to manage multiple bids simultaneously.\n\tStrong written and verbal communication.\n\tProficiency in Microsoft Office Suite (especially Word and PowerPoint).\n\tFamiliarity with OEM Center, RFx portals, and CRM systems (a plus).\n\n\nSuccess Metrics:\n\n\n\t% of bids submitted on or before deadlines\n\tConversion rate from bids to shortlist or award\n\tInternal SLA compliance (gathering inputs, submission approvals)\n\tContribution to total revenue influenced by successful bids\n\n\nWhat We Offer\n\n\n\tOpportunity to work on strategic, revenue-impacting projects\n\tProfessional development within a fast-growing tech business\n\tA culture of ownership, learning, and innovation\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: careers@infinion.co using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]