[
  {
    "title": "Job Openings at DP World",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-dp-world-1",
    "pubDate": "Mon, 24 Nov 2025 18:50:53 GMT",
    "source": "JobGurus",
    "keyword": "dp world",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "DP World - We exist to make the world’s trade flow better, changing what’s possible for the customers and communities we serve globally. With a dedicated, diverse and professional team of more than 108,100 employees spanning 74 countries on six continents. We are pushing trade further and faster towards a seamless supply chain that’s fit for the future. We’re rapidly transforming and integrating our businesses - Ports and Terminals, Marine Services, Logistics and Technology – and uniting our global infrastructure with local expertise to create stronger, more efficient end-to-end supply chain solutions that can change the way the world trades.\n\nWe are recruiting to fill the following positions below:\n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n1.) Technical Superintendent\n\nJob Location: Lagos\n\nJob Summary\n\n\n\tResponsible for the overall management and technical operations of the vessels under his responsibility. This includes overseeing the daily maintenance and repair, budgeting, survey scheduling, onboard general assessment of vessels, inspections and docking when required.\n\tEnsure Company owned and managed vessels are operated in a safe, efficient and economical manner and in full compliance with Class and Statutory regulations.\n\tEnsure the assigned vessels are fully operational technically or otherwise managed accordingly to the management agreement requirements.\n\tTo maintain the classification status of the vessels under his charge and to ensure that the survey status reports are sent to the vessels on a monthly basis.\n\tSupport and monitor on-board Planned Preventive Maintenance to ensure cost effective management and effective implementation of this function.\n\tEnsure that Vessels Planned maintenance system is being operated and reported in the manner prescribed in the company’s standards and procedures.\n\tBudget responsibility for technical elements of the assigned vessels.\n\tResponsible for overseeing the installation and certification of 3rd party equipment on the vessels, such as Diving, ROV and other temporary equipment.\n\tLiaise with Vessel Masters and Chief Engineers as required and providing technical advice and assistance when necessary.\n\tIdentify and source for technical and operational supplies required for the vessels and ensure that the rates are most economical.\n\tCo-ordinate and supervise service repairs, utilizing approved sub-contractors as required and ensure all such repairs are completed in a timely and satisfactory manner and within the vessel’s set operational budget.\n\tPrepare accurate and comprehensive vessel dry-dock specifications and to supervise dry-dockings and repairs to completion as directed. Dry dockings and repairs may take place at a location remote from normal place of work.\n\tLiaising with repair yard management, sub-contractors, Class and Administration to ensure all works are carried out in accordance with agreed specifications and time schedules.\n\tProviding written reports as required, detailing in service repairs dry-docking repairs and surveys, including costs incurred during such activities.\n\tEnsure all relevant information regarding a vessel repair / docking is updated in the PMS system.\n\tLiaise with customers on technical and operational matters including vessel performance.\n\tLiaise with the Purchasing department to ensure that purchase requisitions are being tracked and expedited in a timely manner. Report to Fleet Manager when delays have the potential to impact on vessels operational capabilities. Ensure minimum spare requirements are met.\n\tPerform monthly review of logs processes and attend to vessel inspections and submit reports.\n\tResponsible for the control and updating of the vessel Technical Library (ship’s plans and drawings) as required.\n\tEnsure IMCA guidelines and “best industry practices” are adhered to at all times.\n\tOversee and give input to prepare tender documents including establishing costs/budgets/programs and be part of subsequent bid/tender evaluations.\n\tContribute to the appraisal and selection of repair yards and technical service providers.\n\tCarry out appraisals of Chief Engineers on board his vessel at end of their contract.\n\n\nOther:\n\n\n\tMaintain high technical knowledge and ensure personal development through training and self-development.\n\tUndertake any other Technical related assignments as and when required.\n\tParticipate in annual review and evaluate projects to determine success and how improvements can be made in the future report and present findings.\n\n\nMinimum Qualifications\n\n\n\tUnlimited STCW ’95 Chief Engineer’s license (Motor) sea going vessels or\n\tEngineering degree/diploma in mechanics/electromechanical engineering.\n\n\nClick here to apply online\n\n \n\n \n\n2.) Medical Representative\n\nJob Location: Lagos\n\nJob Function\n\n\n\tTo drive consistent sales growth and achievement of sales goals and targets in the country and in assigned key accounts by identifying opportunities and gaining new business while growing the existing business for Bayer Pharma and Bayer Consumer Health portfolio.\n\n\nKey Performance Areas\n\n\n\tPassion for Performance: Deliver strong sales and market share growth in the assigned territory.\n\tDeliver Growth: Achievement of sales, market share and growth objectives for the country through effective execution of agreed strategies and annual strategic brand plans.\n\tExcellence in Execution: Achieve effective and efficient territory coverage by delivering agreed pharmacy and HCP call rates aligned to the customer segmentation and targeting plan.\n\tKey Opinion Leaders and Stakeholder relationship management: Develop collaborative external and internal relationships that enhance customer care journey and channel feedback.\n\tCollaboration: Develop collaborative external and internal relationships that enhance customer journeys, channel customer feedback into the organization.\n\tEmbrace a performance driven and results-focused working culture that delivers on sales commitments.\n\tExpense budget management, financial control and procedures.\n\tOther duties as required by the KAM/BUH.\n\n\nQualifications Required\n\n\n\tCandidates should possess a Tertiary qualification in Life Sciences, Sales, Marketing or Business.\n\n\nExperience and Skills Required:\n\n\n\tMinimum of 3 years of sales experience in Pharmaceutical Industry.\n\tPrior experience in market pharmacy & hospital environment is an advantage and preferred.\n\tStrong sales track record and evidence of delivering on targets consistently\n\tAdvanced proficiency in MS Office Suite\n\tExceptional presentation and communication skills\n\tExcellent planning, organizational and problem-solving skills\n\tAbility to engage, collaborate and influence at all organizational and management levels.\n\tAbility to manage complex projects and multi-task.\n\n\nClick here to apply online\n\n \n\n \n\n3.) Manager, SHERQ\n\nJob Location: Ikeja, Lagos\n\nJob Function\n\n\n\tAs the dedicated QHSE Manager, your role is to lead and execute holistic Quality, Health, Safety, and Environment (QHSE) strategies for transportation and warehouse operations.\n\tYou are entrusted with ensuring strict adherence to industry standards, thereby safeguarding the well-being of employees, protecting goods, and preserving the environment.\n\tYour responsibilities include overseeing regulatory compliance, formulating and implementing risk mitigation protocols, and spearheading continuous improvement initiatives.\n\tBy cultivating a safe working environment, minimizing hazards, and optimizing processes in both the transport and warehouse sectors, you contribute to the overall efficiency, resilience, and excellence of our operations.\n\n\nKey Performance Areas\nHSEQ Standards & Compliance:\n\n\n\tFormulate and execute pertinent health, safety, and environmental standards alongside the implementation of quality management system procedures, work instructions, and other essential quality system requisites.\n\tOffer expertise and insight to supervise the evolution, execution, and ongoing enhancement of QHSE (Quality, Health, Safety, and Environment) strategies, standards, and programs.\n\tGuarantee the presence of necessary programs and protective measures to curtail employee and corporate QHSE risks, thereby minimizing potential adverse effects.\n\tContinuously monitor, assess, and suggest enhancements to the QHSE systems in place.\n\tDisseminate clear and comprehensive communications regarding QHSE requisites and expectations, fostering uniformity across all MDS sites.\n\tFormulate, supervise, and execute QHSE audit programs (inclusive of certifications) and tools, ensuring consistent adherence to relevant QHSE standards throughout the organization.\n\tOffer assistance and information to the head of QHSE MS (Management System) and other stakeholders concerning all QHSE-related matters, facilitating the continual enhancement of the QHSE Management System.\n\n\nHSEQ Safe Work Systems (QHSE Risks) Management):\n\n\n\tKeep an updated QHSE Hazard Register and ensure the formulation and documentation of corrective action plans.\n\tCoordinate accident and incident reporting, investigations, and documentation, overseeing corrective action tracking via MDS's Incident Reporting System.\n\tAid project management in coordinating Management of Change, Process Hazard Analysis (PHA), or Job Hazard Analysis (JHA) to bolster the QHSE management system in alignment with plant projects.\n\tPossess the capability to secure, sustain, and renew, when necessary, local, state, and federal permits or plans essential for the continuous safe operation of our business.\n\tIdentify and propose resources, equipment, procedural adjustments, and process alterations to manage or eradicate workplace hazards while minimizing environmental impacts.\n\tOffer leadership and guidance in establishing effective methodologies to mitigate workplace risks, supervising the development and execution of safer alternatives and emergency management protocols.\n\tSpearhead the management and progression of risk assessment and monitoring efforts.\n\tConduct assessments and audits to identify disparities in site compliance with group standards.\n\tDevise and maintain strategies and programs ensuring compliance with all pertinent HSE legislation and regulations.\n\tCultivate and retain specialized knowledge regarding both evolving and existing Health, Safety, and Environment regulations and directives, offering guidance on anticipated future requirements.\n\n\nAudits & Management Review:\n\n\n\tEstablish a database tracking system designed to oversee the execution of corrective measures, encompassing audits, HSE cases, incidents, drills, potential incidents, and HSE meetings.\n\tEnsure timely execution of audit plans, both internal and external, with the closure of corrective action plans (RAPs) from external audits within stipulated timelines.\n\n\nQualifications Required\n\n\n\tBachelor’s degree from a recognized institution or a relevant postgraduate business qualification (MBA or equivalent tertiary qualification).\n\tNEBOSH - IGC.\n\tISO 45001 Lead Auditor Certificate\n\tISO 14001 Lead Auditor Certificate\n\tISO 9001:2015 Lead Auditor Certificate.\n\n\nExperience and Skills Required:\n\n\n\tMinimum of 6-8 years of QHSE experience.\n\tTransport and Logistics experience.\n\tWarehouse experience.\n\tFreight Forwarding experience.\n\tManufacturing experience.\n\n\nClick here to apply online    \n\n    \n\n        Click here to Apply",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Vacancies at SortOut Consult",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancies-at-sortout-consult",
    "pubDate": "Mon, 24 Nov 2025 18:50:53 GMT",
    "source": "JobGurus",
    "keyword": "sortout consult",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance"
    ],
    "content": "SortOut Consult is a forward-thinking consulting agency dedicated to helping organizations grow through strategic recruitment, tailored training solutions, and innovative organizational development initiatives. We partner with businesses to build capable teams, enhance performance, and create sustainable structures that drive long-term success.\n\nWe are recruiting to fill the following positions below:\n\n1.) Sales and Marketing Executive\n\nJob Location: Lekki, Lagos\nEmployment Type: Full-time\n\nRole Summary\n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThis is a full-time on-site role for a Sales and Marketing Executive, located in Lagos State, Nigeri\n\tThe role involves developing and executing sales strategies, providing exceptional customer service, managing sales process.\n\tThe Sales and Marketing Executive will also be responsible for growing market presence, building and maintaining client relationships, and identifying new business opportunities.\n\n\nRequirements\n\n\n\tInterested candidates should possess a Bachelor`s Degree\n\t1-2 years of experience in the oil and gas industry is advantageous\n\tStrong Communication and Customer Service skills to effectively interact with clients and team members.\n\tProficient understanding and experience in Sales Management.\n\tProven ability to develop and manage client relationships, with a focus on delivering value and achieving targets.\n\tStrategic thinking and problem-solving abilities to identify and exploit business opportunities.\n\tStrong knowledge of market trends and ability to adapt to a dynamic business environment..\n\tProficient in Excel to Prepare quotations.\n\tWork with the operations team to ensure timely product delivery.\n\tKeep accurate records of all sales activities.\n\tMeet assigned monthly and quarterly sales targets..\n\tAbility to work under pressure and meet targets.\n\tCustomer service oriented.\n\n\nSalary\nN150,000 monthly.\n\nApplication Closing Date: 24th December, 2025.\n\nMethod of Application\nInterested and qualified candidates should forward their applications to: sortoutconsult@gmail.com using the Job Position as the subject of the mail.\n\nNote: Candidates located in or near Lekki will be given priority.\n\n \n\n \n\n2.) Business Development / Marketing Manager\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nKey Job Function\n\n\n\tResponsible for various marketing initiatives and drive, identifying new markets/customers, formulating innovative ideas, including best mix of social media/print media tools, engaging potential customers on the product line, must be trainable, responsible for increasing sales through direct his/her direct marketing efforts.\n\tMust be self-driven to achieve goals with minimal supervision. You would also be responsible for other marketing staff within the Company and creating an ideal marketing structure for effective execution of the long term goals of the Company.\n\n\nOther functions include:\n\n\n\tPreparing and delivering marketing plans within key objectives as stipulated by management team\n\tWorking with in-house/external designers to produce materials of visual impact and within brand guidelines\n\tInvolving key stakeholders for product at each stage of campaign, and reporting results once completed\n\tGenerating and executing marketing campaigns across social media platforms such as Twitter, Facebook, Instagram, YouTube and others\n\tGenerating reports for digital marketing campaigns using data based analytics tools and also presenting this data in an easy to understand format\n\tSourcing advertising opportunities and placing adverts in the press, radio or TV as appropriate to the product or service\n\tLiaising with media, printers and publishers as required and managing the production of marketing materials such as leaflets, flyers, posters and newsletters, including e-newsletters\n\tLiaising with events coordinators to maximise visibility at conferences, receptions and exhibitions, including compiling product and literature lists to display or demonstrate\n\tAttending key conferences to manage booth, do customer interviews and focus groups\n\tMonitoring competitor activity and generating leads for products and services.\n\tEnsuring that all stock/sales in the show room are accounted for\n\tEnsuring that old customers are kept and new customers found which will be monitored by continuous improvement in sales monthly\n\tEnsuring that the show room/ office is well stocked with all stock available in the warehouse\n\tIdentify new business and ventures that the company should go into.\n\tEnsuring that proper and honest recording of resumption and closing time are kept in a ledger.\n\tBasic Administration duties i.e attending strategy sessions and documenting minutes of meetings.\n\tProper filing of Company records, i.e, VAT receipts, and other relevant reports.\n\tAny other duty as may be directed by the management.\n\n\nRenumeration\n\n\n\tSalary: N350,000 - N400,000 Monthly depending on experience\n\tExpenses – All expenses incurred as a direct result of marketing efforts should be properly documented and will be retired weekly\n\tCommissions – Sales directly attributable to marketing effort will be rewarded with 0.5% commission on Total Contract receipt, to be paid quarterly.\n\n\nApplication Closing Date: 28th November, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their resume to: sortoutconsult@gmail.com using the Job Position as the subject of the mail.\n\nNote: Target Market: New Developments/Estates, Property Developers, Banks, High Net worth Individuals, and other middle or high-income individuals. A monthly target of a minimum of 20 new leads and a quarterly target of a hundred million Naira in sales.\n\n \n\n \n\n3.) Head Chef\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tThe Head Chef oversees all kitchen operations, ensuring high-quality food preparation, presentation, and service\n\tThe role involves menu creation, cost control, staff supervision, and maintaining hygiene and safety standards to deliver an exceptional dining experience.\n\n\nKey Responsibilities\n\n\n\tPlan, develop, and execute creative menus in line with the restaurant’s concept and customer preferences.\n\tSupervise and coordinate all kitchen staff, ensuring efficiency and teamwork.\n\tMonitor food quality, taste, and presentation at all times.\n\tManage food costs, inventory, and waste to maximize profitability.\n\tEnsure compliance with health, hygiene, and safety standards.\n\tTrain, mentor, and evaluate kitchen staff performance.\n\tLiaise with suppliers to source high-quality ingredients at competitive prices.\n\tOversee portion control, stock rotation, and kitchen cleanliness.\n\tCollaborate with management to plan special events, promotions, and seasonal menus.\n\tHandle customer feedback relating to food quality or kitchen service.\n\n\nRequirements & Skills\n\n\n\tDiploma or certification in Culinary Arts or a related field is an advantage.\n\tProven experience as a Head Chef or Senior Chef in a reputable restaurant.\n\tStrong leadership, communication, and organizational skills.\n\tIn-depth knowledge of food preparation, kitchen management, and safety regulations.\n\tCreativity and passion for culinary excellence.\n\tAbility to work under pressure and maintain consistency.\n\n\nApplication Closing Date: 28th November, 2025.\n\nMethod of Application \nInterested and qualified candidates should send their resume to: sortoutconsult@gmailcom using the Job Position as the subject of the mail.\n\n     \n\n    \n\n        Click here to Apply",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "DevOps Engineer Job at Interswitch",
    "link": "https://www.jobgurus.com.ng/jobs/view/devops-engineer-job-at-interswitch-2",
    "pubDate": "Mon, 24 Nov 2025 18:50:53 GMT",
    "source": "JobGurus",
    "keyword": "interswitch",
    "duplicate": false,
    "classifications": [
      "Software Engineering",
      "Finance",
      "Marketing"
    ],
    "content": "(function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){\n        (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),\n        m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)\n    })(window,document,'script','//www.google-analytics.com/analytics.js','ga');\n\n    ga('create', 'UA-43112273-1', 'jobgurus.com.ng');\n    ga('send', 'pageview');\n\n\n\n\n    \n        \n    Home\n    Jobs\n    Free Aptitude Test Practice\n    Employer? Post a Job\n            Register\n        Sign in\n        Contact us\n    \n\n    \n\n        \n    \n        \n\n            \n\n                \n\n                    \n                        Toggle navigation\n                        \n                        \n                        \n                    \n\n                    \n                \n            \n\n            \n                \n\n\tJobs\n\tJob Seekers\n\tAptitude Test\n\tScholarships\n\n            \n\n            \n                \n\n                                            Register\n                        Sign in\n                    \n                    Employer? Post a Job\n                \n            \n\n        \n\n    \n\n        \n        \n            \n            \n                 \n    \n                    \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n        \n     \n\n\n                            \n                    \n        \n                        CLICK HERE TO JOIN OUR WHATSAPP CHANNEL \n                    \n    \n\n    \n                                \n                    \n\n                        \n                            \n                        \n\n                        \n                            \n                                Any Specialization\n                                                                    Accounting / Audit / Finance\n                                                                    Administration/ Office/ Operations\n                                                                    Advertising/ Social Media/ Marketing/ PR\n                                                                    Agriculture / Agro Allied\n                                                                    Analyst/ Quality Control\n                                                                    Automotive/ Car Services\n                                                                    Aviation / Airline\n                                                                    Banking / Insurance\n                                                                    Building Design / Architecture\n                                                                    Construction / Mining\n                                                                    Consulting / Business Strategy/ Planning\n                                                                    Craftsmen / Artisans\n                                                                    Creatives (Arts, Design, Fashion)\n                                                                    Customer Service\n                                                                    Domestic / Janitorial Services\n                                                                    Driving / Haulage\n                                                                    Education / Teaching / Training\n                                                                    Engineering / Technical\n                                                                    Executive / Management\n                                                                    Freelance / Data Entry\n                                                                    Government Agencies / Public Sector\n                                                                    Graduates / Freshers\n                                                                    Grants /  Scholarships\n                                                                    Hospitality / Food Services\n                                                                    HSE / Safety Management\n                                                                    Human Resources / Recruitment\n                                                                    Information Technology / ICT\n                                                                    Internship/ Industrial Training\n                                                                    Legal / Law\n                                                                    Logistics / Transportation/ Supply\n                                                                    Manufacturing / Production\n                                                                    Maritime Services / Shipping\n                                                                    Media / Art / Entertainment\n                                                                    Medical/ Healthcare / Pharmaceutical\n                                                                    Military / Para-Military\n                                                                    NGO / Community Services\n                                                                    Oil & Gas / Energy\n                                                                    Procurement/ Purchasing\n                                                                    Project Management\n                                                                    Real Estate / Property / Surveying\n                                                                    Research / Survey\n                                                                    Risk Management / Compliance\n                                                                    Sales / Business Development\n                                                                    Secretarial / PA\n                                                                    Security / Intelligence\n                                                                    Software/ Programming / Web development\n                                                                    Sports / Fitness\n                                                                    Supply Chain/ Store\n                                                                    Technicians\n                                                                    Telecommunications\n                                                                    Tourism / Travels\n                                                                    Vocational Trade and Services\n                                                            \n                        \n\n                        \n                            \n                                Any Work Level\n                                                                    Entry Level (Trainee)\n                                                                    Executive (Director, Head of Dept)\n                                                                    Experienced (Non-Manager)\n                                                                    Internship\n                                                                    Manager (Staff Supervisor)\n                                                                    Senior Executive (MD, CEO, COO)\n                                                                    Vocational (Skilled/Unskilled Labour)\n                                                            \n                        \n\n                        \n                            \n                                 Search\n                            \n                        \n                    \n                \n                            \n            \n\n\n\n\n\n\n            \n\n                \n                                        \n                    \n                                        \n                    \n                    \n\n                    \n                        \n                        \n\n{\n  \"@context\": \"https://schema.org\",\n  \"@type\": \"JobPosting\",\n  \"title\": \"DevOps Engineer\",\n  \"description\": \"Interswitch is an Africa-focused integrated digital payments and commerce company that facilitates the electronic circulation of money as well as the exchange of value between individuals and organisations on a timely and consistent basis. We started operations in 2002 as a transaction switching and electronic payments processing, and have progressively evolved into an integrated payment services company, building and managing payment infrastructure as well as delivering innovative payment products and transactional services throughout the African continent. At Interswitch, we offer unique career opportunities for individuals capable of playing key roles and adding value in an innovative and fun environment.\n\nWe are recruiting to fill the position below:\n\nJob Position:&amp;nbsp;DevOps Engineer\n\nJob Location:&amp;nbsp;Lagos\n\nJob Summary\n\n\n\tIn this role, you&amp;rsquo;ll be our go-to expert for infrastructure, automation, and cloud, from designing resilient systems to implementing efficient CI/CD workflows and building a proactive, scalable monitoring setup.\n\tIf you&amp;rsquo;re hands-on with technologies like Kubernetes, AWS, Azure, Ansible, Terraform, Prometheus, Kibana and Grafana and passionate about leading a team of skilled engineers, we&amp;rsquo;d love to talk.\n\n\nResponsibilities\n\n\n\tDevelop and Drive Our DevOps Vision: Set the direction for our DevOps strategy, building world-class infrastructure, automation, and operational processes from the ground up.\n\tManage and Scale Our Cloud Environments: Architect, deploy, and support infrastructure across AWS and Azure, focusing on high availability, disaster recovery, and cost efficiency.\n\tRun Kubernetes Clusters: Take charge of our Kubernetes clusters for production and dev environments, ensuring security, optimal resource usage, and scaling as we grow.\n\tAutomate and Streamline CI/CD: Build out and enhance our CI/CD pipelines using tools like Bitbucket, ArgoCD, and other industry-standard tech, making deployments smooth, fast, and safe.\n\tSet Up Monitoring and Logging: Design and manage robust monitoring, logging, and alerting systems with Prometheus, Grafana, and the ELK stack to keep our infrastructure healthy and issues visible.\n\tWrite Automation Scripts: Automate everything possible, using Bash, Python, or whatever works best to save time and reduce errors.\n\tCollaborate Across Teams: Work closely with development, QA, security, and more to integrate DevOps practices, ensuring seamless application delivery and high uptime.\n\tLead and Mentor: Guide and grow our DevOps team, sharing best practices, providing support, and fostering a culture of continuous improvement.\n\tFocus on Security: Implement security best practices and ensure our DevOps activities meet the necessary compliance and governance standards.\n\n\nRequirements\nRequired Experience:\n\n\n\tCloud Expertise: Deep, hands-on experience with AWS and Azure, and comfortable managing everything.\n\tKubernetes Knowledge: You know Kubernetes inside-out and have used it in production environments.\n\tInfrastructure as Code: You&amp;rsquo;re proficient with Ansible, Terraform, or similar tools and have experience building and managing IaC in production environments.\n\tCI/CD Workflow Management: Skilled at setting up and optimizing CI/CD workflows, particularly with tools like Bitbucket Pipelines, Jenkins, and ArgoCD.\n\tMonitoring Tools: Proficient in Prometheus, Grafana, and ELK stack, with an eye for optimizing system monitoring, logging, and visualization.\n\tScripting Skills: Strong experience with scripting languages like Bash and Python to automate tasks and streamline processes.\n\tLeadership and Mentorship: Proven ability to lead a team, provide technical guidance, and cultivate a collaborative, growth-oriented environment.\n\tSecurity Savvy: Knowledge of DevOps security best practices and familiarity with industry standards.\n\n\nAdditional Skills:\n\n\n\tMulti-cloud Expertise: Experience with hybrid or multi-cloud environments.\n\tCost Optimization: You know how to keep cloud costs down and optimize resources.\n\tClear Communicator: You can explain complex ideas to both technical and non-technical teams with ease.\n\",\n  \"datePosted\": \"2025-11-24\",\n  \"validThrough\": \"2025-12-25\",\n  \"employmentType\": \"Full-Time\",\n  \"hiringOrganization\": {\n    \"@type\": \"Organization\",\n    \"name\": \"Interswitch\"\n    \n  },\n  \"jobLocation\": {\n    \"@type\": \"Place\",\n    \"address\": {\n      \"@type\": \"PostalAddress\",\n       \"postalCode\": \". \",\n       \"addressRegion\": \". \",\n       \"streetAddress\": \". \",\n      \"addressLocality\": \"Lagos\",\n      \"addressCountry\": \"NG\"\n     \n      \n    }\n  },\n  \"identifier\": {\n    \"@type\": \"PropertyValue\",\n    \"name\": \"\",\n    \"value\": \"190839\"\n  },\n  \"baseSalary\": {\n    \"@type\": \"MonetaryAmount\",\n    \"currency\": \"NGN\",\n    \"value\": {\n      \"@type\": \"QuantitativeValue\",\n      \"minValue\": 0,\n      \"maxValue\": 0,\n      \"unitText\": \"MONTH\"\n    }\n  }\n}\n\n\n\nDevOps Engineer Job at Interswitch\n\n\n\n\n        \n    \n\n        \n        Interswitch is an Africa-focused integrated digital payments and commerce company that facilitates the electronic circulation of money as well as the exchange of value between individuals and organisations on a timely and consistent basis. We started operations in 2002 as a transaction switching and electronic payments processing, and have progressively evolved into an integrated payment services company, building and managing payment infrastructure as well as delivering innovative payment products and transactional services throughout the African continent. At Interswitch, we offer unique career opportunities for individuals capable of playing key roles and adding value in an innovative and fun environment.\n\nWe are recruiting to fill the position below:\n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Position: DevOps Engineer\n\nJob Location: Lagos\n\nJob Summary\n\n\n\tIn this role, you’ll be our go-to expert for infrastructure, automation, and cloud, from designing resilient systems to implementing efficient CI/CD workflows and building a proactive, scalable monitoring setup.\n\tIf you’re hands-on with technologies like Kubernetes, AWS, Azure, Ansible, Terraform, Prometheus, Kibana and Grafana and passionate about leading a team of skilled engineers, we’d love to talk.\n\n\nResponsibilities\n\n\n\tDevelop and Drive Our DevOps Vision: Set the direction for our DevOps strategy, building world-class infrastructure, automation, and operational processes from the ground up.\n\tManage and Scale Our Cloud Environments: Architect, deploy, and support infrastructure across AWS and Azure, focusing on high availability, disaster recovery, and cost efficiency.\n\tRun Kubernetes Clusters: Take charge of our Kubernetes clusters for production and dev environments, ensuring security, optimal resource usage, and scaling as we grow.\n\tAutomate and Streamline CI/CD: Build out and enhance our CI/CD pipelines using tools like Bitbucket, ArgoCD, and other industry-standard tech, making deployments smooth, fast, and safe.\n\tSet Up Monitoring and Logging: Design and manage robust monitoring, logging, and alerting systems with Prometheus, Grafana, and the ELK stack to keep our infrastructure healthy and issues visible.\n\tWrite Automation Scripts: Automate everything possible, using Bash, Python, or whatever works best to save time and reduce errors.\n\tCollaborate Across Teams: Work closely with development, QA, security, and more to integrate DevOps practices, ensuring seamless application delivery and high uptime.\n\tLead and Mentor: Guide and grow our DevOps team, sharing best practices, providing support, and fostering a culture of continuous improvement.\n\tFocus on Security: Implement security best practices and ensure our DevOps activities meet the necessary compliance and governance standards.\n\n\nRequirements\nRequired Experience:\n\n\n\tCloud Expertise: Deep, hands-on experience with AWS and Azure, and comfortable managing everything.\n\tKubernetes Knowledge: You know Kubernetes inside-out and have used it in production environments.\n\tInfrastructure as Code: You’re proficient with Ansible, Terraform, or similar tools and have experience building and managing IaC in production environments.\n\tCI/CD Workflow Management: Skilled at setting up and optimizing CI/CD workflows, particularly with tools like Bitbucket Pipelines, Jenkins, and ArgoCD.\n\tMonitoring Tools: Proficient in Prometheus, Grafana, and ELK stack, with an eye for optimizing system monitoring, logging, and visualization.\n\tScripting Skills: Strong experience with scripting languages like Bash and Python to automate tasks and streamline processes.\n\tLeadership and Mentorship: Proven ability to lead a team, provide technical guidance, and cultivate a collaborative, growth-oriented environment.\n\tSecurity Savvy: Knowledge of DevOps security best practices and familiarity with industry standards.\n\n\nAdditional Skills:\n\n\n\tMulti-cloud Expertise: Experience with hybrid or multi-cloud environments.\n\tCost Optimization: You know how to keep cloud costs down and optimize resources.\n\tClear Communicator: You can explain complex ideas to both technical and non-technical teams with ease.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n\n\n\n        \n        \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n   \n\n\n    \n        Similar Jobs\n    \n\n    \n        \n                        Backend Developer Job at Greenwood Limited\n                        Software Developer (C#) Job at Strivo Labs\n                        Frontend Developer Job at FlyBoku Group\n                        DevOps / Cloud Engineer Job at Hayok Medicare Limited\n                        Full Stack Engineer\n                        Senior Geo-Database & GIS Geologist Job at Bretty Consultancy Services\n                        Wordpress Developer Job at Zaicon Digital Technologies\n                        UI / UX Engineer Job at Strivo Labs\n                        Full-Stack Developer Job at Bomach Group of Company\n                        Job Openings at Aspom Travel Agency\n                    \n    \n\n\n\n                        \n                    \n\n                    \n                        \n\n\n\n    \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n\n\n\n\n\n          \n\n\n    \n\n        Hottest Jobs\n\n        \n        \n            \n\n                Job Vacancies at IT Horizons Limited\n\n               \n            \n        \n            \n\n                Job Openings at Tokiye Integrated Medical Service\n\n               \n            \n        \n            \n\n                Job Vacancies at Charterhouse\n\n               \n            \n        \n            \n\n                Job Openings at Nigerian College of Agribusiness\n\n               \n            \n        \n            \n\n                Job Vacancies at ExCare Health\n\n               \n            \n        \n            \n\n                Customer Support Representative Job at Picadailys\n\n               \n            \n        \n            \n\n                Job Openings at Dover Engineering\n\n               \n            \n        \n            \n\n                2026 NOVA Bank Graduate Trainee Programme (NGTP'26 - Sales Edition)\n\n               \n            \n        \n            \n\n                Administrative Assistant Job at Noble Hall Leadership Academy for Girls\n\n               \n            \n        \n            \n\n                Data Analyst Job at UPDC FM Limited\n\n               \n            \n        \n        \n\n    \n\n\n\n\n        \n        \n   \n\n\n                    \n                            \n            \n        \n        \n        \n\n        \n\n    \n\n        \n\n            \n\n                \n\n                    Job Seekers\n\n                    \n\n                        Search for Jobs\n                         Featured Jobs\n                         Jobs by Specialization\n                         Jobs by Industry\n                         Jobs by Location\n                         \n                        Companies Currently Hiring\n\n                        Upload CV\n\n                        Free Aptitude Test Practice\n                        \n                        Scholarships and Financial Aid\n\n                        Testimonies\n                    \n\n                \n\n                \n\n                    Employers\n\n                    \n\n                        Post A Job\n\n                        Search Resumes/Profiles\n\n                        Create Employer Account\n\n                        Advertise\n\n                        Pricing\n\n                    \n\n                \n\n                \n\n                    Tools & Resources\n\n                    \n\n                        Contact us\n                        \n                        Our Blog\n\n                        Job XML/RSS Feeds\n \n                        Free Aptitude Test Practice\n\n                        Bank Details\n\n                        FAQ & Support\n\n                    \n\n                \n\n                \n\n                    Connect with us\n\n                    \n\n                        \n\n                            \n\n                            \n\n                        \n\n                        \n\n                            \n\n                            \n\n                        \n\n                \n\n                        \n\n                            \n\n                            \n\n                        \n\n                    \n\n\n\n                    \n\n                        Customer Care\n\n                        09134259221 \n\n                        (9am - 5pm) weekdays\n\n                         info [at] jobgurus.com.ng\n\n                    \n\n\n\n                \n\n            \n\n        \n\n    \n\n\n\n    \n\n        \n\n\n\n            \n\n                Privacy Policy\n\n                Terms & Conditions\n\n                Sitemap\n                \n                About us\n\n            \n\n\n\n            Copyright © 2025 Jobgurus.com.ng - Latest Jobs in Nigeria 2025. All right reserved.",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Openings at AP3 Capital",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-ap3-capital",
    "pubDate": "Mon, 24 Nov 2025 18:50:53 GMT",
    "source": "JobGurus",
    "keyword": "ap3 capital",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "AP3 Capital is a specialist professional services and portfolio management firm that delivers a range of Business Assurance Services, Transaction Advisory Services, Policy & Research, and Investment Portfolio Management services. \n\nWe are recruiting to fill the following positions below:\n\n1.) Senior Project and Research Analyst\n\nJob Location: Abuja\nEmployment Type: Full-time\n\nJob Description\n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe take a client-centred approach to the delivery of professional services to public and private sector clients and development finance institutions.\n\tFollowing a period of dynamic change and growth, we are looking for an experienced Senior Project Research Analyst who would double as team lead to support our commitment to building on recent successes, by shaping and optimising our operational strategy and delivery processes to enable us to continue to compete and win against leading firms in the sectors and markets we are active in.\n\tThis is a unique and exciting opportunity for a globally minded individual who is committed to developing a senior-level career in the professional services industry, with entrepreneurial, leadership, and problem-solving skills.\n\tThe ideal candidate will be proactive, detail-oriented, and possess exceptional written and verbal communication skills.\n\tShe / he will have a winning mindset that will enable him or her to contribute to the development of the firm, build a client-centric orientation across our multi-disciplinary teams while providing best-in-class guidance to AP3 teams and our portfolio companies.\n\tThis position has the potential to grow within the firm or an equivalent role in one of our portfolio companies.\n\n\nKey Responsibilities\n\n\n\tYour duties, responsibilities and deliverables for this role are as follows:\n\n\nGeneral Responsibilities:\n\n\n\tThe Senior Research Analyst will be responsible for the following:\n\n\nProject and Research Analysis:\n\n\n\tAssist with screening and selection of project pipelines across diverse sectors, conducting due diligence and facilitating investor engagement.\n\tProvide technical assistance for the drafting of compliant bid project proposals (EOIs & RFPs) in collaboration with multidisciplinary experts.\n\tConduct research, analyse data, and develop comprehensive reports on market trends, value chains, and project feasibility (including economic & financial viability).\n\tCollaborate with technical teams to develop project concept notes, project delivery pathways, and infrastructure assessments.\n\tSupport the organisation and production of reports and workshops related to climate finance and infrastructure development.\n\tSupporting efforts to build consensus around the development of an accelerated project delivery framework, including stakeholder mapping and management to anticipate and address issues (and, where necessary, escalate such issues).\n\tProducing inception reports with a detailed understanding of scope, work plan –interdependencies, risks, and timelines for completion of the project assignments (incl. proposed schedule of consultations with government stakeholders and lenders)\n\tContributing as required to the preparation of tender documents, coordination of the bid evaluation processes, and capturing lessons learned and ensuring the effectiveness of clients’ capacity building processes and approach.\n\tSupporting the PPP/Project Transactions Team in drafting and preparing progress reports.\n\tParticipate in field surveys and data collection activities for project assessments.\n\tManage project timelines, budgets, and deliverables effectively.\n\tCollaborate effectively with a team of analysts, consultants, and project managers.\n\tMaintain a strong understanding of current developments in infrastructure, climate finance, and relevant sectors in Africa.\n\tSupporting the PPP/Infrastructure Finance team with any additional work required.\n\n\nBusiness Development:\n\n\n\tAssess, originate, and resource opportunities that fit with the company’s existing and emerging capabilities,, drawing on the competencies of its expert network.\n\tBuild and maintain relationships with existing and potential clients, associates and partner organisations, financial institutions and multilateral partners, and government officials.\n\tCoordinate with development partners and private sector financiers to ensure opportunities to secure and build on previous collaborations are embraced and best practices are followed.\n\tOrganise and schedule capacity-building workshops and events that engage senior decision-makers across the public, private and multilateral sectors, and showcase our capabilities and expert network (e.g. PPP Masterclass).\n\tContribute as required to the continuous review and update of our website, marketing and community engagement events and initiatives.\n\tEstablish the office procedures, tools, templates, and bid-winning capabilities (incl. Expert database, contract, and contact management; EOI, RFQ, RFP templates; project management and governance processes).\n\tSupport the preparation of proposals, EOIs, RFPs and other tender documents, including competitive challenges for Unsolicited Proposals.\n\tContribute as required to the overall development of the company. Support the formulation of business strategies, risk management & controls through reviewing risk registers & mitigation strategies, and other related activities.\n\n\nTeam and Thought leadership:\n\n\n\tProvide leadership, direction, guidance and development support to senior associates and associate team members.\n\tStay abreast of industry trends, regulatory changes, and market dynamics affecting PPP and infrastructure financing in Africa.\n\tConduct studies related to projects and special topics relevant to the industry.\n\tLine management responsibility for in-house analysts and primary liaison with associates and technical experts (expert network).\n\tProduce blogs, insight reports and other publications that showcase the expertise of the team.\n\tEnsure high-quality standards across all team outputs in the project portfolio.\n\tMobilise expert resources from personal networks and our expert database to support the delivery of internal and external projects.\n\tLead and provide technical support to assigned projects and business development initiatives.\n\tAs a senior member of our team, model our values in every engagement with the team, existing and potential clients, and the public.\n\tMaintain a problem-solving disposition and results mindset in all your dealings internally and externally.\n\n\nQualifications\n\n\n\tBachelor’s Degree Qualifications in Economics, Engineering, Accounting, Business Administration, Finance or related fields (Required); Master's Degree or higher in any of the above considered an added advantage.\n\tMinimum of 5 - 7 years of relevant professional work experience in supporting the development and delivery of infrastructure at a reputable institution, preferably infrastructure consulting/advisory.\n\t5 – 7+ years in the professional services industry; experience in sales, bid and proposal development an added advantage.\n\tStrong ability to build and grow an opportunity pipeline.\n\tProven ability to establish and build client relationships and engage and grow a network of stakeholders.\n\tStrong proficiency in the use of relevant document processing software for documents, presentations, marketing, research and analysis (MS Office applications – Outlook, Word, Excel & PowerPoint). Experience of web-design, digital or other social media skills; an advantage.\n\tStrong business acumen with excellent sales and negotiation skills.\n\tStrong project and people management experience. Professional certifications an advantage.\n\tProven written and presentation skills in a range of formats (briefings, reports, summaries, etc.) and to a range of audiences.\n\tSound knowledge of the infrastructure PPP space in Nigeria.\n\n\nIn addition, you will be able to demonstrate the following:\n\n\n\tPossess the ability to handle highly sensitive and confidential information while exercising professionalism and discretion.\n\tThe right approach and experience to really support our ambition of being a world-class professional services firm.\n\tEnthusiastic and able to work in a fast-paced environment dealing with complex matters.\n\tStrong time-management skills and an ability to organize and coordinate multiple concurrent projects.\n\tReliable, positive, solution-oriented, flexible approach to working.\n\tOutstanding interpersonal, verbal, and written communication skills.\n\tA personable team player who is also able to work independently and on their own initiative.\n\tHigh attention to detail and the ability to prioritise tasks.\n\tSelf-starter who drives individual projects and takes ownership of outcomes.\n\tWilling to travel locally and internationally.\n\n\nSalary\nN400,000 - N500,000 / month\n\nMethod of Application \nInterested and qualified candidates should send their copy of their CV and a brief covering email explaining how they meet the criteria above and what they might be able to bring to the role to: resourcing@ap3advisory.com using the Job Position as the subject of the mail.\n\nNote: We will recruit on an ongoing basis so early applications are advised.\n\n \n\n \n\n2.) Project and Research Analyst\n\nJob Location: Abuja (FCT)\nEmployment Type: Full-time\n\nJob Overview\n\n\n\tThis is a unique and exciting opportunity for a globally-minded individual with entrepreneurial, leadership, and problem-solving skills who is committed to developing a senior-level career in the professional services industry to join our Project Management Unit.\n\tOur Project Management team adds value by helping clients to create concept notes to conceptualise their desired projects and offering project delivery management and support services to. We take a client-centred approach to delivering professional services to public and private sector clients and development finance institutions.\n\tThe ideal candidate will be proactive, detail-oriented, and possess exceptional written and verbal communication skills. S/he will have a growth mindset that will enable him or her to contribute to the development of the firm’s market positioning as trusted transaction advisors to public and private sector clients.\n\tThe successful candidate will work closely with the Managing Partner, Associate Partners, and subject matter experts as part of the core programme management team leading our practice in the delivery of high-quality services to top-tier public, private and development partner clients.\n\tS/he will be responsible for assisting with the delivery of major capital and infrastructure projects across the full project life cycle in a wide range of sectors, including agriculture, transport, energy, real estate and social infrastructure. This position has the potential to grow into a senior management role within the Project Management / Transactions team or any of our portfolio management companies.\n\n\nKey Responsibilities\n\n\n\tYou will assist the leadership team in day-to-day delivery and engagement management on specific projects, with key responsibilities as follows: Project and Research Analyst\n\tConduct data-driven research and analysis to develop insightful content for blog posts, insight reports, and policy papers.\n\tConduct market and desktop research to identify emerging infrastructure and PPP opportunities in Africa and beyond, aligned with AP3 services and strategic priorities.\n\tConduct market research and competitor analysis to identify emerging trends and potential business opportunities within our target sector.\n\tCollaborate with team members from various departments (e.g., project management, finance) to develop and refine compelling and compliant business proposals.\n\tConduct primary and secondary research using various sources, such as surveys, interviews, and literature reviews in support of project delivery.\n\tContribute to proposal writing, editing, proofreading, and formatting to ensure clarity, conciseness, and persuasiveness, and adherence to client and industry requirements.\n\tDevelop detailed work plans and timelines for the delivery of assignments.\n\tAssist with project management tasks as needed, such as data analysis, report preparation, and stakeholders’ communication and management.\n\tConduct research and gather relevant information to support the proposal content, including technical specifications, competitor analysis, and financial projections.\n\tVerify data, information, key stakeholders and analyse it to suit and support the work of project and transaction teams.\n\tTrack, forecast and report on project progress, including metrics and challenges.\n\tContributing as required to the preparation of tender documents, coordination of the bid evaluation processes, and capturing lessons learned and ensuring the effectiveness of clients’ capacity building processes and approach.\n\tSupporting the PMU/Transactions team with any additional work required. Business Development\n\tAssess, originate, and resource opportunities that fit with the company’s existing and emerging capabilities, drawing on the competencies of its expert network.\n\tBuild and maintain relationships with existing and potential clients, associates and partner organisations, financial institutions, multilateral partners, and government officials.\n\tAssist with organizing and scheduling capacity-building workshops and events that engage senior decision-makers across the public, private and multilateral sectors, and showcase our capabilities and expert network (e.g. PPP Masterclass).\n\tAssist with establishing office procedures, tools, templates, and bid-winning capabilities (incl. Expert database, contract, and contact management; EOI, RFQ, RFP templates; project management and governance processes). • Assist in the preparation of proposals, EOIs, RFPs and other tender documents, including competitive challenges for Unsolicited Proposals.\n\tContribute as required to the overall development of the company. Support the formulation of business strategies, risk management & controls through reviewing risk registers & mitigation strategies, and other related activities. Thought leadership\n\tStay abreast of industry trends, regulatory changes, and market dynamics affecting PPP and infrastructure financing in Africa.\n\tConduct studies related to projects and special topics relevant to the industry. • Produce blogs, insight reports and other publications that showcase the expertise of the team.\n\tMobilize expert resources from personal networks and our expert database to support the delivery of internal and external projects.\n\tProvide technical support to assigned projects and business development initiatives.\n\tModel our values in every engagement with the team, existing and potential clients, and the general public.\n\tMaintain a problem-solving disposition and results mindset in all your dealings internally and externally.\n\n\nSkills, Qualifications & Competencies\n\n\n\tMinimum of Degree in Economics, Business Administration, Finance, Public Policy, Environmental Science, or a related field (or equivalent experience).\n\tMinimum of 3 years of experience in project management, research, and analysis, with a focus on infrastructure or climate finance.\n\tA Master's Degree in any of the above will be an added advantage.\n\tDemonstrated experience in conducting feasibility studies, market research, and financial analysis.\n\tStrong analytical and problem-solving skills.\n\tExcellent writing and communication skills.\n\tExperience working in a fast-paced and dynamic environment.\n\tAbility to work independently and as part of a team.\n\tExperience in Africa, particularly West Africa, is a plus.\n\tProficiency in Microsoft Office Suite and project management tools.\n\tExperience drafting business plans and feasibility studies.\n\tGood interpersonal skills.\n\tHighly numerate, with exceptional oral and written communication skills, with demonstrable quantitative and qualitative data analysis skills, and proficiency in the use of Microsoft Excel, Word, PowerPoint, and Internet tools.\n\tExcellent writing, presentation and analytics skills in a range of formats (briefings, reports, summaries, etc.) and to a range of audiences.\n\tProven capabilities to work effectively and constructively with diverse, inter-cultural, interdisciplinary and high-impact teams across multiple locations and time zones.\n\tStrong technical, analytical, and problem-solving capabilities.\n\tThe right approach and experience to manage client relationships and really support our ambition of being a world-class professional services firm.\n\tSelf-starter who drives individual projects and takes ownership of outcomes.\n\tWilling to travel locally and internationally.\n\n\nSalary\nN200,000 - N250,000 / Month.\n\nMethod of Application \nInterested and qualified candidates should send a copy of your CV and a brief Covering email explaining how you meet the criteria above and what you might be able to bring to the role. to: resourcing@ap3advisory.com using the Job Position as the subject of the mail.\n\nNote: We will recruit on an ongoing basis so early applications are advised.\n\n \n\n \n\n3.) Transactions Specialist\n\nJob Location: Abuja (FCT)\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tThe ideal candidate will be proactive, detail-oriented, and possess exceptional written and verbal communication skills.\n\tS/he will have a growth mindset that will enable him or her to contribute to the development of the firm’s market positioning as leading transaction advisors to public and private sector clients.\n\tThe successful candidate will work as part of our core programme management team working with internal and associate subject matter experts to deliver high-quality transaction advisory services to top tier public, private and development partner clients.\n\tS/he will be responsible for assisting with the delivery of major capital and infrastructure projects across the full project life cycle in a wide range of sectors, including agriculture, transport, energy, real estate and social infrastructure.\n\tThis position has the potential to grow into a senior management role within the Transactions team or any of our portfolio management companies.and relevant publications that positively engage and impress existing and potential clients\n\n\nKey Responsibilities\nDelivery of transaction advisory services:\n\n\n\tSupport the development and implementation of a delivery framework that translates our core values into operating guidelines and principles for the transaction advisory division.\n\tLead day-to-day engagement with key stakeholders and ensure the quality of delivery standards across the entire project portfolio.\n\tProduce and present high-quality client materials, including detailed delivery roadmaps and work plans, status reports, project reports, feasibility studies, OBCs, progress reports, procurement documents, financial models, insight reports, .\n\tContribute as required to the day-to-day delivery of Transaction Advisory services, drawing on own knowledge and expertise as well as knowledge and expertise across the team to provide technical expertise on project life cycle activities as required to deliver on client and project objectives.\n\tThis may typically include: Programme design and development; benefits and quality management; stakeholder management; portfolio management; programme and project planning including milestone management; financial modelling and analysis; and risk and issue management.\n\tPolicy advisory and capacity building/training in the formulation and upgrading of national PPP policies, project preparation, management of PPP concessions, financial modelling and analysis, risk & stakeholder management function, risk allocation matrix related to assigned projects and initiatives, etc.\n\tInterpret and analyse complex information, identifying business issues and applying technical knowledge appropriately.\n\tConduct market, situation and policy analysis and research to inform stakeholder management, client management, strategic decision-making, policy development and bid development.\n\tConsult effectively with specialists within the firm when faced with complex technical, stakeholder or risk management issues, instilling innovative, client-centric, solution orientation within the team. Business Development\n\tAssess, originate, and resource opportunities that fit with the company’s existing and emerging capabilities, drawing on the competencies of its expert network.\n\tLead the preparation of proposals, EOIs, RFPs and other tender documents, including competitive challenges for Unsolicited Proposals.\n\tBuild and maintain relationships with existing and potential clients, associates and partner organisations, financial institutions and multilateral partners, and government officials.\n\tLiaise with development partners and private sector financiers to ensure opportunities to secure and build on previous collaborations are embraced, and best practices are followed.\n\tOrganise and schedule capacity-building workshops and events that engage senior decision makers across the public, private and multilateral sectors, and showcase our capabilities and expert network (e.g. PPP Masterclass).\n\tContinuous review and update of our website, marketing and community engagement events and initiatives.\n\tContribute as required to the overall development of the company. Support the formulation of business strategies, risk management & controls through reviewing risk registers & mitigation strategies, and other related activities. Team and Thought leadership.\n\tProvide guidance and support to junior associates and fellow team members on technical and programme management issues as appropriate.\n\tProduce insight reports that showcase the expertise of the team.\n\tStay abreast of industry trends, regulatory changes, and market dynamics affecting the financing and delivery of capital and infrastructure projects across Africa.\n\tConduct studies related to projects and special topics relevant to the industry.\n\tProduce blogs, insight reports and other publications that showcase the expertise of the team.\n\tEnsure high-quality standards across all team outputs in the project portfolio.\n\tMobilise expert resources from personal networks and our expert database to support the delivery of internal and external projects.\n\tLead and provide technical support to assigned projects and business development initiatives.\n\tAs a key member of our team, model our values in every engagement with the team, existing and potential clients, and the public.\n\tMaintain a problem-solving disposition and results mindset in all your dealings internally and externally.\n\tPerform such other duties and functions as may be required to fulfil the requirements of the role.\n\n\nSkills, Qualifications & Competencies\n\n\n\tBachelor’s degree (combined with Masters preferred but not required).\n\tProject feasibility, options appraisal and/or project structuring experience.\n\tProject procurement experience through to financial close.\n\t5-7 years of experience in infrastructure project management, capital & infrastructure projects advisory.\n\tUnderstanding the range of transaction advisory services across the infrastructure project lifecycle for public and private sector clients.\n\tExperience with alternative contract types: EPC, PPP, etc.\n\tExperience building and analysing project financial models.\n\tExperience drafting business plans and feasibility studies.\n\tGood interpersonal skills.\n\tHighly numerate, with exceptional oral and written communication skills, with demonstrable quantitative and qualitative data analysis skills, and proficiency in the use of Microsoft Excel, Word, PowerPoint, and Internet tools.\n\tExcellent writing, presentation, and analytics skills in a range of formats (briefings, reports, summaries, etc.) and to a range of audiences.\n\tProven capabilities of working effectively and constructively with diverse, inter-cultural, interdisciplinary, and high-impact teams across multiple locations and time zones.\n\tStrong technical, analytical, and problem-solving capabilities.\n\tThe right approach and experience to manage team and client relationships and really support our ambition of being a world-class professional services firm.\n\tSelf-starter who drives individual projects and takes ownership of outcomes.\n\tWilling to travel locally and internationally.\n\n\nSalary\nN400,000 - N500,000 Monthly. \n\nMethod of Application \nInterested and qualified candidates should send their copy of their CV and a brief covering email explaining how they meet the criteria above and what they might be able to bring to the role to: resourcing@ap3advisory.com using the Job Position as the subject of the mail to ensure that it is reviewed.\n\nNote: We will recruit on an ongoing basis so early applications are advised.    \n\n    \n\n        Click here to Apply",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Vacancies at JMG Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancies-at-jmg-limited-1",
    "pubDate": "Mon, 24 Nov 2025 18:50:53 GMT",
    "source": "JobGurus",
    "keyword": "jmg limited",
    "duplicate": false,
    "classifications": [],
    "content": "JMG Limited is a diversified solution provider with a broad portfolio in power generation, electrical infrastructures, and industrial equipment. With over 10 years of experience in Africa and strong partnerships with some of the world’s leading brands (CATERPILLAR INC, MITSUBISHI HEAVY INDUSTRIES, LEGRAND, GE LIGHTING, KAESER COMPRESSORS, THYSSENKRUPP), JMG combines global technologies and regional expertise to fulfill the development needs of the African market.\n\nWe are recruiting to fill the following positions below:\n\n1.) Pre-Trip Inspection Officer\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nBrief Description\n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tPre-Trip Inspection Officer will ensure all fleet vehicles meet safety and operational standards before and after each trip through thorough inspections, defect reporting, and proper documentation.\n\tThis role helps prevent breakdowns, improves compliance, and allows mechanics to focus on critical repairs.\n\n\nDuties\n\n\n\tConduct mandatory pre-trip and post-trip inspections (DVIRs) on all designated trucks and trailers.\n\tCheck and verify:\n\t\n\t\tLights and indicators\n\t\tOil and fluid levels (engine oil, coolant, brake fluid)\n\t\tAir leaks / hydraulic leaks\n\t\tTyre condition and pressure\n\t\tBrakes and brake lines\n\t\tMirrors, horn, wipers\n\t\tBody condition, undercarriage, and suspension\n\t\tSafety equipment (extinguisher, triangle, jack, wheel spanner)\n\t\n\t\n\tIdentify minor defects and immediately report them to maintenance (lights, loose connections, leaks, worn components, missing items).\n\tEscalate major safety issues such as brake faults, tyre failures, steering issues, or fluid leaks.\n\tComplete DVIR forms accurately and submit daily.\n\tMaintain a daily record of all inspections.\n\tEnsure drivers sign off before departure and after arrival.\n\tSupport compliance with company policies, HSE standards, and regulatory requirements.\n\tStop unfit vehicles from going on dispatch until repaired.\n\tCoordinate with mechanics and tyre officers for follow-up actions.\n\tAssist in monitoring preventive maintenance schedules.\n\tTake up IMS responsibilities such as reporting unsafe act, condition or procedure in the work place, participating in fire or emergency drill at work, participating in incident reporting and investigation when necessary and adherence to Company policies.\n\n\nMinimum Requirements\n\n\n\tSSCE / Technical certification.\n\t1–5 years of experience in fleet inspection, transport operations, or mechanical support.\n\tExperience with heavy-duty trucks and trailers preferred.\n\tBasic mechanical knowledge is an added advantage.\n\n\nCompetencies:\n\n\n\tStrong knowledge of truck/trailer inspection procedures.\n\tAbility to identify defects quickly and accurately.\n\tGood communication skills (for interacting with drivers, mechanics, and supervisors).\n\tHigh attention to detail.\n\tUnderstanding safety standards and DVIR documentation.\n\tStrong administrative and documentation skills.\n\tHigh attention to detail and accuracy.\n\n\nMethod of Application\nInterested and qualified candidates should forward their CV to: F.esawe@jmglimited.com using the Job Position as the subject to the mail.\n\n \n\n2.) Tyre Officer\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nBrief Description\n\n\n\tTyre Officer will ensure effective management, maintenance, and monitoring of all tyres across the fleet to reduce breakdowns, minimize operating costs, improve tyre lifespan, and support safe, reliable transport operations.\n\n\nDuties\n\n\n\tMaintain an accurate inventory of all tyres, tubes, rims, and related materials.\n\tTrack tyre issuance, returns, and replacements in the tyre register or digital system.\n\tIdentify minor defects and immediately report them to maintenance (lights, loose connections, leaks, worn components, missing items).\n\tEnsure proper storage and rotation of tyres to prevent deterioration.\n\tConduct tyre changes, repairs, patching, and rotations on trucks, trailers, pickups, and other fleet units.\n\tEnsure correct torqueing and alignment practices during installation.\n\tInspect tyres for wear, cracks, cuts, uneven patterns, and internal defects.\n\tRecommend tyres for replacement based on condition and safety standards.\n\tPerform regular tyre pressure checks according to manufacturer and company standards.\n\tIdentify pressure deviations and immediately rectify them to prevent blowouts or premature wear.\n\tCarry out pre-trip and post-trip tyre inspections for all outbound trucks.\n\tRecord tyre usage, mileage, CPK (Cost Per Kilometer), and performance for analysis.\n\tAssist in evaluating tyre brands, suppliers, and quality for procurement decisions.\n\tPrepare daily/weekly reports on tyre consumption, repairs, scrap analysis, and abnormalities.\n\tProvide technical support during breakdowns related to tyres on site or en-route.\n\tEnsure adherence to safety procedures during tyre handling, lifting, and repairs.\n\tSupport the workshop team with wheel alignment and balancing requirements (if equipment is available).\n\tTake up IMS responsibilities such as reporting unsafe act, condition or procedure in the work place, participating in fire or emergency drill at work, participating in incident reporting and investigation when necessary and adherence to Company policies\n\n\nMinimum Requirements\n\n\n\tMinimum of SSCE / Technical Certification.\n\t2 – 5 years of experience in tyre maintenance for heavy-duty trucks and trailers.\n\tKnowledge of tyre brands, load ratings, and repair procedures.\n\tExperience in commercial transport, logistics, or haulage industry preferred.\n\n\nCompetencies:\n\n\n\tStrong knowledge of truck and trailer tyre maintenance.\n\tHigh attention to detail and accuracy.\n\tAbility to diagnose tyre defects and recommend corrective actions.\n\tGood understanding of tyre pressure standards and safety protocols.\n\tStrong record-keeping and reporting skills.\n\tAbility to work under pressure and respond quickly to breakdowns.\n\tAttention to detail to prevent avoidable tyre-related failures.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: F.esawe@jmglimited.com using the Job Position as the subject of the email.\n\n \n\n \n\n3.) Administrative Logistic Officer\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nBrief Description\n\n\n\tLogistics Admin Officer will support the Transport Division with accurate journey data entry, system mapping, tracking updates, document renewals, and contract management.\n\tThe role ensures that all trips, costs, and compliance records are properly captured to enable operational planning, analysis, and performance reporting.\n\n\nDuties\n\n\n\tManage all data entries, trip creation, approvals, and mapping of workflows inside the Journey Management App.\n\tUpdate routes, KM benchmarks, trip types, delivery points, and return-to-base sequences.\n\tEnsure all client pricing, rates, and contract terms are correctly uploaded into the system.\n\tMaintain accurate trip logs for all departments and ensure full compliance with JMG journey policies.\n\tCapture and update KM per route, delivery zones, and expected mileage standards.\n\tRecord and validate diesel consumption, fueling entries, and reconcile with expected KM.\n\tUpload and track journey expenses, such as:\n\t\n\t\tTollgate fees\n\t\tPolice/escort receipts\n\t\tDriver allowances\n\t\tWorkshop emergency expenses\n\t\n\t\n\tSupport the Transport Analyst in generating Cost-Per-Kilometre (CPK) and route expense analysis.\n\tMaintain accurate records of vehicle status, drivers, geo-fences, and alert settings.\n\tSupport the Transport Analyst in generating Cost-Per-Kilometre (CPK) and route expense analysis.\n\tMonitor exceptions such as:\n\t\n\t\tDeviations\n\t\tNight movement\n\t\tOver-speeding\n\t\tUnauthorized stops\n\t\tLog incidents and escalate critical alerts to the Transport Analyst and Operations Team\n\t\n\t\n\tFollow up and renew all fleet documents:\n\t\n\t\tVehicle license, Roadworthiness\n\t\tInsurance (Comprehensive / TPL)\n\t\tPermits & regulatory papers,\n\t\tDriver’s license\n\t\n\t\n\tMaintain a renewal calendar with reminders and ensure 100% compliance.\n\tProcess accident, damage, and third-party insurance claims.\n\tCoordinate with insurance companies, workshops, and internal teams until resolution\n\tMaintain a detailed database of all claims for reporting.\n\tKeep updated records of all drivers, vehicles, trips, and renewals.\n\tSupport internal and external audits through proper documentation.\n\tAssist in preparing weekly or monthly reports including:\n\t\n\t\tVehicle license, Roadworthiness\n\t\tInsurance (Comprehensive / TPL)\n\t\tPermits & regulatory papers,\n\t\tDriver’s license\n\t\n\t\n\tTake up IMS responsibilities such as reporting unsafe act, condition or procedure in the work place, participating in fire or emergency drill at work, participating in incident reporting and investigation when necessary and adherence to Company policies\n\n\nMinimum Requirements\n\n\n\tOND / HND qualifications / B.Sc Degree in Logistics, Transport, Business Admin, or related field.\n\t1 – 3 years of experience in transport administration, tracking, or fleet support.\n\tExperience with fleet software or journey management apps is an advantage.\n\n\nCompetencies:\n\n\n\tStrong administrative and documentation skills.\n\tGood understanding of mileage, fuel standards, and transport workflows.\n\tAbility to use journey management platforms, tracking systems, and Excel.\n\tHigh attention to detail and accuracy.\n\tStrong follow-up and coordination skills.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: F.esawe@jmglimited.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]