[
  {
    "title": "Job Openings at Primovet Engineering Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-primovet-engineering-limited",
    "pubDate": "Wed, 02 Jul 2025 20:40:38 GMT",
    "source": "JobGurus",
    "keyword": "primovet engineering limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Primovet Engineering Limited is a proactive engineering construction company built on a culture of excellence and innovation.\n\nWe are recruiting to fill the following positions below:\n\n1.) Storekeeper\n\nJob Location: Lekki Phase 1, Lagos\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tReceive and inspect all incoming materials and reconcile with purchase orders.\n\tProperly label, store, and organize inventory in designated areas.\n\tMonitor inventory levels and notify management of low stock or discrepancies.\n\tMaintain cleanliness and orderliness of the store/warehouse.\n\tIssue materials and products to internal departments based on approved requisitions.\n\tMaintain accurate stock records and conduct regular stock counts.\n\tEnsure proper documentation for all stock movements (inward and outward).\n\tCoordinate with the procurement team regarding incoming deliveries and shortages.\n\tAssist with stock reconciliation and audits.\n\tComply with health, safety, and quality standards.\n\n\nRequirements\n\n\n\tInterested candidates should possess a minimum of OND qualification with 2 years of work experience.\n\n\nApplication Closing Date: 15th July, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: royalrecruitment77@gmail.com using the Job Position as the subject of the email.\n\nNote: Preferrably, candidate who lives on the Island.\n\n \n\n \n\n2.) Civil Engineer\n\nJob Location: Lekki Phase 1, Lagos\nEmployment Type: Full-time\n\nRequirements\n\n\n\tBachelor’s Degree in Civil Engineering or Structural Engineering.\n\tMinimum of 2 years of relevant experience in structural design and site supervision\n\tMust know how to do structural drawings.\n\tStrong command of structural design software and AutoCAD/Revit.\n\tSolid knowledge of construction practices, materials, and industry standards.\n\n\nApplication Closing Date: 20th July, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: royalrecruitment77@gmail.com using the Job Position as the subject of the email.\n\n \n\n3.) Architect\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nRequirements\n\n\n\tInterested candidates should possess a BSc, MSc qualification with at least 2 years experience.\n\tProficiency in design software (AutoCAD, Revit, SketchUp, Lumion, Adobe Creative Suite, etc.).\n\tStrong knowledge of building materials, construction techniques, and structural systems.\n\tGood understanding of sustainability and green building standards.\n\tExcellent communication, teamwork, and presentation skills.\n\n\nApplication Closing Date: 15th July, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: royalrecruitment77@gmail.com using the Job Position as the subject of the email.\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Structural Engineer Job at Craneburg Construction Company",
    "link": "https://www.jobgurus.com.ng/jobs/view/structural-engineer-job-at-craneburg-construction-company",
    "pubDate": "Wed, 02 Jul 2025 20:40:38 GMT",
    "source": "JobGurus",
    "keyword": "craneburg construction company",
    "duplicate": false,
    "classifications": [],
    "content": "Craneburg Construction Company is one of Nigeria’s largest, most diversified private construction groups. Our reputation as a highly responsive, client-focused establishment stems from extensive Tier 1 and large corporation experience With over 7000 team members, we work across all major sectors including: Oil and Gas, marine, FMCG, and government.\n\nWe are recruiting to fill the position below:\n\nJob Position: Structural Engineer\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Summary\nThe Structural Engineer will be responsible to:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tPerform structural analysis and design for buildings projects.\n\tCreate detailed structural drawings and documentation for construction.\n\tUtilize ETABS and SAFE for structural modeling and design tasks is preferable\n\tReview and revise structural plans as needed based on project requirements or site conditions.\n\n\nResponsibilities\nA summary of role’s responsibility is as follows:\n\n\n\tPrepare drawings, specifications, calculations, charts, and graphs, and monitor work for compliance with applicable codes.\n\tPlan and conduct independent work requiring judgment in the evaluation, selection, application and adaptation of engineering techniques, procedures, and criteria.\n\tProvide technical advice on safe designs and construction.\n\tObtain planning and/or building regulations approval.\n\tAnalyze configurations of the basic components of a structure.\n\tLiaise with professional staff such as architects and engineers.\n\tMonitor and inspect all work undertaken by contractors to ensure structural soundness.\n\tInspect properties to evaluate the conditions and foundations.\n\tAny other assigned task(s).\n\n\nRequirements\n\n\n\tCandidates should possess an HND / B.Sc Degree with 4 - 7 years of work experience.\n\n\nCompetencies Required:\n\n\n\tGood knowledge of construction processes, budget, materials, and legal regulations.\n\tProficiency in the use of office and engineering software like MS Office, AUTOCAD, Project, etc.\n\tHighly creative to design structural analysis, plan and design\n\tGood knowledge of ETABS & SAFE.\n\n\nSalary\nN500,000 - N600,000monthly gross\n\nMethod of Application\nInterested and qualified candidates should send their CV to: ayoade.hro@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Openings at Gomoney",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-gomoney",
    "pubDate": "Wed, 02 Jul 2025 20:40:38 GMT",
    "source": "JobGurus",
    "keyword": "gomoney",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Software Engineering"
    ],
    "content": "Gomoney is a digital bank dedicated to simplifying banking for everyone and contributing to a future where everyone is in control of their money. With tools to split, schedule, send, receive and track payments, users have the tools for better transaction processes and better understanding of their spending habits.\n\nWe are recruiting to fill the following positions below:\n\n1.) Customer Success Associate\n\nJob Location: Lagos\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAs a member of the team, you will be responsible for supporting and educating our customers on platform usage, inbound requests, and improving their gomoney experience. Initially, you will be working directly with our retail product customer segment.\n\tThis role gives you direct interaction with these customers, is critical to driving our customer satisfaction metrics, and is directly tied to the success of gomoney.\n\tYou will play a collaborative role in growing and implementing standards and processes.\n\tYou will maintain documentation such as correspondence and operational records and communicate promotional offers to customers.\n\n\n How Will You Create Impact?\n\n\n\tEvery person in Customer Operations (COps) has the power to solve problems quickly and with minimal fuss.\n\tWe'll give you all the tools and training you need so you know exactly how payments systems work, and you will listen to customers? concerns with positivity, empathy and patience.\n\n\nYour other responsibilities will include:\n\n\n\tOverseeing and assessing customer service staff activities and providing them with regular performance-related feedback.\n\tManage and resolve transaction escalations from outsourced agents, ensuring timely and accurate processing.\n\tManage customer inquiries and issues received via support emails and the gomoney Twitter account.\n\tCoordinate with the Sterling Team on LASRRA updates and resolve onboarding-related issues.\n\tReview and authenticate customer KYC profiles and onboarding information.\n\tEngage with customers, product teams, engineering, outsourced teams, and Sterling Team to resolve issues.\n\tUse Zendesk, Notion, Outlook Support Mail, gomoney admin dashboard, qoreID portal, Smile ID portal, Slack, and Teams to manage and document all customer engagements.\n\tInvestigating and solving customer service complaints.\n\tCadenced and structured communication of customer feedback to our Product & Engineering teams.\n\tDefining and further developing standards of service excellence for all platforms to achieve through high touch culture, guidance, and accountability\n\n\nRequirements\nThis might be for you if you have:\n\n\n\t1-2 years of experience in customer success, experience or support roles.\n\tExcellent communication and interpersonal skills.\n\tA strong ability to work independently and are proactive.\n\tA strong understanding of operational processes and of customer services.\n\n\nClick here to apply online\n\n \n\n2.) Android Engineer\n\nJob Location: Lagos\n\nJob Summary\n\n\n\tWe are looking for an Intermediate Android Developer to join our growing mobile team.\n\tAs part of our Android development team, you will be responsible for developing and enhancing the GoMoney app using modern technologies like Jetpack Compose, Dagger-Hilt, MVVM architecture, and Kotlin Coroutines and Flow.\n\tYou will collaborate closely with our product, design, and backend teams to ensure seamless integration and great user experiences.\n\n\nKey Responsibilities\n\n\n\tDesign, build, and maintain advanced Android applications using Jetpack Compose.\n\tImplement modern Android architecture (MVVM) using Kotlin Coroutines and Flow.\n\tIntegrate dependency injection with Dagger and Hilt for efficient code management.\n\tCollaborate with cross-functional teams (Product, UX/UI, Backend) to define, design, and ship new features.\n\tEnsure code quality through code reviews, testing (unit and integration), and best practices.\n\tTroubleshoot and resolve bugs, bottlenecks, and other issues in a timely manner.\n\tStay up-to-date with Android development trends, including Jetpack libraries and best practices.\n\n\nRequirements\nThis might be for you if you have:\n\n\n\t5 years plus of professional Android development experience.\n\tStrong knowledge of Kotlin and Android SDK.\n\tHands-on experience with Jetpack Compose for UI development.\n\tExperience with Git for version control.\n\tFamiliarity with RESTful APIs and JSON to connect Android applications to back-end services.\n\tExperience with testing frameworks such as JUnit, Espresso, or MockK.\n\tProficiency in using Coroutines and Flow for asynchronous programming.\n\tSolid understanding of MVVM architecture and its implementation in Android.\n\tExperience with Dagger and Hilt for dependency injection.\n\tStrong problem-solving skills and attention to detail.\n\tEffective communication skills and ability to collaborate with cross-functional teams.\n\tExperience with Room for local data storage.\n\tExperience with CI/CD pipelines (e.g., GitHub Actions, Bitrise).\n\tFamiliarity with other Jetpack components (Navigation, LiveData).\n\n\nNice-to-Have:\n\n\n\tExposure to Agile development methodologies.\n\tExperience with cross-platform mobile technologies such as Flutter or React Native\n\n\nClick here to apply online\n\n \n\n \n\n3.) Fraud Analyst\n\nJob Location: Lagos\n\nJob Summary\n\n\n\tAs the Fraud Analyst you'll be responsible for putting our team at the centre of the workplace by...\n\tResearching transactional anomalies and analyse information produced to detect any patterns of unusual internal or external conduct and recognize fraudulent activities.\n\tManages high volume caseload and investigates allegations and issues pertaining to financial fraud.\n\tDocuments investigations, including preliminary and final case reports, for both internal tracking and regulatory reporting purposes.\n\tReach out to banks and FI for repatriation of all fraudulent transactions our customers might have done.\n\tWorks with various departments to identify and eliminate fraud in an expeditious manner to minimize loss.\n\tBuilds relationships with Compliance and Legal Departments of Sterling Bank, effectively communicating and transferring information for case investigations.\n\tEffectively communicates and provides fraud/investigative reporting with team members, leaders, and others involved.\n\tAssists team members with questions/concerns on identified instances of fraud or potential fraud.\n\n\nRequirements\nThis might be for you if you have:\n\n\n\tCandidates should possess a Bachelor's Degree in Risk Management, Banking or related field required.\n\t2-3 years of experience in payment operations or related role is required.\n\tHave experience with electronic investigations including but not limited to online banking.\n\tA strong knowledge of cyber risk and common fraud typologies, along with emerging trends affecting fraud and financial crime.\n\tAbility to multi-task and pursue multiple initiatives simultaneously. Strong analytical, organizational and presentation skills.\n\tExcellent written, verbal communications skills and the ability to synthesize information and make clear, concise recommendations.\n\n\nClick here to apply online    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Logistics Manager Job at Fastest Cakes Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/logistics-manager-job-at-fastest-cakes-limited-12",
    "pubDate": "Wed, 02 Jul 2025 20:40:38 GMT",
    "source": "JobGurus",
    "keyword": "fastest cakes limited",
    "duplicate": false,
    "classifications": [],
    "content": "Fastest Cakes is a registered brand in Nigeria that focuses on delivering awesome and affordable cakes very fast. The company is deeply committed to ensuring that ordering and getting cakes for occasions is seamless and fun. The core team has some serious experience and has successfully produced and delivered over 10,000 cakes unscathed in Lagos.\n\nWe are recruiting to fill the position below:\n\nJob Position: Logistics Manager\nJob Location: Lekki, Lagos\nEmployment Type: Full-time\n\nJob description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are looking for a talented logistics manager to join our team. In this position, you will be responsible for planning deliveries and supervising drivers to deliver our cakes on time.\n\n\nResponsibilities\n\n\n\tPlanning and monitoring outgoing deliveries.\n\tDevelop new strategies to streamline processes and reduce costs.\n\tSupervising logistics, transportation, and customer delivery.\n\tOrganize workspace, label goods, plot routes, and process shipment.\n\tMust be computer literate.\n\tShould be able to use ride-hailing apps like Uber and Bolt.\n\tShould be conversant with locations within Lekki\n\n\nRequirements\n\n\n\tCandidates should possess a Bachelor's Degree qualification with at least 2 years of work experience.\n\tCandidate must reside in or around Lekki\n\tPay close attention to details\n\tSound knowledge of shipping processes and metrics.\n\tStrong communication, memorization, and teamwork skills.\n\tCapacity to perform your duties diligently, particularly during stressful situations.\n\tMust be able to work on some Sundays and holidays.\n\tWork from the office 23 days a month\n\tShould be willing to work with the company long term.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: admin@fastestcakes.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]