[
  {
    "title": "Audit Officer Job at May & Baker Nigeria Plc",
    "link": "https://www.jobgurus.com.ng/jobs/view/audit-officer-job-at-may-baker-nigeria-plc-2",
    "pubDate": "Tue, 01 Jul 2025 11:38:06 GMT",
    "source": "JobGurus",
    "keyword": "may & baker nigeria plc",
    "duplicate": false,
    "classifications": [],
    "content": "May & Baker Nigeria Plc was founded on September 4, 1944 as Nigeria's first pharmaceutical company. It has its origin in England, the United Kingdom in 1834 where three chemists founded Grimwade, May & Pickett, a firm for manufacturing chemicals for pharmaceutical products.\n\nWe are recruiting to fill the position below:\n\nJob Position: Audit Officer\n\nJob Location: Lagos\nWorking Hours: Full Time\nReporting to: the Audit Manager.\n\nQualifications\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe incumbent must possess a minimum of HND / B.Sc. in Accountancy with at least two (2) years of relevant experience.\n\tThe preferred candidate must possess excellent numerical and analytical skills. He/she must be computer literate with in-depth knowledge of Microsoft Excel.\n\n\nBenefits\nAttractive and Negotiable.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: careers@may-baker.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Construction Engineer Job at Jaza Energy",
    "link": "https://www.jobgurus.com.ng/jobs/view/construction-engineer-job-at-jaza-energy",
    "pubDate": "Tue, 01 Jul 2025 11:38:06 GMT",
    "source": "JobGurus",
    "keyword": "jaza energy",
    "duplicate": false,
    "classifications": [],
    "content": "Jaza is a solar energy start-up working to power Sub-Saharan Africa. We build solar-powered shops which charge batteries customers use to power their homes. In 2022, we achieved over 1.5 million battery swaps, providing approximately 186,000 people access to clean, affordable energy. We employ women from each community (known as Jaza Stars) to run the service, empowering our team to become leaders, entrepreneurs and drivers of economic growth within their communities. We’ve already successfully entered the Nigerian market, piloted several sites here and will grow to hundreds of locations over the next year. To support this expansion, we’re planning to hire over 200 people over the next 6 months.\n\nWe are recruiting to fill the position below:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Position: Construction Engineer\n\nJob Location: Ibadan, Oyo\nJob Function: Expansion\nDesignation: Acquisition Team Lead\nEmployment Type: Contract\nWorkplace Type: Onsite\n\nJob Role\nThe Expansion Construction Engineer is the owner of the process of service location acquisition, renovations and installation in our expansion process into new sites. The Expansion Construction person finds suitable service locations, negotiates, leases, procure equipment, renovates, installs, audits and signs off on those allocated sites according to our company’s predefined standards.\n\n\n\tAssess approved sites and identify suitable services locations, shops / plots of land for leasing that meet our defined standards.\n\tManage the lease or acquisition of shops or plot of land that meet our service location criteria.\n\tAssess the acquired service location and identify preparations or renovations requirements.\n\tManage the sourcing of appropriate furniture producing factories/contractors that meet the set criteria to produce Jaza furniture and install hubs across allocated sites.\n\tManage quality checklists and ensure that they are adhered to in the process of acquisition, renovation and construction.\n\tWork effectively with engineers, supply chain, and other construction teams, ensuring seamless integration between different parts of the project.\n\tRequest, procure, take delivery and document required items, tools and equipment needed for the completion of the work.\n\tEnsure availability of furniture across allocated regions/sites undergoing Expansion to ensure there are no delays in the set timelines.\n\tMonitor renovations and construction needs and constantly reports need for tools, materials and equipment with reference to the set targets across allocated locations undergoing Expansion\n\tDocument and report milestones reached during this process.\n\n\nQualifications\n\n\n\tA relevant Degree in Construction Management, Civil Engineering or a related field.\n\tMinimum of 2 years hands-on experience in similar role.\n\tUnderstanding of the overall construction process, including shop or land negotiation, leasing and acquisition, renovation, site preparation, furnishing and foundation work, and structural assembly.\n\tAbility to interpret blueprints and design specifications, especially for our customized hubs, ensuring they meet both the structural and electrical needs for solar installations.\n\tAbility to think critically and come up with solutions for unique or complex construction challenges, particularly when working with already built shops.\n\tGood data collection, analytical, and reporting skills.\n\tAbility to commit to high level quality standards.\n\tClear communication skills to interact with suppliers, contractors, and other stakeholders and explain complex technical concepts in simple terms.\n\tAbility to work independently, interact with people of different backgrounds, cultures, languages and to travel frequently to remote locations.\n\n\nMust have skills:\n\n\n\tconstruction\n\tCommunication\n\tland / Site Purchase\n\tConstruction Management\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Quality Assurance Officer Job at ReelFruit",
    "link": "https://www.jobgurus.com.ng/jobs/view/quality-assurance-officer-job-at-reelfruit-2",
    "pubDate": "Tue, 01 Jul 2025 11:38:06 GMT",
    "source": "JobGurus",
    "keyword": "reelfruit",
    "duplicate": false,
    "classifications": [],
    "content": "ReelFruit, founded in 2012, is the market leader in the healthy snack category, pioneering the introduction of healthy dried fruit as a snack in the Nigerian market. The company was founded on a mission to build a scalable agribusiness to add value to raw materials locally and produce, package and distribute locally made snacks that could sit on any shelf in the world!\n\nWe are recruiting to fill the position below:\n\nJob Position: Quality Assurance Officer\n\nJob Location: Abeokuta, Ogun\nEmployment Type: Full-time\n\nDuties and Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tEnsure compliance to quality policy, procedures, work instructions, and documented quality systems. In addition, ensure compliance to statutory and regulatory requirements.\n\tCarry out inspection upon arrival of raw materials, packaging materials and inputs against specifications and submit reports after inspection.\n\tEnsure all quality procedures for fruit washing and storage are observed.\n\tCheck the peeling and cutting quality, and complete the quality control sheet at Processing.\n\tCheck the packing quality and complete the quality control sheet at Packing.\n\tConduct quality control on pallets in accordance to the finished goods control procedure.\n\tEnsure daily calibration and verification of all measuring equipment in the laboratory and in the factory.\n\tMonitor and control all storage areas and conditions.\n\tContinuous training and coaching of factory employees on Food safety and quality issues.\n\tFulfillment of housekeeping and environmental standards.\n\tReport any non-compliance detected in relation to both the Quality and Food safety management system to the Quality manager.\n\tReport immediately any non-conformity on product quality detected to the QA manager.\n\tReport immediately any breakage, damage or malfunction of equipment to the QA manager.\n\tEnsure samples for analyses are properly taken for each batch.\n\tManage and maintain all tools and equipment for carrying out quality control checks: in the laboratory and in the factory.\n\tEnsure proper and prompt filing of records: maintain organized and accessible records for analysis and reference.\n\tEnsure correct traceability of products and records.\n\tSupporting process improvements throughout the testing and quality assurance processes\n\tAdhere to all health and safety guidelines in the factory.\n\n\nSupervisory duties:\n\n\n\tAppraise the performance of immediate team members, identify their training needs and organize or recommend appropriate training for them.\n\tAdminister disciplinary measures of immediate team members in accordance with the company’s disciplinary procedures\n\tInterpret policies and procedures to immediate team members and where necessary, consult superior or appropriate departments.\n\n\nEducational Qualifications, Experience & Requirements\n\n\n\tBachelor's Degree / HND or higher in Food Science, Agribusiness or a related field.\n\tAt least two (2) years of professional or sector / industry experience.\n\tFlexibility based on factory production schedule.\n\tKnowledge of the use of measuring equipment.\n\tKnowledge of GMPs\n\tKnowledge of the HACCP system\n\tExcellent planning, analytical and organizational skills\n\tAbility to work with little or no supervision.\n\tProficiency in Microsoft Applications.\n\tIntegrity and accountability\n\tFluency in English – excellent communication skills, both oral and written.\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]