[
  {
    "title": "Product Marketer / Sales Representative Job at Zooad HR Partner",
    "link": "https://www.jobgurus.com.ng/jobs/view/product-marketer-sales-representative-job-at-zooad-hr-partner",
    "pubDate": "Mon, 23 Jun 2025 09:19:12 GMT",
    "source": "JobGurus",
    "keyword": "zooad hr partner",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "At Zooad HR Partner we believe that people are the backbone of any successful organization. That's why we're dedicated to providing innovative HR solutions, outsourcing services, and training programs that empower businesses and enhance people. We're not just an HR consulting firm; we're passionate advocates for business growth, employee development, and organizational excellence. Our team of experts has extensive experience in HR consulting and outsourcing, and we're committed to delivering personalized solutions that meet the unique needs of each client.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Product Marketer / Sales Representative\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tWe're seeking a results-driven Product Marketer/Sales Representative to promote our products and drive revenue growth.\n\tAs a key member of our sales team, you'll develop and execute sales strategies, build strong customer relationships, and collaborate with cross-functional teams to achieve business objectives.\n\n\nResponsibilities\n\n\n\tDevelop and implement sales strategies to meet revenue targets\n\tIdentify and pursue new business opportunities\n\tCollaborate with marketing team to develop effective sales materials and campaigns\n\tPresent product demonstrations and pitches to potential customers\n\tBuild and maintain strong relationships with customers and partners\n\tConduct market research to stay up-to-date on industry trends and competitor activity\n\tNegotiate and close deals to meet sales targets\n\n\nRequirements\n\n\n\t1+ years of experience in sales, marketing, or business development\n\tProven track record of meeting or exceeding sales targets\n\tExcellent communication, interpersonal, and negotiation skills\n\tStrong product knowledge and ability to understand complex technical information\n\tAbility to work independently and as part of a team\n\tStrong analytical and problem-solving skills\n\n\nPreferred Qualifications:\n\n\n\tExperience in product marketing, sales, or a related field\n\tFamiliarity with CRM software and sales tools\n\tStrong networking and relationship-building skills\n\tAbility to work in a fast-paced environment and adapt to changing priorities.\n\n\nWhat We Offer\n\n\n\tSalary: N120,000 - N200,000 Monthly.\n\tCompetitive salary and commission structure\n\tOpportunity to work with a dynamic and growing company\n\tCollaborative and supportive work environment\n\tProfessional development and growth opportunities\n\n\nMethod of Application\nInterested and qualified candidates should send their resume and cover letter outlining their qualifications and experience to: zooadpartnes.hr@gmail.com using \"Inventory Staff Application - Abuja\" as the subject of the mail.\n\nNote: If you're a motivated and results-driven sales professional looking for a challenging and rewarding role, apply.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Hospital Administrator Job at Kelina Hospital",
    "link": "https://www.jobgurus.com.ng/jobs/view/hospital-administrator-job-at-kelina-hospital",
    "pubDate": "Mon, 23 Jun 2025 09:19:12 GMT",
    "source": "JobGurus",
    "keyword": "kelina hospital",
    "duplicate": false,
    "classifications": [],
    "content": "Kelina Hospital is a surgical hospital, with a focus on Minimally Invasive Surgery. Kelina was the first private hospital in Nigeria to do Laser Lithotripsy for Kidney Stones (PCNL, RIRS, 2011), Laparoscopic Radical Prostatectomy, LRP (2012), and Holmium Laser Enucleation of the Prostate (HoLEP, 2018). Kelina does Laparoscopic Surgery in General Surgery, Urology, Gynaecology amongst others. HoLEP, LRP, PCNL, RIRS are the most common surgeries we do each week.\n\nWe are recruiting to fill the position below:\n\nJob Position: Hospital Administrator\n\nJob Location: Off Adeola Odeku Street, Victoria Island - Lagos\nEmployment Type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tChief Admin Officer reporting only to CEO and Board.\n\tChief Admin Officer in charge of coordinating and supervising all HODs.\n\tResponsibility for business, growth, customer satisfaction, hour-by-hour, day-to-day smooth operations of every aspect of the hospital, including facility, Plant and HR management.\n\n\nRequirements\nTo be eligible, candidate must:\n\n\n\tBe University Graduate with relevant certifications.\n\tBe resident in Lagos.\n\tHave post-NYSC job experience in administration, especially in related fields supervising not less than 50 staff.\n\tBe highly computer-skilled.\n\tBe certified by relevant professional bodies where this applies.\n\n\nRemuneration\nNot less than N6,000,000 per annum.\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Customer Care Representative Job at Kaelot Gift Shop",
    "link": "https://www.jobgurus.com.ng/jobs/view/customer-care-representative-job-at-kaelot-gift-shop",
    "pubDate": "Mon, 23 Jun 2025 09:19:12 GMT",
    "source": "JobGurus",
    "keyword": "kaelot gift shop",
    "duplicate": false,
    "classifications": [],
    "content": "Kaelot Gift Shop, Nigeria's leading Gifting Company, is recruiting to fill the position below:\n\nJob Position: Customer Care Representative\n\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\nStart Date: Immediate\n\nSummary\n\n\n\tAre you friendly, organized, and passionate about creating amazing customer experiences? We’re looking for a reliable and detail-oriented Customer Care Representative to join our team!\n\n\nWhat You’ll Be Doing\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWelcoming and assisting walk-in customers with a warm, helpful attitude\n\tProcessing orders quickly and accurately for both in-store and delivery customers\n\tManaging inventory—stocking, counting, and making sure nothing goes missing\n\tKeeping the store clean, tidy, and beautifully arranged every day.\n\n\nYou’re a Great Fit If You\n\n\n\tCommunicate clearly and confidently\n\tAre proactive and can multitask without breaking a sweat\n\tAn organized and have strong attention to detail\n\tHave basic computer or POS skills\n\tLive in or near Ikeja and can resume work on time, every time.\n\n\nSalary\nN65,000 monthly.\n\nMethod of Application\nInterested candidates should send their cover letter and CV to: hrkaelot@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Front Desk Officer Job at TeamAce Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/front-desk-officer-job-at-teamace-limited-2",
    "pubDate": "Mon, 23 Jun 2025 09:19:12 GMT",
    "source": "JobGurus",
    "keyword": "teamace limited",
    "duplicate": false,
    "classifications": [],
    "content": "TeamAce Limited - Our client, a leading Aesthetic Clinic, is recruiting to fill the position below:\n\nJob Position: Front Desk Officer\nJob Location: Lagos,\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tAs the Front Desk Officer, you will be responsible for managing patient interactions, scheduling appointments, and performing general administrative duties to ensure a smooth and welcoming front desk experience.\n\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tGreet and attend to patients warmly and professionally\n\tManage appointment bookings and handle inquiries across all platforms\n\tMaintain patient records, ensure confidentiality, and follow up on scheduled visits\n\tHandle payment processing and follow-up for outstanding balances\n\tMonitor and update the clinic inventory, including consumables and materials\n\tSupport administrative tasks and coordinate daily clinic flow.\n\n\nRequirements\n\n\n\tOND/HND is required\n\tMinimum of 2 years with HMO experience\n\tKnowledge of labor laws and HR best practices.\n\n\nSalary\nN130,000 - N150,000 per month.  \n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]