[
  {
    "title": "Assistant Facility Manager Job at Dana Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/assistant-facility-manager-job-at-dana-group",
    "pubDate": "Sat, 14 Jun 2025 16:17:32 GMT",
    "source": "JobGurus",
    "keyword": "dana group",
    "duplicate": false,
    "classifications": [],
    "content": "Dana Group is a major Nigerian conglomerate with a diverse range of businesses spanning manufacturing, aviation, automotive, and pharmaceuticals.It's known for its contributions to Nigeria's industrialization and has diversified into various sectors over its history.\n\nWe are recruiting to fill the position below:\n\nJob Position: Assistant Facility Manager\n\nJob Location: Oshodi-Isolo, Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking an experienced Assistant Facility Manager to join our team.\n\tAs an Assistant Facility Manager, you'll play a key role in ensuring the smooth operation of our facilities, supporting our employees, and maintaining a safe and efficient work environment.\n\n\nResponsibilities\n\n\n\tAssist the Facility Manager in overseeing daily facility operations, maintenance, and repairs\n\tManage and perform routine maintenance and repairs of office equipment and systems, including:\n\tAir Conditioning (AC) systems\n\tFurniture and fixtures (e.g., chairs, tables, cabinets)\n\tElectrical systems and lighting\n\tPlumbing and water systems\n\tSupervising and guiding technicians and maintenance staff\n\tAssigning tasks and ensuring timely completion of work orders\n\tProviding training and development opportunities for team members\n\tBuilding maintenance and repairs (e.g., painting, carpentry, etc)\n\tCoordinate with vendors and contractors for larger maintenance and repair projects\n\tLead and coordinate the facility team, including:\n\tEnsure compliance with safety regulations, building codes, and company policies\n\tDevelop and implement facility management plans, budgets, and procedures\n\tProvide excellent customer service to employees, visitors, and stakeholders\n\tMonitor and control facility-related expenses and budgets\n\tIdentify opportunities for cost savings and efficiency improvements\n\n\nRequirements\n\n\n\tMinimum of 4 years of proven experience in a similar role.\n\tExcellent analytical and problem-solving skills.\n\tAttention to detail and accuracy in work.\n\tBasic knowledge of electrical, plumbing, and HVAC systems\n\tStrong knowledge of facility operations, maintenance, and management\n\tExcellent leadership, communication, organizational, and problem-solving skills\n\tAbility to work independently and as part of a team\n\tProximity to Isolo, Lagos State\n\n\nMethod of Application\nInterested and qualified candidates should send their CVs to: vacancies@danagroup.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Customer Relation Officer Job at Domino Stores Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/customer-relation-officer-job-at-domino-stores-limited",
    "pubDate": "Sat, 14 Jun 2025 16:17:32 GMT",
    "source": "JobGurus",
    "keyword": "domino stores limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Domino Stores Limited is a private Nigerian Group of Companies, operating retail, and hospitality and property business.\n\nWe are recruiting to fill the position below:\n\nJob Position: Customer Relation Officer\n\nJob Location: Sabo, Yaba - Lagos\nEmployment Type: Part-time\n\nResponsibilties\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tEscort customers to the appropriate aisle or shelve in order to assist with purchasing decisions.\n\tEnsure the store is clean and safe.\n\tEnsure the shelves and display areas are well stacked, including fridges and freezers appropriately.\n\tCleaning the shelves and keeping stock neat and tidy\n\tAnswering customer enquiries and/or passing them on to the appropriate officer in charge.\n\tKeep shelves fully stocked with appropriate products.\n\tEnsure that products are accurately labelled.\n\tProcess customer orders and payments.\n\tMaking sure that fridges and freezers are atthe correct temperature.\n\tMaking sure that the customer’s experience is a positive one.\n\n\nRequirements\n\n\n\tNational Diploma in any field or equivalent qualification required.\n\tA minimum of 6 months of experience as a Supermarket Attendant.\n\tProven customer service or retail experience is a plus.\n\tGreat attention to detail.\n\tGood communication and people skills.\n\n\nMethod of Application\nInterested and qualified candidates should send their Resume in PDF or MS Word  to: career.dominostores@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Supervisor Job at Crescent Rice Mill Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/supervisor-job-at-crescent-rice-mill-limited",
    "pubDate": "Sat, 14 Jun 2025 16:17:32 GMT",
    "source": "JobGurus",
    "keyword": "crescent rice mill limited",
    "duplicate": false,
    "classifications": [],
    "content": "Crescent Rice Mill Limited is a leading rice processing company located at KM 15, Kano - Gumel Road, Jogana, Kano, Nigeria. With a vision to provide high-quality rice products to homes and businesses across Nigeria, we leverage advanced milling technology and a dedicated workforce to meet our customers' demands. We specialize in producing a variety of rice products, including Head Rice, Broken Rice, Reject Rice, Khus-Khus Rice, and Rice Bran. Our operations are strategically located in Kano, Nigeria’s commercial hub, enabling us to maintain efficient distribution channels across the nation.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nFounded with a commitment to excellence and sustainability, Crescent Rice Mill Limited collaborates with local farmers to source premium rice paddy, ensuring that our processes support the agricultural community and promote economic development.\n\nWe are recruiting to fill the position below:\n\nJob Position: Supervisor\n\nJob Location: Kano\nEmployment Type: Full-time\n\nKey Duties and Responsibilities\nSupervision and Training:\n\n\n\tTrain and supervise operational staff to ensure they meet safety, quality, and productivity standards.\n\tConduct regular training sessions for employees on safety protocols, equipment handling, and best operational practices.\n\tProvide ongoing coaching and performance evaluation for workers to improve efficiency and maintain high-quality output.\n\tEnsure that all team members understand their responsibilities and follow the company’s policies and standard operating procedures.\n\n\nProduction Oversight:\n\n\n\tOversee rice milling operations, ensuring that production targets are met while minimizing waste and inefficiencies.\n\tImplement effective strategies to improve production speed and quality while maintaining cost efficiency.\n\tWork closely with other departments, including Quality Control and Maintenance, to ensure smooth production flow.\n\tMonitor raw material inputs, track production output, and identify areas for improvement to enhance operational effectiveness.\n\n\nQuality Control and Compliance:\n\n\n\tEnsure all production activities adhere to industry quality control standards and company policies.\n\tConduct routine inspections to verify that rice products meet company and regulatory specifications.\n\tWork closely with the Quality Control team to address any issues related to product defects or inconsistencies.\n\tMaintain compliance with food safety standards, including NAFDAC, SON, and other regulatory requirements.\n\n\nOperational Efficiency and Reporting:\n\n\n\tPrepare and weeklyproduction reports detailing output, efficiency, and any operational challenges encountered.\n\tImplement measures to optimize raw material usage and minimize waste, ensuring cost-effective operations.\n\tMaintain accurate documentation of production activities, including machine performance, worker attendance, and any incidents or accidents.\n\n\nEquipment and Facility Management:\n\n\n\tEnsure that all milling equipment is functioning properly and coordinate with the maintenance team for scheduled servicing and repairs.\n\tMonitor machinery performance and identify potential issues before they cause production delays.\n\tImplement preventive maintenance schedules to reduce equipment breakdowns and extend machine lifespan.\n\tEnsure cleanliness and proper organization of the production facility to maintain a safe and efficient working environment.\n\n\nHealth, Safety, and Staff Welfare:\n\n\n\tEnforce health and safety policies to protect workers from potential hazards in the production environment.\n\tEnsure that all employees wear appropriate protective gear and follow safety procedures at all times.\n\tInvestigate and document any workplace accidents or incidents, recommending measures to prevent future occurrences.\n\tPromote a positive and productive work environment by addressing employee concerns and fostering teamwork.\n\n\nRequirements\n\n\n\tInterested candidates should possess a Bachelor's / Master`s Degree with 4 - 6 years of work experience. \n\n\nSalary\nN150,000 - N250,000 per month. \n\nMethod of Application\nInterested and qualified candidates should send their CV to: hr.crescentricemill@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Audit Officer Job at Taeillo",
    "link": "https://www.jobgurus.com.ng/jobs/view/audit-officer-job-at-taeillo",
    "pubDate": "Sat, 14 Jun 2025 16:17:32 GMT",
    "source": "JobGurus",
    "keyword": "taeillo",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Taeillo is an e-commerce furniture and lifestyle brand that manufactures furniture by specializing in African-inspired designs.\n\nWe are recruiting to fill the position below:\n\nJob Position: Audit Officer\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\n\nThe Position\n\n\n\tWe are looking for an internal auditor to provide guidance on financial accuracy, internal controls and regulatory compliance.\n\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tResponsible for examining and improving operating practices, and financial and risk management processes of the organization.\n\thandle corporate transparency by conducting audits, generating reports, and ensuring compliance. They analyze risks, monitor regulations, and maintain trust and communication with various departments.\n\tDeveloping, implementing and maintaining internal audit policies and procedures in accordance with local and international best practice.\n\tIdentifying and reducing all business and financial risks through effective implementation and monitoring of controls.\n\tConducting ad hoc investigations into identified or reported risks.\n\tOverall supervision of planned annual audits.\n\tEvaluate the design and effectiveness of internal controls, including segregation of duties, access controls, and authorization processes.\n\tPerform internal audits, reviews, and testing procedures to assess the reliability and accuracy of financial and operational information.\n\tDocument audit findings, observations, and recommendations in audit reports, and communicate results to management and stakeholders.\n\n\nRequirements\n\n\n\tBachelor's degree in accounting, finance, business administration, or related fieldis required.\n\t5-7 years of work experience in a similar role.\n\tProven experience in a manufacturing company will be a added advantage.\n\tProven experience in internal auditing, internal controls, or risk management roles.\n\tStrong understanding of internal control principles, practices, and frameworks.\n\n\nSalary\nN250,000 - N300,000 per month. \n\nMethod of Application\nInterested and qualified candidates should send their CV to: peopleandculture@taeillo.com using the Job Position as the subject of the email.\n\nNote: Do not apply for this role if you do not have the above stated requirements.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Quality Control Officer Job at Erisco Foods Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/quality-control-officer-job-at-erisco-foods-limited-4",
    "pubDate": "Sat, 14 Jun 2025 16:17:32 GMT",
    "source": "JobGurus",
    "keyword": "erisco foods limited",
    "duplicate": false,
    "classifications": [],
    "content": "Erisco Foods Limited is an indigenous food product manufacturer, incorporated in Nigeria in 2004 and started operations in 2009, manufacturing Tomato Paste, Seasoning, Rice, Milk cubes and more. We are firmly committed to producing high-quality products that combine nourishment with value pricing, as they strive to become one of Nigeria’s largest indigenous foodmanufacturers on a global scale.\n\nWe are recruiting to fill the position below:\n\nJob Position: Quality Control Officer\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a detail-oriented and proactive Quality Control Officer to ensure that our products meet internal and external quality standards.\n\tThe ideal candidate will be responsible for monitoring all production stages, ensuring that quality procedures are followed, and supporting continuous improvement initiatives.\n\n\nKey Responsibilities\n\n\n\tInspect raw materials, in-process, and finished products to ensure compliance with quality standards.\n\tConduct routine quality control tests and maintain accurate records of results.\n\tMonitor and enforce hygiene and safety standards throughout the production process.\n\tReport any quality issues and work closely with production and maintenance teams for prompt resolution.\n\tAssist in the development and implementation of quality control procedures and documentation.\n\tParticipate in internal audits and support regulatory inspections.\n\tProvide training to production staff on quality standards and procedures.\n\n\nQualifications and Requirements\n\n\n\tB.Sc./HND in Food Science & Technology, Microbiology, Industrial Chemistry, or a related field.\n\tMinimum of 2 years of experience in a quality control role within a manufacturing or FMCG environment.\n\tStrong knowledge of food safety standards (e.g., HACCP, ISO 22000).\n\tAttention to detail and excellent analytical skills.\n\tAbility to work under pressure and in a fast-paced production environment.\n\tGood communication and teamwork skills.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and Cover Letter to: recruitment@eriscofoodsltd.com.ng using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]