[
  {
    "title": "Graphics Designer Job at Smart Partners Consulting Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/graphics-designer-job-at-smart-partners-consulting-limited",
    "pubDate": "Tue, 24 Jun 2025 11:38:06 GMT",
    "source": "JobGurus",
    "keyword": "smart partners consulting limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Smart Partners Consulting Limited (SPCL) is an indigenous consulting firm poised on the business model of collaboration to provide professional services of Human Resources and Business Strategy to different companies in various sectors of Nigeria’s economy. It was incorporated in July 2013. Our idea of collaboration and partnership involves the synergy of tested experts in the marketplace to research, identify and proffer solutions to the ever-dynamic needs of our Clients.\n\nWe are recruiting to fill the position below:\n\nJob Position: Graphics Designer\n\nJob Location: Lagos\nEmployment Type: Full-time / On-Site\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a creative, detail-oriented Graphics Designer to join our team.\n\tThe ideal candidate is a visual storyteller who can conceptualize and design compelling content across digital and print platforms.\n\tYou must be skilled in design software, have a strong eye for aesthetics, and be able to manage multiple projects under tight deadlines.\n\n\nResponsibilities\n\n\n\tDevelop and design visual content including social media creatives, marketing collateral, website banners, brochures, flyers, logos, and presentations.\n\tCollaborate with the marketing, social media, and content teams to interpret concepts and translate them into engaging visual designs.\n\tCreate layouts and design templates that are visually appealing and brand-consistent.\n\tEnsure final graphics and layouts are visually appealing, on-brand, and delivered on time.\n\tMaintain brand consistency across all design projects.\n\tRevise designs based on feedback and approval cycles.\n\tStay updated on industry trends and tools to bring fresh, modern visuals to campaigns.\n\n\nQualifications and Experience\n\n\n\tBachelor’s Degree in Graphic Design, Fine Arts, or a related field (or equivalent work experience).\n\tProven experience as a Graphics Designer or similar role.\n\tProficient in Adobe Creative Suite (Photoshop, Illustrator etc.) and other design tools like Canva and CorelDRAW.\n\tAttention to detail, creativity, and the ability to deliver quality work under deadlines.\n\tAbility to receive constructive feedback and adjust designs accordingly.\n\tStrong portfolio showcasing a variety of design projects.\n\tExcellent visual design skills with a strong understanding of typography, color theory, and layout techniques.\n\tSound knowledge of motion graphics or video editing is a plus.\n\n\nSkills and Competencies:\n\n\n\tExcellent strategic thinking capabilities.\n\tHigh attention to detail and accuracy.\n\tStrong communication and presentation skills.\n\tAbility to work under pressure and meet tight deadlines.\n\tCommercial awareness and problem-solving mindset.\n\n\n     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "HR Business Partner Job at FelamokHR Consulting Services Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/hr-business-partner-job-at-felamokhr-consulting-services-limited",
    "pubDate": "Tue, 24 Jun 2025 11:38:06 GMT",
    "source": "JobGurus",
    "keyword": "felamokhr consulting services limited",
    "duplicate": false,
    "classifications": [],
    "content": "FelamokHR Consulting Services Limited is a Human Resource company with over a decade of business excellence and management consulting practice, head-quartered in Lagos, Nigeria.\n\nWe are recruiting to fill the position below:\n\nJob Position: HR Business Partner\n\nJob Location: Abuja (FCT) \nEmployment Type: Full-time\n\nRole Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tFelamokHR is a dynamic and forward-thinking human resource consulting firm committed to delivering innovative HR solutions to clients across Nigeria. Our services include recruitment, HR outsourcing, strategy development, talent management, and employee relations. We pride ourselves on professionalism, integrity, and results.\n\tAs we expand our impact and reach, we are seeking a strategic and experienced HR Business Partner (HRBP) to join our growing team in Abuja.\n\tThe HR Business Partner will serve as a strategic advisor to both internal teams and external client organizations. This role is responsible for aligning business objectives with HR solutions, fostering organizational effectiveness, and driving HR initiatives that support client needs and internal operations.\n\n\nKey Responsibilities\n\n\n\tPartner with client organizations to understand their business strategy and deliver tailored HR solutions.\n\tSupport the design and execution of talent management programs including workforce planning, succession planning, and employee engagement.\n\tManage full-cycle recruitment processes for both internal and client roles, ensuring top-tier talent placement.\n\tFacilitate learning and development initiatives that build leadership and functional capabilities.\n\tCollaborate with client management teams to drive organizational culture and change initiatives.\n\tDevelop and implement HR policies and procedures in compliance with Nigerian labor laws and client expectations.\n\tProvide expert guidance on employee relations, performance management, conflict resolution, and disciplinary processes.\n\tAnalyze HR data and metrics to inform decisions and improve service delivery.\n\tPrepare HR reports, dashboards, and insights for internal and client use.\n\tStay abreast of HR best practices, trends, and regulatory changes.\n\n\nRequirements & Qualifications\n\n\n\tBachelor's Degree in Human Resource Management, Industrial Relations, Psychology, or a related field (Master’s degree or CIPM certification is an added advantage).\n\t5+ years of progressive HR experience, preferably with consulting or multi-industry exposure.\n\tStrong knowledge of Nigerian labor laws and HR compliance standards.\n\tExcellent interpersonal and communication skills.\n\tProven ability to build relationships and influence stakeholders at all levels.\n\tHigh emotional intelligence, problem-solving skills, and strategic thinking.\n\tProficiency in HRIS tools and Microsoft Office Suite.\n\n\nSalary\nN200,000 - N300,000 / month.\n\nWhat We Offer:\n\n\n\tCompetitive salary and performance-based incentives\n\tA supportive and collaborative work environment\n\tProfessional development and growth opportunities\n\tExposure to diverse industries and high-impact HR projects.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and a brief cover letter to: hr.greengrassnigeria@gmail.com using “Application – HR Business Partner – Abuja” as the subject of the mail.\n\nNote: FelamokHR Consulting Services Limited is an equal opportunity employer. We value diversity and are committed to creating an inclusive environment for all employees.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Account Officer Job at Joefelin Resources",
    "link": "https://www.jobgurus.com.ng/jobs/view/account-officer-job-at-joefelin-resources",
    "pubDate": "Tue, 24 Jun 2025 11:38:06 GMT",
    "source": "JobGurus",
    "keyword": "joefelin resources",
    "duplicate": false,
    "classifications": [],
    "content": "Joefelin Resources is a Recruitment, Training, Manpower Development Consultants & Specialists company.\n\nWe are recruiting to fill the position below:\n\nJob Position: Account Officer\n\nJob Location: Alimosho, Lagos\nEmployment Type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tRecording transactions\n\tPayments and expenses and processing invoices.\n\tSend out bills and invoices,\n\tFollow up on overdue payments.\n\tEnsure that a company's invoices and payments match up\n\tCross-checking the original document to the company's record.\n\tMonitor and track financial transactions, expenses, and budgets to ensure compliance with regulations and company policies.\n\n\nRequirements\n\n\n\tCandidates should possess a Bachelor's Degree with a minimum of 2 years of work experience.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: recruitjfc@gmail.com using the Job Position as ths subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Social Media Manager Job at Future Moves Recruitment Agency",
    "link": "https://www.jobgurus.com.ng/jobs/view/social-media-manager-job-at-future-moves-recruitment-agency",
    "pubDate": "Tue, 24 Jun 2025 11:38:06 GMT",
    "source": "JobGurus",
    "keyword": "future moves recruitment agency",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance"
    ],
    "content": "Future Moves Recruitment Agency is a licensed full-fledged Human Resource Firm with extensive expertise and experience in human capital development and staffing. Your preferred end-to-end HR partner.\n\nWe are recruiting to fill the position below:\n\nJob Position: Social Media Manager\n\nJob Location: Iyana Bodija, Ibadan - Oyo\nWorking Days: Monday to Friday\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tFMR Agency is looking for a Social Media Manager to lead our client's digital presence and inspire travellers through engaging content.\n\tThis role involves creating and executing social media strategies, managing content across multiple platforms, interacting with our travel community, and running targeted campaigns to boost brand awareness and bookings.\n\tThe ideal candidate is passionate about travel, has a strong understanding of social media trends, and is skilled in content creation, storytelling, and performance analytics.\n\n\nKey Responsibilities\n\n\n\tDeveloping the social media strategies\n\tCreating content for social media platforms\n\t?Doing competitor research\n\tMonitoring social media performance\n\tEngaging with the online community\n\tScheduling or publishing posts\n\tCopywriting\n\tFlexibility\n\tDriving organization online presence to achieve business goals\n\tCreating graphics.\n\n\nSalary\nN100,000 - N150,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: recruiter.k@fmragency.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Assistant HR/IR Manager Job at Lafarge Africa Plc",
    "link": "https://www.jobgurus.com.ng/jobs/view/assistant-hrir-manager-job-at-lafarge-africa-plc",
    "pubDate": "Tue, 24 Jun 2025 11:38:06 GMT",
    "source": "JobGurus",
    "keyword": "lafarge africa plc",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Lafarge Africa Plc is a member of the LafargeHolcim Group – the biggest building and concrete solutions company in the world. It is a publicly quoted company on the Nigerian Stock Exchange (NSE) and serves Nigeria with a wide range of building and construction solutions designed to meet housing and construction needs from small projects like individual home buildings to major construction and infrastructure projects.\n\nWe are recruiting to fill the position below:\n\nJob Position: Assistant HR/IR Manager\n\nRequisition ID: 14044\nJob Location: Mfamosing, Cross River\nJob type: Full-time\n\nAbout the Job\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWorking with the HR Business Partner, the role provides support in the delivery of the HR agenda to the business.\n\tThis includes preparing analysis and materials for HR processes e.g. FRC, annual salary review, supporting line managers and acting as assigned Business Partner to certain groups.\n\n\nWhat you'll be doing\n\n\n\tSupport the implementation of the annual agenda for HR Strategy in line with the functional plan.\n\tSupport the Plant HRBP in the recruitment of non-cadre staff.\n\tMaintain the personnel administration/records for the site, ensuring on-time delivery, accuracy of information provided and legal compliance (especially for annual social statements, and individual contracts).\n\tCoach and equip supervisors to effectively manage their people in line with people plans e.g. performance management \n\tSupport production of HR data reporting and analysis to satisfy routine and ad-hoc organisational requirements \n\tWorking with the Head of HR, Industrial/IR, manage employee and industrial relations for the plant and provide support and guidance to the Plant HRBP.\n\tManage the interface with relevant statutory bodies and trade associations in the locality as agreed with the Plant HRBP in conjunction with the Head of HR Industrial/IR. \n\tSupport the development and continuous improvement of HR systems and policies in line with best practices.\n\tWork with the Head of HR Industrial and Plant HRBP to identify opportunities and areas of improvement to support improved organisational and people performance.\n\tSupport the Plant HRBP in the deployment of policies for effective employee / industrial relations management across the plant.\n\tSupport the Plant HRBP on employee and industrial relations issues to ensure a peaceful industrial atmosphere.\n\tLiaising with the Head of HR Industrial/IR, support Plant HRBP in resolving industrial relations crisis in the plant.\n\tProvide necessary support for the Plant HRBP during salary negotiations.\n\tUnder the direction of the Plant, HRBP manages projects as required.\n\tMonitor the social climate in the plant and provide regular feedback to the Plant HRBP and Head of HR Industrial/IR.\n\tCollaborate with and support other roles within the O & HR function as required.\n\n\nWhat we are looking for \n\n\n\tGraduate in any discipline, preferably the Social Sciences\n\t2 - 3 years of relevant HR BP or generalist experience in an Industrial setting \n\tCIPD certification added advantage \n\tExcellent influencing and coaching skills\n\tA solution-based approach to problem-solving\n\tProject management skills\n\tTenacious and flexible – open to change.\n\n\nBehavioral competence:\n\n\n\tCustomer focused\n\tGood communication and interpersonal skills\n\tAbility to prioritise and work well under pressure\n\tDesire to learn.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]