[
  {
    "title": "Customer Service Agent Job at JTech Global Resources Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/customer-service-agent-job-at-jtech-global-resources-limited",
    "pubDate": "Fri, 06 Jun 2025 14:15:17 GMT",
    "source": "JobGurus",
    "keyword": "jtech global resources limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "(adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\nJTech Global Resources Limited, a fast-growing digital service company committed to simplifying financial transactions for individuals and businesses. Our core offerings include: Buying and selling of digital assets, gift card trading, utility and digital bill payment services (e.g. airtime, data, electricity, etc.), flight booking, E-commerce, and other fintech-based solutions.\nThe dream was birthed in 2018, but Jtechtrade became a reality in 2019. Since then, we have provided digital financial assets to both merchants and users of our platform, gaining vast knowledge and experience on how the digital space has paved the way for a financial revolution. Our platform is designed with our users in mind; it features advanced cybersecurity technology, making it safe and secure, which also ensures that our payment system is fast and reliable.\n\nWe are recruiting to fill the position below:\n\nJob Position: Customer Service Agent\n\nJob Location: Amuwo Odofin, Lagos\nEmployment Type: Full-time\n\nJob Description\n\n\n\tWe are looking for a proactive and knowledgeableCustomer Service agent to join our team.In this role, you will be the first point of contact for our customers, assisting them with inquiries related to transactions, account management, and general support.\n\tThe ideal candidate will have excellent communication skills and a passion for providing exceptional customer service in the fast-paced world of digital currencies.\n\n\nResponsibilities\n\n\n\tCustomer Support: Respond to customer inquiries via phone, email, and chat, providing timely and accurate information regarding our products and services.\n\tTransaction Assistance: Assist customers with transactions, including confirmations, troubleshooting issues, and providing guidance on best practices.\n\tProblem Resolution: Identify and address customer concerns effectively, ensuring a high level of satisfaction and trust in our services.\n\tFeedback Collection: Gather customer feedback to identify areas for improvement and communicate insights to the management team.\n\tDocumentation: Maintain accurate records of customer interactions, transactions, and feedback in the company’s CRM system.\n\n\nRequirements\n\n\n\tAn OND / HND / Bachelor's Degree in Business administration, Hospitality, arts, or a related field.\n\tExcellent verbal and written communication skills.\n\tStrong problem-solving abilities and attention to detail.\n\tAbility to work effectively in a fast-paced, dynamic environment.\n\tStrong organizational and time management skills.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: jtechtradecareers@outlook.com using the Job Position as the subject of the    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Grants Consortium Manager (National) Job at Première Urgence Internationale",
    "link": "https://www.jobgurus.com.ng/jobs/view/grants-consortium-manager-national-job-at-première-urgence-internationale",
    "pubDate": "Fri, 06 Jun 2025 14:15:17 GMT",
    "source": "JobGurus",
    "keyword": "première urgence internationale",
    "duplicate": false,
    "classifications": [],
    "content": "Assistant General Manager Job at Dangote Group            \n        \n\n        \n            \n\n                        Dangote Group  \n            \n                         Administration/ Office/ Operations  \n             \n                         Ogun\n                            \n        \n\n        Dangote Group is one of Nigeria’s most diversified business conglomerates with a hard – earned reputation for excellent business practices and products’ quality with its operational…\n    \n\n    \n        Apply\n        6th June, 2025",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Enterprise Sales Executive Job at Cobranet Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/enterprise-sales-executive-job-at-cobranet-limited-1",
    "pubDate": "Fri, 06 Jun 2025 14:15:17 GMT",
    "source": "JobGurus",
    "keyword": "cobranet limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Cobranet Limited; a reputable organization incorporated in 2003 and provides internet solutions. Our footprint and range of products have grown immensely since incorporation and we are proud to provide every segment of society with a reliable link to the digital universe.\n\nOur entire network topology is rugged, dynamic and fully redundant with negligible downtimes: content showing extremely high availability exceeding 99.5%. Our promise is to continue providing innovative solutions at the best feature-to-price and service-to-price ratio.\n\nWe are recruiting to fill the position below:\n\nJob Position: Enterprise Sales Executive \n\nJob Location: Lekki Phase 1, Lagos\nEmployment Type: Full-time\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Description\n\n\n\tWe are looking for a high-performing Snr. Enterprise Sales Executive to help us meet our customer acquisition and revenue growth targets by keeping our company competitive and innovative.\n\tYou will be responsible for maximizing our sales potential, crafting sales plans and justifying those to plans to the upper management.\n\n\nResponsibilities\n\n\n\tProspecting for new sales and opportunities\n\tAchieving growth and hitting sales targets by successfully managing available resources\n\tDesigning and implementing a strategic business/sales plan that expands company’s customer base and ensure its strong presence\n\tEnsure the adequacy of sales-related equipment or material\n\tRespond to complaints from customers and give after-sales support when requested\n\tStore and sort financial and non-financial data in electronic form and present reports\n\tBuild and promote strong, long-lasting customer relationships by partnering with them and understanding their needs\n\tPresent sales, revenue and expenses reports and realistic forecasts to the management team\n\tIdentify emerging markets and market shifts while being fully aware of new products and competition status\n\tHandle the processing of all orders with accuracy and timeliness\n\tInform clients of unforeseen delays or problems\n\tManage customer portfolio to maximize relationship building opportunities.\n\n\nRequirements\n\n\n\tB.Sc / M.Sc Degree in Business Administration or a related field; certification in sales or marketing will be an asset\n\tSuccessful previous experience as a sales representative, consistently meeting or exceeding targets\n\tCommitted to continuous education through workshops, seminars and conferences\n\tDemonstrated ability to communicate, present and influence credibly and effectively at all levels of the organization\n\tProven ability to drive the sales process from plan to close\n\tStrong business sense and industry expertise\n\tExcellent mentoring, coaching and people management skills\n\tProven working experience as a project administrator in the information technology sector\n\tSolid technical background, with understanding or hands-on experience in software development and web technologies\n\tExcellent verbal and communication skills with proficiency in English Language\n\tSolid organizational skills including attention to detail and multi-tasking skills\n\tStrong working knowledge of Microsoft Office\n\tWell-organized and responsible with an aptitude in problem-solving\n\tA team player with high level of dedication.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: recruitment@cobranet.ng using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Senior Technician, Mechanical Job at Dangote Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/senior-technician-mechanical-job-at-dangote-group",
    "pubDate": "Fri, 06 Jun 2025 14:15:17 GMT",
    "source": "JobGurus",
    "keyword": "dangote group",
    "duplicate": [
      {
        "site": "Example Site",
        "id": "931a4b36a0363d1a3091f995fafc4d41",
        "timestamp": 1748870561278
      },
      {
        "site": "JobGurus",
        "id": "ed021726df1a03209ab5850fd1887342",
        "timestamp": 1748949214016
      },
      {
        "site": "JobGurus",
        "id": "588752c5dca4899706ac3b4253acdfab",
        "timestamp": 1749216438631
      },
      {
        "site": "JobGurus",
        "id": "b33c1cb0bb83f4fd24e6363e8ee67d2a",
        "timestamp": 1749217687942
      },
      {
        "site": "JobGurus",
        "id": "ab1a025c31b324a7901bec1ceb5aa9ad",
        "timestamp": 1749219313400
      }
    ],
    "classifications": [],
    "content": "Dangote Group is one of Nigeria’s most diversified business conglomerates with a hard – earned reputation for excellent business practices and products’ quality with its operational headquarters in the bustling metropolis of Lagos, Nigeria in West Africa.\n\nWe are recruiting to fill the position below:\n\nJob Position: Senior Technician, Mechanical\n\nJob Location: Ibese, Ogun\nJob type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tPerform a variety of tasks pertaining to fabrication, installation, maintenance, repair, and service of mechanical equipment, instruments and structures used within the plant.\n\n\nKey Duties and Responsibilities\n\n\n\tLiaise with the Shift Technicians to identify problematic equipment/machines in the plant and effect repairs promptly.\n\tImplement SOP’s for maintenance.\n\tExecute corrective maintenance on all assigned equipment/ machines in a timely manner.\n\tAssist to ensure safety precautions are observed and personal protection equipment are worn during repairs or scheduled maintenance.\n\tParticipate in plant safety, health, and environmental programs.\n\tEnter data into ERP system (e.g., SAP) for spares and consumables.\n\tTake inventory of working tools weekly to ensure that it matches the original tool list provided.\n\tPerform work order repairs, inspections, and adjustments.\n\tReplace minor fixtures in the plant machines.\n\tTechnicians should personally clean operating equipment for effective performance\n\tTechnicians should maintain the tools and tackle properly\n\tEnsures quality maintenance as per PM schedule\n\tReports any break down or stoppages more than 30mins to sectional engineers.\n\tCarry out briefly- analysis of break down jobs\n\tEnsure no break down on groups taken for maintenance until next PM schedule date.\n\tAttends to any breaks down within the shortest possible time.\n\tFill the checklist against the job carried out daily and file it properly\n\tEnsure to remove all scrap after maintenance\n\tIdentify potential environmental and OHS hazards\n\n\nRequirements\n\n\n\tSSCE + Trade Test I, II, III in Mechanical related Trade with 16 years relevant work experience. OND Mechanical Engineering with 5 years of relevant work experience is highly preferred.\n\tBasic knowledge of cement production process\n\tIn-depth knowledge of the cement packing machines/ functions and procedures\n\tAbility to troubleshoot, diagnose and repair equipment with accuracy and speed\n\tProblem solving skills\n\tAbility to pay attention to details\n\tGood relationship management skills.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Supervisor Job at Techdoctorinnovations",
    "link": "https://www.jobgurus.com.ng/jobs/view/supervisor-job-at-techdoctorinnovations",
    "pubDate": "Fri, 06 Jun 2025 14:15:17 GMT",
    "source": "JobGurus",
    "keyword": "techdoctorinnovations",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Techdoctorinnovations, a Social Media Management, Rebranding, and Recruiment firm, is recruiting suitable candidates to fill the position below:\n\nJob Position: Supervisor\n\nJob Location: Opebi-Ikeja, Lagos \nEmployment Type: Full-time\n\nResponsibilities\n\n\n\tSupervise and manage lounge staff to ensure efficient operations\n\tProvide excellent customer service and ensure customer satisfaction\n\tManage sales, track inventory, and maintain accurate financial records\n\tCollaborate with the management team to develop and implement business strategies.\n\n\nRequirements\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tHND / B.Sc in any field\n\tProven supervisory experience in a hospitality or related industry\n\tExcellent leadership, communication, and customer service skills.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: techdoctorinnovations@gmail.com using the Job Position as the subject of the email\n\nNote: For inquiries, send a WhatsApp message to: 09138885064.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]