[
  {
    "title": "Job Openings at De Royal Drinkables and Refreshments Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-de-royal-drinkables-and-refreshments-limited",
    "pubDate": "Wed, 24 Sep 2025 19:12:38 GMT",
    "source": "JobGurus",
    "keyword": "de royal drinkables and refreshments limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "De Royal Drinkables and Refreshments Limited - Our water draws its cool, crisp character from a long, patient journey deep beneath the Nigerian earth. It begins as rainfall and gradually seeps through layers of soil, sand, and mineral-rich rock. Along the way, it’s naturally filtered—cleansed of impurities while gathering essential minerals that give it a refreshing and balanced taste.\n\nWe are recruiting to fill the following positions below:\n\n1.) Electrical Technician\n\nJob Location: Abuja (FCT)\nEmployment Type: Full-time\n\nJob Summary\n     \n\n            \n    \n\n\n\n\n\tWe are seeking a skilled and motivated Electrical Technician with a background in Instrumentation & Control or Power Systems to join our technical team.\n\tThe successful candidate will be responsible for installing, maintaining, troubleshooting, and repairing electrical systems and equipment to ensure smooth operations.\n\n\nKey Responsibilities\n\n\n\tCarry out electrical installation, troubleshooting, and repairs of machines and equipment.\n\tPerform routine preventive maintenance to minimize downtime.\n\tMonitor and calibrate instrumentation and control systems.\n\tRead and interpret electrical drawings, schematics, and manuals.\n\tEnsure compliance with safety and regulatory standards.\n\tProvide technical support during equipment upgrades and projects.\n\n\nRequirements:\n\n\n\tHND in Electrical Engineering (Instrumentation & Control or Power Systems).\n\t2–3 years of relevant experience (preferably in a factory or industrial setting).\n\tStrong knowledge of electrical systems, control panels, and troubleshooting.\n\tAbility to work independently and as part of a team.\n\tGood problem-solving skills and attention to detail.\n\n\nApplication Closing Date: 31st October, 2025. \n\nMethod of Application\nInerested and qualified candidates should send their CV to: careers.royalwaterng@gmail.com using the Job Position as the subject of the mail.\n\n \n\n \n\n2.) Factory Operator (Engineering Background)\n\nJob Location: Abuja (FCT)\nEmployment Type: Full-time\n\nKey Responsibilities\n\n\n\tOperate, monitor, and maintain production machines and electrical systems.\n\tCarry out routine checks, preventive maintenance, and troubleshooting of factory equipment.\n\tEnsure all electrical components and control systems are functioning optimally.\n\tSupport continuous improvement of production efficiency and reduction of downtime.\n\tAdhere strictly to safety, hygiene, and quality control standards.\n\tKeep accurate maintenance and production logs.\n\tCollaborate with engineers and the maintenance team to resolve technical issues quickly.\n\n\nRequirements\n\n\n\tCandidates should possess an OND / HND / B.Sc. in Electrical Engineering (or related field).\n\t1–3 years of relevant experience in factory/production operations (experience in water/beverage industry is an added advantage).\n\tStrong knowledge of electrical systems, panels, and machine operations.\n\tAbility to read and interpret electrical diagrams.\n\tGood problem-solving and technical troubleshooting skills.\n\tWillingness to work in shifts and under pressure.\n\n\nRemuneration\nAttractive and competitive, based on qualifications and experience\n\nApplication Closing Date: 7th October, 2025.\n\nMethod of Application\nInerested and qualified candidates should send their CV to: careers.royalwaterng@gmail.com using the Job Position as the subject of the mail.\n\n \n\n \n\n3.) Sales Manager\n\nJob Location: Abuja (FCT) \nEmployment Type: Full-time\n\nKey Responsibilities\n\n\n\tDevelop and implement sales strategies to increase market share and achieve revenue targets.\n\tIdentify and onboard new distributors, wholesalers, and retailers.\n\tManage and mentor the sales team to deliver excellent results.\n\tBuild and maintain strong relationships with key clients and distributors.\n\tMonitor market trends, competitor activities, and customer feedback to guide strategy.\n\tEnsure timely reporting of sales performance and market insights to management.\n\tWork closely with production and logistics teams to ensure product availability.\n\n\nRequirements\n\n\n\tBachelor’s degree in Business Administration, Marketing, or related field.\n\tMinimum of 5 years of sales/marketing experience, with at least 2 years in the table water/bottling industry.\n\tStrong distributor/wholesaler management background.\n\tExcellent leadership, negotiation, and communication skills.\n\tProven track record of meeting and exceeding sales targets.\n\tAbility to work independently and as part of a team.\n\n\nApplication Closing Date: 14th October, 2025.\n\nMethod of Application\nInterested and qualified candidate should forward their CV to: careers.royalwaterng@gmail.com using the Job Position as the subject of the mail.\n\n \n\n \n\n4.) Production Manager\n\nJob Location: Abuja\nEmployment Type: Full-time\n\nResponsibilities\n\n\n\tSupervise and coordinate daily production activities to meet output and quality targets\n\tOversee the operation of water treatment systems including reverse osmosis (RO), filtration, UV disinfection, and ozone systems\n\tEnsure the proper functioning and maintenance of automated and semi-automated production machinery (filling, capping, shrink wrapping, and packaging)\n\tAssign duties to production staff and monitor performance for efficiency and safety compliance\n\tImplement and uphold quality control measures and preventive maintenance schedules\n\tEnsure adherence to NAFDAC, SON, and other relevant regulatory requirements\n\tMinimize production downtime by proactively identifying and addressing operational issues\n\tMaintain accurate production reports and ensure consistent documentation practices\n\n\nRequirements\n\n\n\tMinimum of 3 – 5 years of production experience in a bottled water factory or related FMCG environment.\n\tStrong understanding of water treatment processes, including reverse osmosis (RO), filtration, UV disinfection, and ozone systems.\n\tProven ability to supervise production staff, allocate tasks, and monitor production lines for efficiency and quality.\n\tExperience with automated and semi-automated filling machines, shrink wrapping, capping machines, and packaging equipment.\n\tKnowledge of NAFDAC, SON, and other regulatory compliance for water and beverage production.\n\tSkilled in quality control, preventive maintenance, and minimizing downtime.\n\n\nApplication Closing Date: 13th October, 2025.\n\nMethod of Application\nInterested and qualified candidate should forward their CV to: careers.royalwaterng@gmail.com using the Job Position as the subject of the mail.\n\nNote: Abuja based candidate are stongly adviced to apply.\n\n     \n\n    \n\n        Click here to Apply",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Openings at Orange VFX Studios",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-orange-vfx-studios",
    "pubDate": "Wed, 24 Sep 2025 19:12:38 GMT",
    "source": "JobGurus",
    "keyword": "orange vfx studios",
    "duplicate": false,
    "classifications": [],
    "content": "Orange VFX Studios - We create Animation and Visual effects digital content to entertain, inform, and inspire Africans through unique storytelling that leverages creativity and technology (aka CreaTech) to build a better Africa! We also train, mentor, and empower the next generation of African Digital Content Creators.\n\nWe are recruiting to fill the following positions below:\n\n1.) Motion Designer\n\nJob Location: Lagos\nJob type: Full-Time\n\nJob Responsibilities\n     \n\n            \n    \n\n\n\n\n\tDesign and animate engaging motion graphics for a variety of media, including film, TV, commercials, and digital platforms.\n\tCollaborate with the creative and production teams to translate concepts and storyboards into dynamic visual experiences.\n\tUtilize After Effects to craft smooth, visually appealing animations and graphical elements.\n\tContribute creative ideas to help elevate the overall look and feel of each project.\n\tRevise and refine animations based on feedback to meet creative and technical standards.\n\tManage multiple tasks and prioritize deadlines in a fast-paced production environment.\n\n\nRequirements\n\n\n\tCertificate or Degree in Motion Design, Animation, Visual Effects, or a related field is preferred.\n\tAt least 1 year of professional experience in motion design or a related field.\n\tStrong working knowledge of After Effects; familiarity with other Adobe Creative Cloud tools (such as Illustrator and Photoshop) is a plus.\n\tA keen eye for typography, color, and composition, with strong attention to detail.\n\tExcellent communication and problem-solving skills.\n\tAbility to adapt quickly, work independently and as part of a team.\n\tA portfolio or demo reel showcasing your motion design work.\n\n\nClick here to apply online\n\n \n\n2.) Training Coordinator\n\nJob Location: Lagos\nJob type: Full-Time\n\nJob Responsibilities\n\n\n\tCoordinate and schedule training sessions, workshops, and events for students and faculty.\n\tSupport instructors and trainers with materials, resources, and logistics to ensure smooth delivery of programs.\n\tCommunicate effectively with participants, responding to questions and providing essential information.\n\tMaintain accurate records of attendance, feedback, and training outcomes.\n\tAssist with curriculum development and the preparation of training materials.\n\tTrack learner progress and gather feedback to help improve future training sessions.\n\tHelp onboard new instructors and participants to the Academy processes and tools.\n\tCollaborate with the Academy team to organize special events, guest lectures, and community-building activities.\n\n\nRequirements\n\n\n\tCertificate or Degree in Education, Human Resources, Business Administration, or a similar area is preferred.\n\tAt least 1 year of experience in training coordination, education administration, HR, or a related field.\n\tStrong organizational skills with the ability to manage multiple projects and deadlines.\n\tExcellent written and verbal communication skills.\n\tDetail-oriented with strong problem-solving abilities.\n\tComfortable using digital tools (such as MS Office, Google Workspace, or Learning Management Systems).\n\tPositive attitude and a collaborative spirit.\n\tPassion for helping others learn and grow.\n\n\nBonus Skills:\n\n\n\tExperience working in an educational or training environment.\n\tFamiliarity with e-learning platforms or virtual training tools.\n\tEvent planning or project management experience.\n\tAbility to adapt quickly and thrive in a dynamic, team-oriented setting.\n\n\nClick here to apply online\n\n \n\n \n\n3.) Compositor\n\nJob Location: Lagos\nJob type: Full-Time\n\nJob Responsibilities\n\n\n\tAs a Compositor, you will be responsible for crafting our projects’ final and often breathtaking visual effects shots.\n\tUtilizing your expertise in Nuke and After Effects, you’ll seamlessly integrate all layers and elements of a shot, including live-action and computer graphics.\n\tWorking closely with our VFX Supervisors, you will ensure that each shot meets the highest visual effect standards while maintaining the director’s vision and overall project aesthetic.\n\tYour role will involve troubleshooting compositing challenges and providing creative solutions to meet production deadlines.\n\n\nRequirements\n\n\n\tCertificate or Degree in Visual Effects, Computer Graphics, or a related field.\n\tMinimum of 1 year of experience as a Compositor within the VFX or animation industry.\n\tProficiency in Nuke and After Effects is a must.\n\tStrong understanding of colour, contrast, detail, and a good eye for composition and timing.\n\tKnowledge of 3D principles and techniques, including camera setup, modelling for projection, camera animation, and projection setup.\n\tAbility to work under tight deadlines and on multiple projects simultaneously.\n\tExcellent problem-solving skills and attention to detail.\n\tA strong portfolio showcasing your compositing work and ability to contribute to all phases of the VFX pipeline.\n\n\nClick here to apply online    \n\n    \n\n        Click here to Apply",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]