[
  {
    "title": "Content Creator Job at Oneland Africa",
    "link": "https://www.jobgurus.com.ng/jobs/view/content-creator-job-at-oneland-africa",
    "pubDate": "Mon, 30 Jun 2025 13:30:07 GMT",
    "source": "JobGurus",
    "keyword": "oneland africa",
    "duplicate": false,
    "classifications": [],
    "content": "Oneland Africa is a leading real estate company committed to helping Nigerians own premium properties across Nigeria. Oneland sees to the sales of developed Housing units, off plan sales, lease/letting and Facility Management.\n\nWe are recruiting to fill the position below:\n\nJob Position: Content Creator\n\nJob Location: Lekki, Lagos\nEmployment Type: Full-time\n\nSummary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAre you confident in front of the camera and have a flair for storytelling?\n\tDo you consider yourself smart, creative, and camera-friendly? Then this opportunity is for you!\n\tWe're on the hunt for a Content Creator to join our team.\n\tThe ideal candidate will be good-looking, articulate, and bursting with creative ideas to shape our content across multiple platforms.\n\n\nKey Responsibilties\n\n\n\tCreate engaging video and photo content for our digital platforms\n\tDevelop and pitch creative content ideas that align with our brand voice\n\tRepresent the brand confidently in front of the camera\n\tStay updated on trends to keep content fresh and relevant\n\tCollaborate with the team to drive content strategy.\n\n\nRequirements\n\n\n\tInterested candidates should possess a Bachelor`s Degree with 1 - 3 years of work experience.\n\tStrong on-camera presence and communication skills\n\tExperience in content creation (reels, skits, voiceovers, product storytelling, etc.)\n\tYoung, Creativity, Confidence, and a sense of humour\n\tBasic video editing skills is a plus\n\tA portfolio showcasing your previous work.\n\n\nSalary\nN50,000 - N100,000 monthly.\n\nMethod of Application\nInterested and qualified candidates should send their portfolio to: hr@oneland.africa using the Job Position as the subject of the mail.\n\nNote: We’re excited to see your creativity!    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Senior Sales Executive Job at Willers Solutions Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/senior-sales-executive-job-at-willers-solutions-limited-1",
    "pubDate": "Mon, 30 Jun 2025 13:30:07 GMT",
    "source": "JobGurus",
    "keyword": "willers solutions limited",
    "duplicate": false,
    "classifications": [],
    "content": "Willers Solutions Limited - Our mission is to deliver tangible business solutions to our clients that are consistent with value maximisation, innovation and integrity, leveraging our pool of competent and inspired personnel.\n\nWe are recruiting to fill the position below:\n\nJob Position: Senior Sales Executive\n\nJob Location: Warri, Delta\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDevelop and execute sales strategies for protective/marine coating products.\n\tBuild long-term relationships with major accounts, contractors, and technical influencers.\n\tDeliver technical presentations, guide product application discussions, and coordinate field trials.\n\tLead project targeting efforts and ensure alignment with business goals.\n\tCollaborate with internal teams to address client needs and ensure service delivery.\n\tTrack sales pipeline, monitor progress, and ensure monthly/quarterly targets are met.\n\tProvide market feedback on product performance, customer trends, and competitive activity.\n\n\nEducation & Qualifications\n\n\n\tB.Sc / B.Tech in Chemistry, Chemical Engineering, or a related field (AMPP Level 1/2 is a plus).\n\t5–6 years of proven experience in sales of protective coatings, marine paints, or related industrial chemicals.\n\tStrong expertise in liquid coatings, including product specifications, applications, and standards.\n\tExperience handling B2B clients, industrial projects, or marine sector accounts.\n\tExcellent presentation, negotiation, and client management skills.\n\tMust be self-driven, strategic, and comfortable working independently.\n\tWillingness to travel extensively.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: jobs@willerssolutions.com using \"Senior Sales Executive\" as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Technical Support Officer Job at Techdroid Integrated Services",
    "link": "https://www.jobgurus.com.ng/jobs/view/technical-support-officer-job-at-techdroid-integrated-services",
    "pubDate": "Mon, 30 Jun 2025 13:30:07 GMT",
    "source": "JobGurus",
    "keyword": "techdroid integrated services",
    "duplicate": false,
    "classifications": [],
    "content": "Techdroid Integrated Services is recruiting suitable candidates to fill the position below:\n\nJob Position: Technical Support Officer\nJob Location: Lagos\nEmployment Type: Full-time \n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tInstall, configure, and maintain computer hardware, software, systems, networks, printers, and scanners.\n\tMonitor and maintain the organization’s IT infrastructure, including servers, internet, and email systems.\n\tProvide first-line support to staff and customers on hardware and software-related issues.\n\tRespond to and log calls, escalating calls as required with key support vendors and clients\n\tMaintain records/logs of repairs and fixes, and maintenance schedule.\n\tProvide one-on-one training when required\n\tTroubleshoot system and network problems and diagnose and solve hardware/software faults.\n\tOn-site installation, set-up, support, and delivery of hardware and software to the client\n\tEnsure security of data, network access, and backup systems.\n\tSet up new user accounts and profiles and deal with password issues.\n\tManage software licenses and updates, and ensure compliance with IT  policies.\n\tRecommend and implement improvements to IT systems and  processes.\n\tLiaise with IT vendors and service providers to ensure timely support and  maintenance.\n\n\nRequirements\n\n\n\tBachelor’s degree in Computer Science, Information Technology, or a related field.\n\tMinimum of 1-3 years of experience in a similar IT support or systems administration role.\n\tStrong understanding of computer systems, mobile devices, operating systems (Windows/Mac), and networks (LAN/WAN).\n\tExperience with troubleshooting hardware, software, and network issues.\n\tFamiliarity with Microsoft 365, Google Workspace, antivirus, and backup solutions.\n\tKnowledge of basic cybersecurity practices and data protection \n\tprinciples.\n\tStrong problem-solving, communication, and interpersonal skills.\n\tAbility to work independently and collaboratively in a team-oriented  environment.\n\tExperience with ERPs or business management systems.\n\tBasic knowledge of web and server administration.\n\tCertifications such as CompTIA A+, Network+, or Microsoft Certified IT Professional (MCITP) are an added advantage.\n\tProfessional fluency in English is essential, both written and spoken.\n\tSuccessful candidate MUST be available to resume immediately.\n\tWe expect applications and CVs to come from applicants living in any of these areas in Lagos: Ikeja, Oshodi, Ilupeju, Anthony, Dopemu, Agege, Maryland, and Ojota axis.\n\n\nSalary\nN100,000 - N150,000 / Month.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hr@techdroidsystems.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "QHSE Officer Job at iEngineering Corporation",
    "link": "https://www.jobgurus.com.ng/jobs/view/qhse-officer-job-at-iengineering-corporation",
    "pubDate": "Mon, 30 Jun 2025 13:30:07 GMT",
    "source": "JobGurus",
    "keyword": "iengineering corporation",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "iEngineering Corporation, founded in 1999, is a privately owned global information-engineering firm specializing in the development of engineering software and collaborative e-business applications. The company was started with a vision of providing scalable information technology solutions to the transportation community, using state-of-the-practice technology. Experienced in transportation engineering software life-cycle management, including project management, specification development, engineering software development, implementation, maintenance, support, and marketing, iEngineering is dedicated to creating superior software and e-business solutions for the transportation engineering industry.\n\nWe are recruiting to fill the position below:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Position: QHSE Officer\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nRequirement\n\n\n\tInterested candidates should posses relevant qualifications\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: pops.ng@ieng-group.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "General Manager Job at Excel and Grace Consulting",
    "link": "https://www.jobgurus.com.ng/jobs/view/general-manager-job-at-excel-and-grace-consulting-7",
    "pubDate": "Mon, 30 Jun 2025 13:30:07 GMT",
    "source": "JobGurus",
    "keyword": "excel and grace consulting",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Excel and Grace Consulting is a fast-paced business consulting organization with a track record of delivering exceptional business solutions to small and medium-scale enterprises in Nigeria, Ghana, Germany, Switzerland, Canada, etc. We are certified management consultants with the International Council of Management Consulting Institutes (CMC-Global) with over 18 years of experience. Our team of experts and consultants have authored over 20 books on business management, business structure, business operations, human resources, organizational structure, employee development, money management, and so on.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: General Manager\nJob Location: Iyana-Ipaja, Lagos\nEmployment Type: Full-time\nIndustry: Distribution / FMCG / Consumable Products\n\nPosition Overview\n\n\n\tWe are seeking an experienced and strategic General Manager (GM) to lead the overall operations of our company, which specializes in the distribution of consumable products.\n\tThe GM will be responsible for driving operational excellence, managing supply chain efficiency, ensuring customer satisfaction, and leading cross-functional teams to achieve business goals.\n\tThis role requires a hands-on leader with strong business acumen and a deep understanding of distribution dynamics and FMCG market trends.\n\n\nKey Responsibilities\n\n\n\tOversee daily operations across logistics, warehousing, procurement, sales, and customer service.\n\tStreamline supply chain processes to ensure timely and cost-effective product delivery.\n\tDevelop and implement business strategies to drive growth, profitability, and market share.\n\tIdentify and capitalize on new distribution opportunities and partnerships.\n\tFoster a culture of accountability, performance, and continuous improvement.\n\tCollaborate with the sales and marketing teams to drive product visibility and customer acquisition.\n\tMonitor market trends, competitor activity, and customer feedback.\n\tPrepare and manage budgets, forecasts, and financial reports.\n\tMonitor KPIs and financial metrics to ensure profitability and cost control.\n\tLead, mentor, and develop a high-performing team across departments.\n\tEnsure compliance with industry regulations, health & safety standards, and company policies.\n\tMitigate operational risks and maintain strong relationships with key stakeholders.\n\n\nQualifications & Experience\n\n\n\tBachelor’s degree in Business Administration, Supply Chain, or related field (MBA preferred).\n\tMinimum of 8–10 years of leadership experience, preferably in FMCG, distribution, or logistics sectors.\n\tProven track record of managing operations, P&L responsibility, and driving business growth.\n\tStrong leadership, negotiation, and interpersonal skills.\n\tExcellent problem-solving and decision-making abilities.\n\tProficient in ERP systems and Microsoft Office Suite.\n\n\nMethod of Application\nInterested and qualified candidates should send their Resume to: eandg.tprecruiters@gmail.com using \"General Manager-Iyana-Ipaja\" as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]