[
  {
    "title": "Senior Process Engineer Job at Hobark International Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/senior-process-engineer-job-at-hobark-international-limited-1",
    "pubDate": "Thu, 26 Jun 2025 18:49:25 GMT",
    "source": "JobGurus",
    "keyword": "hobark international limited",
    "duplicate": false,
    "classifications": [],
    "content": "Hobark International Limited (HIL) is the parent company of the Hobark group operating in the oil and gas industry. The company was incorporated in 1998, starting as a staffing agency based in Port Harcourt. Currently we have offices in 4 countries with our head office in Lagos.\n\nWe are recruiting to fill the position below:\n\nJob Position: Senior Process Engineer\n\nJob Location: Lagos, Nigeria\nJob type: Contract\nStart Date: 24th July, 2025.\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tPerform process optimization studies and recommend solutions to optimize existing installations.\n\tSupport Offshore Operations and SMART Room with flow assurance, process trouble shooting and production optimization activities.\n\tRecommend facility and / or equipment modification and optimization work programs and prepare the corresponding Scope of Requirements (i.e., Feasibility, Pre-project studies or SMRs).\n\tParticipate in developing safety-related modifications to facilities and corresponding engineering documents (P&IDs, ESD and Fire and Gas logic Diagrams, Flare radiation and capacity, PSVs, HIPS, ...)\n\n\nRequirements\n\n\n\tCandidates should possess a B.Eng Degree in Chemical Engineering (or equivalent).\n\tProfessional experience: 6+ years of process engineering studies, including site operations exposure.\n\tRequired skills: familiar with the use of process simulation tools such as HYSIS; ProII; OLGA; Flaresim\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Key Account Executive Job at Hobark International Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/key-account-executive-job-at-hobark-international-limited",
    "pubDate": "Thu, 26 Jun 2025 18:49:25 GMT",
    "source": "JobGurus",
    "keyword": "hobark international limited",
    "duplicate": false,
    "classifications": [],
    "content": "Hobark International Limited (HIL) is the parent company of the Hobark Group operating in the Oil and Gas Industry. Incorporated in 1998, the company started out as a staffing agency which supplied skilled personnel to the Oil and Gas Industry within Nigeria.\n\nGrowth and expansion led to diversification in a variety of services and the construction of offices in Port-Harcourt (Nigeria), Benin (Nigeria), Lagos (Nigeria), Houston (USA), London (UK), Calgary (Canada), Abidjan (Cote D’Ivoire), Libreville (Gabon) and Pointe-Noire (Congo). The corporate headquarters is located in Victoria Island, Lagos (Nigeria).\n\nThe subsidiaries that make up the Hobark Group offer a broad spectrum of services and expertise, and together offer Integrated Oilfield Solutions.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Key Account Executive\n\nJob Location: Lagos\nEmployment Type: Full-time\nSector: Oil and Gas\n\nResponsibilties\nMain Tasks include:\n\n\n\tAcquire a thorough understanding of the customers’ business, goals, needs and requirements.\n\tEffectively coordinate and track all activities for each assigned account, from lead identification and tender generation through to final payment and account cycle closure.\n\tArrange weekly visits to each client to enhance relationships, identify opportunities and address queries and complaints.\n\tKeep abreast of client production rates, investments and divestments, and other activities, news, and projects in order to build an opportunity pipeline, identify new areas of interest, and generate new business.\n\tEnsure successful and timely delivery of products and services to assigned accounts according to their specifications.\n\tFollow up on market activity and develop a thorough understanding of major / competitors in the industry for both supply and services.\n\tEnsure Client visits are pre-planned and well-prepared prior to the visit.\n\tVisits are to be made with timely & professional visit reports.\n\tPrepare regular progress reports for internal and external stakeholders using key account metrics.\n\n\nJob Specification\n\n\n\tEducational background: BSc / B.Tech Degree in Engineering or Business Administration\n\n\nProfessional experience and requirements:\n\n\n\tMinimum of 5 years of sales experience in a related field / industry., preferably in Oil and Gas related field\n\tExperience and knowledge in any of the following products is a plus;\n\t\n\t\tRotating Equipment (pumps, compressor, turbine, and gear\n\t\tValves and actuators\n\t\tGas Detectors\n\t\tHydraulic & Air filtration system.\n\t\n\t\n\tThe Job requires frequent traveling within the country.\n\n\nMethod of Application\nInterested and qualified candidates should send their CVs to: obeten_mbang@hobarkintl.com using the Job Position as the subject of the mail.\n\nNote\nExperience and knowledge in any of the following products within the Oil and Gas sector is highly required:\n\n\n\tRotating Equipment (pumps, compressor, turbine, and gear\n\tValves and actuators\n\tGas Detectors\n\tHydraulic& Air filtration system.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "B2B Sales Executive Job at Ascentech Services Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/b2b-sales-executive-job-at-ascentech-services-limited-1",
    "pubDate": "Thu, 26 Jun 2025 18:49:25 GMT",
    "source": "JobGurus",
    "keyword": "ascentech services limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Ascentech Services Limited is a full-fledged Human Resource Solution Provider incorporated in 2013 with its Head Office in Lagos, Nigeria. We are committed to forging long-term partnerships with our clients by creating and delivering robust and flexible services that address the changing needs of their business.\n\nWe are recruiting to fill the position below:\n\nJob Position: B2B Sales Executive\n\nJob Location: Lagos\nEmployment Type: Full-time\nIndustry: Kitchen Appliances / Electronics\n\nSummary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are looking for experienced and motivated B2B Sales Executives to strengthen our sales team.\n\tThis role focuses on building and expanding our client base across wholesale, distribution, and institutional segments. Candidates with a solid background in the small and kitchen appliances industry will be especially well-positioned for success.\n\n\nKey Responsibilities\n\n\n\tDevelop and manage B2B sales pipelines with a focus on wholesale, retail partners, dealers, and institutional buyers.\n\tBuild strong, long-term relationships with key decision-makers and procurement teams.\n\tMeet and exceed monthly and quarterly sales targets.\n\tCollaborate closely with the marketing, logistics, and product teams to align strategies and ensure customer satisfaction.\n\tConduct regular market analysis to identify new business opportunities and emerging trends.\n\tPresent product offerings effectively to potential clients and negotiate deals.\n\tPrepare detailed reports and sales forecasts.\n\n\nRequirements\n\n\n\tMinimum of 3 years of proven experience in B2B sales, preferably within the consumer electronics or home/kitchen appliances sector.\n\tStrong understanding of product distribution, pricing strategies, and trade relationships.\n\tCandidates with prior exposure to well-known and established brands in the appliance industry will have a competitive advantage.\n\tExcellent negotiation, communication, and presentation skills.\n\n\nSalary\nN300,000 - N500,000 / month. \n\nWhat We Offer:\n\n\n\tCompetitive salary and commission structure.\n\tCareer advancement opportunities within a fast-paced organization.\n\tSupportive team culture with a focus on professional growth.\n\tAccess to high-demand, market-relevant product lines.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: cv@ascentech.com.ng using “B2B SALES EXECUTIVE - LAGOS” as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Front Desk Executive Job at Kayode Obembe Properties Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/front-desk-executive-job-at-kayode-obembe-properties-limited-1",
    "pubDate": "Thu, 26 Jun 2025 18:49:25 GMT",
    "source": "JobGurus",
    "keyword": "kayode obembe properties limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Kayode Obembe Properties Limited is a real estate firm incorporated and registered in Nigeria as a limited liability company. We are setting out new standards in delivering properties in real estate sectors. Our company acquires develops, sell/lease and manage properties and real estate products in choice location across the country.\n\nWe are recruiting to fill the position below:\n\nJob Position: Front Desk Executive\n\nJob Locations: Chevron & Ikeja - Lagos\nEmployment Type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tMeeting and greeting clients.\n\tKeeping the reception area tidy.\n\tAnswering and forwarding phone calls.\n\tE-mail marketing & bulk SMS management.\n\tClient database management/client management follow-up.\n\tConsultants/Realtors Management.\n\tFollow up on client payments, Receipt Issuing.\n\tFollow up with inventory and impress for office use.\n\tFollow up with Realtors/Consultants and ensure sales from the above–mentioned.\n\tSourcing more consultants and establishing new business\n\tMaintain accurate records of business transactions.\n\tAiming to achieve the best from Realtors/Consultants.\n\tDocument and give a formal report on Realtors/Consultants.\n\tAnd any other duties assigned to you by the Management.\n\n\nRequirements\n\n\n\tCandidates should possess a Bachelor's Degree qualification with at least 2 years of work experience.\n\tReal Estate background will be an added advantage.\n\tMust reside at Ajah and its Environs.\n\tMust be a female.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: careers@getkoproperties.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Human Resources Manager Job at Blue Wave New Energy Technology Nigeria Company Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/human-resources-manager-job-at-blue-wave-new-energy-technology-nigeria-company-limited-1",
    "pubDate": "Thu, 26 Jun 2025 18:49:25 GMT",
    "source": "JobGurus",
    "keyword": "blue wave new energy technology nigeria company limited",
    "duplicate": false,
    "classifications": [],
    "content": "Blue Wave New Energy Technology Nigeria Company Limited is an innovative new energy company headquartered in Nigeria, committed to providing economical and sustainable power energy solutions to the African continent. The company was founded in 2023 and is headquartered in Lagos, with R&D and manufacturing centres in Jiangxi, China.\n\nWith cost-effective products and innovative business models, Blue Wave New Energy is committed to contributing clean and reliable power energy to Africa's progress and prosperity. Its product lines cover solar lighting systems, portable energy storage equipment, home-integrated energy storage systems, and outdoor mobile power platforms to meet customers' power needs in multiple scenarios.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nWe are recruiting to fill the position below:\n\nJob Position: Human Resources Manager\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\nIndustry: Renewable Energy (Solar, Storage, Wind)\n\nJob Summary\n\n\n\tWe’re hiring an HR Manager to lead and scale our HR function in a growing renewable energy startup.\n\tThis role is ideal for someone with experience building HR systems from scratch and working in Chinese-led organizations.\n\tYou’ll work closely with leadership to drive people strategy, talent acquisition, compliance, performance, and culture.\n\n\nKey Responsibilities\n\n\n\tDevelop and execute HR strategy aligned with company growth.\n\tOversee end-to-end recruitment and workforce planning.\n\tBuild performance management, L&D, and employee engagement frameworks.\n\tManage compensation, benefits, and attendance tracking systems.\n\tFoster a collaborative culture and bridge cross-cultural team dynamics.\n\tEnsure compliance with Nigerian labor laws and internal policies.\n\n\nKey Requirements\n\n\n\tBachelor’s degree in HRM, Business Admin, or related field.\n\tMinimum 6 years of HR experience, with 2+ years in management.\n\tCIPM or CIPD certification is required.\n\tProven record building HR systems in startups.\n\tExperience working with Chinese expatriate leadership is strongly preferred.\n\tSolid knowledge of Nigerian labor laws and HR best practices.\n\n\nSalary\nN350,000 - N400,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hr@bluewave.top using \"HR Manager - Renewable Energy' as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]