[
  {
    "title": "Digital Marketer (Experienced) Job at Syntax Technology",
    "link": "https://www.jobgurus.com.ng/jobs/view/digital-marketer-experienced-job-at-syntax-technology",
    "pubDate": "Mon, 23 Jun 2025 12:33:57 GMT",
    "source": "JobGurus",
    "keyword": "syntax technology",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Syntax Technology is a Nigerian-based digital solutions company committed to delivering creative, strategic, and tailored digital services. With a team of skilled professionals, we partner with businesses—big or small—to turn their ideas into results.\n\nWhether you're a start-up looking to build your online presence or an established company ready to scale, we offer the digital edge you need.\n\nWe are recruiting to fill the position below:\n\nJob Position: Digital Marketer (Experienced)\n\nJob Location: Ikeja, Lagos\nEmployment Type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAre you passionate and result driven Digital Marketer? We are looking for creative and experience individual to join our team.\n\n\nResponsibilities\n\n\n\tDevelop and execute digital marketing campaigns.\n\tGraphics design and content creation.\n\tManage social media account management and increase engagement.\n\tImplement search engine optimization.\n\tWebsite creation and management.\n\tDigital marketing training and education.\n\tEdit and produce high quality video content for social media, websites and other digital platforms.\n\n\nRequirements\n\n\n\tInterested candidates should possess a Bachelor’s Degree\n\tMinimum of 2 years of experience in digital marketing, with a focus on social media, email, and search engine.\n\tStrong written and verbal communication skills.\n\tAbility to think creatively and develop innovative digital marketing strategies.\n\tProficiency in graphics design tools such as Corel draw.\n\n\nMethod of Application\nInterested and qualified candidates should send their resume to: crecruitment50@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Head, Investment Job at Coronation",
    "link": "https://www.jobgurus.com.ng/jobs/view/head-investment-job-at-coronation",
    "pubDate": "Mon, 23 Jun 2025 12:33:57 GMT",
    "source": "JobGurus",
    "keyword": "coronation",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Coronation is a leading financial service partner that helps build enduring legacies for sustainable wealth creation in Africa. Having established a 30-year record of achievements in banking across Africa and beyond, our founders established a Pan-African platform focused on building a better financial future for Africa. Today, our businesses are entrusted with our over $1billion of clients’ assets and are recognized as Nigeria's fastest-growing investment managers. Our purpose at Coronation is to create a prosperous future for our clients and the African continent. Coronation is proud to be an Equal Opportunity Employer. We enable an inclusive workplace by identity, disability, and other statuses protected by law.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nCoronation Insurance Plc - an affiliated company to Coronation Group Ltd - is a leading insurance provider of a diverse range of products and services covering general and special risk businesses to individuals and corporate entities.\n\nWe are recruiting to fill the position below:\n\nJob Position: Head, Investment\n\nJob Location: Lagos \nEmployment Type: Full-time\n\nRole Responsibilities\nBusiness Advisory and Stakeholder Management:\n\n\n\tProvide advisory services to the Board, Executive Management, and other stakeholders on best-fit strategies, operational plan, working capital requirements, and liquidity management, by leveraging on own deep expertise in strategy, and knowledge of key environmental trends, internal dynamics/resources and operating environment.\n\tBuild valued relationships with stakeholders at the strategic level, and assemble coalitions, to support long term business development.\n\n\nForeign Currency and Market Risk Management:\n\n\n\tDevelop strategy, policies, and tools to support the ongoing management of foreign exchange risk, liquidity and interest rate risks with the aim of mitigating the effects of volatility and unpredicted movement in market valuations (e.g. foreign currencies, interest rate).\n\tManage the company’s foreign currency activities through the identification of FCY surpluses and deficits, and maintain oversight over active management of FCY windows, administration of FCY inflows into the company, and handling of overseas remittances either on behalf of the company. Working Capital Management.\n\tDefine and manage the company’s strategy and processes for projecting, monitoring, analyzing, and optimizing its cash-flow, assets and liabilities through ratio analysis of operating expenses (e.g. working capital ratio, collection ratio), with the aim of ensuring the company is capable of continuing operations, and satisfying short-term debt, and upcoming operational expenses.\n\tProactively engage various functions across the Company in respect to their capital/operating expenditure to determine periodic forecasts on working capital, provide cashflow forecast /position to Executive Management, and propose solutions where required.\n\n\nWorking Capital Management\n\n\n\tDefine and manage the company’s strategy and processes for projecting, monitoring, analyzing, and optimizing its cash-flow, assets and liabilities through ratio analysis of operating expenses (e.g. working capital ratio, collection ratio), with the aim of ensuring the company is capable of continuing operations, and satisfying short-term debt, and upcoming operational expenses.\n\tProactively engage various functions across the Company in respect to their capital/operating expenditure to determine periodic forecasts on working capital, provide cashflow forecast /position to Executive Management, and propose solutions where required.\n\tTransactional Treasury Processes:Implement company’s policy on capital structure by ensuring an appropriate distribution between debt and equity to minimize cost of funds (CoF) and maintain CoF within the Company’s prescribed band. Manage Relationships with Financial Institutions.\n\tManage the organization’s relationships with other financial institutions (i.e. banks, fund custodians, trustees etc.), by negotiating favorable investment terms on behalf of the organization, escalating potential settlement failures to the Treasurers of other financial institutions to avoid unwanted outcomes, and managing the organization’s relationship with its designated banks.\n\n\nWhat we are looking for\nEducational Qualification and Work Experience:\n\n\n\tA minimum of a Bachelor’s Degree from an accredited university.\n\t8 - 10 years of relevant experience within a financial services company.\n\tAdvanced business degree (preferably an MBA) is an added advantage.\n\tRelevant experience in insurance will be a huge advantage.\n\tProfessional certification in finance and/or accounting from a recognized professional body (e.g. CFA, CGMA,ACCA, ICAN etc.)\n\n\nTechnical & Behavioural Competencies\nKnowledge:\n\n\n\tMacroeconomic Analysis\n\tMarket and Regulatory Environments.\n\n\nSkills:\n\n\n\tStrategy\n\tTreasury Management\n\tBusiness Acumen Behavior\n\tAnalytical Thinking\n\tEntrepreneurship\n\tRelationship Building for Influencing\n\tLeading and Developing Others\n\tDrive for Results.\n\n\nOur Benefits\n\n\n\tTo help you stay energized, engaged, and inspired, we offer a wide range of employee benefits including a competitive compensation package, a robust rewards package, retirement benefits and tools designed to help you build a sound financial future.\n\tWe also provide an environment that fosters the actualization of goals, and career fulfillment for our people while providing transformational solutions for Africa’s challenges.\n\n\nFlexible Working Arrangement:\n\n\n\tCoronation’s current flexible working arrangement is designed to enable in-person connections and collaboration that is core to our culture such that it provides employees the flexibility of working from both the office (on-premises) and remotely.\n\n\nMethod of Application\nInterested and qualified candidates should send their CVs to: careers@coronationinsurance.com.ng using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Senior HR Business Partner Job at Teal Consulting",
    "link": "https://www.jobgurus.com.ng/jobs/view/senior-hr-business-partner-job-at-teal-consulting",
    "pubDate": "Mon, 23 Jun 2025 12:33:57 GMT",
    "source": "JobGurus",
    "keyword": "teal consulting",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "Teal Consulting - Our client, a strategic security management firm, is recruiting to fill the position below:\n\nJob Position: Senior HR Business Partner\n\nJob Location: Island, Lagos\nEmployment Type: Full-time\n\nSummary\n\n\n\tWe are seeking an experienced Senior HR Business Partner to drive people strategy, oversee HR operations, and support business alignment through proactive HR interventions.\n\tThis role is instrumental in ensuring compliance, workforce efficiency, and organizational excellence.\n\n\nKey Responsibilities Includes:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tManage end-to-end hiring: job ads, interviews, background checks, and onboarding.\n\tMaintain employee records, draft HR documents, and enforce policies on attendance and conduct.\n\tEnsure compliance with labor laws (pensions, taxes), and oversee performance reviews, training, and staff engagement.\n\tSupervise daily admin operations, support staff, and maintain organized records for contracts and licenses.\n\tOversee procurement: vendor evaluation, purchase requests, inventory tracking, and co-approval with Finance.\n\tPrepare monthly reports on HR, administration, and procurement for management.\n\tAlign HR and procurement activities with internal controls and regulatory standards.\n\n\nRequirements\n\n\n\tInterested candidates should possess a Bachelor`s Degree\n\t5+ years of experience in HR, administration, preferably in security, logistics, or service sectors.\n\tSolid knowledge of Nigerian labor laws, HR compliance, procurement processes, and policy enforcement.\n\tSkilled in recruitment, vendor evaluation, purchase planning, inventory tracking, and internal controls.\n\tProficient in Microsoft Office (Excel, Word) and HRIS tools, with strong documentation and reporting abilities.\n\tDiscreet, detail-oriented, and able to multitask effectively in dynamic, fast-paced environments.\n\n\nMethod of Application\nInterested and qualified candidates should forward their CV to: tealconsulting@tealconsulting.ng using the Job Position as the subject of the mail.\n\nNote: Only selected applicants will be contacted.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Full Stack Developer (Web & AI Workflows) Job at Zocode Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/full-stack-developer-web-ai-workflows-job-at-zocode-limited",
    "pubDate": "Mon, 23 Jun 2025 12:33:57 GMT",
    "source": "JobGurus",
    "keyword": "zocode limited",
    "duplicate": false,
    "classifications": [
      "Software Engineering"
    ],
    "content": "Zocode Limited is established as a Business Resources Provider registered with the Corporate Affairs Commission in Nigeria, we provide business solutions to support and help organizations enhance their performance. Our business solution products or services are delivered via channels like software, training, process modeling and optimization. We tell fewer stories and deliver more results. One of our values is “Customer Satisfaction”, to continually deliver solutions that have real impact on our clients by consistently improving the capacity of our personnel, methodologies, and infrastructures.\n\nWe are recruiting to fill the position below:\n\nJob Position: Full Stack Developer (Web & AI Workflows)\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Location: Remote\nEmployment Type: Contract\n\nJob Description\n\n\n\tWe are looking for askilled Full Stack Developer with experience in web application developmentandAI-powered workflows.\n\tThe ideal candidate will have strong expertise inPython, React, Node.js, and integratingAI tools (e.g., OpenAI, LangChain, Hugging Face, etc.)into software solutions.\n\n\nResponsibilities\nYou will be responsible for:\n\n\n\tDeveloping and maintainingscalable web applicationsusingReact (frontend) and Node.js/Python (backend).\n\tDesigning and implementingAI/ML workflowsto enhance application intelligence (e.g., chatbots, automation, data processing).\n\tIntegratingthird-party AI APIs(OpenAI, Gemini, Claude, etc.) and frameworks (LangChain, LlamaIndex) into applications.\n\tBuildingRESTful APIs and microservicesfor seamless AI model deployment.\n\tOptimizing applications forperformance, security, and scalability.\n\tCollaborating with cross-functional teams to define, design, and ship new features.\n\tStaying updated with the latest advancements inAI/ML tools and web technologies.\n\n\nRequirements\nTechnical Skills:\nWeb Development:\n\n\n\tStrong experience inReact.js(with hooks, state management like Redux/Zustand).\n\tProficiency inNode.js(Express/Nest.js) andPython(Django/Flask/FastAPI).\n\tKnowledge ofRESTful APIs, GraphQL, and WebSockets.\n\tFamiliarity with databases (PostgreSQL, MongoDB, Firebase).\n\tProficiencyUI/UX Design (Figma).\n\n\nAI/ML & Workflow Automation:\n\n\n\tHands-on experience withAI tools (OpenAI API, Gemini, Hugging Face, LangChain, etc.).\n\tAbility to design and implementAI-powered workflows(e.g., chatbots, document processing, recommendation systems).\n\tExperience withLLM fine-tuning, RAG (Retrieval-Augmented Generation), and prompt engineering.\n\tBasic understanding ofmachine learning models (NLP, computer vision)is a plus.\n\n\nDevOps & Tools:\n\n\n\tExperience withGit, Docker, CI/CD pipelines.\n\tFamiliarity with cloud platforms (AWS, GCP, Azure) for deploying AI models.\n\tKnowledge ofserverless architectures(AWS Lambda, Firebase Functions).\n\n\nSoft Skills:\n\n\n\tStrong problem-solving and analytical thinking.\n\tAbility to work independently and in a team.\n\tGood communication skills to explain technical concepts.\n\n\nSalary\nN250,000 - N300,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: jobs@zocoderesources.com using the Job Position as the subject of the mail.\n\nNote: This is a 3 months contract with posible extension.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]