[
  {
    "title": "Internal Auditor Job at Outsource Nigeria",
    "link": "https://www.jobgurus.com.ng/jobs/view/internal-auditor-job-at-outsource-nigeria",
    "pubDate": "Wed, 11 Jun 2025 16:48:38 GMT",
    "source": "JobGurus",
    "keyword": "outsource nigeria",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Outsource Nigeria is a full-service Human Resources agency, specializing in providing outsourced turnkey manpower solutions to growing companies. Our solution include HR Services, Recruiting, Accounting, IT Support, Business Intelligence, Developers, and Operations including management and field / phone / automated based resources. The core of Outsource Nigeria’s success is its people.\n\nWe are recruiting to fill the position below:\n\nJob Position: Internal Auditor\n\nJob Location: Abuja (FCT) \nEmployment Type: Full-time\n\nRole Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Manager will be responsible for evaluating the effectiveness of internal controls, risk management processes, and governance systems.\n\tThis role involves performing audits across business operations, identifying weaknesses, and recommending improvements to ensure compliance with regulatory requirements, policies, and best practices.\n\n\nDuties & Responsibilities\nAudit Functions:\n\n\n\tDevelop and implement risk-based internal audit plans for the bank.\n\tPerform regular audits of operational, financial, and administrative functions.\n\tEvaluate internal control system and recommend improvements.\n\tEnsure accuracy and integrity of financial records and transactions.\n\tPrepare audit reports with observations, risks, and recommendations for corrective action.\n\tFollow up on the implementation of audit recommendations.\n\n\nCompliance Functions:\n\n\n\tMonitor the bank’s compliance with all applicable CBN regulations, microfinance guidelines, anti-money laundering (AML) laws, and Know Your Customer (KYC) policies.\n\tEnsure the bank’s activities are in line with the Microfinance policy, regulatory and supervisory framework.\n\tPrepare and submit periodic compliance reports to regulatory bodies (CBN, NDIC, etc.).\n\tDevelop and review internal policies to ensure they reflect current regulatory requirements.\n\tConduct compliance training and sensitization of staff.\n\n\nRegulatory and risk oversight:\n\n\n\tLiaise with external auditors and regulatory examiners.\n\tIdentify areas of potential non-compliance or financial risk ans recommend mitigating controls.\n\tEnsure timely updates to management and board on compliance issues and changes in regulation.\n\tMaintain a compliance risk register and implement monitoring mechanisms.\n\n\nAsset Management:\n\n\n\tAnalyse financial records, operational data, and business procedures to ensure accuracy and compliance with applicable laws and regulations.\n\tTake charge of evaluating, tracking, optimizing the performance of assets including but not limited to equities, bonds, fixed incomes and other investments of the organisation.\n\tTrack and monitor investment fund per time.\n\tMonitor investments maturity and due date and ensure payment is done timely.\n\tEnsure update communication is done to investors regularly to maintain relationships.\n\tAnalyse the different investment options for placement and returns.\n\n\nRequirements\n\n\n\tBachelor’s Degree in Accounting, Finance, or a related field.\n\tAt least 8 – 10 years of experience with minimum of 5yrs in similar position.\n\tProfessional certification such as ACA, ACCA, or CIA is preferred.\n\tRegistration / membership to a relevant professional Body is an advantage.\n\tStrong knowledge of risk management, compliance, internal control systems, and financial reporting.\n\tFamiliarity with relevant regulations (e.g., tax laws).\n\tProficient in Microsoft Office and audit software/tools.\n\tFamiliarity with quick book accounting software/tool.\n\tHigh attention to detail, analytical thinking, and problem-solving skills.\n\tStrong verbal and written communication skills.\n\tIntegrity, independence, and a proactive approach to work.\n\n\nSalary\nN300,000 / month.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: jobs@outsourcenigeria.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]