[
  {
    "title": "Social Media Manager / Content Creator Job at Auldon Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/social-media-manager-content-creator-job-at-auldon-limited",
    "pubDate": "Tue, 17 Jun 2025 12:33:19 GMT",
    "source": "JobGurus",
    "keyword": "auldon limited",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance"
    ],
    "content": "Auldon Limited is a toy trading company strategically located in the commercial centre of idumota Lagos Nigeria, it is a wholesale distribution organization servicing major departmental stores, Multi-National Organizations and educational institutions within Nigeria and its sub-region. Founded as Arigold Toys in 1996 before transforming into a limited liability company, with the registration RC-439491 and named auldon limited in the year 2002.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nAuldon limited is famously known internationally for pioneering the African Themed Unity Girls Dolls, a collection of 14-inch dolls, each representing Nigeria’s three major tribes which promotes cultural inclusion amongst Africans and her diaspora communities. The product is being created to deliver an empowering social message to girls around Nigeria and the world at large.\n\nWe are recruiting to fill the position below:\n\nJob Position: Social Media Manager / Content Creator\n\nJob Location: Lagos Island, Lagos\nEmployment Type: Full-time\n\nJob Description\n\n\n\tWe are looking for a talented Social media manager/Content creator to administer our social media accounts.\n\tYou will be responsible for creating original text and video content, managing posts and responding to followers.\n\tYou will manage our company image in a cohesive way to achieve our marketing goals.\n\tAs a Social media manager, we expect you to be up-to-date with the latest digital technologies and social media trends.\n\tYou should have excellent communication skills and be able to express our company's views creatively. Ultimately, you should be able to handle our social media presence, ensuring high levels of web traffic and customer engagement.\n\n\nResponsibilities\n\n\n\tPerform research on current benchmark trends and audience preferences\n\tDesign and implement a social media strategy to align with business goals\n\tSet specific objectives and report on ROI\n\tGenerate, edit, publish and share engaging content daily, e.g. original text, photos, videos and news.\n\tMonitor SEO and web traffic metrics\n\tCollaborate with other teams, like marketing, sales and customer service, to ensure brand consistency\n\tCommunicate with followers, respond to overleaves in a timely manner and monitor customer reviews.\n\n\nQualifications and Requirements\n\n\n\tBachelor's degree in Marketing, Communications, or related field.\n\tMinimum of 3 years of experience in social media management or digital marketing.\n\tProven track record of developing and implementing successful social media strategies and campaigns.\n\tStrong understanding of social media platforms, algorithms, and best practices.\n\tExcellent written and verbal communication skills.\n\n\nMethod of Application\nInterested and qualified candidate should send their CV to: operations@auldontoys.com using Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Admin Manager Job at Prixair",
    "link": "https://www.jobgurus.com.ng/jobs/view/admin-manager-job-at-prixair",
    "pubDate": "Tue, 17 Jun 2025 12:33:19 GMT",
    "source": "JobGurus",
    "keyword": "prixair",
    "duplicate": false,
    "classifications": [],
    "content": "Prixair comprises of Prixair Hotels, Prixair Catering, Prixair Properties, Prixair Studio and Flames Restaurant. We are the leading hospitality company, spanning the lodging sector from luxurious full-service hotels to extended-stay suites. Prixair Group offers business and leisure travellers the finest in accommodations, service, amenities and value. Prixair Group is dedicated to continuing its tradition of providing exceptional guest experiences.\n\nWe are recruiting to fill the position below:\n\nJob Position: Admin Manager \n\nJob Location: Gaduwa, Abuja (FCT) \nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Administrative Officer provides support to ensure efficient operation of the office.\n\tThe role involves handling a variety of administrative and clerical tasks, including maintaining records, managing supplies, coordinating meetings, and supporting other departments as needed.\n\n\nKey Responsibilities\n\n\n\tOversee and coordinate daily office activities and operations to ensure efficiency and compliance with company policies.\n\tMaintain and update office records, files, and databases.\n\tManage office supplies and inventory; ensure timely procurement and restocking.\n\tSupport HR or accounting with basic data entry or document management tasks.\n\tHandle correspondence (emails, letters, memos) and incoming/outgoing mail or packages.\n\tSchedule meetings, prepare meeting rooms, and take meeting minutes when necessary.\n\tAssist in the preparation of reports, letters, and presentations.\n\tLiaise with vendors, service providers, and contractors to ensure smooth operations.\n\tMonitor maintenance and cleanliness of the office premises.\n\tPerform general clerical duties including photocopying, scanning, and filing.\n\n\nRequirements\n\n\n\tOND / HND / B.Sc. in Business Administration, Office Management, or a related field.\n\t7-11 years of proven experience in an administrative or clerical role.\n\tProficient in Microsoft Office Suite (Word, Excel, Outlook).\n\tStrong organizational and multitasking skills.\n\tExcellent written and verbal communication skills.\n\tAttention to detail and ability to work independently.\n\n\nPreferred Skills:\n\n\n\tFamiliarity with office equipment like printers, copiers, and scanners.\n\tAbility to maintain confidentiality and handle sensitive information.\n\tGood interpersonal skills and a professional attitude.\n\tFlexibility and willingness to take on varied administrative tasks.\n\n\nMethod of Application\nInterested and qualified candidates should forward their CV to: amandaosifoedwards@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Graphics Designer / Video Editor Job at Auldon Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/graphics-designer-video-editor-job-at-auldon-limited",
    "pubDate": "Tue, 17 Jun 2025 12:33:19 GMT",
    "source": "JobGurus",
    "keyword": "auldon limited",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance"
    ],
    "content": "Auldon Limited is a toy trading company strategically located in the commercial centre of idumota Lagos Nigeria, it is a wholesale distribution organization servicing major departmental stores, Multi-National Organizations and educational institutions within Nigeria and its sub-region. Founded as Arigold Toys in 1996 before transforming into a limited liability company, with the registration RC-439491 and named auldon limited in the year 2002.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nAuldon limited is famously known internationally for pioneering the African Themed Unity Girls Dolls, a collection of 14-inch dolls, each representing Nigeria’s three major tribes which promotes cultural inclusion amongst Africans and her diaspora communities. The product is being created to deliver an empowering social message to girls around Nigeria and the world at large.\n\nWe are recruiting to fill the position below:\n\nJob Position: Graphics Designer / Video Editor\n\nJob Location: Lagos Island, Lagos\nEmployment Type: Part-time\n\nJob Summary\n\n\n\tWe are currently recruiting for a Graphics Designer / Video Editor that can help to visually represent the company’s creative products.\n\n\nResponsibilities\n\n\n\tEditing video content for various platforms\n\tDesigning graphics for marketing materials, and social media\n\tCollaborating with marketing and creative teams\n\tMaintaining a high standard of quality\n\tStaying up-to-date with industry trends\n\tEnsuring consistency in brand messaging\n\tCreating engaging content that resonates with customers\n\tWorking under tight deadlines\n\tCreating compelling and effective logos, designs, print and digital media\n\tCreating attractive Graphic & Video Content.\n\n\nQualifications\n\n\n\tDegree in Graphic Design, Visual Arts, or a related field.\n\t2 - 4 years of experience as a Graphic Designer and Video Editor.\n\tStrong portfolio showcasing design and video editing skills.\n\tProficiency in design and video editing software (Adobe Creative Suite, Final Cut Pro, etc.).\n\n\nSalary:\nN150,000 Monthly.\n\nMethod of Application\nInterested and qualified candidate should send their CV to: operations@auldontoys.com using Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Branch Manager Job at Citygate Global Investment Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/branch-manager-job-at-citygate-global-investment-limited",
    "pubDate": "Tue, 17 Jun 2025 12:33:19 GMT",
    "source": "JobGurus",
    "keyword": "citygate global investment limited",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Citygate Global Investment Ltd is an organization founded in June 2007 to engage in Finance business (Microfinance Finance) and registered with Corporate Affairs Commission (CAC). Citygate Global is a registered member of Association of Non-Bank Microfinance Institution of Nigeria (AMFIN) and also a registered Money Lending Company in all the States where we operate.\n\nWe are recruiting to fill the position below:\n\nJob Position: Branch Manager\nJob Location: Warri, Delta\nEmployment Type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tLead and manage the branch team to achieve business objectives and improve customer satisfaction\n\tOversee branch operations, including sales, credit, and customer service\n\tDevelop and implement strategies to grow the branch's portfolio and customer base\n\tEnsure compliance with regulatory requirements and MFB policies\n\tFoster a positive and productive work environment.\n\n\nRequirements\n\n\n\tInterested candidates should possess an HND with 5 - 10 years of work experience. \n\n\nSalary\nN250,000 - N300,000 per month. \n\nMethod of Application\nInterested and qualified candidates should send their CV to: careers@citgateglobal.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]