[
  {
    "title": "Social Media & Digital Marketing Officer Job at ValueJet",
    "link": "https://www.jobgurus.com.ng/jobs/view/social-media-digital-marketing-officer-job-at-valuejet-1",
    "pubDate": "Thu, 03 Jul 2025 14:43:34 GMT",
    "source": "JobGurus",
    "keyword": "valuejet",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "ValueJet was founded as an airline in 2018. Our vision is to be a global airline connecting people and places using modern air travel, enabled by professional workforce. We offer an end-to-end customer experience backed by up-to-date technology. We are a team of dedicated and passionate people who are committed to providing the best service to our customers. We operate to and from the following cities: Lagos, Abuja, Port Harcourt, Yola, Benin, Asaba, Kano & Jos. We also offer charter services.\n\nWe are recruiting to fill the position below:\n\nJob Position: Social Media & Digital Marketing Officer\n\nJob Location: Lagos\nEmployment: Permanent\n\nAbout the Job\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAre you passionate about crafting compelling content and growing digital communities? ValueJet is looking for someone bold, creative, and data-savvy to lead the charge across our digital platforms.\n\n\nResponsibilities\n\n\n\tCraft authentic stories that connect with our global audience\n\tRunning high-impact digital campaigns that drive results\n\tTurning insights and analytics into smarter strategies\n\n\nWho You Are\n\n\n\tA growth-focused creative with a knack for storytelling, a collaborative mindset, and a deep understanding of digital culture.\n\tYou’re not afraid to try, test, and optimize bringing ideas to life with the right mix of vision and execution.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Head of Investment Job at Co Creation Hub",
    "link": "https://www.jobgurus.com.ng/jobs/view/head-of-investment-job-at-co-creation-hub",
    "pubDate": "Thu, 03 Jul 2025 14:43:34 GMT",
    "source": "JobGurus",
    "keyword": "co creation hub",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "CcHUB is Nigeria’s first open living lab and pre-incubation space being designed to be a multi-functional, multi-purpose space where work to catalyze creative social tech ventures take place. The HUB is a place for technologists, social entrepreneurs, government, tech companies, impact investors and hackers in and around Lagos to co-create new solutions to the many social problems in Nigeria.\n\nWe are recruiting to fill the position below:\n\nJob Position: Head of Investment\n\nJob Location: Lagos\nEmploymwnt Type: Full-time\n\nJob Purpose\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tThe Head of Investments at CcHUB leads the organisation’s investment strategy and execution, ensuring startups supported across our incubation, acceleration, and venture studio programs are well-prepared for funding, and that our portfolio companies receive value-adding support to scale.\n\tThis role also oversees portfolio management for CcHUB Syndicate and Growth Capital by CcHUB, while driving new investment activity through both equity and non-dilutive financing mechanisms.\n\tThe Head of Investments will play a strategic role as a member of the senior management team, providing guidance to the organisation on all matters related to investments and capital mobilization for startups.\n\n\nDuties and Responsibilities\nStrategic and Organisational Leadership (10–20%):\n\n\n\tServe as a member of the CcHUB management team, contributing to organization-wide strategy and decision-making.\n\tLeading strategy development and implementation of the CCHUB Investment strategy across the areas below (Investment Readiness Support, Portfolio Management, Investment Execution) \n\tProvide internal advisory on investment-related matters, including fund structuring, startup financing trends, and capital strategy for special initiatives.\n\tManage and grow a high-performing investment team, providing mentorship, guidance, and performance oversight.\n\n\nInvestment Readiness Support (30–40%):\n\n\n\tLead the development and delivery of investment readiness programming for startups participating in CcHUB’s incubators, accelerators, and venture studios.\n\tDesign and implement tools, frameworks, and training modules to improve founders’ fundraising capacity and investor engagement skills.\n\tCoordinate pitch sessions, demo days, and investor matchmaking events.\n\n\nPortfolio Management (20–30%):\n\n\n\tOversee and deepen engagement with CcHUB’s portfolio companies (currently about a dozen companies supported through CcHUB Syndicate and Growth Capital).\n\tTrack and report portfolio performance, support investee governance (e.g., board participation, reporting obligations), and facilitate access to follow-on capital, strategic partners, and advisory services.\n\tAdvise the Managing Director on portfolio company matters through preparation, participation, and reporting on portfolio company board meetings and based on portfolio reports. \n\tProvide occasional support to high-performing alumni of CcHUB startup programs, particularly where opportunities exist for growth and capital mobilisation.\n\n\nInvestment Execution (20–30%):\n\n\n\tLead deal sourcing, diligence, structuring, and execution for investments made via CcHUB Syndicate and Growth Capital and through startup support programs.\n\tManage investor relationships and support the reactivation and growth of the CcHUB Syndicate, ensuring quality deal flow and co-investment opportunities.\n\tStructure and deploy non-dilutive funding instruments where applicable, particularly through accelerators and grant-linked innovation programs.\n\n\nKey Performance Indicators\nIn the first year, the KPIs will include: \n\n\n\tStrategic and Organizational Leadership \n\tInvestment Readiness Support\n\tPortfolio Management\n\tInvestment Execution.\n\n\nQualifications\nEssential:\n\n\n\tMinimum of 7–10 years of progressive experience in venture capital, impact investing, private equity, investment banking, startup financing, or leading incubators, accelerators, or venture studios.\n\tProven ability to design and deliver investment readiness programs for early-stage startups.\n\tDeep understanding of the African startup and innovation ecosystem.\n\tStrong experience in conducting due diligence, managing investment processes, and supporting portfolio companies post-investment.\n\tExcellent relationship-building skills with both investors and founders.\n\tStrong analytical, negotiation, and financial modelling capabilities.\n\tDemonstrated leadership experience, including managing teams and contributing at the senior leadership level.\n\n\nDesirable:\n\n\n\tExperience with both equity and non-dilutive financing mechanisms.\n\tKnowledge of fundraising trends and blended finance models applicable to African startups.\n\tFamiliarity with regulatory frameworks and compliance considerations around startup investments in multiple countries across Africa.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Experienced Male / Female Field Marketer Job at Omimewos Global Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/experienced-male-female-field-marketer-job-at-omimewos-global-limited",
    "pubDate": "Thu, 03 Jul 2025 14:43:34 GMT",
    "source": "JobGurus",
    "keyword": "omimewos global limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Omimewos Global Limited, a paint manufacturing company, is recruiting to fill the position below:\n\nJob Position: Experienced Male / Female Field Marketer \n\nJob Location: Ota, Ogun\nEmployment Type: Full-time\n\nRequirements\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tInterested candidates should possess a Bachelor`s Degree / OND qualification with 3 - 7 years of work experience.\n\tWell behaved\n\tMust have experience in marketing\n\tMust be a team player\n\tMust also ready to meet up company target\n\tTarget orientated person\n\tFamiliar with Lagos, Ogun State road (female) and a male must be also familiar with other western States.\n\n\nSalary\nN100,000 - N170,000 monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: valourpaintsnigerialimited@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Personal Assistant to a Senior Executive Job at Obsidian Capital",
    "link": "https://www.jobgurus.com.ng/jobs/view/personal-assistant-to-a-senior-executive-job-at-obsidian-capital",
    "pubDate": "Thu, 03 Jul 2025 14:43:34 GMT",
    "source": "JobGurus",
    "keyword": "obsidian capital",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Obsidian Capital is a Principal Investment firm established in 2014 with a focus on transforming African lives by creating companies that deliver sustained, long-term beneficial impact. The firm designs locally specialized, globally competitive, large-scale private-sector solutions to infrastructure challenges in middle Africa. Located in Lagos State, Nigeria, Obsidian Capital aims to transform the infrastructure landscape of middle Africa, particularly in renewable and sustainable power infrastructure.\n\nWe are recruiting to fill the position below:\n\nJob Position: Personal Assistant to a Senior Executive\n\nJob Location: Ikoyi, Lagos\nEmployment Type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are looking for an organised, diligent, experienced and dedicated Personal Assistant (PA) to support a Senior Executive (SE).\n\tThe ideal candidate must have a positive attitude, be credible, reliable, discrete, responsible, trustworthy, mature, demonstrate a high attention to detail, good initiative and strong communication skills, both verbal and written. Cultural fit is key to the role, and it is vital that the PA shares and upholds our values and beliefs.\n\n\nResponsibilities\nKey Responsibilities of this role include but are not limited to:\n\n\n\tOrganise and maintain SE’s daily schedule - booking appointments and coordination of any travel logistics.\n\tKeep the SE well informed of upcoming commitments and responsibilities, following up appropriately.\n\tAssist the SE with organising regular team meetings, training days, team bonding activities, etc. Use own initiative to solve problems as they arise.\n\tHelp to manage communication between the SE and the wider team, promoting team work and collaboration.\n\tHandle incoming documents relating to live transactions. Liaise with and support the work of the wider team.\n\tManage ad-hoc and special projects, events from idea stage to fruition.\n\tInteract and communicate professionally with high-level corporate organisations and high profile individuals, as an extension of the SE.\n\tPrioritise urgent matters and proactively manage any conflicts efficiently and effectively, and following-through on projects until the successful completion, often with deadline pressures.\n\tManage some of the SE’s personal tasks on his behalf.\n\n\nRequired Qualifications and Skills\n\n\n\tBachelor’s Degree.\n\tStrong organisational skills, able to prioritise and perform multiple tasks seamlessly.\n\tExcellent ability to speak and write English language.\n\tProficient in MacOS Keynote, Pages, Numbers, MS Word & MS Excel.\n\tDiligent, high attention to detail.\n\tStrong interpersonal skills, good at building stakeholders relationships.\n\tResult oriented, able to deliver on time, under pressure.\n\tHighly adaptable, able to deal with ambiguity and change.\n\tAble to handle confidential matters with absolute discretion.\n\tAble to work in a fast-paced, team with minimal supervision.\n\tProactive, with good decision-making capacity.\n\tClient-facing experience.\n\tGood Numeric ability.\n\tMust be mature, courteous, reliable.\n\n\nMethod of Application\nInterested and qualified candidates should send their Applications to: hrpartners.recruitments@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Restuarant Manager Job at Global Windsor Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/restuarant-manager-job-at-global-windsor-group",
    "pubDate": "Thu, 03 Jul 2025 14:43:34 GMT",
    "source": "JobGurus",
    "keyword": "global windsor group",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "Global Windsor Group, with the core of its activities in Nigeria, is a diversified organization covering a range of markets including property, oil and gas, and communications. These markets comprise a significant cross-section of both ECOWAS and the Nigerian economy.\n\nGWG can provide world-class products and services, having established strong relationships with some of the world's leading multinationals. With a diverse operational platform, we aim to further entrench ourselves as a pioneer within the Nigerian markets.\n\nWe are recruiting to fill the position below:\n\nJob Position: Restuarant Manager\nJob Location: River Plate, Wuse 2 - Abuja (FCT)\nEmployment Type: Full-time\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Summary\n\n\n\tWe are seeking a passionate and experienced Restaurant Manager to oversee the daily operations of our restaurant, The Garden by L’Epicure, located at River Plate Park, Wuse 2.\n\tThe ideal candidate will ensure a seamless flow of service, uphold high standards in food quality and customer experience, manage staff performance, and drive overall guest satisfaction.\n\tThis role requires effective leadership, excellent organizational skills, and strong attention to detail to ensure the continued success of the restaurant.\n\n\nKey Responsibilities\n\n\n\tOversee all front-of-house and back-of-house restaurant operations.\n\tHire, train, schedule, and supervise restaurant staff.\n\tMonitor food quality, presentation, and safety standards.\n\tHandle customer inquiries, complaints, and ensure an exceptional dining experience.\n\tMaintain proper stock levels and manage supplier relationships.\n\tEnforce compliance with health, safety, and hygiene regulations.\n\tTrack sales, labor, and food costs to meet profitability targets.\n\tDevelop marketing and promotional strategies to drive customer traffic.\n\tEnsure the cleanliness and ambiance of the restaurant are maintained at all times.\n\tPrepare shift reports and assist in budgeting and forecasting.\n\tPerfrom other task assigned.\n\n\nQualifications & Requirements\n\n\n\tMinimum of a Diploma in Hospitality Management, Business Administration, or related field (Bachelor's degree preferred).\n\tProven experience as a Restaurant Manager or similar role.\n\tStrong leadership, communication, and interpersonal skills.\n\tAbility to multitask and work in a fast-paced environment.\n\tFamiliarity with restaurant management software and POS systems.\n\tStrong understanding of hospitality standards and customer service.\n\tGood organizational and financial management skills.\n\n\nWork Schedule:\n\n\n\tDays: Monday to Saturday\n\tHours: 3:00 PM - 12:00 Midnight\n\tMust be flexible to work during holidays, peak hours, and special events.\n\n\nSalary\nN150,000 - N200,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV and Cover letter to: recruitment.windsorr@gmail.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]