[
  {
    "title": "Accounts Assistant Job at  Flour Mills of Nigeria",
    "link": "https://www.jobgurus.com.ng/jobs/view/accounts-assistant-job-at-flour-mills-of-nigeria",
    "pubDate": "Wed, 18 Jun 2025 10:44:31 GMT",
    "source": "JobGurus",
    "keyword": " flour mills of nigeria",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Nigerian Eagle Flour Mills Limited (NEFM), a subsidiary of Flour Mills of Nigeria Plc, was incorporated in November 1979 to manufacture and market Flour and allied products like Semolina and Bran.\n\nWe are recruiting to fill the position below:\n\nJob Position: Accounts Assistant\n\nJob Location: Ibadan, Oyo\n\nThe Purpose\n\n\n\tTo promptly settle vendor and transporter bills, and to maintain and implement efficient control systems that prevent duplication or overshooting of maintenance expenses and budget. \n\n\nThe Job\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tProcess vendors’ documents in the M-Files system and forward them to the Head Office for payment processing.  \n\tGenerate payment advice and communicate updates to vendors regarding bill settlements.  \n\tReconcile vendor sub-ledgers with the general ledger on a monthly, quarterly, and yearly basis.  \n\tEnsure accurate three-way matching of Purchase Orders (PO), Waybills, and Invoices.  \n\tMaintain proper bookkeeping of all financial documents and general journal entries in M-Files.  \n\tHandle prompt processing of all PHFM-related payments, including staff salaries.  \n\tEnsure timely remittance of statutory payments (PAYE, Pension, Withholding Tax, VAT) to avoid penalties.  \n\tParticipate actively in monthly stock counts and stock reconciliation exercises. \n\n\nRequirements\nQualifications:\n\n\n\tOND in Accounting or any other related discipline.  \n\tAAT Certification will be an added advantage.\n\n\nExperience:\n\n\n\tMinimum of two years of relevant work experience in a similar role. \n\n\nThe Person Must:\n\n\n\tPossess good verbal and written communication skills.   \n\tProficiency in accounting software and Microsoft Office tools.  \n\tStrong attention to detail, organizational, and analytical skills. \n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Sales & Marketing Executive (Female) Job at Elliom Food Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/sales-marketing-executive-female-job-at-elliom-food-limited",
    "pubDate": "Wed, 18 Jun 2025 10:44:31 GMT",
    "source": "JobGurus",
    "keyword": "elliom food limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Elliom Food Limited is dedicated to producing high-quality bread and refined water. We use the finest ingredients to ensure exceptional taste and freshness and take the highest standard to provide hygienic drinking water. Our mission is to bring joy to our customers through our artisanal baking and clean water, while maintaining the highest standards of quality and hygiene.\n\nWe are recruiting to fill the position below:\n\nJob Position: Sales & Marketing Executive (Female) \n\nJob Location: Benin City, Edo\nEmployment Type: Full-time\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tPromote and sell all Elliom Foods products (bread, pastries, beverages) to wholesalers, retailers, and direct consumers\n\tIdentify new sales routes and business opportunities across Benin City\n\tTrack customer feedback and relay market insights to management for product improvement\n\tDemonstrate product knowledge during customer interactions, ensuring high satisfaction\n\tRepresent the company professionally in appearance and attitude at all times\n\tMeet weekly and monthly sales targets with dedication\n\tBuild and maintain strong relationships with customers, vendors, and local communities\n\tDistribute samples and promotional materials to grow brand awareness\n\tAssist in organizing local marketing events, tastings, or product launches.\n\n\nRequirements\n\n\n\tMinimum qualification: SSCE / WAEC / NECO\n\tFemale applicants only\n\tMust be presentable, confident, and neat in appearance\n\tAbility to speak clearly in English, Pidgin, and/or Edo dialects\n\tStrong communication and persuasive skills\n\tPassionate about food and customer service\n\tEnergetic, proactive, and ready to move around the city.\n\n\nWhat We Offer\n\n\n\tSalary: N100,000 per month\n\tPerformance-based bonuses on sales\n\tFree accommodation provided.\n\tOpportunity to build a rewarding career in marketing\n\tSupportive and friendly work environment.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: elliombakery@gmail.com using the Job Position as the subject of the email.\n\nNote: Only shortlisted candidates will be contacted.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Videographer / Editor Job at Sujimoto Construction Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/videographer-editor-job-at-sujimoto-construction-limited",
    "pubDate": "Wed, 18 Jun 2025 10:44:31 GMT",
    "source": "JobGurus",
    "keyword": "sujimoto construction limited",
    "duplicate": false,
    "classifications": [],
    "content": "Sujimoto Construction Limited is a luxury real estate and construction company with a vision to dominate Nigeria's real estate industry. The firm covers all areas of construction, including the pre and post phases. Our major expertise is in luxury real estate development. We have also expanded our operations into facility management and direct construction, catering to the discerning real estate investor who wishes to be associated only with bespoke and iconic structures.\n\nWe are recruiting to fill the position below:\n\nJob Position: Videographer / Editor\n\nJob Location: Lagos\njob Type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a highly experienced Videographer/Editor to join our dynamic creative team.\n\tThe ideal candidate will possess a deep understanding of video production processes, from concept development to post-production, and will have a portfolio that showcases exceptional storytelling through visual media.\n\tThis role requires a blend of technical expertise, artistic vision, and strong collaboration skills.\n\n\nResponsibilities\n\n\n\tVideo Production: Lead all aspects of video production, including pre-production planning, shooting, and post-production editing. Collaborate with creative teams to develop concepts and scripts that align with project goals.\n\tFilming: Operate professional video cameras, lighting, and sound equipment to capture high-quality footage. Ensure the highest production standards are met on all shoots.\n\tEditing: Utilize advanced editing software (e.g., Adobe Premiere Pro, Final Cut Pro, DaVinci Resolve) to edit footage, create compelling narratives, and produce polished final products. Implement color grading, sound design, and visual effects as necessary.\n\tProject Management: Manage multiple projects simultaneously, ensuring deadlines are met while maintaining quality. Communicate effectively with team members and stakeholders throughout the production process.\n\tCollaboration: Work closely with directors, producers, and other team members to brainstorm ideas, provide creative input, and incorporate feedback into projects.\n\tQuality Control: Review and critique video content for quality, accuracy, and adherence to brand standards. Ensure all projects are delivered on time and to specification.\n\tInnovation: Stay up-to-date with industry trends, techniques, and technologies. Propose new ideas and approaches to enhance the quality and impact of video content.\n\n\nRequirements\n\n\n\t3 years+ of proven experience as a videographer/Editor\n\tProficiency in video editing software such as Adobe Premiere Pro, Cap Cut or equivalent.\n\tStrong knowledge of lighting, composition, and audio techniques..\n\tExcellent attention to detail, creativity, and organizational skills.\n\tExperience with 4K and HDR video production.\n\tKnowledge of drone operation and aerial videography.\n\tStrong communication and teamwork abilities.\n\tAbility to work independently and under pressure.\n\n\nMethod of Application\nInterested and qualified candidates should submit their CV and portfolio showcasing relevant work to: Best@sujimotonig.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Branch Manager Job at Covenant Microfinance Bank Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/branch-manager-job-at-covenant-microfinance-bank-limited-1",
    "pubDate": "Wed, 18 Jun 2025 10:44:31 GMT",
    "source": "JobGurus",
    "keyword": "covenant microfinance bank limited",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance"
    ],
    "content": "Covenant Microfinance Bank Limited was incorporated as a private limited liability company on May 6, 2003 and commenced operations on March 15, 2004 as Covenant University Community Bank Limited (CUCB LTD). Converted to a Microfinance Bank in line with Central Bank of Nigeria’s directive to all Community Banks and commenced business as such on January 11, 2008.Granted license to operate as a State Microfinance Bank in December, 2012 having met the prescribed N100 million minimum capital requirement. In 2014, became one of the first Microfinance Banks to generate the 10-digit Nigeria Uniform Bank Account Number (NUBAN) for all its customers after successfully signing up for integration to NCS.\n\nWe are recruiting to fill the position below:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Position: Branch Manager\n\nJob Location: Ota, Ogun\nEmployment Type: Full-time\n\nResponsibilities\n\n\n\tBusiness Development: Identifying and pursuing new business opportunities , growing existing customer relationships, and meeting sales targets.\n\tTeam Management: Leading and motivating a team of bankers, providing guidance, coaching, and feedback to ensure high performance.\n\tRisk Management: Ensuring compliance with bank policies, procedures, and regulatory requirements, managing risk, and maintaining a safe and secure banking environment.\n\tFinancial Management: Managing branch finances, including budgeting, forecasting, and financial reporting.\n\tMarketing and Promotion: Developing and implementing marketing strategies to promote bank products and services.\n\tCommunity Engagement: Building relationships with local businesses,organizations, and community groups to promote the bank's reputation and services.\n\tProblem-Solving: Resolving complex customer complaints, operational issues, and other branch-related problems.\n\n\nRequirements\n\n\n\tCandidates should possess relevant qualifications in a related field with experience.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and a Cover Letter detailing their qualifications and experience to: career@covenantmfb.com.ng using “Branch Manager” as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "UI/UX Instructor Job at Fortesoft Systems Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/uiux-instructor-job-at-fortesoft-systems-limited",
    "pubDate": "Wed, 18 Jun 2025 10:44:31 GMT",
    "source": "JobGurus",
    "keyword": "fortesoft systems limited",
    "duplicate": false,
    "classifications": [],
    "content": "Fortesoft Systems Limited-NIIT is an IT training and consultancy organisation. We pride ourselves in providing thorough training on different technologies to our clients.\n\nWe are recruiting to fill the position below:\n\nJob Position: UI/UX Instructor\nJob Location: Surulere, Akowonjo, Anthony, Ikeja, Ikorodu, Festac, Ajah, Oshodi - Lagos\nEmployment Type: Full-time\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tTeach hands-on UI/UX design skills: wireframing, prototyping, user research, usability testing, and responsive design.\n\tDeliver engaging lectures, real-world projects, and design thinking workshops.\n\tMentor students on portfolio building, career paths in UI/UX, and certifications (Google UX, IDF, Nielsen Norman Group).\n\tStay current with trends in human-centered design, accessibility, and AI-powered design tools.\n\n\nRequirements\n\n\n\tProficiency in Figma, Adobe XD, Sketch, InVision, and UX research tools.\n\tStrong teaching, communication, and mentoring skills with a focus on user-centered design.\n\tCertifications (Google UX, IDF, Nielsen Norman Group) are a plus.\n\n\nSalary\nN120,000 - N170,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: hrniit1@gmail.com using the Job Positiion as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]