[
  {
    "title": "Job Openings at Fadac Resources and Services Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-fadac-resources-and-services-limited-4",
    "pubDate": "Thu, 25 Sep 2025 14:42:23 GMT",
    "source": "JobGurus",
    "keyword": "fadac resources and services limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Fadac Resources and Services Limited - Our clients in various sectors are currently recruiting suitably qualified candidates to fill the following positions below:\n\n1.) Construction Site Builder\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nRole Overview\n\n\n\tThe Construction Site Builder is responsible for carrying out hands-on building activities on construction sites, including preparing, assembling, and installing structures.\n\tThe role ensures work is performed according to plans, specifications, and safety standards while supporting project deadlines.\n\n\nKey Responsibilities\n     \n\n            \n    \n\n\n\n\n\tExecute building and construction tasks such as measuring, cutting, assembling, and installing materials.\n\tInterpret and follow blueprints, drawings, and site instructions.\n\tOperate hand and power tools safely and efficiently.\n\tCollaborate with site supervisors, engineers, and other workers to complete assigned tasks.\n\tMaintain site cleanliness and comply with safety regulations at all times.\n\tIdentify and report site hazards, damages, or material needs promptly.\n\n\nRequirements\n\n\n\tCandidates should possess relevant qualifications.\n\tProven experience in construction or similar role.\n\tBasic knowledge of construction methods, tools, and materials.\n\tAbility to read and interpret drawings/blueprints.\n\tPhysical fitness and stamina to work outdoors and in varying conditions.\n\tStrong attention to detail and commitment to safety.\n\n\nApplication Closing Date: 25th October, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: emmanuel.o@fadacresources.com using the Job Position as the subject of the email.\n\n \n\n \n\n2.) Talent Acquisition & Engagement Executive\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Responsibilities\n\n\n\tWorking with Hiring Managers to identify staffing needs.\n\tSource for potential candidates through online channels (e.g., social platforms and professional networks)\n\tScreening and selecting suitably qualified candidates for different roles by conducting both phone and face-to-face/video interviews for prospective hires.\n\tSourcing and engaging candidates for both immediate talent needs and the talent pipeline through various channels.\n\tThorough screening of prospective hires through interviews.\n\tEnsuring a positive candidate experience and maintaining positive communication with prospective hires.\n\tWorking with Line Managers to develop Job Descriptions for job roles, to aid hiring needs\n\tWorking to drive traffic to the career portal continuously.\n\tAssigning candidates on the Career portal to a line manager for phone interviews.\n\tLeverage different channels to create and sustain employee dialogue towards engagement.\n\tSourcing, screening, and selecting qualified candidates for all senior/top-level roles (or any other roles) by\n\tcombining a range of methods (e.g., structured interviews, assessments, and behavioral questions).\n\tAttending job fairs and recruitment events.\n\tParticipating in conferences and meet-ups to network with various professionals.\n\tParticipating in exit interviews.\n\tNetworking with potential candidates to promote the employer brand, attract professionals, and reduce hiring timelines.\n\tPlan interview and selection procedures, including screening calls, assessments, and in-person interview techniques.\n\tPeriodically provide training and guidelines for assigned team member/s\n\tMonitor and ensure optimal performance of all recruitment activities and platforms, both at the front end (career portal) and back end.\n\tProvide a bi-weekly report of all unit members’ activities, as well as other required periodic reports.\n\n\nRequirements\n\n\n\tA Bachelor’s Degree in Human Resources Management or any other related field. Additional years of relevant experience may be substituted for a Degree.\n\t3 - 5 years of post-graduation experience with cognitive experience in full life-cycle talent acquisition.\n\tExcellent knowledge of MS Office.\n\tAdditional qualifications and recognized professional certification (e.g., CIPD, CIPM, PHRi, SPHRi) will be a plus.\n\tProven work experience as a Talent Acquisition Specialist or similar role.\n\tFamiliarity with social media, resume databases, and professional networks (e.g., GitHub).\n\tHands-on experience with full-cycle recruiting using various interview techniques and evaluation methods.\n\tKnowledge of Applicant Tracking Systems (ATSs).\n\tExcellent verbal and written communication skills.\n\tDemonstrated ability to utilize advanced and unique sourcing techniques to identify talent.\n\tGoal and result oriented with good leadership skills.\n\tStrong Strategic thinking and Problem-solving.\n\n\nApplication Closing Date: 30th September, 2025.\n\nMethod of Application \nInterested and qualified candidates should send their CV to: susan.o@fadacresources.com using the Job Position as the subject of the email.\n\n \n\n \n\n3.) Client Service Executive\n\nJob Location: Lagos \nEmployment Type: Full-time\n\nDescription\n\n\n\tThe ideal candidate will serve as the primary point of contact for clients, ensuring excellent service delivery, handling inquiries, and resolving issues promptly.\n\tThis role requires strong communication, relationship management, and problem-solving skills to maintain and grow client satisfaction and loyalty.\n\n\nJob Responsibilities\n\n\n\tServe as the primary point of contact for client inquiries and requests, delivering timely and professional responses.\n\tBuild and maintain strong, long-lasting client relationships.\n\tEnsure seamless communication between clients and internal teams to deliver on service expectations.\n\tTrack client accounts and monitor service delivery to ensure agreed standards are met.\n\tHandle client complaints or issues effectively, escalating where necessary to achieve resolution.\n\tPrepare and deliver regular reports, updates, and presentations to clients as required.\n\tSupport client onboarding processes, ensuring all requirements are properly documented and completed.\n\tIdentify opportunities to upsell or cross-sell services to existing clients.\n\n\nJob Requirements\n\n\n\tBachelor’s degree in Business Administration, Marketing, Communications, or a related field.\n\t2–3 years of experience in client service, account management, or customer-facing roles.\n\tExcellent verbal and written communication skills.\n\tStrong interpersonal and relationship-building abilities.\n\tAbility to manage multiple client accounts and tasks simultaneously.\n\tProficiency in MS Office (Word, Excel, PowerPoint) and familiarity with CRM tools.\n\tProblem-solving mindset with strong attention to detail.\n\tA proactive, self-motivated, and customer-centric approach.\n\n\nApplication Closing Date: 29th September, 2025.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: susan.o@fadacresources.com using the Job Position as the subject of the email.\n\n     \n\n    \n\n        Click here to Apply",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]