[
  {
    "title": "Job Openings at Mantrac",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-mantrac",
    "pubDate": "Tue, 09 Sep 2025 20:37:52 GMT",
    "source": "JobGurus",
    "keyword": "mantrac",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Mantrac is the sole distributor for Caterpillar products in Nigeria, distributing and supporting machinery, power systems and material-handling equipment. The company provides customers with comprehensive solutions, backed by technical know-how, experience and in-depth knowledge of their local markets.\n\nWe are recruiting to fill the following positions below:\n\n1.) Senior Electrical Engineer\n\nJob Location: Port Harcourt, Rivers\nJob Type: Full time\n\nSummary of Responsibilities\n     \n\n            \n    \n\n\n\n\n\tTo effectively and efficiently carry out troubleshooting and field repairs, maintenance and servicing of electrical equipment installations, generator sets, machine systems and other specialized units.\n\tAct as mentor for the trainee Service Engineers and the Apprentices as well as newly recruited engineer as may be assigned from time to time.\n\n\nMain Function\n\n\n\tInspect, troubleshoot and trace faults on electrical modules and components of Caterpillar engines (Gas & Diesel), generator sets, machine systems and specialized units (e.g altronic magnetos etc) reported for repair, maintenance and servicing actions in the field.\n\tConduct inspection, load testing, PDS and commissioning of new Caterpillar equipment and ensure completion of DSR Forms before delivery is effected to Customers.\n\tEstablish and enlist parts required for assigned jobs and follow up for prompt order and delivery.\n\tImplement all assigned electrical jobs (including electrolyte preparation and batter charging jobs) promptly, successfully and in accordance with Caterpillar standards without any redo actions.\n\tUse appropriate diagnostic tools to evaluate accurate performance of repaired components, units and systems.\n\tTake proper care of all company’s assets (tools, test equipment, vehicle etc) entrusted to his care.\n\tPerform or coordinate certain essential field service works, contract servicing, PIP and SOS functions as may be required or assigned from time to time.\n\tReport any difficult task to appropriate authorities for adequate attention and thus assist management in taking accurate repair decisions as the need arise.\n\tPrepare necessary documents and service reports (e.g. Delivery slips, SIMS etc) both to customers and for management action as required.\n\n\nContacts:\n\n\n\tAll levels of management within the Company.\n\tCustomer representatives.\n\n\nRequirements\n\n\n\tHND / First Degree in Engineering related field with 2 years of field experience.\n\tGood working knowledge of Caterpillar Electrics, sound and safe driving skills with valid professional driving license are added advantages.\n\n\nEnvironment:\n\n\n\tFinancial Impact:\n\tSee annual work plan.\n\tHazards:\n\tSlippery floor, noisy environment and lifting of heavy objects.\n\tRoad and water travels and community embarrassments.\n\n\nMethod of Application\nInterested and qualified candidates should forward their CV to: recruitment@mantracnigeria.com using the Job Position as the subject of the email.\n\n \n\n \n\n2.) Product Support Sales Representative\n\nJob Location: Lagos\nJob Type: Full time\n\nSummary of Responsibilities\n\n\n\tEnsure achievement of agreed sales targets and performance objectives, thus ensuring the achievement of parts sales profit objective in the Construction Segment.\n\n\nMain Function\n\n\n\tVisiting customers in the Region (old and new), prospecting for parts, unit sales and service opportunities and as well seek for regular patronage.\n\tEnsure prompt delivery of parts or services (including back-ordered items) and corresponding invoices to engender customer satisfaction and early payment as they fall due.\n\tPreparation and implementation of weekly call plan and corresponding summary report.\n\tPreparation and updating customers’ profile list.\n\tPromptly and effectively resolve customer complaints such as to retain their goodwill and confidence in the product, services and the dealership at large.\n\tActively involved in the Region’s debt collection drive on an on-going basis.\n\tEstablish and report on competitive activities and sales opportunities (for parts, units & service). Implement actions that will ensure prompt and adequate conversion to Caterpillar products & services.\n\tImplement relevant marketing and promotional programmes as they arise.\n\tEnsure prudent financial management and adequate maintenance / security of Company assets placed in the incumbent’s care by virtue of function and/or location.\n\tSeek out new business opportunities in the Region and Construction industry by monitoring on-going contracts and maximizing parts sales opportunities.\n\tLiaise between MNL, Unatrac and Customers on parts sales issues and special pricing on selected commodity items.\n\n\nQualification\n\n\n\tHND/B.Sc. Engineering with 2 years of working experience in Technical Sections of MNL or similar company.\n\tB.Sc./ HND in Engineering or equivalent.\n\tInterpersonal and communication skills with leadership skills and ability to take the initiative.\n\tHave good selling skills.\n\n\nMethod of Application \nInterested and qualified candidates should forward their  CV to: recruitment@mantracnigeria.com using the Job Position and location as the subject of the mail.\n\n \n\n \n\n3.) Inside Sales Representative\n\nJob Location: Lagos\n\nSummary of Responsibilities\n\n\n\tResponsible for effective execution of territory sales plan, championing customer success and meeting the sales target through the sales of Mantrac products and services within their assigned product portfolio and customer territory.\n\tLiaise with prospects and customers via the telephone, and manage sales territories with between 800 and 1,200 customers.\n\tResponsible for delivering sales revenue targets as directed by ISR Manager.\n\n\nMain Function\n\n\n\tDeliver assigned revenue target according to the territory sales plan and compliance with Mantrac Sales Processes (MSP).\n\tIdentify key commercial opportunities through on-going communication with customers in the assigned territory to deliver revenue target.\n\tBuild long-term relationship with customers by ensuring regular customer contact is maintained to ensure maximisation of all revenue generating opportunities, typically minimum 2 contacts per customer per year.\n\tActively prospect potential new and lapsed customers not known by Mantrac.\n\tEngage with customers’ business priorities to gain agreement to consider Mantrac.\n\tDevelop a clear understanding of customers’ business challenges and needs; build relationship with customers, diarise and follow up on all leads.\n\tIdentify and differentiate the best Mantrac solution to win the deal.\n\tAddress customers’ anxieties and lead the deal to completion.\n\tProduce a reliable monthly sales forecast based upon opportunity pipeline and customers’ decision stage using Sales Force or the Company Sales Management Tool as prescribed by Manager.\n\tMaintain and adhere to Mantrac Sales Processes minimum requirements, such as coverage performance, pipeline and forecast accuracy, data quality.\n\n\nRequirements\n\n\n\tGraduate in Engineering related discipline or its equivalent, Strong telephone communication skills, 2 or 3 years of Telesales Experience, Database Management and Marketing.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: recruitment@mantracnigeria.com using the Job Position and Location as the subject of the email.    \n\n    \n\n        Click here to Apply",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Vacancies at Dana Motors Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancies-at-dana-motors-limited",
    "pubDate": "Tue, 09 Sep 2025 20:37:52 GMT",
    "source": "JobGurus",
    "keyword": "dana motors limited",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Marketing"
    ],
    "content": "Dana is a conglomerate with diversified busines interest in different sectors of the economy.\n\nWe are recruiting to fill the following positions below:\n\n1.) Driver\n\nJob Location: Oshodi - Isolo, Lagos\nEmployment Type: Full-time\n\nJob Description:\n     \n\n            \n    \n\n\n\n\n\tMaintain awareness of current road systems and conditions by monitoring news and traffic reports, adjusting routes as necessary to avoid delays.\n\tEnsure that vehicles are kept perfect and clean at all times by washing both the inside and outside parts of the vehicle.\n\tGood understanding of road networks\n\tCarry out checks on vehicles and ensure they are in good condition\n\tArrange for vehicle care and maintenance (i.e. oil change, tire rotation, cleaning, etc.).\n\tRecognize electrical and mechanical faults and report to the supervisor.\n\n\nRequirements.\n\n\n\tMust have a minimum of SSCE\n\tAt least 2 years of work experience.\n\tMust have a valid Driver’s License\n\tPreferred or interested candidates must reside within Victoria Island and its environs.\n\n\nSalary\nN90,000 - N100,000 per month. \n\nMethod of Application\nInterested and qualified candidates should send their CV to: jobs@kiamotorsnigeria.com using the Job Position as the subject of the email.\n\nNote: No accommodation please.\n\n \n\n2.) Logistics Officer\n\nJob Location: Oshodi - Isolo, Lagos\nEmployment Type: Full-time\n\nJob Description\n\n\n\tCollaborate with Logistic team to ensure all procurement activities align with company requirements and financial policies.\n\tMaintain accurate records of vehicle duty certificates.\n\tEnsure timely submission of all narrative and financial reports.\n\tTake stock of vehicles and manage vehicle key inventory.\n\tInput vehicle information into warranty systems.\n\tFile and manage vehicle documentation, including vehicle transfers.\n\tMaintain organized and up-to-date stock reports.\n\tCarry out any other duty that may be assigned from time to time.\n\n\nRequirements\n\n\n\tHND / B.Sc in supply Chain Management, Business Administration, or related field.\n\tMinimum of 1 year of experience in logistics coordination.\n\tProficiency in Microsoft Office Suite (especially Excel).\n\n\nSalary\nN100,000 - N120,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: jobs@kiamotorsnigeria.com using the Job Position as the subject of the email.\n\n \n\n \n\n3.) Customer Care Executive\n\nJob Location: Oshodi, Isolo - Lagos\nEmployment Type: Full-time\n\nResponsibilities\n\n\n\tContact customers ahead of scheduled maintenance or service appointments to remind them and confirm attendance.\n\tReach out to customers after service completion to assess satisfaction levels and gather feedback on the quality of work.\n\tReceive, document, and resolve customer complaints and queries, ensuring issues are escalated to the appropriate department when necessary.\n\tCollaborate with workshops, spare parts, and service teams to address customer concerns and ensure timely resolutions.\n\tKia on Road (KOR) Assistance – Provide remote support to stranded customers and coordinate with the workshop technical team to deliver on-site rescue services when required.\n\tArrange alternative vehicles for customers whose cars are undergoing extended repairs, ensuring proper documentation and follow-up.\n\tDraft and send professional emails, bulk SMS, and promotional messages to keep customers informed of services, offers, and campaigns.\n\tIssue invoices to customers promptly and accurately, and ensure they are properly tracked.\n\tRespond to service-related emails, inquiries, and requests from customers in a timely and professional manner. Liaise with the accounts department to raise, track, and resolve customer refund requests.\n\tSupport service marketers in visiting corporate clients, conducting feedback sessions, and gathering insights to improve services and product offerings.\n\tPrepare and submit detailed reports on corporate client visits, capturing key concerns and recommendations for improvement.\n\tContact customers to inform them of new campaigns, promotions, and special offers, and encourage participation. Compile and submit daily call reports summarising the number of customers reached, concerns raised, and feedback collected.\n\n\nRequirements\n\n\n\tB.Sc / HND in Business Administration, Marketing, Communication, or a related field.\n\t1-3 years of experience in customer service, preferrably in the Automotive or service industry.\n\tExcellent communication, negotiation and interpersonal skills.\n\n\nSalary\nN110,000 - N130,000 Monthly.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: jobs@kiamotorsnigeria.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]