[
  {
    "title": "Hotel Manager Job at Residency Hotel Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/hotel-manager-job-at-residency-hotel-limited-1",
    "pubDate": "Wed, 25 Jun 2025 11:38:31 GMT",
    "source": "JobGurus",
    "keyword": "residency hotel limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Residency Hotel Limited is one of the leading hospitality industries in Nigeria with over 10 branches across the nation and more than 30 years in the industry.\n\nWe are recruiting to fill the position below:\n\nJob Position: Hotel Manager\nJob Location: Abuja (FCT)\nEmployment Type: Full-time\n\nDescription\n\n\n\tResidency Hotels Limited, a nation-wide hotel chain, is looking for talented individuals with customer service, sales & marketing background in hospitality industry to work in management position in our Abuja hotels.\n\n\nRequirements\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tSelected candidates must have a minimum of HND.\n\tMinimum of 3 years’ previous experience as a hotel Manager.\n\tSelected candidates must have a maximum of 10 years’ experience in the hotel industry.\n\tSelected candidates will be responsible for overall revenue generation in accommodation, foods, and beverages.\n\tSelected candidates will take full responsibility for operations of the hotel, including ensuring zero revenue leakages and theft.\n\tSelected candidates will agree to meet and exceed quarterly target.\n\tSelected candidates will be provided with a manager living quarter inside the hotel premises.\n\n\nSalary\nN250,000 / Month.\n\nMethod of Application\nInterested and qualified candidates should send their CV to: jobs@myresidencyhotel.com using \"Hotel Manager\" as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Marketing Officer Job at HTSF Global Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/marketing-officer-job-at-htsf-global-limited",
    "pubDate": "Wed, 25 Jun 2025 11:38:31 GMT",
    "source": "JobGurus",
    "keyword": "htsf global limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "HTSF Global Limited is a leading company dedicated to revolutionizing the agricultural and grocery shopping experience through our innovative e-commerce marketplace.HTSF Global was founded with a clear vision: to transform the Agriculture sector by delivering excellence in goods and services through technology. Our story began with Ayodeji Enitan's firsthand experience of the challenges in Agriculture, igniting a passion for creating meaningful change.\n\nWe are recruiting to fill the position below:\n\nJob Position: Marketing Officer\n\nJob Location: Ikorodu, Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a proactive Marketing Officer to support the growth of our new Egg Depot in Ikorodu, Lagos.\n\tThe successful candidate will be responsible for developing and executing marketing strategies to attract and retain customers, promote our egg products extensively, and increase brand visibility within the local market.\n\tYou will play a key role in on-ground marketing activities, community outreach, and customer engagement. The ideal candidate must reside in Ikorodu, and be familiar with the local market dynamics.\n\n\nKey Responsibilities\n\n\n\tDevelop and implement local marketing strategies to promote egg sales.\n\tIdentify and engage potential B2B and B2C customers (retailers, supermarkets, restaurants, and households).\n\tConduct on-ground marketing campaigns (flyers, roadshows, local events, etc.)\n\tMonitor and report on market trends, customer feedback, and competitor activity.\n\tBuild partnerships with local businesses to drive depot traffic.\n\tCollaborate with the sales team to align marketing and sales goals.\n\tTrack performance metrics and analyze campaign effectiveness.\n\n\nRequirements\n\n\n\tEducation: OND / HND / B.Sc in Marketing, Business Administration, or related fields.\n\tExperience: Proven experience in marketing, preferably in agro-based products.\n\tMust reside in Ikorodu.\n\tStrong communication, persuasion, and sales skills.\n\tSelf-motivated, target-driven, and able to work under minimal supervision.\n\n\nBenefits\n\n\n\tCompetitive Salary Package\n\tOpportunity for career growth and professional development.\n\tA Dynamic and supportive work environment.\n\n\nMethod of Application\nInterested and qualified candidates should send their CVs and a Cover letter detailing why they are suitable for this role to: htsfarmshumanresources@gmail.com using “Marketing Officer” as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Tax Compliance Manager Job at PZ Cussons",
    "link": "https://www.jobgurus.com.ng/jobs/view/tax-compliance-manager-job-at-pz-cussons",
    "pubDate": "Wed, 25 Jun 2025 11:38:31 GMT",
    "source": "JobGurus",
    "keyword": "pz cussons",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "PZ Cussons is a dynamic consumer products group and innovator of some of the world's best known and loved brands. Calling on over 130 years of expertise, we operate internationally in carefully selected developed and emerging markets that present the greatest strategic potential for future growth. Our world-class supply chain and distribution networks enable us to meet our global consumer needs and deliver quality brands that add value and enhance everyday lives.\n\nWe are recruiting to fill the position below:\n\nJob Position: Tax Compliance Manager\nJob ID: JR002184\nJob Location: Head Office, Nigeria\nJob type: Full-time\n\nJob Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tPreparing & reviewing Withholding tax returns(Federal and All States) as per statutory requirement for PZW/Wilmar entities in Nigeria by spooling monthly reports, verifying applicable rates, separating into applicable tax jurisdictions, reconciling WHT report against ledger balances and processing payments without any delays.\n\tPreparing & reviewing VAT returns as per statutory requirement for PZW/Wilmar entities in Nigeria by spooling monthly reports, verifying applicable rates, reconciling VAT report against ledger balances and processing payments without any delays.\n\tPreparing & reviewing monthly Corporate Tax computation by spooling monthly reports, verifying applicable rates.\n\tPreparing & reviewing PAYE returns (Federal and All States) as per statutory requirement for PZW/Wilmar entities in Nigeria by spooling monthly reports, verifying applicable rates, separating into applicable tax jurisdictions, reconciling WHT report against ledger balances and processing payments without any delays.\n\tProcess payments for all monthly taxes, final demand notice liabilities and every other undisputed tax liability\n\tPrepare initial draft responses to demand notices, queries and other correspondence from the FIRS and state boards.\n\tApply for and Obtain Tax clearance certificates for all entities every year\n\tReceive and record all correspondence from tax authorities\n\tMaintain correspondence tracker to ensure responses are filed within the stipulated timeline.\n\tHT credit note verification on B2B Customer purchases.\n\n\nQualifications & Experience\n\n\n\tA Bachelor's Degree in Accounting, Finance, or a related field, with a minimum of a Second Class Upper division including in a multinational corporate environment, with exposure to following areas:\n\t\n\t\tPreparation of various statutory returns – Corporate Tax, WHT,VAT,PAYE etc.\n\t\tHandling various audit (FIRS/state tax authorities / Internal / external audit etc.)\n\t\n\t\n\t3 - 4 years of relevant experience\n\t\n\t\n\t\n\tProfessional Qualified ACA/ ACCA or /and member of The Chartered Institute of Taxation of Nigeria\n\tCandidates with working experience in Audit / Assurance function with Big Assurance function are preferred.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Engineering Manager, MAAS Job at Canonical Nigeria",
    "link": "https://www.jobgurus.com.ng/jobs/view/engineering-manager-maas-job-at-canonical-nigeria",
    "pubDate": "Wed, 25 Jun 2025 11:38:31 GMT",
    "source": "JobGurus",
    "keyword": "canonical nigeria",
    "duplicate": false,
    "classifications": [
      "Software Engineering"
    ],
    "content": "(adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\nCanonical - We deliver open source to the world faster, more securely, and more cost-effectively than any other company. We develop Ubuntu, the world’s most popular enterprise Linux from cloud to edge, together with a passionate global community of 200,000 contributors. Ubuntu means 'humanity to others. We chose it because it embodies the generosity at the heart of open source, the new normal for platforms and innovation. Together with a community of 200,000, we publish an operating system that runs from the tiny connected devices up to the world's biggest mainframes, the platform that everybody uses on the public cloud, and the workstation experience of the world's most productive developers. Secure and reliable, elegant and intuitive, and open for innovation - Ubuntu is the future of open source, which is why it's the fastest-growing Linux in the world despite already being the most widely deployed.\n\nWe are recruiting to fill the position below:\n\nJob Position: Engineering Manager, MAAS\nJob Location: Lagos\nEmployment Type: Full-time\n\nThe role entails\n\n\n\tLeading a distributed team of engineers in your time zone (we organise engineering teams by Americas, EMEA etc)\n\tBeing an advocate of, and advancing, modern software development practices\n\tParticipating in the engineering process through code and architectural review\n\tTalent development through coaching, mentoring, feedback and career planning\n\tSetting and managing expectations with other engineering teams, senior management, and external stakeholders\n\tEngaging with broader teams at Canonical, the open source community and partners\n\tTravelling to internal and external global events for 4 to 6 weeks per year \n\n\nWhat we are looking for in you\n\n\n\tExceptional academic track record from both high school and university\n\tUndergraduate degree in a technical subject\n\tConfidence to respectfully speak up, exchange feedback, and share ideas without hesitation\n\tTrack record of going above-and-beyond expectations to achieve outstanding results\n\tLeadership and commitment to skills development and mentorship\n\tPassion for technology evidenced by personal projects and initiatives\n\tThe work ethic and confidence to shine alongside motivated colleagues\n\tProfessional written and spoken English with excellent presentation skills\n\tExperience with Linux (Debian or Ubuntu preferred) \n\tExcellent interpersonal skills, curiosity, flexibility, and accountability\n\tAbility to travel internationally twice a year for company events up to two weeks long\n\tYou understand modern Linux cloud computing technologies, including networking, storage, containers and K8s\n\tAppreciative of diversity, polite, and effective in a multi-cultural, multi-national organization\n\tThoughtfulness and self-motivation\n\tResult-oriented, with a personal drive to meet commitments\n\tYou have experience programming in Python and Go\n\tYou love developing and growing people and have a strong track record of doing it\n\n\nNice-to-have skills:\n\n\n\tTypescript using modern web frameworks such as React, Angular, Svelte or Vue.\n\n\nWhat we offer you\n\n\n\tWe consider geographical location, experience, and performance in shaping compensation worldwide.\n\tWe revisit compensation annually (and more often for graduates and associates) to ensure we recognise outstanding performance.\n\tIn addition to base pay, we offer a performance-driven annual bonus or commission.\n\tWe provide all team members with additional benefits, which reflect our values and ideals.\n\tWe balance our programs to meet local needs and ensure fairness globally.\n\tDistributed work environment with twice-yearly team sprints in person\n\tPersonal learning and development budget of USD 2,000 per year\n\tAnnual compensation review\n\tRecognition rewards\n\tAnnual holiday leave\n\tMaternity and paternity leave\n\tEmployee Assistance Program\n\tOpportunity to travel to new locations to meet colleagues\n\tPriority Pass, and travel upgrades for long haul company    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Civil Engineer Job at Ekiti Agro-Allied International Cargo Airport",
    "link": "https://www.jobgurus.com.ng/jobs/view/civil-engineer-job-at-ekiti-agro-allied-international-cargo-airport",
    "pubDate": "Wed, 25 Jun 2025 11:38:31 GMT",
    "source": "JobGurus",
    "keyword": "ekiti agro-allied international cargo airport",
    "duplicate": false,
    "classifications": [],
    "content": "The Ekiti Agro-Allied International Cargo Airport is a new airport in Ekiti State, Nigeria, designed for both cargo and passenger flights. It received approval for non-scheduled flight operations in December 2024, with the aim of boosting the state's economy and facilitating the export of agricultural products.\n\nWe are recruiting to fill the position below:\n\nJob Position: Civil Engineer\n\nJob Location: Ekiti\n\nKey Responsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDeveloping plans and specifications for airport infrastructure projects, including runways, taxiways, aprons, roads, drainage systems, and related facilities.\n\tEnsuring projects comply with relevant regulations, including those from the NCAA (Nigeria Civil Aviation Authority) and other relevant agencies.\n\tOverseeing the maintenance and repair of existing airport infrastructure, ensuring its continued functionality and safety.\n\n\nQualification/Job Specifications\n\n\n\tMinimum of 2 years of post-qualifications HND / B.Eng. Civil Engineering\n\n\nSkills and Competence:\n\n\n\tProficiency in relevant software, such as AutoCAD, Civil 3D, or similar tools. Ability to work independently and as part of a team.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and a certificate of Local Government of Origin to: jobs.airport@ekitistate.gov.ng using the Job Position as the subject of the mail.\n\nNote\n\n\n\tOnly qualified candidates should apply.\n\tOnly shortlisted candidates will be contacted.\n    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]