[
  {
    "title": "Job vacancies at Cecure Intelligence Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-vacancies-at-cecure-intelligence-limited",
    "pubDate": "Thu, 08 Jan 2026 10:20:12 GMT",
    "source": "JobGurus",
    "keyword": "cecure intelligence limited",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance"
    ],
    "content": "Cecure Intelligence Limited - Building digital products with modern technologies excites us. We take an idea through our curated delivery process to create tangible outcomes for our customers quickly. This enables you to truly validate your idea and derive immediate benefit.\n\nWe are recruiting to fill the following positions below:\n\n1.) Partnerships Manager\n\nJob Location: Lagos\nJob Type:Full-time\n\nRole Overview\n     \n\n            \n    \n\n\n\n\n\tWe are seeking a Partnership Manager to lead and grow strategic OEM and ISV relationships.\n\tThis role is central to expanding our partner portfolio, driving tier and specialty growth, and executing joint Go-to-Market (GTM) initiatives that generate measurable, partnership-led revenue.\n\tYou will ensure our partnerships remain aligned with business strategy, compliant with standards, and responsive to market needs.\n\n\nKey Responsibilities\n\n\n\tLead the full partner lifecycle, from onboarding to retention and tier growth\n\tManage quarterly partner business reviews and track performance against targets\n\tDrive partner certifications, tier upgrades, and specialty achievements\n\tOwn joint GTM planning, including MDF utilization and co-branded campaigns\n\tCollaborate with Sales to grow partner-led pipeline and revenue\n\tManage partner incentives, rebates, and funding utilization\n\tEnsure ISO-compliant partner processes in collaboration with Compliance\n\tMaintain strong OEM/ISV relationships through structured monthly and quarterly reviews\n\tDeliver accurate reporting on partnership performance and program compliance\n\n\nRequirements\nEducation:\n\n\n\tBachelor’s Degree in Business Administration, Marketing, or a related field\n\tMaster’s degree or relevant professional certifications are an advantage.\n\n\nSkills and Experience Required:\n\n\n\t2–4 years of experience managing OEM and/or ISV partnerships\n\tStrong relationship-building skills across executive and operational levels\n\tSolid understanding of sales processes, GTM execution, and partner financials\n\tProven success driving revenue through joint GTM initiatives\n\tExperience with partner lifecycle management and tier growth strategies\n\tExcellent communication and presentation skills\n\tStrong reporting and dashboard management capabilities\n\tExperience working within structured compliance or ISO-aligned environments\n\n\nMethod of Application \nInterested and qualified candidates should send their CV to: jobs@cecureintel.com using the Job Position as the subject of the mail.\n\n \n\n \n\n2.) Account Manager\n\nJob Location: Lagos\nJob Type:Full-time\n\nRole Overview\n\n\n\tWe are seeking an Account Manager to drive business growth by generating new opportunities, expanding existing accounts, and maintaining a healthy pipeline through proactive engagement.\n\tYou will manage the full sales cycle, build strong customer relationships, and contribute to both individual and team revenue targets.\n\n\nKey Responsibilities\n\n\n\tGenerate new business opportunities and meet new logo targets\n\tExpand existing customer accounts with a focus on wallet share and cross-selling\n\tManage the full sales cycle: discovery, proposal, negotiation, and closure\n\tConduct consistent outbound prospecting and sales activities\n\tMaintain accurate CRM records and generate Sales Qualified Leads (SQLs)\n\tBuild and nurture strong customer relationships through structured Quarterly Business Reviews (QBRs)\n\tCollaborate with Presales, Delivery, Finance, and Marketing teams to support deal execution\n\tSupport contract negotiation, documentation, and compliance processes\n\tAchieve individual revenue targets and contribute to team goals\n\n\nRequirements\nEducation:\n\n\n\tBachelor’s Degree in Business Administration, Marketing, or a related field\n\tA master’s degree or relevant professional certifications are an advantage\n\n\nSkills and Experience Required:\n\n\n\tMinimum 5 years of experience as an Account Manager or Sales Executive in technology/OEM/ISV sales\n\tProven track record in meeting/exceeding revenue and new logo acquisition targets\n\tStrong experience managing large, complex sales pipelines with high CRM data integrity\n\tExpertise in strategic account expansion and B2B sales cycle management\n\tExcellent communication, negotiation, and proposal development skills\n\tProven ability to build long-term, high-value customer relationships\n\tProficiency in CRM software and pipeline management\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: jobs@cecureintel.com using the Job Position as the subject of the mail.\n\n \n\n \n\n3.) Learning and Development Associate\n\nJob Location: Lagos\nJob Type:Full-time\n\nRole Overview\n\n\n\tWe are seeking a Learning and Development Associate to support the day-to-day execution and delivery of training programs within the CIL Academy.\n\tThis role is focused on tactical execution and operational excellence, ensuring training programs run smoothly, learners remain engaged, and program performance is accurately tracked and reported.\n\tYou will play a key role in coordinating training logistics, supporting learners, maintaining learning systems, and providing reliable insights through operational reporting.\n\n\nKey Responsibilities\n\n\n\tCoordinate all logistical aspects of online and in-person training programs\n\tManage the end-to-end learner lifecycle, including enrollment, assessments, and onboarding\n\tTrack learner progress, attendance, and participation, escalating issues that require intervention\n\tProvide first-level technical support to learners using the Learning Management System (LMS) and training environments\n\tMaintain operational dashboards and prepare routine progress and performance reports\n\tSupport the distribution and minor updates of learning materials as required\n\n\nRequirements\n\n\n\tBachelor’s Degree (or equivalent) in Human Resources, Education, or a technology-related field\n\tAdvanced degrees or relevant certifications are an added advantage\n\tCertification or training in instructional design, facilitation, coaching, training, or leadership development is a plus.\n\n\nSkills and Experience Required\n\n\n\t1–3 years of experience in a learning, training, or similar coordination role\n\tStrong organizational, coordination, and attention-to-detail skills\n\tProcess-driven mindset with the ability to manage multiple tasks simultaneously\n\tExcellent written and verbal communication skills for engaging learners, instructors, and internal stakeholders\n\tAbility to quickly learn and support digital learning platforms (LMS and virtual environments)\n\tProficiency in data tracking, dashboards, and basic reporting tools (e.g., spreadsheets or LMS reporting features)\n\tStrong customer service orientation and commitment to delivering a positive learner experience\n\tAbility to work effectively in a team-oriented, fast-paced environment.\n\n\nMethod of Application \nInterested and qualified candidates should send their CV to: jobs@cecureintel.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Openings at Olam Agri",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-olam-agri-2",
    "pubDate": "Thu, 08 Jan 2026 10:20:12 GMT",
    "source": "JobGurus",
    "keyword": "olam agri",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Olam Agri is a market-leading, differentiated food, feed, and fiber agri-business with a global origination footprint, processing capabilities, and deep understanding of market needs built over 33 years. With a strong presence in high-growth emerging markets and products across grains & oilseeds, animal feed & protein, rice, edible oils, specialty grains & seeds, cotton, wood products, rubber and commodity financial services.\n\nOlam Agri is at the heart of global food and agri-trade flows with more than 40 million MT in volume traded annually. Focused on transforming food, feed and fiber for a more sustainable future, it aims at creating value for customers, enabling farming communities to prosper sustainably, and strive for a food-secure future.\n     \n\n            \n    \n\n\n\nWe are recruiting to fill the following positions below:\n\n1.) Packing Manager\n\nJob Location: Lagos\n\nJob Description\n\n\n\tThe Packing Manager is responsible for overseeing and optimizing all packing operations within Olamagri’s facility in Lagos.\n\tThis role ensures that goods are efficiently and effectively packed according to specifications, quality standards, and timelines for storage and shipment.\n\tThe Packing Manager will manage a team of packing staff, implement and maintain efficient packing processes, ensure the proper use of packing materials, and collaborate with other departments such as Production, Warehouse, and Logistics.\n\tThe ideal candidate will have strong organizational and leadership skills, a focus on efficiency and quality, and a commitment to safety and Olam's core values of being Collaborative, Agile, Resourceful, Entrepreneurial, and Sustainable.\n\n\nKey Deliverables\n\n\n\tPacking Operations Management: Plan, organize, and supervise all packing activities to ensure efficient and timely completion of packing schedules.\n\tTeam Leadership & Supervision: Lead, train, and manage the packing team, including assigning tasks, monitoring performance, providing feedback, and ensuring adherence to standard operating procedures (SOPs).\n\tPacking Standards & Quality Control: Establish and enforce packing standards and quality control procedures to ensure products are packed correctly, securely, and according to specifications, minimizing damage during transit and storage.\n\tPacking Material Management: Monitor and manage the usage of packing materials, ensuring appropriate materials are used, minimizing waste, and coordinating with the Procurement team for timely and adequate supply.\n\tEfficiency & Process Improvement: Continuously evaluate and optimize packing processes to improve efficiency, reduce bottlenecks, and increase throughput. Implement best practices in packing methodologies.\n\tEquipment Maintenance & Safety: Ensure that all packing equipment is in good working order, schedule regular maintenance, and enforce safety regulations within the packing area to prevent accidents and injuries.\n\n\nStrategic Effectiveness:\n\n\n\tCoordination with Other Departments: Collaborate closely with Production to understand output schedules, with the Warehouse team for storage requirements, and with Logistics for shipment preparation.\n\tProblem Solving: Address and resolve any issues or delays that arise during the packing process in a timely and effective manner.\n\tPerformance Monitoring & Reporting: Track key performance indicators (KPIs) related to packing operations (e.g., packing efficiency, error rates, material usage) and provide regular reports to management.\n\tSustainability in Packing: Implement practices to minimize packing material waste, explore more sustainable packing options where feasible, and promote responsible disposal of packing waste.\n\n\nOperational Effectiveness:\n\n\n\tEfficient and Timely Packing Operations: Consistent completion of packing schedules according to production and shipment requirements.\n\tHigh-Quality Packing Standards: Ensuring goods are packed correctly and securely, minimizing damage and returns.\n\tEffective Team Performance: A well-trained, motivated, and productive packing team.\n\tOptimized Packing Processes: Continuous improvement in packing efficiency and throughput.\n\tMinimized Packing Material Waste: Efficient use of packing materials and implementation of waste reduction initiatives.\n\tSafe Working Environment: Ensuring adherence to safety regulations and minimizing workplace accidents in the packing area.\n\tAccurate Packing Records: Maintenance of accurate records of packed goods and packing material usage.\n\tSmooth Coordination with Other Departments: Effective communication and collaboration with Production, Warehouse, and Logistics teams.\n\tAdherence to Packing Budgets: Operating within allocated budget for packing materials and operations.\n\tContribution to Operational Efficiency: Positive impact on the overall efficiency of the supply chain.\n\n\nRequirements\n\n\n\tEducation: Bachelor’s degree in mechanical engineering, relevant professional certifications in packaging would be an advantage.\n\tExperience: Minimum of 5 years of progressive experience in packing development and management, preferably within the food, agricultural, or FMCG sectors.\n\tExperience working with a variety of packaging materials and technologies is essential.\n\n\nTechnical Skills:\n\n\n\tGood understanding of packing methods and techniques for various types of goods.\n\tFamiliarity with different packing materials (e.g., cartons, wrapping materials, strapping).\n\tUnderstanding of safety procedures in a packing environment.\n\tLanguage Skills: Fluency in English is essential. Proficiency in other relevant local languages would be an advantage.\n\n\nClick here to apply online\n\n \n\n \n\n2.) Treasury Analyst\n\nJob Location: Nigeria\n\nJob Description\n\n\n\tThe Treasury (TSF) Manager will manage cash flow, trade finance instruments, FX transactions, and banking operations in compliance with Nigerian regulatory frameworks.\n\tThis role ensures liquidity for procurement, production, and export activities while optimizing costs and mitigating financial risks.\n\tThe candidate must be conversant with CBN FX policies, Form M/PAAR processes, export proceeds repatriation timelines, and Nigerian banking practices.\n\n\nKey Deliverables\n\n\n\tCash & Liquidity Management: Prepare daily cash positions and weekly rolling cashflow forecasts; monitor variances and recommend corrective actions. Manage working capital across procurement, production, and distribution cycles. Ensure timely funding for import and local procurement transactions.\n\tTrade & Structured Finance (TSF): Process Form M applications and ensure compliance with CBN guidelines for imports. Coordinate PAAR issuance and liaise with banks/customs for documentation. Manage Letters of Credit (LCs), Bills for Collection, Bank Guarantees, and SBLCs for import/export transactions. Track TSF facility utilization and ensure adherence to bank limits and conditions.\n\tFX & Risk Management: Monitor FX exposures and execute transactions through CBN FX windows (e.g., I&E window, official window) in line with company policy. Liaise with banks for FX bids and ensure compliance with CBN FX allocation rules. Track export proceeds and ensure repatriation within CBN timelines (currently 90 days); maintain documentation for regulatory audits. Support hedging strategies where applicable.\n\n\nStrategic Effectiveness\n\n\n\tBanking Relationships & Operations: Maintain strong relationships with Nigerian commercial banks and development finance institutions. Handle account openings, KYC updates, and e-channel setups (e.g., Remita, NIBSS Instant Payment). Negotiate bank charges and FX spreads; benchmark against market rates. Ensure compliance with bank covenants and maintain updated covenant trackers.\n\tTreasury Systems & Controls: Operate ERP and reconcile treasury transactions with GL. Maintain robust internal controls over payments and TSF documentation. Prepare monthly treasury reports: cashflow, FX exposure, facility utilization, and compliance dashboards.\n\tRegulatory Compliance: Ensure adherence to CBN FX regulations, BOFIA, and trade documentation requirements. Maintain accurate records for Form M, PAAR, LC documentation, and export proceeds for internal and external audits. Support compliance with Nigerian tax and customs regulations related to trade finance.\n\n\nRequirements\n\n\n\tBachelor’s degree in Finance, Accounting, Economics, or related field; ACA/ACCA or CTP certification is an advantage.\n\t2–4 years of experience in treasury, trade finance, or banking operations within Nigeria.\n\tStrong knowledge of CBN FX policies, Form M/PAAR processes, and Nigerian banking ecosystem.\n\tProficiency in ERP systems and Intermediate Excel.\n\n\nClick here to apply online\n\n \n\n \n\n3.) Plant Manager\n\nJob Location: Ilorin, Kwara\n\nJob Description\n\n\n\tThe role encompasses in managing day to day activity of the plant in the country handling all function from production, processing, quality, Engineering & Projects and QEHS. Specific Knowledge: Knowledge of Food Safety Management systems / HACCP/FSSC / BRC / ISO 14000 and management of Industrial relations is required for the role.\n\n\nStrategic Effectiveness\n\n\n\tProduce and Deliver products - Manage production activities and services.\n\tReview shop floor operations daily for adherence to Quality systems & norms. Lead and support in process/system related issues. Support Preventive Maintenance schedule for Plant & Machinery and related Engineering activities.\n\tProduce & deliver products – Optimize production costs - Consolidate variances, analyze and find our root causes and plan for actions accordingly. Manage line OEEs, wastages and conversion costs through effective monitoring, review & control.\n\tQEHS - Lead the QEHS initiatives and work with the Central Quality Head in delivering the goals. To commission sustainable systems to hold the gains.\n\tEngineering & Projects - To implement best practices in Plant maintenance, thereby improving the OEE. Manage Maintenance & repairs cost within the budgeted levels. Ensure delivery of Projects within the Scope, Cost & Time.\n\tCost efficiency Programs - Should lead Cost efficiency and continual improvement programs. Identify opportunities, base line and execute projects amongst cross functional teams.\n\tManage Industrial relations - Actively participate & lead IR discussions. Negotiate with various Unions, ensure Industrial discipline is maintained and labor productivity is increased on a regular basis.\n\tBudget and Budgetary control - Chalk out budgets for Labor, energy, materials, maintenance & other Plant overheads effectively and implement\n\n\nRequirements\n\n\n\tCandidate with extensive exposure in Plant management / Project activities, good exposure towards team a management.\n\t15-20 Years of work exposure in Leading FMCG Company, with engineering degree from a reputed college\n\tBiscuits, Wafers & Bakery manufacturing experience will be preferred.\n\n\nClick here to apply online    \n\n    \n\n        Click here to Apply",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Openings at Max Drive",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-max-drive-1",
    "pubDate": "Thu, 08 Jan 2026 10:20:12 GMT",
    "source": "JobGurus",
    "keyword": "max drive",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Max Drive - We are a team of passionate people and a leading technology-enabled company driven by a vision to solve the mobility challenges in Africa. We want to get people and goods to their destinations hitch-free. It is personal for us because we understand the frustration of epileptic transportation. We are making mobility safe, affordable, accessible, and sustainable through the deployment of high-performance technologies and operators.\n\nWe are recruiting to fill the following positions below:\n\n1.) IT & Infrastructure Manager\n\nJob Location: Lagos\n\nDescription\n     \n\n            \n    \n\n\n\n\n\tAs the IT & Infrastructure  Manager at MAX, you will play a critical role in ensuring the design, installation, supervision, implementation, and maintenance of MAX’s computing needs. You will ensure the secure and effective operation of all computer systems, related applications, hardware, and software used within MAX services.\n\n\n Responsibilities\n\n\n\tManage information technology and computer systems\n\tPlan, organize, control and evaluate IT and electronic data operations\n\tManage IT staff by recruiting, training and coaching employees, communicating job expectations and appraising their performance\n\tDesign, develop, implement and coordinate IT systems, policies and procedures\n\tEnsure security of data, network access and backup systems\n\tAct in alignment with user needs and system functionality to contribute to organizational policy\n\tAudit systems and assess their outcomes\n\tPreserve assets, information security and control structures\n\tHandle annual budget and ensure cost effectiveness\n\tMonitor performance of information technology systems to determine cost and productivity levels, and make recommendations for improving the IT infrastructure\n\tConsult computer users to ascertain needs and to ensure that facilities meet user or project requirements\n\tprovide user training, support, advice, and feedback\n\tTest and modify systems to ensure that they operate reliably\n\tManage secure network access for remote users\n\tEnsure network components meet needs and work together seamlessly, using the full range of capabilities, and stay informed about new features and competitive solutions\n\tContinuously analyze current processes, technologies, and vendors to identify areas of improvement\n\tDevelop and execute disaster procedures, and maintain data backups\n\tAnalyze department needs, identify vulnerabilities, and boost productivity, efficiency and accuracy to inform business decisions\n\n\nRequirements\nWhat You’ll Need: \n\n\n\tBachelor's degree in Information Technology, Computer Science, Information Systems, or any other related course\n\t3+ years of management or supervisory experience\n\t7+ years of cognate experience in IT operations\n\tProven experience (between 3 & 5 years)  in operations management, especially in a field-related role.\n\tExperience leading and managing large IT projects and rolling out IT infrastructures across various technologies\n\tExcellent working knowledge of computer systems, security, network and systems administration, databases and data storage systems, and phone systems\n\tStrong critical thinking and decision-making skills\n\tExcellent project management skills and strong ability to prioritize\n\tFirm grasp on IT infrastructure and operations best practices.\n\n\nBenefits\n\n\n\tCompetitive pay & benefits\n\tPremium Health insurance cover\n\tConsistent Learning and Development.\n\n\nClick here to apply online\n\n \n\n \n\n2.) Inventory Officer\n\nJob Location: Ado Ekiti, Ekiti\n\nResponsibilities\n\n\n\tReceive, store, issue the goods, managing the stock levels and giving out the supplies from the stock\n\tEnsuring the preparation of inventories, maintaining the stock records, using computerized systems for entering the records and is accountable for checking the supply invoices with the purchase orders.\n\tSource out for suppliers and ensure that quotes are obtained as well.\n\tEnsure that surpluses or obsolete stocks are taken out.\n\tMaintaining record of receipts as well as issuance of items that are going out of the warehouse so as to ensure accuracy and completeness\n\tReconciliation of physical stock vis-a-vis book records or stock in the system Ensure zero discrepancy as per content of the purchase order (PO) vis-a-vis the packing list/invoice from the supplier.\n\tOversee the stacking of goods in an orderly system within the stock location system so that the stock can be stored easily and retrieved whenever there is a requirement.\n\tUndertake the function of stock taking and confirm the periodic stock on a regular basis by working closely with the designated staff members\n\tEnsure proper supervision of the offloading process, the subsequent arrangement of merchandise, material, etc., and consignment so that it can be accessed and identified easily\n\tTo ensure the correct and timely valuation of the inventory and to be involved in directing and managing procedures related to offloading, packing and unpacking\n\tUpdate the City Inventory Management - Database with new items and their respective quantities.\n\tEnsure the safekeeping of all asset spare keys belonging to MAX\n\tEnsure retrieval of trackers from the storage rack/location upon receiving a satisfactorily filled Store Requisition Form.\n\tInspect the items received from suppliers and ensure quality conformance. If items do not conform to agreed quality levels, reject such items.\n\tEnsure that the bin cards for each SKU are updated\n\n\nRequirements\n\n\n\tA degree in Finance, Accounting or any relevant fields, Minimum of a BSc/HND.\n\tMinimum experience of 2 years.\n\n\nSkills and Abilities.\n\n\n\tStrong interpersonal and communication (written and oral) skills.\n\tExcellent understanding of Inventory Control principles and practices.\n\tProficient in MS Office/Google Workspace.\n\tGood Math’s Skills Critical and analytical thinking.\n\tAccuracy and Attention to detail.\n\tConfidentiality and Thoroughness.\n\n\nClick here to apply online\n\n \n\n \n\n3.) Battery Swap Station Attendant\n\nJob Location: Ikorodu, Lagos\n\nDescription\n\n\n\tThe Battery Swap Station Attendant is responsible for overseeing the operations of the battery swap station for electric motorcycles.\n\tThis role includes monitoring battery swaps, assisting riders, ensuring proper parking of motorcycles at the end of the day, and managing the charging of batteries overnight for next-day use.\n\n\nKey Responsibilities\n\n\n\tMonitor Operations: Supervise the daily operations of the battery swap station, ensuring efficient and safe battery swaps for electric motorcycles.\n\tAssist Riders: Provide assistance to riders during the battery swap process, ensuring they understand the procedure and feel comfortable with the operation.\n\tBattery Management: Ensure all batteries are properly charged and maintained. Monitor battery levels and perform routine checks to confirm functionality.\n\tParking Coordination: Oversee the proper parking of motorcycles at the end of each day, ensuring all bikes are secured and accessible for riders the following morning.\n\tCharging Supervision: Manage the overnight charging of batteries, ensuring all batteries are fully charged and ready for use the next day.\n\tRecord Keeping: Maintain accurate records of battery swaps, usage statistics, and any issues encountered during operations.\n\tSafety Compliance: Adhere to all safety protocols and guidelines to ensure a safe environment for riders and staff.\n\n\nRequirements\n\n\n\tMinimum of OND or equivalent.\n\t1-2 years of prior experience in a customer service or technical support role is a plus.\n\tStrong customer service skills and a friendly demeanor.\n\tBasic technical aptitude and problem-solving skills.\n\tAbility to follow procedures and guidelines accurately\n\tAttention to detail and a commitment to maintaining equipment in good condition.\n\tGood communication skills and the ability to interact effectively with customers.\n\tPhysical ability to lift and handle batteries and perform light maintenance tasks.\n\tAbility to work independently and as part of a team.\n\n\nClick here to apply online    \n\n    \n\n        Click here to Apply",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Job Openings at Avocado Virtual Solutions",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-avocado-virtual-solutions",
    "pubDate": "Thu, 08 Jan 2026 10:20:12 GMT",
    "source": "JobGurus",
    "keyword": "avocado virtual solutions",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Avocado Virtual Solutions (AVS) is a professional recruitment agency and business support service dedicated to helping entrepreneurs, small businesses, and busy professionals streamline their operations. We specialize in administrative support, customer service, social media management, recruitment assistance with onboarding, and business/company branding. Our mission is to help clients save time, enhance productivity, and build strong, recognizable brands while they focus on growing their businesses.\n\nWe are recruiting to fill the following positions below:\n\n1.)  Virtual Social Media Assistant\n\nJob Location: Fully Remote\nEmployment Type: Full-time\n     \n\n            \n    \n\n\n\nAbout Role\n\n\n\tWe are a growing financial services company seeking a Virtual Social Media Assistant to build, manage, and grow our online presence. The ideal candidate will be creative, detail-oriented, and knowledgeable about social media growth strategies, especially within the UK market.\n\n\nKey Responsibilities\n\n\n\tCreate and set up new social media pages for the business on all social media platforms starting with Instagram, Facebook, and TikTok\n\tDevelop and implement strategies to grow followers, engagement, and reach\n\tPlan, manage, and optimize sponsored adverts and paid promotions\n\tCreate a clear, comfortable, and consistent content calendar aligned with business goals\n\tDesign engaging graphics and visual content for social media posts\n\tEdit short-form videos (Reels, TikTok videos) suitable for financial services content\n\tManage daily social media activities including posting, captions, hashtags, and basic community engagement\n\tEnsure content aligns with brand tone, compliance, and financial services standards\n\tApply basic UK marketing strategies and audience targeting techniques\n\n\nRequirements & Qualifications\n\n\n\tProven experience managing Instagram and TikTok business pages\n\tGood basic understanding of UK digital marketing basics (audience behavior, trends, ad targeting)\n\tStrong skills in graphic design (Canva, Photoshop, or similar tools)\n\tVideo editing skills for short-form content (CapCut, InShot, Premiere Pro, etc.)\n\tAbility to create structured and realistic content calendars\n\tCreative thinking with attention to detail\n\tAbility to work independently and meet deadlines\n\tBasic knowledge of social media analytics and performance tracking\n\n\nWhat We’re Looking For\n\n\n\tSomeone proactive and growth-focused\n\tA creative individual who understands how to market financial services professionally\n\tA virtual assistant who can take ownership of the brand’s social media presence.\n\n\nSalary & Benefits\n\n\n\tSalary: N70,000 per month.\n\tRemote and flexible working environment\n\tOpportunity to grow with a fast-expanding financial services brand.\n\n\nApplication Closing Date: 14th January, 2026.\n\nMethod of Application \nInterested and qualified candidates should send their CV and Applications to: avsabujahr@gmail.com using the Job Positiion as the subject of the email.\n\n \n\n \n\n2.) Human Resource Manager\n\nJob Location: Jabi, Abuja (FCT)\nEmployment Type: Full-time\n\nAbout the Role\n\n\n\tWe are seeking an experienced and people-focused Human Resources Manager to lead and manage all HR functions across the organization.\n\tThe HR Manager will be responsible for building efficient HR systems, overseeing recruitment and talent management, ensuring compliance with labor laws, and fostering a productive and positive workplace culture that aligns with the company’s business goals.\n\tThis role requires a strategic thinker who can balance employee relations with business needs while supporting leadership in driving organizational growth and performance.\n\n\nKey Responsibilities\n\n\n\tPromote hotel rooms, services, and offers to attract new guests\n\tDevelop and execute marketing campaigns (online and offline)\n\tManage the hotel’s social media pages and online presence\n\tCreate engaging content (flyers, posts, short videos, promotions)\n\tDrive corporate bookings, partnerships, and walk-in clients\n\tHandle customer inquiries and follow up on leads\n\tMonitor competitor activities and market trends\n\tTrack marketing performance and report results to management\n\n\nKey Performance Indicators (KPIs)\n\n\n\tTime-to-hire and quality of recruited talent\n\tEmployee retention and turnover rates\n\tEffectiveness of performance management and appraisal systems\n\tCompliance with HR policies and labor regulations\n\tEmployee engagement and workplace satisfaction levels\n\n\nRequirements & Qualifications\n\n\n\tBachelor’s degree in Human Resources, Business Administration, or a related field with 3–5 years of experience in an HR role, with at least 1 year in a managerial position\n\tStrong knowledge of Nigerian labor laws and HR best practices\n\tExcellent interpersonal, communication, and conflict management skills\n\tAbility to handle confidential information with professionalism\n\tProficiency in HR software and Microsoft Office / Google Workspace\n\n\nWhat we Offer\n\n\n\tOpportunity to shape HR systems and company culture\n\tDirect collaboration with senior leadership\n\tCareer growth and long-term development opportunities\n\n\nSalary\nN200,000 / Month\n\nApplication Closing Date: 15th January, 2026.\n\nMethod of Application \nInterested and qualified candidates should send their CV and Applications to: avsabujahr@gmail.com using the Job Position as the subject of the email.\n\n \n\n \n\n3.) Compliance and Regulatory Officer\n\nJob Location: Jabi, Abuja (FCT) \nEmployment Type: Full-time\n\nAbout Role\n\n\n\tThe Compliance & Regulatory Officer will play a critical role in safeguarding Sylvastar Group’s operations by ensuring strict adherence to all applicable laws, regulatory requirements, and internal policies.\n\tThis role supports management by identifying compliance risks, maintaining regulatory standards across all subsidiaries, and promoting a strong culture of corporate governance and ethical conduct within the Group.\n\n\nKey Responsibilities\n\n\n\tEnsure compliance with all relevant laws, regulations, and corporate governance requirements\n\tMonitor regulatory updates and advise management on implementation and risk impact\n\tDevelop, review, and enforce internal compliance policies and procedures\n\tMaintain statutory records, licenses, permits, and regulatory filings\n\tConduct internal compliance audits and risk assessments\n\tLiaise with regulatory authorities, legal advisers, and external auditors\n\tInvestigate compliance breaches and recommend corrective actions\n\tPrepare and submit compliance reports to management\n\tTrain staff on regulatory and compliance requirements\n\n\nRequirements & Qualifications\n\n\n\tHND/BSc in Law, Business Administration, Accounting, or related field\n\t2–4 years of experience in compliance, regulatory, or risk-related roles\n\tStrong knowledge of Nigerian regulatory frameworks and corporate governance\n\tExcellent documentation, analytical, and reporting skills\n\tHigh level of integrity, discretion, and professionalism\n\tStrong communication and stakeholder management skills\n\n\nPersonal Attributes:\n\n\n\tEthical and principled\n\tDetail-oriented and organized\n\tProactive and solutions-driven\n\tAbility to work independently.\n\n\nSalary\nN250,000 per month.\n\nApplication Closing Date: 6th January, 2026.\n\nMethod of Application \nInterested and qualified candidates should send their applications and CV to: avsabujacareer@gmail.com using the Job Position as the subject of the email.\n\n     \n\n    \n\n        Click here to Apply",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]