[
  {
    "title": "Job Openings at Molaprise",
    "link": "https://www.jobgurus.com.ng/jobs/view/job-openings-at-molaprise",
    "pubDate": "Mon, 20 Oct 2025 19:36:15 GMT",
    "source": "JobGurus",
    "keyword": "molaprise",
    "duplicate": false,
    "classifications": [
      "Finance",
      "Software Engineering"
    ],
    "content": "Molaprise, headquartered in New York with a global reach, is a rising-leader in technology consulting and cloud services. We specialize in cybersecurity, cloud adoption, and infrastructure modernization, delivering secure and agile solutions trusted by financial and US government sectors. We strive to make advanced technology accessible, driving business and public sector success. With top-tier partnerships, our seasoned team offers tailored cloud strategies to exceed expectations, ensuring that with Molaprise, your digital transformation journey leads to tangible, superior outcomes.\n\nWe are recruiting to fill the following positions below:\n\n1.) Director, Technology Consulting & Systems Integration - Africa\n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob No.: 61\nJob Location: Lagos\nJob type: Full-time\n\nJob Description\n\n\n\tMolaprise is seeking a Senior Consulting Manager or Director to lead and scale our Technology Consulting & Systems Integration Practice across Ghana, Nigeria, and offshore markets.\n\tThis role is a rare opportunity to bridge Africa’s immense potential with global enterprise-grade delivery.\n\tYou’ll drive innovation across finance, energy, healthcare, and the public sector, build AI-powered platforms, and position Africa as a global digital leader.\n\n\nWhy This Role Matters — For You and for Africa\n\n\n\tAfrica is transforming. From modernizing banks and automating agribusiness to building AI-driven public services, the opportunity is enormous.\n\tAt Molaprise, we’re launching Africa’s top talent into global tech delivery—designing and executing world-class solutions from Africa, for the world.\n\n\nThis is more than a job—it’s a mission to:\n\n\n\tBuild a world-class consulting practice in Africa\n\tLead large-scale enterprise transformation initiatives\n\tMentor the next generation of AI and engineering talent\n\tDeliver cutting-edge systems across sectors\n\tShape Africa’s digital innovation narrative\n\n\nKey Responsibilities\nPractice Leadership & Strategic Growth:\n\n\n\tDefine the vision and roadmap for consulting and systems integration across Africa.\n\tGrow vertical-specific solutions in:\n\t\n\t\tFinancial Services: Core banking modernization, fraud prevention\n\t\tPublic Sector: National ID systems, digital citizen platforms\n\t\tHealthcare: Telehealth, smart diagnostics, data interoperability\n\t\tEnergy/Utility: IoT grid monitoring, predictive analytics\n\t\n\t\n\tBuild a multi-million-dollar pipeline targeting mid-to-enterprise clients ($10M–$300M in revenue).\n\n\nSales Engineering & Market Expansion:\n\n\n\tLead technical pre-sales, solutioning, and RFP responses.\n\tCo-develop offerings with partners (Microsoft, AWS, Cisco, OpenAI).\n\tDrive regional campaigns, events, and briefings to enhance visibility.\n\tSupport high-value deal closures alongside account executives.\n\n\nGlobal Delivery & Offshore Engineering:\n\n\n\tBuild and manage a cross-border engineering hub for U.S. clients.\n\tDeliver MVPs, multi-cloud migrations, and enterprise-grade integrations.\n\tEnsure alignment across U.S.–Africa projects, especially in cloud and cybersecurity.\n\n\nTeam Building & Culture Crafting:\n\n\n\tRecruit and mentor engineers, architects, consultants, and project managers across Africa.\n\tFoster a culture of agility, excellence, and accountability.\n\tChampion Molaprise’s mission to transform Africa’s digital infrastructure.\n\n\nRequirements\nWhat We’re Looking For:\n\n\n\t10+ years of experience leading tech consulting, SI practices, or offshore/global delivery teams.\n\tDeep expertise in cloud (Azure, AWS), enterprise AI, DevOps, and systems integration.\n\tProven ability to translate technical complexity into business value and close transformation deals.\n\tPassion for building in high-growth, resource-constrained environments.\n\tStrong communicator who can engage C-suite and engineering teams alike.\n\n\nPreferred Qualifications:\n\n\n\tExperience with African tech implementations (e.g., national ID, healthcare access, fintech platforms).\n\tUnderstanding of African regulatory frameworks (NDPR, GIPC Act, etc.).\n\tCertifications: CISSP, Azure Solutions Architect, AWS Pro, CCIE, TOGAF, etc.\n\tExperience working with governments, banks, telcos, or regional enterprises.\n\tPrevious delivery experience with U.S.-based clients from offshore hubs.\n\n\nWhy Join Molaprise Africa\n\n\n\tPan-African Impact: Drive digital transformation across West Africa and beyond.\n\tHigh Ownership: Influence strategy, team growth, and execution.\n\tInnovative Work: Build real-world AI, automation, and cloud solutions.\n\tResults-Driven Culture: Grit, honesty, execution, and customer obsession.\n\tCompetitive Compensation: Strong base + performance bonus; equity may be offered.\n\tAutonomy: Lead from the front with full ownership of outcomes.\n\tBuild Africa-Grown IP: Architect AI agents, automation systems, and industry-focused platforms.\n\n\nSalary\nDOE\n\nClick here to apply online\n\n \n\n \n\n2.) DevOps & Cloud Engineer\n\nJob No.: 57\nJob Location: Lagos\nJob type: Full-time\n\nAbout the Role\n\n\n\tWe’re seeking a versatile DevOps & Cloud Engineer who thrives on solving infrastructure challenges and believes automation unlocks innovation.\n\tIn this role, you’ll design, build, and maintain secure, scalable, and reliable systems that power our products.\n\tYou’ll be instrumental in shaping cloud strategy, driving DevOps culture, and ensuring system resilience for growth.\n\n\nWhat You'll Do\nCloud Infrastructure Design & Management:\n\n\n\tArchitect, deploy, and maintain scalable and secure infrastructure on AWS and/or Azure\n\tImplement infrastructure-as-code practices (Terraform, CloudFormation, or similar) for consistency and repeatability\n\tOptimize cloud resource usage to balance performance, cost, and reliability\n\n\nCI/CD & Automation:\n\n\n\tBuild, manage, and improve CI/CD pipelines for seamless deployment and rollback\n\tAutomate repetitive operational tasks to reduce manual overhead and increase efficiency\n\tEnable rapid development cycles while maintaining system stability and security\n\n\nMonitoring, Logging & Reliability:\n\n\n\tSet up observability frameworks: logging, metrics, alerts, and dashboards\n\tProactively detect and resolve performance bottlenecks and system outages\n\tDrive reliability engineering practices to ensure uptime, scalability, and resilience\n\n\nSecurity & Compliance:\n\n\n\tIdentify, assess, and mitigate security vulnerabilities across cloud environments and applications\n\tImplement security-first practices in cloud deployments, data handling, and access control\n\tConduct regular audits and updates to maintain a secure infrastructure.\n\n\nWhat You Bring\n\n\n\t3+ years of hands-on experience managing cloud infrastructure and DevOps workflows\n\tProficiency with containerization (Docker, Kubernetes) and CI/CD tools (GitHub Actions, Jenkins, or similar)\n\tStrong experience with infrastructure-as-code (Terraform, Ansible, or equivalent)\n\tA security-first mindset with a passion for automation and continuous improvement\n\tExposure to multi-tenant SaaS architecture or distributed systems is a strong plus\n\n\nWhy Join Us?\n\n\n\tWork with a high-performing engineering team on infrastructure that scales globally\n\tHybrid flexibility with opportunities for part-time or full-time engagement\n\tOwnership of critical DevOps decisions shaping the company’s growth trajectory\n\tCompetitive compensation and a culture that values automation, security, and innovation.\n\n\nSalary\nDOE\n\nClick here to apply online\n\n \n\n \n\n3.) AI / ML Engineer\n\nJob No.: 59\nJob Location: Lagos, \nJob type: Full-time / Consultant \n\nAbout the Role\n\n\n\tWe’re seeking a curious and data-driven AI/ML Engineer who thrives on uncovering patterns where others see noise.\n\tYou’ll join a small, high-trust team focused on applying AI/ML in novel, real-world contexts.\n\tYour work will go beyond experiments — you’ll help design intelligent systems that learn, adapt, and evolve in production environments.\n\n\nWhat You'll Do\nModel Development & Experimentation:\n\n\n\tResearch, design, and train machine learning models for predictive analytics, anomaly detection, and optimization tasks\n\tBuild prototypes and run experiments to validate hypotheses and model performance\n\tContinuously refine algorithms for accuracy, scalability, and efficiency\n\n\nData Analysis & Insights:\n\n\n\tExplore large, complex datasets to uncover actionable insights\n\tTranslate findings into features, signals, and improvements that enhance product functionality\n\tEnsure data quality, integrity, and preprocessing pipelines for ML readiness\n\n\nCross-Functional Collaboration:\n\n\n\tWork closely with product managers, engineers, and domain experts to integrate models into production systems\n\tCommunicate complex ML concepts to both technical and non-technical stakeholders\n\tSupport ongoing monitoring, evaluation, and retraining of deployed models\n\n\nDeployment & Optimization:\n\n\n\tImplement scalable ML solutions in real-world environments\n\tLeverage cloud ML platforms and APIs for training, deployment, and monitoring\n\tOptimize runtime performance to balance accuracy, speed, and cost\n\n\nWhat You Bring\n\n\n\t3+ years of hands-on experience in machine learning, applied AI, or data science\n\tStrong proficiency in Python and libraries such as Pandas, NumPy, Scikit-learn, TensorFlow, or PyTorch\n\tDemonstrated ability to design experiments, analyze results, and iterate quickly\n\tComfort working independently in unstructured problem spaces and ambiguous environments\n\tA mindset of curiosity, experimentation, and continuous learning\n\n\nWhy Join Us?\n\n\n\tBe part of a phase 2 initiative, applying AI/ML to cutting-edge, real-world problems\n\tWork in a high-trust, collaborative environment where your contributions drive impact\n\tHybrid flexibility with consultant or full-time options\n\tCompetitive compensation and opportunities for ownership of AI/ML strategy\n\n\nSalary\nDOE\n\nClick here to apply online    \n\n    \n\n        Click here to Apply",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Operations Officer (Partnerships) Job at Sendtins Nigeria Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/operations-officer-partnerships-job-at-sendtins-nigeria-limited",
    "pubDate": "Mon, 20 Oct 2025 19:36:15 GMT",
    "source": "JobGurus",
    "keyword": "sendtins nigeria limited",
    "duplicate": false,
    "classifications": [
      "Marketing",
      "Finance",
      "Software Engineering"
    ],
    "content": "(function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){\n        (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),\n        m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)\n    })(window,document,'script','//www.google-analytics.com/analytics.js','ga');\n\n    ga('create', 'UA-43112273-1', 'jobgurus.com.ng');\n    ga('send', 'pageview');\n\n\n\n\n    \n        \n    Home\n    Jobs\n    Free Aptitude Test Practice\n    Employer? Post a Job\n            Register\n        Sign in\n        Contact us\n    \n\n    \n\n        \n    \n        \n\n            \n\n                \n\n                    \n                        Toggle navigation\n                        \n                        \n                        \n                    \n\n                    \n                \n            \n\n            \n                \n\n\tJobs\n\tJob Seekers\n\tAptitude Test\n\tScholarships\n\n            \n\n            \n                \n\n                                            Register\n                        Sign in\n                    \n                    Employer? Post a Job\n                \n            \n\n        \n\n    \n\n        \n        \n            \n            \n                 \n    \n                    \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n        \n     \n\n\n                            \n                    \n        \n                        CLICK HERE TO JOIN OUR WHATSAPP CHANNEL \n                    \n    \n\n    \n                                \n                    \n\n                        \n                            \n                        \n\n                        \n                            \n                                Any Specialization\n                                                                    Accounting / Audit / Finance\n                                                                    Administration/ Office/ Operations\n                                                                    Advertising/ Social Media/ Marketing/ PR\n                                                                    Agriculture / Agro Allied\n                                                                    Analyst/ Quality Control\n                                                                    Automotive/ Car Services\n                                                                    Aviation / Airline\n                                                                    Banking / Insurance\n                                                                    Building Design / Architecture\n                                                                    Construction / Mining\n                                                                    Consulting / Business Strategy/ Planning\n                                                                    Craftsmen / Artisans\n                                                                    Creatives (Arts, Design, Fashion)\n                                                                    Customer Service\n                                                                    Domestic / Janitorial Services\n                                                                    Driving / Haulage\n                                                                    Education / Teaching / Training\n                                                                    Engineering / Technical\n                                                                    Executive / Management\n                                                                    Freelance / Data Entry\n                                                                    Government Agencies / Public Sector\n                                                                    Graduates / Freshers\n                                                                    Grants /  Scholarships\n                                                                    Hospitality / Food Services\n                                                                    HSE / Safety Management\n                                                                    Human Resources / Recruitment\n                                                                    Information Technology / ICT\n                                                                    Internship/ Industrial Training\n                                                                    Legal / Law\n                                                                    Logistics / Transportation/ Supply\n                                                                    Manufacturing / Production\n                                                                    Maritime Services / Shipping\n                                                                    Media / Art / Entertainment\n                                                                    Medical/ Healthcare / Pharmaceutical\n                                                                    Military / Para-Military\n                                                                    NGO / Community Services\n                                                                    Oil & Gas / Energy\n                                                                    Procurement/ Purchasing\n                                                                    Project Management\n                                                                    Real Estate / Property / Surveying\n                                                                    Research / Survey\n                                                                    Risk Management / Compliance\n                                                                    Sales / Business Development\n                                                                    Secretarial / PA\n                                                                    Security / Intelligence\n                                                                    Software/ Programming / Web development\n                                                                    Sports / Fitness\n                                                                    Supply Chain/ Store\n                                                                    Technicians\n                                                                    Telecommunications\n                                                                    Tourism / Travels\n                                                                    Vocational Trade and Services\n                                                            \n                        \n\n                        \n                            \n                                Any Work Level\n                                                                    Entry Level (Trainee)\n                                                                    Executive (Director, Head of Dept)\n                                                                    Experienced (Non-Manager)\n                                                                    Internship\n                                                                    Manager (Staff Supervisor)\n                                                                    Senior Executive (MD, CEO, COO)\n                                                                    Vocational (Skilled/Unskilled Labour)\n                                                            \n                        \n\n                        \n                            \n                                 Search\n                            \n                        \n                    \n                \n                            \n            \n\n\n\n\n\n\n            \n\n                \n                                        \n                    \n                                        \n                    \n                    \n\n                    \n                        \n                        \n\n{\n  \"@context\": \"https://schema.org\",\n  \"@type\": \"JobPosting\",\n  \"title\": \"Operations Officer (Partnerships)\",\n  \"description\": \"Sendtins Nigeria Limited is&amp;nbsp;recruiting suitably qualified candidates to fill the position below:\n\nJob Position: Operations Officer (Partnerships)\n\nJob Location:&amp;nbsp;Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tDo you have the grit and drive to connect an innovative tech platform with the realities of the Nigerian logistics market? We are looking for a highly tenacious Operations Officer, Partnerships to be the external face of SendTins.\n\tYour primary mission is to aggressively secure and maintain the key partnerships that drive our transaction volume and market expansion.\n\tIf you have what it takes to shine at an exciting and interesting startup with massive opportunities for growth, we want to hear from you.\n\n\nJob Responsibilities\n\n\n\tPartner Acquisition &amp;amp; Negotiation: Aggressively identify, pitch, negotiate, and onboard crucial logistics partners, including motor park agents, haulage companies, and independent drivers across Lagos and surrounding states.\n\tVendor &amp;amp; Partner Management: Serve as the primary liaison for all external vendors and partners. Ensure relationships are productive, profitable, and compliant.\n\tPresentation &amp;amp; Pitching: Conduct ongoing market research and use insights to confidently deliver high-impact presentations and pitches to potential partners and stakeholders.\n\tField Strategy: Spend significant time (60%+) in the field, conducting market intelligence and managing agent relationships to hit onboarding targets.\n\n\nQualifications &amp;amp; Experience\n\n\n\tEducation: BSc or HND in Marketing, Business Administration, or any related field.\n\tExperience: A minimum of 3 years of progressive experience in vendor management, channel sales, or partnership acquisition.\n\tSkills: Proven expertise in pitching, negotiation, and building trust in professional and field environments. Expert use of Office/GSuite for compelling presentations and reporting.\n\n\nBenefits\nWe are an Equal Opportunity Employer and are committed to your well-being:\n\n\n\tCompetitive Salary (N250,000 - N300,000 monthly)&amp;nbsp;&amp;amp; Performance Bonus Structure\n\tHMO Coverage\n\tPension Contributions.\n\n\nMethod of Application&amp;nbsp;\nInterested and qualified candidates should send their CV / Resume to:&amp;nbsp;hr@oaklandsandjohnson.com&amp;nbsp;using the Job Position as the subject of the&amp;nbsp;email.&amp;nbsp;\",\n  \"datePosted\": \"2025-10-20\",\n  \"validThrough\": \"2025-11-01\",\n  \"employmentType\": \"Full-Time\",\n  \"hiringOrganization\": {\n    \"@type\": \"Organization\",\n    \"name\": \"Sendtins Nigeria Limited\"\n    \n  },\n  \"jobLocation\": {\n    \"@type\": \"Place\",\n    \"address\": {\n      \"@type\": \"PostalAddress\",\n       \"postalCode\": \". \",\n       \"addressRegion\": \". \",\n       \"streetAddress\": \". \",\n      \"addressLocality\": \"Lagos\",\n      \"addressCountry\": \"NG\"\n     \n      \n    }\n  },\n  \"identifier\": {\n    \"@type\": \"PropertyValue\",\n    \"name\": \"\",\n    \"value\": \"189083\"\n  },\n  \"baseSalary\": {\n    \"@type\": \"MonetaryAmount\",\n    \"currency\": \"NGN\",\n    \"value\": {\n      \"@type\": \"QuantitativeValue\",\n      \"minValue\": 250000,\n      \"maxValue\": 400000,\n      \"unitText\": \"MONTH\"\n    }\n  }\n}\n\n\n\nOperations Officer (Partnerships) Job at Sendtins Nigeria Limited\n\n\n\n\n        \n    \n\n        \n        Sendtins Nigeria Limited is recruiting suitably qualified candidates to fill the position below:\n\nJob Position: Operations Officer (Partnerships)\n\nJob Location: Lagos\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tDo you have the grit and drive to connect an innovative tech platform with the realities of the Nigerian logistics market? We are looking for a highly tenacious Operations Officer, Partnerships to be the external face of SendTins.\n\tYour primary mission is to aggressively secure and maintain the key partnerships that drive our transaction volume and market expansion.\n\tIf you have what it takes to shine at an exciting and interesting startup with massive opportunities for growth, we want to hear from you.\n\n\nJob Responsibilities\n\n\n\tPartner Acquisition & Negotiation: Aggressively identify, pitch, negotiate, and onboard crucial logistics partners, including motor park agents, haulage companies, and independent drivers across Lagos and surrounding states.\n\tVendor & Partner Management: Serve as the primary liaison for all external vendors and partners. Ensure relationships are productive, profitable, and compliant.\n\tPresentation & Pitching: Conduct ongoing market research and use insights to confidently deliver high-impact presentations and pitches to potential partners and stakeholders.\n\tField Strategy: Spend significant time (60%+) in the field, conducting market intelligence and managing agent relationships to hit onboarding targets.\n\n\nQualifications & Experience\n\n\n\tEducation: BSc or HND in Marketing, Business Administration, or any related field.\n\tExperience: A minimum of 3 years of progressive experience in vendor management, channel sales, or partnership acquisition.\n\tSkills: Proven expertise in pitching, negotiation, and building trust in professional and field environments. Expert use of Office/GSuite for compelling presentations and reporting.\n\n\nBenefits\nWe are an Equal Opportunity Employer and are committed to your well-being:\n\n\n\tCompetitive Salary (N250,000 - N300,000 monthly) & Performance Bonus Structure\n\tHMO Coverage\n\tPension Contributions.\n\n\nMethod of Application \nInterested and qualified candidates should send their CV / Resume to: hr@oaklandsandjohnson.com using the Job Position as the subject of the email.     \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n\n\n\n        \n        \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n   \n\n\n    \n        Similar Jobs\n    \n\n    \n        \n                        Branch Manager Job at Woodgate Structure Limited\n                        Front Desk Officer / Travel Consultant Job at Fly Countrywide Travel & Services Limited\n                        Operations Assistant Job at EHA Clinics\n                        Core Operations Officer Job at  Strivo Labs\n                        Executive Assistant to the CEO Job at TeamAce Limited\n                        Front Desk Personnel Job at Starnet Innovations Limited\n                        Front Desk / Customer Service Officer Job at Elan Orris Real Estate Limited\n                        Front Desk Officer Job at Amies Recruitment Agency\n                        Executive Assistant Job at Dangote Group\n                        Executive Assistant to the Managing Director Job at Lheon Consulting Limited\n                    \n    \n\n\n\n                        \n                    \n\n                    \n                        \n\n\n\n    \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n\n\n\n\n\n          \n\n\n    \n\n        Hottest Jobs\n\n        \n        \n            \n\n                Apply Before November 24 and Become a Software Developer\n\n               \n            \n        \n            \n\n                Job Openings at Oando Plc\n\n               \n            \n        \n            \n\n                2026 GZI Industries Graduate Trainee Programme\n\n               \n            \n        \n            \n\n                Customer Service Officer Job at Dangote Group\n\n               \n            \n        \n            \n\n                Data Entry Officer Job at Cola Solar\n\n               \n            \n        \n            \n\n                Sales Representative Job at CWAY Group\n\n               \n            \n        \n            \n\n                Customer Service Business Partner Job at PalmPay\n\n               \n            \n        \n            \n\n                Job Openings at Flutterwave\n\n               \n            \n        \n            \n\n                Personal Assistant\n\n               \n            \n        \n            \n\n                Human Resources Manager\n\n               \n            \n        \n        \n\n    \n\n\n\n\n        \n        \n   \n\n\n                    \n                            \n            \n        \n        \n        \n\n        \n\n    \n\n        \n\n            \n\n                \n\n                    Job Seekers\n\n                    \n\n                        Search for Jobs\n                         Featured Jobs\n                         Jobs by Specialization\n                         Jobs by Industry\n                         Jobs by Location\n                         \n                        Companies Currently Hiring\n\n                        Upload CV\n\n                        Free Aptitude Test Practice\n                        \n                        Scholarships and Financial Aid\n\n                        Testimonies\n                    \n\n                \n\n                \n\n                    Employers\n\n                    \n\n                        Post A Job\n\n                        Search Resumes/Profiles\n\n                        Create Employer Account\n\n                        Advertise\n\n                        Pricing\n\n                    \n\n                \n\n                \n\n                    Tools & Resources\n\n                    \n\n                        Contact us\n                        \n                        Our Blog\n\n                        Job XML/RSS Feeds\n \n                        Free Aptitude Test Practice\n\n                        Bank Details\n\n                        FAQ & Support\n\n                    \n\n                \n\n                \n\n                    Connect with us\n\n                    \n\n                        \n\n                            \n\n                            \n\n                        \n\n                        \n\n                            \n\n                            \n\n                        \n\n                \n\n                        \n\n                            \n\n                            \n\n                        \n\n                    \n\n\n\n                    \n\n                        Customer Care\n\n                        09134259221 \n\n                        (9am - 5pm) weekdays\n\n                         info [at] jobgurus.com.ng\n\n                    \n\n\n\n                \n\n            \n\n        \n\n    \n\n\n\n    \n\n        \n\n\n\n            \n\n                Privacy Policy\n\n                Terms & Conditions\n\n                Sitemap\n                \n                About us\n\n            \n\n\n\n            Copyright © 2025 Jobgurus.com.ng - Latest Jobs in Nigeria 2025. All right reserved.",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]