[
  {
    "title": "Content Creator & Story Writer Job at Oriki Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/content-creator-story-writer-job-at-oriki-group-1",
    "pubDate": "Sat, 21 Jun 2025 13:42:02 GMT",
    "source": "JobGurus",
    "keyword": "oriki group",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Oriki is an Agri-beauty farm to skin brand, the first and only personal care manufacturer in Nigeria to operate a fast-growing premium wellness & spa brand in conjunction. We work relentlessly towards our vision of putting Africa on the map in the global skincare & wellness industry, poised to significantly contribute to the personal grooming & wellness market share. ORÍKÌ exists to display that African ingredients and their potent benefits will not just remain local; We stand for international best standards and quality.\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nOriki Group is comprised of a wellness day spa with multiple locations, farm to skin retail products, a wholesale & amenity product line for spas, hotels, and airlines, a training institute, the ORIKI franchise and the UNWIND by ORÍKÌ tech app.\n\nWe are recruiting to fill the position below:\n\nJob Position: Content Creator & Story Writer\nJob Location: Victoria Island, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tThe driven, innovative, creative and detail-oriented Content Creator & Story Writer is to produce high-quality, captivating contents for the different facet of the ORÍKÌ Group.\n\tThe Content Creator & Story Writer works closely with the social media team to update existing material, generate exciting written ups, catchy contents and identify new ways to reach consumers.\n\tThis position requires the ability to anticipate needs, be creative, think critically and offer solutions to problems with a very high level of professionalism and confidentiality.\n\tTo fit this role, you must have a previous remarkable track record of story writing, managing and creating engaging contents for various social media pages, have great time management skills, good understanding of the social media metrics and be able to act as a team player and without guidance.\n\n\nResponsibilities\nContent Creating:\n\n\n\tConducting research and interviews to learn more about current trends, developments, exciting contents and perceptions about any subject matter to help contextualize your findings.\n\tAssisting the creative social media team with constructive feedback on materials created for the brand.\n\tCreate and submit monthly content creating plan for each subsidiary of the brand\n\tCollaborating with various subsidiaries to cover every exciting news, details or objectives to showcase the brand.\n\tResearch and understand target market audience and develop content strategies for engagement for each subsidiary of the brand\n\tCreating contents to engage target audience for the different subsidiaries of the brand including reels, videos and graphics\n\tMonitoring social media pages to ensure every captivating content created and approved is posted by the social media team.\n\tSubmitting monthly content creating reports as required\n\tSuggesting new content creating ways to promote the brand’s offerings, discounts and to reach consumers.\n\n\nStory Writing:\n\n\n\tResearch on the target audience across the various subsidiaries and create compelling and engaging stories for any subsidiary of the brand as required\n\tCrafting characters, dialogues and plotlines that resonates with the objectives for the content being created for the various subsidiaries of the brand.\n\tCollaborating with the social media editors’ team to refine work done for any subsidiary of the brand.\n\tUsing story writing to highlight the unique offerings of each subsidiary of the brand.\n\tMonitoring trends and happenings in the country, evaluate and create captivating story lines in favor of the target subsidiary of the brand for engagement.\n\tOther responsibilities as assigned.\n\n\nRequirements\n\n\n\tCandidates should possess relevant qualifications with experience.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: jointheteam@orikigroup.com using the Job Position as the Subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Business Manager Job at Excel and Grace Consulting",
    "link": "https://www.jobgurus.com.ng/jobs/view/business-manager-job-at-excel-and-grace-consulting-5",
    "pubDate": "Sat, 21 Jun 2025 13:42:02 GMT",
    "source": "JobGurus",
    "keyword": "excel and grace consulting",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Excel and Grace Consulting is a fast-paced business consulting organization with a track record of delivering exceptional business solutions to small and medium-scale enterprises in Nigeria, Ghana, Germany, Switzerland, Canada, etc. We are certified management consultants with the International Council of Management Consulting Institutes (CMC-Global) with over 18 years of experience. Our team of experts and consultants have authored over 20 books on business management, business structure, business operations, human resources, organizational structure, employee development, money management, and so on.\n\nWe are recruiting to fill the position below:\n\nJob Position: Business Manager\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\nJob Location: Port Harcourt, Rivers\n\nAbout the Role\n\n\n\tWe are seeking a results-driven Business Manager to oversee operations at our retail and wholesale outlet located in Steel Village, Port Harcourt.\n\tThe ideal candidate will be responsible for driving business growth, managing inventory efficiently, supervising daily operations, and ensuring overall profitability.\n\tThis role is pivotal in streamlining our inventory processes and enhancing operational efficiency. If you thrive in a fast-paced retail environment and have a keen eye for stock control, we’d love to hear from you.\n\n\nKey Responsibilities\n\n\n\tManage day-to-day business operations including sales, stock, and staff supervision.\n\tImplement and maintain accurate inventory management systems.\n\tPrepare regular financial and inventory reports for senior management.\n\tEnsure excellent customer service standards are upheld at all times.\n\tMonitor and analyze sales performance and make strategic decisions to improve turnover.\n\tCoordinate with suppliers and vendors to ensure consistent stock availability.\n\tTrain and mentor junior staff members on inventory handling and sales strategies.\n\tEnforce compliance with company policies and retail best practices.\n\n\nRequirements\n\n\n\tHND / B.Sc Degree in Business Administration, Supply Chain Management, or related field.\n\tProven experience in retail or wholesale management (minimum 3 years preferred).\n\tStrong background in inventory management is essential.\n\tExcellent leadership, organizational, and communication skills.\n\tProficient in inventory software and Microsoft Office Suite.\n\tAbility to multitask, prioritize, and manage time efficiently.\n\n\nSalary\nN250,000 / Month.\n\nMethod of Application\nInterested and qualified candidates should send their CV and a brief cover letter to: eandg.tprecruiters@gmail.com using \"Business Manager – Steel Village\" as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Receptionist Job at Blowfish Group",
    "link": "https://www.jobgurus.com.ng/jobs/view/receptionist-job-at-blowfish-group-1",
    "pubDate": "Sat, 21 Jun 2025 13:42:02 GMT",
    "source": "JobGurus",
    "keyword": "blowfish group",
    "duplicate": false,
    "classifications": [],
    "content": "The Blowfish Group - In the heart of Victoria Island, brings you the world in one place. Hospitality and leisure, backed by a truly international team of industry professionals. Global standards and the warmth of Nigerian hospitality perfected over time. With our unique approach to servicing, we offer high-end hospitality and leisure carefully tailored with love to suit our customers’ requirements.\n\nWe are recruiting to fill the position below:\n\nJob Position: Receptionist\n\nJob Location: Victoria Island, Lagos\nEmployment Type: Full-time\n\nResponsibilities\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tPerform all check-in and check-out tasks\n\tManage online and phone reservations\n\tInform customers about payment methods\n\tRegister guests collecting necessary information (like contact details and exact dates of their stay)\n\tRespond to clients’ complaints in a timely and professional manner\n\tWelcome guests upon their arrival and assign rooms\n\tProvide information about our hotel, available rooms, rates and amenities\n\tMaintain updated records of bookings and payments Etc.\n\n\nRequirements and Skills\n\n\n\tApplicant should possess a minimum of OND, HND or BSc. from any of the Nigeria-recognized institutions\n\tMinimum of 3 years of experience in 4/5star Hotel\n\tMust have very good knowledge of hotel reservation software like Micros/Opera.\n\tMust be smart, Confident and good-looking\n\tExcellent communication and organizational skills.\n\tAbility to maintain a positive, friendly attitude even under pressure.\n\tExcellent organizational and multitasking skills\n\tProfessional attitude and appearance.\n\n\n\n\n\nRemuneration\nN100,000 - N150,000 / Month.\n\nMethod of Application\nInterested and qualified candidates should send CV to: kingsley.orji@theblowfishhotel.com using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Head of Engineering Job at Sow Real Estate Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/head-of-engineering-job-at-sow-real-estate-limited",
    "pubDate": "Sat, 21 Jun 2025 13:42:02 GMT",
    "source": "JobGurus",
    "keyword": "sow real estate limited",
    "duplicate": false,
    "classifications": [],
    "content": "Sow Real Estate is a premier Nigerian real estate development company specializing in both luxury and mass housing solutions. Established in 2012 and headquartered in Maitama, Abuja, the company has built a reputation for delivering high-quality residential and commercial properties that combine modern design with affordability.\n\nWe are recruiting to fill the position below:\n\nJob Position: Head of Engineering\n\nJob Location: Abuja (FCT)\n\nSummary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tAs we scale our operations, we are seeking a seasoned and strategic Head of Engineering to lead our engineering and project execution functions.\n\tThe Head of Engineering will oversee the entire engineering and technical operations of the company.\n\tThis role involves leading a multidisciplinary team of engineers, ensuring projects are delivered on time, within budget, and to the highest quality standards.\n\tThe ideal candidate must have extensive experience in construction engineering, project management, and real estate development.\n\n\nKey Responsibilities\n\n\n\tLead and manage the engineering department, including civil, structural, electrical, and mechanical engineers.\n\tOversee the planning, design, and execution of all engineering projects.\n\tDevelop and enforce engineering policies, standards, and procedures.\n\tEvaluate and implement new technologies and innovations in construction methods.\n\tEnsure all engineering activities comply with local and international building codes, health and safety regulations.\n\tManage budgets, project schedules, and resource allocation.\n\tConduct site inspections to ensure compliance with designs, safety, and quality standards.\n\tCollaborate with architects, contractors, and consultants to ensure seamless project execution.\n\tProvide technical guidance and mentorship to engineering teams.\n\tPrepare technical reports, risk assessments, and performance metrics for executive leadership.\n\n\nQualifications & Requirements\n\n\n\tMaster’s Degree in Civil Engineering, Structural Engineering, Building Technology, or a related field (Master’s degree preferred).\n\t5 - 8 years of engineering experience, with at least 3years in a senior or leadership role within the real estate or construction sector.\n\tCOREN certification is mandatory; other professional certifications (e.g., PMP, MNSE) are also added advantage.\n\tProven experience in leading large-scale residential and commercial real estate projects.\n\tStrong knowledge of construction standards, materials, methodologies, and project lifecycle management.\n\tExcellent leadership, communication, and organizational skills.\n\tProficiency in engineering and project management software (e.g., AutoCAD, Revit, MS Project, Primavera).\n\tDemonstrated ability to lead cross-functional teams and drive engineering excellence.\n\tDeep understanding of Nigerian regulatory standards and approval processes for real estate developments.\n\n\nWhat We Offer\n\n\n\tCompetitive salary and performance-based bonuses\n\tHealth and wellness benefits\n\tA dynamic and collaborative work environment\n\tOpportunity to work on innovative and landmark real estate projects\n\tCareer development and continuous learning opportunities.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV and a cover letter to: osezzbank@gmail.com using \"Head of Engineering -SOW Real Estates\" as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Sales Manager Job at Sow Real Estate Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/sales-manager-job-at-sow-real-estate-limited-1",
    "pubDate": "Sat, 21 Jun 2025 13:42:02 GMT",
    "source": "JobGurus",
    "keyword": "sow real estate limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Sow Real Estate Nigeria Limited is a real estate company that is focused on delivering affordable housing with quality materials and achieving customer satisfaction.\n\nWe are recruiting to fill the position below:\n\nJob Position: Sales Manager\n\nJob Location: Lekki Phase 1, Lagos\nEmployment Type: Full-time\n\nJob Description\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking an experienced and results-driven Sales Manager to lead a dynamic real estate sales team in Lagos.\n\tThe ideal candidate must have a proven track record in property sales, with a strong network of high-net-worth clients and decision-makers capable of investing in premium real estate within the Lagosmarket.\n\n\nResponsibilities\n\n\n\tLead, motivate, and manage a team of sales executives to achieve and exceed sales targets.\n\tDevelop and execute strategic plans to drive property sales, with a particular focus on high-end residential and commercial developments.\n\tLeverage an existing network of qualified clients to generate leads and close high-value deals.\n\tProvide market insights and customer feedback to guide marketing and business development strategies.\n\tCoordinate property viewings, client meetings, and contract negotiations.\n\tEnsure a high level of customer satisfaction throughout the sales process.\n\n\nRequirements\n\n\n\tMinimum of 3 - 5 years of experience in real estate sales.\n\tDemonstrated success in selling luxury or high-value properties.\n\tExtensive client base and strong network of prospective property buyers and investors.\n\tProven ability to lead and develop a high-performing sales team.\n\tExcellent negotiation, communication, and presentation skills.\n\tStrong understanding of the Lagosreal estate market, pricing trends, and buyer behavior.\n\n\nBenefits\n\n\n\tCompetitive salary and performance-based commissions.\n\tAvailability of team vehicle\n\tFuel Allowance\n\tOpportunities for career growth and continuous professional development.\n\n\nMethod of Application\nInterested and qualified candidates should send a copy of their Resume in PDF to: hrsowreallag@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]