[
  {
    "title": "Digital Marketing Officer Job at Mephalti Technologies Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/digital-marketing-officer-job-at-mephalti-technologies-limited",
    "pubDate": "Thu, 05 Jun 2025 10:17:44 GMT",
    "source": "JobGurus",
    "keyword": "mephalti technologies limited",
    "duplicate": false,
    "classifications": [
      "Marketing"
    ],
    "content": "Mephalti Technologies Limited is an emerging startup software company renowned for providing innovative, high-quality technology solutions and digital transformation services.\n\nWe are recruiting to fill the position below:\n\nJob Position: Digital Marketing Officer\nJob Location: Benin, Edo\nEmployment Type: Full-time\nDepartment: Marketing\nReports To: Marketing Manager\n\nJob Overview\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a creative, data-driven Digital Marketing Officer to join our growing team. This individual will be responsible for executing online marketing strategies to increase brand awareness, generate leads, and enhance user engagement across digital platforms.\n\n\nKey Responsibilities\n\n\n\tDevelop and manage digital marketing campaigns across social media, email, SEO/SEM, and paid ads.\n\tOptimize content for the website and social networking channels such as LinkedIn, Twitter, Instagram, Facebook, and YouTube.\n\tCollaborate with the design and content teams to develop compelling campaigns.\n\tConduct competitor and market research to guide strategies.\n\tAnalyze digital data to draw key recommendations for future marketing campaigns.\n\tTrack and report website traffic flow and provide internal reports regularly.\n\tDesign and execute email marketing campaigns.\n\tStay up to date with the latest digital marketing trends and best practices.\n\n\nQualifications / Requirements\n\n\n\tBachelor's degree in Marketing, Communications, Business, or a related field.\n\t 2+ years of experience in digital marketing or a related role.\n\tProficient in Google Analytics, Google Ads, Facebook Business Manager, SEO tools, and CMS platforms (e.g., WordPress).\n\tStrong analytical skills and data-driven thinking.\n\tExcellent communication and copywriting skills.\n\tAbility to work independently and as part of a team.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: mephaltihqrecruitment@gmail.com using the Job Position as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  },
  {
    "title": "Senior Accountant Job at Pause Factory Resources Limited",
    "link": "https://www.jobgurus.com.ng/jobs/view/senior-accountant-job-at-pause-factory-resources-limited",
    "pubDate": "Thu, 05 Jun 2025 10:17:44 GMT",
    "source": "JobGurus",
    "keyword": "pause factory resources limited",
    "duplicate": false,
    "classifications": [],
    "content": "Pause Factory Resources Limited - Our client, a Construction company, is recruiting to fill the position below:\n\nJob Position: Senior Accountant\nJob Location: Victoria Island, Lagos\nEmployment Type: Full-time\n\nJob Summary\n\n\n\tOur Client is seeking an experienced and highly skilled accounting professional to lead their accounting function, ensure compliance with accounting standards and regulatory requirements, and provide strategic financial guidance to support business growth.\n\n\nKey Responsibilities of the Position\nFinancial Reporting:\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tPrepare and review financial statements, including balance sheets, income statements, and cash flow statements\n\tEnsure compliance with International Financial Reporting Standards and local accounting standards\n\tCoordinate the preparation of annual budgets and forecasts\n\n\nFinancial Planning and Analysis;\n\n\n\tProvide strategic financial guidance to support business growth and decision-making.\n\tAnalyze financial data to identify trends, risks, and opportunities.\n\tDevelop and implement financial models to support business planning.\n\n\nAudit and Compliance;\n\n\n\tCoordinate the annual audit process, including preparation of audit schedules and responses to audit queries.\n\tEnsure compliance with regulatory requirements, including tax laws and company laws.\n\tImplement and maintain internal controls to ensure accuracy and integrity of financial data.\n\n\nAnnual Financial Statement and Reporting;\n\n\n\tCompute and prepare annual financial statements, including income statements, balance sheets, and cash flow statements.\n\tPrepare and submit annual financial reports to management, stakeholders, and regulatory bodies.\n\tEnsure timely and accurate submission of financial statements and reports.\n\n\nBank Relationships;\n\n\n\tLiaise with all banks to ensure smooth transactional operations.\n\tManage bank accounts, including account opening, closing, and maintenance.\n\tEnsure compliance with bank regulations and requirements.\n\n\nLeadership and Management:\n\n\n\tLead and manage a team of accountants, providing guidance, training, and development opportunities.\n\tCoordinate the recruitment, training, and development of accounting staff.\n\tImplement and maintain accounting policies, procedures, and standards.\n\n\nJob Specification\n\n\n\tBachelor's Degree in Accounting or a related field.\n\tMinimum 8-15 years of experience in accounting, including 5 years in managerial level.\n\tChartered Accountant (ACA, ACCA, or ICAN) qualification.\n\tStrong knowledge of IFRS and local accounting standards.\n\tExcellent analytical, communication, and leadership skills.\n\tAbility to work in a fast-paced environment and meet deadlines.\n\n\nSalary\n\n\n\tNegotiable.\n\n\nMethod of Application\nInterested and qualified candidates should send their detailed Resume: jobs@pausefactory.org using \"Senior Accountant\" as the subject of the mail.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]