[
  {
    "title": "Administrative Manager Job at Haven Hauling",
    "link": "https://www.jobgurus.com.ng/jobs/view/administrative-manager-job-at-haven-hauling",
    "pubDate": "Mon, 30 Jun 2025 19:12:11 GMT",
    "source": "JobGurus",
    "keyword": "haven hauling",
    "duplicate": false,
    "classifications": [
      "Finance"
    ],
    "content": "Haven Hauling is a logistics and export business that is part of the Johnvents Group, committed to the safe and timely delivery of goods. Backed by a modern transport fleet and a highly experienced freight and export team, we ensure efficient and reliable movement of products to their destinations, both locally and internationally.\n\nWe are recruiting to fill the position below:\n\nJob Position: Administrative Manager\n\nJob Location: Owo, Ondo\nEmployment Type: Full-time\n\nJob Summary\n     \n\n        \n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});\n    \n    \n\n\n\n\n\tWe are seeking a detail-oriented and highly organised Administrative Manager to oversee the day-to-day administrative functions that support our logistics and fleet operations.\n\tThis role is central to ensuring the smooth running of office systems, compliance processes, documentation, and interdepartmental coordination.\n\n\nKey Responsibilities\n\n\n\tOversee daily office operations, including facility management, cleanliness, supplies, safety, and overall organisation of the workplace.\n\tSupervise front desk operations, ensuring professional handling of calls, correspondence, and visitors.\n\tManage the administrative team, including onboarding, training, work schedules, and performance monitoring.\n\tMaintain up-to-date and accurate administrative records, including fleet documentation, insurance, employee files, and compliance logs.\n\tCollaborate closely with fleet, HR, finance, and operations teams to ensure effective internal coordination and communication.\n\tManage procurement of office equipment and supplies, ensuring cost efficiency through vendor negotiation and planning.\n\tMonitor administrative budgets and track office-related expenditures.\n\tEnsure effective filing systems, proper documentation, and secure data management for easy retrieval and audit readiness.\n\tGenerate and submit administrative reports on office operations, compliance, and record-keeping.\n\tEnsure compliance with relevant health, safety, administrative, and transport regulations.\n\tCoordinate third-party services including cleaning, maintenance, and equipment repair.\n\tOrganise internal meetings, travel logistics, staff events, and support conference planning in line with company policies.\n\tIntroduce and manage office systems and tools to improve administrative efficiency and workflow.\n\tEnforce workplace safety and emergency procedures, including fire safety and evacuation protocols.\n\tManage company insurance portfolios, including property, liability, and vehicle policies.\n\tOversee vehicle-related administrative tasks such as insurance renewals, registrations, documentation, and fleet records.\n\n\nSpecification\n\n\n\tA Degree in Business Administration, Public Administration, or a related field.\n\tMinimum of 5 years of experience in an administrative role, preferably within logistics or transport services.\n\tStrong organisational and multitasking abilities, with excellent attention to detail.\n\tProven team leadership experience and interpersonal skills.\n\tFamiliarity with compliance and transport documentation requirements.\n\tGood written and verbal communication skills.\n\n\nMethod of Application\nInterested and qualified candidates should send their CV to: applications@capitalsage.ng using the Job Position as the subject of the email.    \n\n    \n\n        Click here to Apply  \n        \n\n    \n     \n\n        \n\n\n\n     (adsbygoogle = window.adsbygoogle || []).push({});",
    "image": "https://www.jobgurus.com.ng/assets/img/logo.png"
  }
]